{
    "Physics": [
        {
            "title": "Doping a fractional quantum anomalous Hall insulator",
            "authors": "Zhengyan Darius Shi, T. Senthil",
            "summary": "We study novel itinerant phases that can be accessed by doping a fractional\nquantum anomalous Hall (FQAH) insulator, with a focus on the experimentally\nobserved Jain states at lattice filling $\\nu = p/(2p+1)$. Unlike in the lowest\nLandau level, where charge motion is confined into cyclotron orbits, the\ncharged excitations in the FQAH occupy Bloch states with well-defined crystal\nmomenta. At a non-zero doping density, this enables the formation of itinerant\nstates of the doped anyons just beyond the FQAH plateau region. Specializing to\nthe vicinity of $\\nu = 2/3$, we describe a few possible such itinerant states.\nThese include a topological superconductor with chiral neutral fermion edge\nmodes as well as a more exotic Pair Density Wave (PDW) superconductor with\nnon-trivial non-Abelian topological order. A Fermi liquid metal with a\ndoping-induced period-3 charge density wave also occurs naturally in our\nanalysis. This Fermi liquid (as well as the PDW) arises from pairing\ninstabilities of a composite Fermi liquid metal that can emerge near filling\n$2/3$. Though inspired by the theory of anyon superconductivity, we explain how\nour construction is qualitatively different. At a general Jain filling $\\nu =\np/(2p+1)$, the same analytical framework leads to a wider variety of phases\nincluding higher-charge superconductors and generalized composite Fermi\nliquids. We predict unusual physical signatures associated with each phase and\nanalyze the crossover between different temperature regimes. These results\nprovide a proof-of-principle that exotic itinerant phases can be stabilized by\ncorrelations intrinsic to the FQAH setup.",
            "pdf_url": "http://arxiv.org/pdf/2409.20567v1",
            "published": "2024-09-30 17:59:45+00:00",
            "updated": "2024-09-30 17:59:45+00:00"
        },
        {
            "title": "Annealing Flow Generative Model Towards Sampling High-Dimensional and Multi-Modal Distributions",
            "authors": "Dongze Wu, Yao Xie",
            "summary": "Sampling from high-dimensional, multi-modal distributions remains a\nfundamental challenge across domains such as statistical Bayesian inference and\nphysics-based machine learning. In this paper, we propose Annealing Flow (AF),\na continuous normalizing flow-based approach designed to sample from\nhigh-dimensional and multi-modal distributions. The key idea is to learn a\ncontinuous normalizing flow-based transport map, guided by annealing, to\ntransition samples from an easy-to-sample distribution to the target\ndistribution, facilitating effective exploration of modes in high-dimensional\nspaces. Unlike many existing methods, AF training does not rely on samples from\nthe target distribution. AF ensures effective and balanced mode exploration,\nachieves linear complexity in sample size and dimensions, and circumvents\ninefficient mixing times. We demonstrate the superior performance of AF\ncompared to state-of-the-art methods through extensive experiments on various\nchallenging distributions and real-world datasets, particularly in\nhigh-dimensional and multi-modal settings. We also highlight the potential of\nAF for sampling the least favorable distributions.",
            "pdf_url": "http://arxiv.org/pdf/2409.20547v1",
            "published": "2024-09-30 17:48:22+00:00",
            "updated": "2024-09-30 17:48:22+00:00"
        },
        {
            "title": "Formally Verified Physics-Informed Neural Control Lyapunov Functions",
            "authors": "Jun Liu, Maxwell Fitzsimmons, Ruikun Zhou, Yiming Meng",
            "summary": "Control Lyapunov functions are a central tool in the design and analysis of\nstabilizing controllers for nonlinear systems. Constructing such functions,\nhowever, remains a significant challenge. In this paper, we investigate\nphysics-informed learning and formal verification of neural network control\nLyapunov functions. These neural networks solve a transformed\nHamilton-Jacobi-Bellman equation, augmented by data generated using\nPontryagin's maximum principle. Similar to how Zubov's equation characterizes\nthe domain of attraction for autonomous systems, this equation characterizes\nthe null-controllability set of a controlled system. This principled learning\nof neural network control Lyapunov functions outperforms alternative\napproaches, such as sum-of-squares and rational control Lyapunov functions, as\ndemonstrated by numerical examples. As an intermediate step, we also present\nresults on the formal verification of quadratic control Lyapunov functions,\nwhich, aided by satisfiability modulo theories solvers, can perform\nsurprisingly well compared to more sophisticated approaches and efficiently\nproduce global certificates of null-controllability.",
            "pdf_url": "http://arxiv.org/pdf/2409.20528v1",
            "published": "2024-09-30 17:27:56+00:00",
            "updated": "2024-09-30 17:27:56+00:00"
        },
        {
            "title": "On Mixed Quantum/Classical Theory for Rotationally Inelastic Scattering of Identical Collision Partners",
            "authors": "Dulat Bostan, Bikramaditya Mandal, Dmitri Babikov",
            "summary": "Mixed quantum/classical theory (MQCT) for the treatment of rotationally\ninelastic transitions during collisions of two identical molecules, described\neither as indistinguishable or distinguishable partners, is reviewed. The\ntreatment of two molecules as indistinguishable includes symmetrization of\nrotational wavefunctions, introduces exchange parity, and gives state-to-state\ntransition matrix elements different from those in the straightforward\ntreatment of molecules as distinguishable. Moreover, the treatment of collision\npartners as indistinguishable is eight times faster. Numerical results,\npresented for $H_2 + H_2$, CO + CO and $H_2O + H_2O$ systems, indicate good\nagreement of MQCT calculations with full-quantum calculations from literature\nand show that an a posteriori correction, applied after the treatment of\ncollision partners as distinguishable, generally produces good results that\nagree well with the rigorous treatment of collision partners as\nindistinguishable. This correction for cross section includes either\nmultiplication by 2, or summation over physically indistinguishable processes,\ndepending on the transition type. After this correction, the results of two\ntreatments agree within 5% for most but may reach 10-20% for some transitions.\nAt low collision energies dominated by scattering resonances these differences\ncan be larger, but they tend to decrease as collision energy is increased. It\nis also shown that if the system is artificially forced to follow the same\ncollision path in the indistinguishable and distinguishable treatments, then\nall differences between the results of two treatments disappear. This\ninteresting finding gives new insight into the collision process and indicates\nthat indistinguishability of identical collision partners comes into play\nthrough the collision path itself, rather than through matrix elements of\ninelastic transitions.",
            "pdf_url": "http://arxiv.org/pdf/2409.20525v1",
            "published": "2024-09-30 17:22:33+00:00",
            "updated": "2024-09-30 17:22:33+00:00"
        },
        {
            "title": "JUTRACK: a Julia package for auto-differentiable accelerator modeling and particle tracking",
            "authors": "Jinyu Wan, Yue Hao, Helena Alamprese, Christian Ratcliff, Ji Qiang",
            "summary": "Efficient accelerator modeling and particle tracking are key for the design\nand configuration of modern particle accelerators. In this work, we present\nJUTRACK, a nested accelerator modeling package developed in Julia programing\nlanguage and enhanced with compiler-level automatic differentiation (AD). With\nthe aid of AD, JUTRACK enables rapid derivative calculations in accelerator\nmodeling, facilitating sensitivity analyses and optimization tasks. We\ndemonstrate the effectiveness of AD-derived derivatives through several\npractical applications, including sensitivity analysis of space-charge-induced\nemittance growth, nonlinear beam dynamics analysis for a synchrotron light\nsource, and lattice parameter tuning of the future Electron-Ion Collider (EIC).\nThrough the incorporation of automatic differentiation, this package opens up\nnew possibilities for accelerator physicists in beam physics studies and\naccelerator design optimization.",
            "pdf_url": "http://arxiv.org/pdf/2409.20522v1",
            "published": "2024-09-30 17:21:47+00:00",
            "updated": "2024-09-30 17:21:47+00:00"
        },
        {
            "title": "A physics-compliant diagonal representation for wireless channels parametrized by beyond-diagonal reconfigurable intelligent surfaces",
            "authors": "Philipp del Hougne",
            "summary": "The parametrization of wireless channels by so-called \"beyond-diagonal\nreconfigurable intelligent surfaces\" (BD-RIS) is mathematically characterized\nby a matrix whose off-diagonal entries are partially or fully populated.\nPhysically, this corresponds to tunable coupling mechanisms between the RIS\nelements that originate from the RIS control circuit. Here, we derive a\nphysics-compliant diagonal representation for BD-RIS-parametrized channels.\nRecognizing that the RIS control circuit, irrespective of its detailed\narchitecture, can always be represented as a multi-port network with auxiliary\nports terminated by tunable individual loads, we physics-compliantly express\nthe BD-RIS-parametrized channel as a multi-port chain cascade of i) radio\nenvironment, ii) static parts of the control circuit, and iii) individually\ntunable loads. Thus, the cascade of the former two systems is terminated by a\nsystem that is mathematically always characterized by a diagonal matrix. This\nphysics-compliant diagonal representation implies that existing algorithms for\nchannel estimation and optimization for conventional (\"diagonal\") RIS can be\nreadily applied to BD-RIS scenarios. We demonstrate this in an experimentally\ngrounded case study. Importantly, we highlight that, operationally, an\nambiguous characterization of the cascade of radio environment and the static\nparts of the control circuit is required, but not the breakdown into the\ncharacteristics of its two constituent systems nor the lifting of the\nambiguities. Nonetheless, we demonstrate how to derive or estimate the\ncharacteristics of the static parts of the control circuit for pedagogical\npurposes. The diagonal representation of BD-RIS-parametrized channels also\nenables their treatment with coupled-dipole-based models. We furthermore derive\nthe assumptions under which the physics-compliant BD-RIS model simplifies to\nthe widespread linear cascaded model.",
            "pdf_url": "http://arxiv.org/pdf/2409.20509v1",
            "published": "2024-09-30 17:11:12+00:00",
            "updated": "2024-09-30 17:11:12+00:00"
        },
        {
            "title": "Nanosecond hardware regression trees in FPGA at the LHC",
            "authors": "Pavel Serhiayenka, Stephen Roche, Benjamin Carlson, Tae Min Hong",
            "summary": "We present a generic parallel implementation of the decision tree-based\nmachine learning (ML) method in hardware description language (HDL) on field\nprogrammable gate arrays (FPGA). A regression problem in high energy physics at\nthe Large Hadron Collider is considered: the estimation of the magnitude of\nmissing transverse momentum using boosted decision trees (BDT). A forest of\ntwenty decision trees each with a maximum depth of ten using eight input\nvariables of 16-bit precision is executed with a latency of less than 10 ns\nusing O(0.1%) resources on Xilinx UltraScale+ VU9P -- approximately ten times\nfaster and five times smaller compared to similar designs using high level\nsynthesis (HLS) -- without the use of digital signal processors (DSP) while\neliminating the use of block RAM (BRAM). We also demonstrate a potential\napplication in the estimation of muon momentum for ATLAS RPC at HL-LHC.",
            "pdf_url": "http://arxiv.org/pdf/2409.20506v1",
            "published": "2024-09-30 17:09:06+00:00",
            "updated": "2024-09-30 17:09:06+00:00"
        },
        {
            "title": "Maximal device-independent randomness in every dimension",
            "authors": "Máté Farkas, Jurij Volčič, Sigurd A. L. Storgaard, Ranyiliu Chen, Laura Mančinska",
            "summary": "Random numbers are used in a wide range of sciences. In many applications,\ngenerating unpredictable private random numbers is indispensable.\nDevice-independent quantum random number generation is a framework that makes\nuse of the intrinsic randomness of quantum processes to generate numbers that\nare fundamentally unpredictable according to our current understanding of\nphysics. While device-independent quantum random number generation is an\nexceptional theoretical feat, the difficulty of controlling quantum systems\nmakes it challenging to carry out in practice. It is therefore desirable to\nharness the full power of the quantum degrees of freedom (the dimension) that\none can control. It is known that no more than $2 \\log(d)$ bits of private\ndevice-independent randomness can be extracted from a quantum system of local\ndimension $d$. In this paper we demonstrate that this bound can be achieved for\nall dimensions $d$ by providing a family of explicit protocols. In order to\nobtain our result, we develop new certification techniques that can be of wider\ninterest in device-independent applications for scenarios in which complete\ncertification ('self-testing') is impossible or impractical.",
            "pdf_url": "http://arxiv.org/pdf/2409.18916v2",
            "published": "2024-09-27 17:03:11+00:00",
            "updated": "2024-09-30 17:06:21+00:00"
        },
        {
            "title": "Sparse space-time resolvent analysis for statistically-stationary and time-varying flows",
            "authors": "Barbara Lopez-Doriga, Eric Ballouz, H. Jane Bae, Scott T. M. Dawson",
            "summary": "Resolvent analysis provides a framework to predict coherent spatio-temporal\nstructures of largest linear energy amplification, through a singular value\ndecomposition (SVD) of the resolvent operator, obtained by linearizing the\nNavier-Stokes equations about a known turbulent mean velocity profile.\nResolvent analysis utilizes a Fourier decomposition in time, which limits its\napplication to statistically-stationary or time-periodic flows. This work\ndevelops a variant of resolvent analysis applicable to time-evolving flows, and\nproposes a variant that identifies spatio-temporally sparse structures,\napplicable to either stationary or time-varying systems. Spatio-temporal\nresolvent analysis is formulated through the incorporation of the temporal\ndimension via a discrete time-differentiation operator. Sparsity (localisation)\nis achieved through the addition of an l1-norm penalisation term to the\noptimisation associated with the SVD. This modified problem can be formulated\nas a nonlinear eigenproblem, and solved via an inverse power method. We first\nshowcase the implementation of the sparse analysis on statistically-stationary\nturbulent channel flow, and demonstrate that the sparse variant can identify\naspects of the physics not directly evident from standard resolvent analysis.\nThis is followed by applying the sparse space-time formulation on systems that\nare time-varying: a time-periodic turbulent Stokes boundary layer, and then a\nturbulent channel flow with a sudden imposition of a lateral pressure gradient,\nwith the original streamwise pressure gradient unchanged. We present results\ndemonstrating how the sparsity-promoting variant can either change the\nquantitative structure of the leading space-time modes to increase their\nsparsity, or identify entirely different linear amplification mechanisms\ncompared to non-sparse resolvent analysis.",
            "pdf_url": "http://arxiv.org/pdf/2404.06331v2",
            "published": "2024-04-09 14:09:14+00:00",
            "updated": "2024-09-30 16:59:54+00:00"
        },
        {
            "title": "Uncovering Hidden Patterns: Approximate Resurgent Resummation from Truncated Series",
            "authors": "Alessio Maiezza, Juan Carlos Vasquez",
            "summary": "We analyze truncated series generated as divergent formal solutions of\nnon-linear ordinary differential equations. Motivating the study is a specific\nnon-linear, first-order differential equation, which is the basis of the\nresurgent formulation of renormalized perturbation theory in quantum field\ntheory. We use the Borel-Pad\\'e approximant and classical analysis to determine\nthe analytic structure of the solution using the first few terms of its\nasymptotic series. Afterward, we build an approximant, consistent with the\nresurgent properties of the equation. The procedure gives an approximate\nexpression for the Borel-Ecalle resummation of the solution useful for\npractical applications. Connections with other physical applications are also\ndiscussed.",
            "pdf_url": "http://arxiv.org/pdf/2409.20458v1",
            "published": "2024-09-30 16:17:02+00:00",
            "updated": "2024-09-30 16:17:02+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "COLLAGE: Collaborative Human-Agent Interaction Generation using Hierarchical Latent Diffusion and Language Models",
            "authors": "Divyanshu Daiya, Damon Conover, Aniket Bera",
            "summary": "We propose a novel framework COLLAGE for generating collaborative\nagent-object-agent interactions by leveraging large language models (LLMs) and\nhierarchical motion-specific vector-quantized variational autoencoders\n(VQ-VAEs). Our model addresses the lack of rich datasets in this domain by\nincorporating the knowledge and reasoning abilities of LLMs to guide a\ngenerative diffusion model. The hierarchical VQ-VAE architecture captures\ndifferent motion-specific characteristics at multiple levels of abstraction,\navoiding redundant concepts and enabling efficient multi-resolution\nrepresentation. We introduce a diffusion model that operates in the latent\nspace and incorporates LLM-generated motion planning cues to guide the\ndenoising process, resulting in prompt-specific motion generation with greater\ncontrol and diversity. Experimental results on the CORE-4D, and InterHuman\ndatasets demonstrate the effectiveness of our approach in generating realistic\nand diverse collaborative human-object-human interactions, outperforming\nstate-of-the-art methods. Our work opens up new possibilities for modeling\ncomplex interactions in various domains, such as robotics, graphics and\ncomputer vision.",
            "pdf_url": "http://arxiv.org/pdf/2409.20502v1",
            "published": "2024-09-30 17:02:13+00:00",
            "updated": "2024-09-30 17:02:13+00:00"
        },
        {
            "title": "POMONAG: Pareto-Optimal Many-Objective Neural Architecture Generator",
            "authors": "Eugenio Lomurno, Samuele Mariani, Matteo Monti, Matteo Matteucci",
            "summary": "Neural Architecture Search (NAS) automates neural network design, reducing\ndependence on human expertise. While NAS methods are computationally intensive\nand dataset-specific, auxiliary predictors reduce the models needing training,\ndecreasing search time. This strategy is used to generate architectures\nsatisfying multiple computational constraints. Recently, Transferable NAS has\nemerged, generalizing the search process from dataset-dependent to\ntask-dependent. In this field, DiffusionNAG is a state-of-the-art method. This\ndiffusion-based approach streamlines computation, generating architectures\noptimized for accuracy on unseen datasets without further adaptation. However,\nby focusing solely on accuracy, DiffusionNAG overlooks other crucial objectives\nlike model complexity, computational efficiency, and inference latency --\nfactors essential for deploying models in resource-constrained environments.\nThis paper introduces the Pareto-Optimal Many-Objective Neural Architecture\nGenerator (POMONAG), extending DiffusionNAG via a many-objective diffusion\nprocess. POMONAG simultaneously considers accuracy, number of parameters,\nmultiply-accumulate operations (MACs), and inference latency. It integrates\nPerformance Predictor models to estimate these metrics and guide diffusion\ngradients. POMONAG's optimization is enhanced by expanding its training\nMeta-Dataset, applying Pareto Front Filtering, and refining embeddings for\nconditional generation. These enhancements enable POMONAG to generate\nPareto-optimal architectures that outperform the previous state-of-the-art in\nperformance and efficiency. Results were validated on two search spaces --\nNASBench201 and MobileNetV3 -- and evaluated across 15 image classification\ndatasets.",
            "pdf_url": "http://arxiv.org/pdf/2409.20447v1",
            "published": "2024-09-30 16:05:29+00:00",
            "updated": "2024-09-30 16:05:29+00:00"
        },
        {
            "title": "Manifold-Constrained Nucleus-Level Denoising Diffusion Model for Structure-Based Drug Design",
            "authors": "Shengchao Liu, Divin Yan, Weitao Du, Weiyang Liu, Zhuoxinran Li, Hongyu Guo, Christian Borgs, Jennifer Chayes, Anima Anandkumar",
            "summary": "Artificial intelligence models have shown great potential in structure-based\ndrug design, generating ligands with high binding affinities. However, existing\nmodels have often overlooked a crucial physical constraint: atoms must maintain\na minimum pairwise distance to avoid separation violation, a phenomenon\ngoverned by the balance of attractive and repulsive forces. To mitigate such\nseparation violations, we propose NucleusDiff. It models the interactions\nbetween atomic nuclei and their surrounding electron clouds by enforcing the\ndistance constraint between the nuclei and manifolds. We quantitatively\nevaluate NucleusDiff using the CrossDocked2020 dataset and a COVID-19\ntherapeutic target, demonstrating that NucleusDiff reduces violation rate by up\nto 100.00% and enhances binding affinity by up to 22.16%, surpassing\nstate-of-the-art models for structure-based drug design. We also provide\nqualitative analysis through manifold sampling, visually confirming the\neffectiveness of NucleusDiff in reducing separation violations and improving\nbinding affinities.",
            "pdf_url": "http://arxiv.org/pdf/2409.10584v2",
            "published": "2024-09-16 08:42:46+00:00",
            "updated": "2024-09-30 15:09:02+00:00"
        },
        {
            "title": "Enhancing GANs with Contrastive Learning-Based Multistage Progressive Finetuning SNN and RL-Based External Optimization",
            "authors": "Osama Mustafa",
            "summary": "The application of deep learning in cancer research, particularly in early\ndiagnosis, case understanding, and treatment strategy design, emphasizes the\nneed for high-quality data. Generative AI, especially Generative Adversarial\nNetworks (GANs), has emerged as a leading solution to challenges like class\nimbalance, robust learning, and model training, while addressing issues\nstemming from patient privacy and the scarcity of real data. Despite their\npromise, GANs face several challenges, both inherent and specific to\nhistopathology data. Inherent issues include training imbalance, mode collapse,\nlinear learning from insufficient discriminator feedback, and hard boundary\nconvergence due to stringent feedback. Histopathology data presents a unique\nchallenge with its complex representation, high spatial resolution, and\nmultiscale features. To address these challenges, we propose a framework\nconsisting of two components. First, we introduce a contrastive learning-based\nMultistage Progressive Finetuning Siamese Neural Network (MFT-SNN) for\nassessing the similarity between histopathology patches. Second, we implement a\nReinforcement Learning-based External Optimizer (RL-EO) within the GAN training\nloop, serving as a reward signal generator. The modified discriminator loss\nfunction incorporates a weighted reward, guiding the GAN to maximize this\nreward while minimizing loss. This approach offers an external optimization\nguide to the discriminator, preventing generator overfitting and ensuring\nsmooth convergence. Our proposed solution has been benchmarked against\nstate-of-the-art (SOTA) GANs and a Denoising Diffusion Probabilistic model,\noutperforming previous SOTA across various metrics, including FID score, KID\nscore, Perceptual Path Length, and downstream classification tasks.",
            "pdf_url": "http://arxiv.org/pdf/2409.20340v1",
            "published": "2024-09-30 14:39:56+00:00",
            "updated": "2024-09-30 14:39:56+00:00"
        },
        {
            "title": "Continuous Diffusion for Mixed-Type Tabular Data",
            "authors": "Markus Mueller, Kathrin Gruber, Dennis Fok",
            "summary": "Score-based generative models (or diffusion models for short) have proven\nsuccessful for generating text and image data. However, the adaption of this\nmodel family to tabular data of mixed-type has fallen short so far. In this\npaper, we propose CDTD, a Continuous Diffusion model for mixed-type Tabular\nData. Specifically, we combine score matching and score interpolation to ensure\na common continuous noise distribution for both continuous and categorical\nfeatures alike. We counteract the high heterogeneity inherent to data of\nmixed-type with distinct, adaptive noise schedules per feature or per data\ntype. The learnable noise schedules ensure optimally allocated model capacity\nand balanced generative capability. We homogenize the data types further with\nmodel-specific loss calibration and initialization schemes tailored to\nmixed-type tabular data. Our experimental results show that CDTD consistently\noutperforms state-of-the-art benchmark models, captures feature correlations\nexceptionally well, and that heterogeneity in the noise schedule design boosts\nthe sample quality.",
            "pdf_url": "http://arxiv.org/pdf/2312.10431v3",
            "published": "2023-12-16 12:21:03+00:00",
            "updated": "2024-09-30 13:45:03+00:00"
        }
    ]
}