{
    "Physics": [
        {
            "title": "The role of the chiral anomaly in polarized deeply inelastic scattering III: Wess-Zumino-Witten contributions and chiral Ward identities for finite quark mass",
            "authors": "Andrey Tarasov, Raju Venugopalan",
            "summary": "We extend our prior results on the worldline computation of the axial\nvector-vector-vector (AVV) triangle anomaly in polarized deeply inelastic\nscattering (DIS) to the finite mass case by computing in addition the\npseudoscalar-vector-vector (PVV) triangle graph. For the well-studied QED case,\nwe show explicitly how the off-forward AVV pole exactly cancels an identical\nPVV pole. We then demonstrate the dramatic difference in QCD due to the chiral\ncondensate, which qualitatively modifies anomalous Ward identities. As in the\nmassless case, the anomaly pole in QCD is canceled by the dynamics of a\nprimordial isosinglet pseudoscalar $\\bar \\eta$-meson, whose Wess-Zumino-Witten\ncoupling to the topological charge density shifts the pole to the physical\n$\\eta^\\prime$ mass, with the finite quark mass contribution differing by\n$O(10\\%)$ from the Witten-Veneziano formula. We obtain a compact analytic\nexpression for the finite mass corrections to Shore and Veneziano's result that\nthe proton's net quark helicity $\\Delta \\Sigma\\propto \\sqrt{\\chi_{\\rm QCD}'\n|_{m=0}(0)}$, the forward slope of the topological susceptibility in the chiral\nlimit, and show they are of the order of a few percent. Our prior prediction\nthat the polarized DIS structure function $g_1$ is quenched by sphaleron-like\ntopological transitions at small $x$ is unaffected by quark mass effects. Our\nresults illustrate how worldline computations of anomalous processes, in\nsynergy with lattice computations and nonet chiral perturbation theory, can\nuncover novel nonperturbative features of QCD at the Electron-Ion collider.",
            "pdf_url": "http://arxiv.org/pdf/2501.10519v2",
            "published": "2025-01-17 19:40:51+00:00",
            "updated": "2025-01-22 18:51:54+00:00"
        },
        {
            "title": "A Non-linear Massive Gravity Theory of Geometric Origin",
            "authors": "Thibault Damour, Tamanna Jain",
            "summary": "We study the number of propagating degrees of freedom, at non-linear order,\nin torsion gravity theories, a class of modified theories of gravity that\ninclude a propagating torsion in addition to the metric. We focus on a\nthree-parameter subfamily of theories (``torsion bigravity\") that contains, at\nlinear order, only two physical excitations: a massless spin-2 one (with two\ndegrees of freedom) and a massive spin-2 one (with five degrees of freedom). We\nstudy the dynamics of the massive spin-2 field in the limit where the torsion\nfield decouples from the metric. The number of degrees of freedom of the\ntorsion field is found to {\\it change, at non-linear order, from five to nine}.",
            "pdf_url": "http://arxiv.org/pdf/2501.13077v1",
            "published": "2025-01-22 18:40:02+00:00",
            "updated": "2025-01-22 18:40:02+00:00"
        },
        {
            "title": "Real-time Terahertz Compressive Optical-Digital Neural Network Imaging",
            "authors": "Shao-Hsuan Wu, Seyed Mostafa Latifi, Chia-Wen Lin, Shang-Hua Yang",
            "summary": "Terahertz (THz) band has recently garnered significant attention due to its\nexceptional capabilities in non-invasive, non-destructive sensing, and imaging\napplications. However, current THz imaging systems encounter substantial\nchallenges owing to hardware limitations, which result in information loss and\nrestricted imaging throughput during data digitization and information\nextraction processes. To overcome these challenges, we propose a hybrid\ncompressive optical-digital neural network designed to facilitate both\nreal-time THz imaging and precise object information extraction. This approach\nutilizes a physical encoder, an optical neural network (ONN), to transform and\nreduce the dimensionality of physical signals, effectively compressing them to\nfit the physical constraints of THz sensor arrays. After the compressed signals\nare captured and digitized by the THz sensor array, a jointly trained digital\nneural network (DNN) reconstructs the signals into their desired or original\nform. Our proposed THz ONN-DNN computational imaging system demonstrates\nenhanced imaging quality, an expanded field of view with a lens-free system,\ndiffraction-free imaging capability, and real-time THz video capture at a rate\nof two frames per second.",
            "pdf_url": "http://arxiv.org/pdf/2501.13065v1",
            "published": "2025-01-22 18:19:51+00:00",
            "updated": "2025-01-22 18:19:51+00:00"
        },
        {
            "title": "Universal programmable and self-configuring optical filter",
            "authors": "David A. B. Miller, Charles Roques-Carmes, Carson G. Valdez, Anne R. Kroo, Marek Vlk, Shanhui Fan, Olav Solgaard",
            "summary": "We propose an approach to integrated optical spectral filtering that allows\narbitrary programmability, can compensate automatically for imperfections in\nfilter fabrication, allows multiple simultaneous and separately programmable\nfilter functions on the same input, and can configure itself automatically to\nthe problem of interest, for example to filter or reject multiple arbitrarily\nchosen frequencies. The approach exploits splitting the input light into an\narray of multiple waveguides of different lengths that then feed a programmable\ninterferometer array that can also self-configure. It can give spectral\nresponse similar to arrayed waveguide gratings but offers many other filtering\nfunctions, as well as supporting other structures based on non-redundant arrays\nfor precise spectral filtering. Simultaneous filtering also allows, for the\nfirst time to our knowledge, an automatic measurement of the temporal coherency\nmatrix and physical separation into the Karhunen-Lo\\`eve expansion of\ntemporally partially coherent light fields.",
            "pdf_url": "http://arxiv.org/pdf/2501.11811v2",
            "published": "2025-01-21 01:19:01+00:00",
            "updated": "2025-01-22 18:15:54+00:00"
        },
        {
            "title": "Quantum thermodynamics of nonequilibrium processes in lattice gauge theories",
            "authors": "Zohreh Davoudi, Christopher Jarzynski, Niklas Mueller, Greeshma Oruganti, Connor Powers, Nicole Yunger Halpern",
            "summary": "A key objective in nuclear and high-energy physics is to describe\nnonequilibrium dynamics of matter, e.g., in the early universe and in particle\ncolliders, starting from the Standard Model. Classical-computing methods, via\nthe framework of lattice gauge theory, have experienced limited success in this\nmission. Quantum simulation of lattice gauge theories holds promise for\novercoming computational limitations. Because of local constraints (Gauss's\nlaws), lattice gauge theories have an intricate Hilbert-space structure. This\nstructure complicates the definition of thermodynamic properties of systems\ncoupled to reservoirs during equilibrium and nonequilibrium processes. We show\nhow to define thermodynamic quantities such as work and heat using\nstrong-coupling thermodynamics, a framework that has recently burgeoned within\nthe field of quantum thermodynamics. Our definitions suit instantaneous\nquenches, simple nonequilibrium processes undertaken in quantum simulators. To\nillustrate our framework, we compute the work and heat exchanged during a\nquench in a $\\mathbb{Z}_2$ lattice gauge theory coupled to matter in 1+1\ndimensions. The thermodynamic quantities, as functions of the quench parameter,\nevidence a phase transition. For general thermal states, we derive a simple\nrelation between a quantum many-body system's entanglement Hamiltonian,\nmeasurable with quantum-information-processing tools, and the Hamiltonian of\nmean force, used to define strong-coupling thermodynamic quantities.",
            "pdf_url": "http://arxiv.org/pdf/2404.02965v2",
            "published": "2024-04-03 18:00:03+00:00",
            "updated": "2025-01-22 18:13:22+00:00"
        },
        {
            "title": "Quantifying the particle aspect of quantum systems",
            "authors": "Sreetama Das, Indranil Chakrabarty, Arun Kumar Pati, Aditi Sen De, Ujjwal Sen",
            "summary": "The possibility of a quantum system to exhibit properties that are akin to\nboth the classically held notions of being a particle and a wave, is one of the\nmost intriguing aspects of the quantum description of nature. These aspects\nhave been instrumental in understanding paradigmatic natural phenomena as well\nas to provide nonclassical applications. A conceptual foundation for the wave\nnature of a quantum state has recently been presented, through the notion of\nquantum coherence. We introduce here a parallel notion for the particle nature\nof a quantum state of an arbitrary physical system. We provide elements of a\nresource theory of particleness, and give a quantification of the same.\nFinally, we provide evidence for a complementarity between the particleness\nthus introduced, and the coherence of an arbitrary quantum state.",
            "pdf_url": "http://arxiv.org/pdf/1812.08656v4",
            "published": "2018-12-20 16:02:31+00:00",
            "updated": "2025-01-22 17:55:51+00:00"
        },
        {
            "title": "Search for non-standard neutrino interactions with the first six detection units of KM3NeT/ORCA",
            "authors": "S. Aiello, A. Albert, A. R. Alhebsi, M. Alshamsi, S. Alves Garre, A. Ambrosone, F. Ameli, M. Andre, L. Aphecetche, M. Ardid, S. Ardid, J. Aublin, F. Badaracco, L. Bailly-Salins, Z. Bardačová, B. Baret, A. Bariego-Quintana, Y. Becherini, M. Bendahman, F. Benfenati, M. Benhassi, M. Bennani, D. M. Benoit, E. Berbee, V. Bertin, S. Biagi, M. Boettcher, D. Bonanno, A. B. Bouasla, J. Boumaaza, M. Bouta, M. Bouwhuis, C. Bozza, R. M. Bozza, H. Brânzăş, F. Bretaudeau, M. Breuhaus, R. Bruijn, J. Brunner, R. Bruno, E. Buis, R. Buompane, J. Busto, B. Caiffi, D. Calvo, A. Capone, F. Carenini, V. Carretero, T. Cartraud, P. Castaldi, V. Cecchini, S. Celli, L. Cerisy, M. Chabab, A. Chen, S. Cherubini, T. Chiarusi, M. Circella, R. Clark, R. Cocimano, J. A. B. Coelho, A. Coleiro, A. Condorelli, R. Coniglione, P. Coyle, A. Creusot, G. Cuttone, R. Dallier, A. De Benedittis, B. De Martino, G. De Wasseige, V. Decoene, I. Del Rosso, L. S. Di Mauro, I. Di Palma, A. F. Díaz, D. Diego-Tortosa, C. Distefano, A. Domi, C. Donzaud, D. Dornic, E. Drakopoulou, D. Drouhin, J. -G. Ducoin, R. Dvornický, T. Eberl, E. Eckerová, A. Eddymaoui, T. van Eeden, M. Eff, D. van Eijk, I. El Bojaddaini, S. El Hedri, V. Ellajosyula, A. Enzenhöfer, G. Ferrara, M. D. Filipović, F. Filippini, D. Franciotti, L. A. Fusco, S. Gagliardini, T. Gal, J. García Méndez, A. Garcia Soto, C. Gatius Oliver, N. Geißelbrecht, E. Genton, H. Ghaddari, L. Gialanella, B. K. Gibson, E. Giorgio, I. Goos, P. Goswami, S. R. Gozzini, R. Gracia, C. Guidi, B. Guillon, M. Gutiérrez, C. Haack, H. van Haren, A. Heijboer, L. Hennig, J. J. Hernández-Rey, W. Idrissi Ibnsalih, G. Illuminati, D. Joly, M. de Jong, P. de Jong, B. J. Jung, G. Kistauri, C. Kopper, A. Kouchner, Y. Y. Kovalev, V. Kueviakoe, V. Kulikovskiy, R. Kvatadze, M. Labalme, R. Lahmann, M. Lamoureux, G. Larosa, C. Lastoria, J. Lazar, A. Lazo, S. Le Stum, G. Lehaut, V. Lemaître, E. Leonora, N. Lessing, G. Levi, M. Lindsey Clark, F. Longhitano, F. Magnani, J. Majumdar, L. Malerba, F. Mamedov, A. Manfreda, M. Marconi, A. Margiotta, A. Marinelli, C. Markou, L. Martin, M. Mastrodicasa, S. Mastroianni, J. Mauro, G. Miele, P. Migliozzi, E. Migneco, M. L. Mitsou, C. M. Mollo, L. Morales-Gallegos, A. Moussa, I. Mozun Mateo, R. Muller, M. R. Musone, M. Musumeci, S. Navas, A. Nayerhoda, C. A. Nicolau, B. Nkosi, B. Ó Fearraigh, V. Oliviero, A. Orlando, E. Oukacha, D. Paesani, J. Palacios González, G. Papalashvili, V. Parisi, E. J. Pastor Gómez, C. Pastore, A. M. Păun, G. E. Păvălaş, S. Peña Martínez, M. Perrin-Terrin, V. Pestel, R. Pestes, P. Piattelli, A. Plavin, C. Poiré, V. Popa, T. Pradier, J. Prado, S. Pulvirenti, C. A. Quiroz-Rangel, N. Randazzo, S. Razzaque, I. C. Rea, D. Real, G. Riccobene, A. Romanov, E. Ros, A. Šaina, F. Salesa Greus, D. F. E. Samtleben, A. Sánchez Losa, S. Sanfilippo, M. Sanguineti, D. Santonocito, P. Sapienza, J. Schnabel, J. Schumann, H. M. Schutte, J. Seneca, N. Sennan, P. Sevle, I. Sgura, R. Shanidze, A. Sharma, Y. Shitov, F. Šimkovic, A. Simonelli, A. Sinopoulou, B. Spisso, M. Spurio, D. Stavropoulos, I. Štekl, M. Taiuti, G. Takadze, Y. Tayalati, H. Thiersen, S. Thoudam, I. Tosta e Melo, B. Trocmé, V. Tsourapis, A. Tudorache, E. Tzamariudaki, A. Ukleja, A. Vacheret, V. Valsecchi, V. Van Elewyck, G. Vannoye, G. Vasileiadis, F. Vazquez de Sola, A. Veutro, S. Viola, D. Vivolo, A. van Vliet, E. de Wolf, I. Lhenry-Yvon, S. Zavatarelli, A. Zegarelli, D. Zito, J. D. Zornoza, J. Zúñiga, N. Zywucka",
            "summary": "KM3NeT/ORCA is an underwater neutrino telescope under construction in the\nMediterranean Sea. Its primary scientific goal is to measure the atmospheric\nneutrino oscillation parameters and to determine the neutrino mass ordering.\nORCA can constrain the oscillation parameters $\\Delta m^{2}_{31}$ and\n$\\theta_{23}$ by reconstructing the arrival direction and energy of multi-GeV\nneutrinos crossing the Earth. Searches for deviations from the Standard Model\nof particle physics in the forward scattering of neutrinos inside Earth matter,\nproduced by Non-Standard Interactions, can be conducted by investigating\ndistortions of the standard oscillation pattern of neutrinos of all flavours.\nThis work reports on the results of the search for non-standard neutrino\ninteractions using the first six detection units of ORCA and 433 kton-years of\nexposure. No significant deviation from standard interactions was found in a\nsample of 5828 events reconstructed in the 1 GeV$-$1 TeV energy range. The\nflavour structure of the non-standard coupling was constrained at 90\\%\nconfidence level to be $|\\varepsilon_{\\mu\\tau} | \\leq 5.4 \\times 10^{-3}$,\n$|\\varepsilon_{e\\tau} | \\leq 7.4 \\times 10^{-2}$, $|\\varepsilon_{e\\mu} | \\leq\n5.6 \\times 10^{-2}$ and $-0.015 \\leq \\varepsilon_{\\tau\\tau} -\n\\varepsilon_{\\mu\\mu} \\leq 0.017$. The results are comparable to the current\nmost stringent limits placed on the parameters by other experiments.",
            "pdf_url": "http://arxiv.org/pdf/2411.19078v2",
            "published": "2024-11-28 11:56:05+00:00",
            "updated": "2025-01-22 17:11:42+00:00"
        },
        {
            "title": "Bifurcations in Bosonic Stars: chains and rings from spherical solutions",
            "authors": "Chen Liang, Carlos A. R. Herdeiro, Eugen Radu",
            "summary": "We study the bifurcation phenomena between spherical and axisymmetric bosonic\nstars. By numerically solving for the zero-modes of spherical bosonic stars\nunder specific axially symmetric perturbations, we discover that excited state\nspherical bosonic stars bifurcate into two types of axisymmetric bosonic stars\nunder $\\ell=2$ perturbations, with matter distributions resembling chains and\nrings, respectively. Meanwhile, $\\ell=4$ axisymmetric perturbations lead\nspherical scalar bosonic stars to bifurcate into a new type of axisymmetric\nbosonic stars, exhibiting a mixed chain-like and ring-like matter distribution,\nwhich we refer to as gyroscope-like. Additionally, for the first time, we have\nconstructed chains of scalar bosonic stars with 7 constituents and their\ncorresponding ring-like scalar bosonic stars. Our results provide an\nexplanation for the bifurcations in bosonic stars from the perspective of\nperturbations, and by analyzing physical quantities such as quadrupoles and\nenergy densities we systematically discuss the impact of axisymmetric\nperturbations on spherical bosonic stars.",
            "pdf_url": "http://arxiv.org/pdf/2501.05342v2",
            "published": "2025-01-09 16:13:39+00:00",
            "updated": "2025-01-22 16:52:43+00:00"
        },
        {
            "title": "Is fixed-node diffusion quantum Monte Carlo reproducible?",
            "authors": "Flaviano Della Pia, Benjamin Shi, Yasmine S. Al-Hamdani, Dario Alfè, Tyler Anderson, Matteo Barborini, Anouar Benali, Michele Casula, Neil Drummond, Matúš Dubecký, Claudia Filippi, Paul Kent, Jaron Krogel, Pablo Lopez Rios, Arne Lüchow, Ye Luo, Angelos Michaelides, Lubos Mitas, Kosuke Nakano, Richard Needs, Manolo Per, Anthony Scemama, Jil Schultze, Ravindra Shinde, Emiel Slootman, Sandro Sorella, Alexandre Tkatchenko, Mike Towler, Cyrus Umrigar, Lucas Wagner, William Ashwin Wheeler, Haihan Zhou, Andrea Zen",
            "summary": "Fixed-node diffusion quantum Monte Carlo (FN-DMC) is a widely-trusted\nmany-body method for solving the Schr\\\"{o}dinger equation, known for its\nreliable predictions of material and molecular properties. Furthermore, its\nexcellent scalability with system complexity and near-perfect utilization of\ncomputational power makes FN-DMC ideally positioned to leverage new advances in\ncomputing to address increasingly complex scientific problems. Even though the\nmethod is widely used as a computational gold standard, reproducibility across\nthe numerous FN-DMC code implementations has yet to be demonstrated. This\ndifficulty stems from the diverse array of DMC algorithms and trial wave\nfunctions, compounded by the method's inherent stochastic nature. This study\nrepresents a community-wide effort to address the titular question, affirming\nthat: Yes, FN-DMC is reproducible (when handled with care). Using the\nwater-methane dimer as the canonical test case, we compare results from eleven\ndifferent FN-DMC codes and show that the approximations to treat the\nnon-locality of pseudopotentials are the primary source of the discrepancies\nbetween them. In particular, we demonstrate that, for the same choice of\ndeterminantal component in the trial wave function, reliable and reproducible\npredictions can be achieved by employing the T-move (TM), the determinant\nlocality approximation (DLA), or the determinant T-move (DTM) schemes, while\nthe older locality approximation (LA) leads to considerable variability in\nresults. This work lays the foundation to establish accurate and reproducible\nFN-DMC estimates for all future studies across applications in materials\nscience, physics, chemistry, and biology.",
            "pdf_url": "http://arxiv.org/pdf/2501.12950v1",
            "published": "2025-01-22 15:22:59+00:00",
            "updated": "2025-01-22 15:22:59+00:00"
        },
        {
            "title": "Absorptive Effects in Black Hole Scattering",
            "authors": "Yilber Fabian Bautista, Yu-Tin Huang, Jung-Wook Kim",
            "summary": "In this paper we define absorptive Compton amplitudes, which captures the\nabsorption factor for waves of spin-weight-$s$ scattering in black hole\nperturbation theory. At the leading order, in the $G M \\omega$ expansion, such\namplitudes are purely imaginary and expressible as contact terms. Equipped with\nthese amplitudes we compute the mass change in black hole scattering events via\nKosower-Maybee-O'Connell formalism, where the rest mass of Schwarzschild/Kerr\nblack hole is modified due to absorption of gravitational, electromagnetic, or\nscalar fields sourced by other compact object. We reproduced the power loss\npreviously computed in the post-Newtonian expansion. The results presented here\nhold for similar mass ratios and generic spin orientation, while keeping the\nKerr spin parameter to lie in the physical region $\\chi \\le 1$.",
            "pdf_url": "http://arxiv.org/pdf/2411.03382v2",
            "published": "2024-11-05 18:11:00+00:00",
            "updated": "2025-01-22 15:19:00+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Robust Representation Consistency Model via Contrastive Denoising",
            "authors": "Jiachen Lei, Julius Berner, Jiongxiao Wang, Zhongzhu Chen, Zhongjia Ba, Kui Ren, Jun Zhu, Anima Anandkumar",
            "summary": "Robustness is essential for deep neural networks, especially in\nsecurity-sensitive applications. To this end, randomized smoothing provides\ntheoretical guarantees for certifying robustness against adversarial\nperturbations. Recently, diffusion models have been successfully employed for\nrandomized smoothing to purify noise-perturbed samples before making\npredictions with a standard classifier. While these methods excel at small\nperturbation radii, they struggle with larger perturbations and incur a\nsignificant computational overhead during inference compared to classical\nmethods. To address this, we reformulate the generative modeling task along the\ndiffusion trajectories in pixel space as a discriminative task in the latent\nspace. Specifically, we use instance discrimination to achieve consistent\nrepresentations along the trajectories by aligning temporally adjacent points.\nAfter fine-tuning based on the learned representations, our model enables\nimplicit denoising-then-classification via a single prediction, substantially\nreducing inference costs. We conduct extensive experiments on various datasets\nand achieve state-of-the-art performance with minimal computation budget during\ninference. For example, our method outperforms the certified accuracy of\ndiffusion-based methods on ImageNet across all perturbation radii by 5.3% on\naverage, with up to 11.6% at larger radii, while reducing inference costs by\n85$\\times$ on average. Codes are available at:\nhttps://github.com/jiachenlei/rRCM.",
            "pdf_url": "http://arxiv.org/pdf/2501.13094v1",
            "published": "2025-01-22 18:52:06+00:00",
            "updated": "2025-01-22 18:52:06+00:00"
        },
        {
            "title": "Orchid: Image Latent Diffusion for Joint Appearance and Geometry Generation",
            "authors": "Akshay Krishnan, Xinchen Yan, Vincent Casser, Abhijit Kundu",
            "summary": "Diffusion models are state-of-the-art for image generation. Trained on large\ndatasets, they capture expressive image priors that have been used for tasks\nlike inpainting, depth, and (surface) normal prediction. However, these models\nare typically trained for one specific task, e.g., a separate model for each of\ncolor, depth, and normal prediction. Such models do not leverage the intrinsic\ncorrelation between appearance and geometry, often leading to inconsistent\npredictions.\n  In this paper, we propose using a novel image diffusion prior that jointly\nencodes appearance and geometry. We introduce a diffusion model Orchid,\ncomprising a Variational Autoencoder (VAE) to encode color, depth, and surface\nnormals to a latent space, and a Latent Diffusion Model (LDM) for generating\nthese joint latents. Orchid directly generates photo-realistic color images,\nrelative depth, and surface normals from user-provided text, and can be used to\ncreate image-aligned partial 3D scenes seamlessly. It can also perform\nimage-conditioned tasks like joint monocular depth and normal prediction and is\ncompetitive in accuracy to state-of-the-art methods designed for those tasks\nalone. Lastly, our model learns a joint prior that can be used zero-shot as a\nregularizer for many inverse problems that entangle appearance and geometry.\nFor example, we demonstrate its effectiveness in color-depth-normal inpainting,\nshowcasing its applicability to problems in 3D generation from sparse views.",
            "pdf_url": "http://arxiv.org/pdf/2501.13087v1",
            "published": "2025-01-22 18:46:47+00:00",
            "updated": "2025-01-22 18:46:47+00:00"
        },
        {
            "title": "An Efficient Framework for Crediting Data Contributors of Diffusion Models",
            "authors": "Chris Lin, Mingyu Lu, Chanwoo Kim, Su-In Lee",
            "summary": "As diffusion models are deployed in real-world settings, and their\nperformance is driven by training data, appraising the contribution of data\ncontributors is crucial to creating incentives for sharing quality data and to\nimplementing policies for data compensation. Depending on the use case, model\nperformance corresponds to various global properties of the distribution\nlearned by a diffusion model (e.g., overall aesthetic quality). Hence, here we\naddress the problem of attributing global properties of diffusion models to\ndata contributors. The Shapley value provides a principled approach to\nvaluation by uniquely satisfying game-theoretic axioms of fairness. However,\nestimating Shapley values for diffusion models is computationally impractical\nbecause it requires retraining on many training data subsets corresponding to\ndifferent contributors and rerunning inference. We introduce a method to\nefficiently retrain and rerun inference for Shapley value estimation, by\nleveraging model pruning and fine-tuning. We evaluate the utility of our method\nwith three use cases: (i) image quality for a DDPM trained on a CIFAR dataset,\n(ii) demographic diversity for an LDM trained on CelebA-HQ, and (iii) aesthetic\nquality for a Stable Diffusion model LoRA-finetuned on Post-Impressionist\nartworks. Our results empirically demonstrate that our framework can identify\nimportant data contributors across models' global properties, outperforming\nexisting attribution methods for diffusion models.",
            "pdf_url": "http://arxiv.org/pdf/2407.03153v2",
            "published": "2024-06-09 17:42:09+00:00",
            "updated": "2025-01-22 18:21:13+00:00"
        },
        {
            "title": "O(d/T) Convergence Theory for Diffusion Probabilistic Models under Minimal Assumptions",
            "authors": "Gen Li, Yuling Yan",
            "summary": "Score-based diffusion models, which generate new data by learning to reverse\na diffusion process that perturbs data from the target distribution into noise,\nhave achieved remarkable success across various generative tasks. Despite their\nsuperior empirical performance, existing theoretical guarantees are often\nconstrained by stringent assumptions or suboptimal convergence rates. In this\npaper, we establish a fast convergence theory for the denoising diffusion\nprobabilistic model (DDPM), a widely used SDE-based sampler, under minimal\nassumptions. Our analysis shows that, provided $\\ell_{2}$-accurate estimates of\nthe score functions, the total variation distance between the target and\ngenerated distributions is upper bounded by $O(d/T)$ (ignoring logarithmic\nfactors), where $d$ is the data dimensionality and $T$ is the number of steps.\nThis result holds for any target distribution with finite first-order moment.\nMoreover, we show that with careful coefficient design, the convergence rate\nimproves to $O(k/T)$, where $k$ is the intrinsic dimension of the target data\ndistribution. This highlights the ability of DDPM to automatically adapt to\nunknown low-dimensional structures, a common feature of natural image\ndistributions. These results are achieved through a novel set of analytical\ntools that provides a fine-grained characterization of how the error propagates\nat each step of the reverse process.",
            "pdf_url": "http://arxiv.org/pdf/2409.18959v2",
            "published": "2024-09-27 17:59:10+00:00",
            "updated": "2025-01-22 16:45:40+00:00"
        },
        {
            "title": "Low-dimensional adaptation of diffusion models: Convergence in total variation",
            "authors": "Jiadong Liang, Zhihan Huang, Yuxin Chen",
            "summary": "This paper investigates how diffusion generative models leverage (unknown)\nlow-dimensional structure to accelerate sampling. Focusing on two mainstream\nsamplers -- the denoising diffusion implicit model (DDIM) and the denoising\ndiffusion probabilistic model (DDPM) -- and assuming accurate score estimates,\nwe prove that their iteration complexities are no greater than the order of\n$k/\\varepsilon$ (up to some log factor), where $\\varepsilon$ is the precision\nin total variation distance and $k$ is some intrinsic dimension of the target\ndistribution. Our results are applicable to a broad family of target\ndistributions without requiring smoothness or log-concavity assumptions.\nFurther, we develop a lower bound that suggests the (near) necessity of the\ncoefficients introduced by Ho et al.(2020) and Song et al.(2020) in\nfacilitating low-dimensional adaptation. Our findings provide the first\nrigorous evidence for the adaptivity of the DDIM-type samplers to unknown\nlow-dimensional structure, and improve over the state-of-the-art DDPM theory\nregarding total variation convergence.",
            "pdf_url": "http://arxiv.org/pdf/2501.12982v1",
            "published": "2025-01-22 16:12:33+00:00",
            "updated": "2025-01-22 16:12:33+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Quasi-Monte Carlo with Domain Transformation for Efficient Fourier Pricing of Multi-Asset Options",
            "authors": "Christian Bayer, Chiheb Ben Hammouda, Antonis Papapantoleon, Michael Samet, Raúl Tempone",
            "summary": "Efficiently pricing multi-asset options poses a significant challenge in\nquantitative finance. Fourier methods leverage the regularity properties of the\nintegrand in the Fourier domain to accurately and rapidly value options that\ntypically lack regularity in the physical domain. However, most of the existing\nFourier approaches face hurdles in high-dimensional settings due to the tensor\nproduct (TP) structure of the commonly employed numerical quadrature\ntechniques. To overcome this difficulty, this work advocates using the\nrandomized quasi-MC (RQMC) quadrature to improve the scalability of Fourier\nmethods with high dimensions. The RQMC technique benefits from the smoothness\nof the integrand and alleviates the curse of dimensionality while providing\npractical error estimates. Nonetheless, the applicability of RQMC on the\nunbounded domain, $\\mathbb{R}^d$, requires a domain transformation to\n$[0,1]^d$, which may result in singularities of the transformed integrand at\nthe corners of the hypercube, and hence deteriorate the performance of RQMC. To\ncircumvent this difficulty, we design an efficient domain transformation\nprocedure based on boundary growth conditions on the transformed integrand. The\nproposed transformation preserves sufficient regularity of the original\nintegrand for fast convergence of the RQMC method. To validate our analysis, we\ndemonstrate the efficiency of employing RQMC with an appropriate transformation\nto evaluate options in the Fourier space for various pricing models, payoffs,\nand dimensions. Finally, we highlight the computational advantage of applying\nRQMC over MC or TP in the Fourier domain, and over MC in the physical domain\nfor options with up to 15 assets.",
            "pdf_url": "http://arxiv.org/pdf/2403.02832v2",
            "published": "2024-03-05 10:06:09+00:00",
            "updated": "2025-01-19 15:31:24+00:00"
        }
    ]
}