{
    "Physics": [
        {
            "title": "A method for site-specifically tethering the enzyme urease to DNA origami with sustained activity",
            "authors": "Ian Murphy, Keren Bobilev, Daichi Hayakawa, Eden Ikonen, Thomas E. Videbæk, Shibani Dalal, Wylie W. Ahmed, Jennifer L. Ross, W. Benjamin Rogers",
            "summary": "Attaching enzymes to nanostructures has proven useful to the study of enzyme\nfunctionality under controlled conditions and has led to new technologies.\nOften, the utility and interest of enzyme-tethered nanostructures lie in how\nthe enzymatic activity is affected by how the enzymes are arranged in space.\nTherefore, being able to conjugate enzymes to nanostructures while preserving\nthe enzymatic activity is essential. In this paper, we present a method to\nconjugate single-stranded DNA to the enzyme urease while maintaining enzymatic\nactivity. We show evidence of successful conjugation and quantify the variables\nthat affect the conjugation yield. We also show that the enzymatic activity is\nunchanged after conjugation compared to the enzyme in its native state.\nFinally, we demonstrate the tethering of urease to nanostructures made using\nDNA origami with high site-specificity. Decorating nanostructures with\nenzymatically-active urease may prove to be useful in studying, or even\nutilizing, the functionality of urease in disciplines ranging from\nbiotechnology to soft-matter physics. The techniques we present in this paper\nwill enable researchers across these fields to modify enzymes without\ndisrupting their functionality, thus allowing for more insightful studies into\ntheir behavior and utility.",
            "pdf_url": "http://arxiv.org/pdf/2409.03040v2",
            "published": "2024-09-04 19:19:12+00:00",
            "updated": "2025-04-22 17:41:51+00:00"
        },
        {
            "title": "RGUP Corrections to Scalar and Fermionic Fields",
            "authors": "Gaurav Bhandari, S. D. Pathak, Vikash Kumar Ojha",
            "summary": "We investigate the Relativistic Generalized Uncertainty Principle (RGUP)\neffects on scalar and fermionic fields using the Stetsko-Tkachuk approximation.\nModified equations of motion, Hamiltonians, and stress-energy tensors are\nderived in Minkowski spacetime, incorporating quantum gravitational corrections\nthat ensure a minimal observable length and revert to standard dynamics when\ncorrections are absent. For fermionic fields in curved spacetime, spin\nconnections maintain gravitational consistency. This framework, applicable to\nhigh-energy physics, black hole thermodynamics, and cosmology, integrates\nquantum gravity into relativistic field theories.",
            "pdf_url": "http://arxiv.org/pdf/2504.16043v1",
            "published": "2025-04-22 17:10:40+00:00",
            "updated": "2025-04-22 17:10:40+00:00"
        },
        {
            "title": "Egocentric Mixed-Methods SNA: Analyzing Interviews with Women and/or Queer and LGBT+ Ph.D. Physicists",
            "authors": "Chase Hatcher, Lily Donis, Adrienne Traxler, Madison Swirtz, Camila Manni, Justin Gutzwa, Charles Henderson, Ramón Barthelemy",
            "summary": "Social network analysis (SNA) has been widely used in physics education\nresearch (PER) in recent years, but mostly in a limited range of the available\nmodalities. This paper describes a unique approach to egocentric, mixed-methods\nSNA applied to qualitative network data obtained from 100 interviews with women\nand/or queer professional physicists. We focus on our methods for obtaining\nquantitative network data from these qualitative sources and present novel\ntechniques for analysis of the networks. We also examine the ways in which\negocentric and mixed-methods SNA techniques are aligned with critical methods\nand well-suited to the study of difference, non-normativity, and experiences of\nmarginalization in physics spaces and communities. We explore the limitations\nand potential applications of these methods and situate this work in the larger\ncontext of our study of these interviews. This work bridges a methodological\ngap between SNA and qualitative work on identity in PER and begins to develop\nour understanding of the way gender and sexual minority physicists experience\nsupport.",
            "pdf_url": "http://arxiv.org/pdf/2504.10621v2",
            "published": "2025-04-14 18:21:30+00:00",
            "updated": "2025-04-22 17:02:01+00:00"
        },
        {
            "title": "LHCspin: a Polarized Gas Target for LHC",
            "authors": "A. Accardi, A. Bacchetta, L. Barion, G. Bedeschi, V. Benesova, S. Bertelli, V. Bertone, C. Bissolotti, M. Boglione, G. Bozzi, N. Bundaleski, V. Carassiti, F. G. Celiberto, Z. Chen, G. Ciullo, M. Constantinou, P. Costa Pinto, A. Courtoy, U. D'Alesio, C. De Angelis, E. De Lucia, I. Denisenko, P. Di Nezza, M. Diehl, F. Donato, N. Doshita, O. M. N. Duarte Teodoro, M. G. Echevarria, T. El-Kordy, R. Engels, F. Fabiano, I. P. Fernando, M. Ferro-Luzzi, C. Flore, L. Gamberg, G. R. Goldstein, J. O. Gonzalez-Hernandez, B. Gou, A. Gridin, A. Guskov, C. Hadjidakis, V. Hejny, T. Iwata, D. Keller, N. Koch, A. Kotzinian, J. P. Lansberg, P. Lenisa, X. Li, H. W. Lin, S. Liuti, R. Longo, M. Maggiora, G. Manca, S. Mariani, J. Matousek, T. Matsuda, A. Metz, M. Mirazita, Y. Miyachi, A. Movsisyan, F. Murgia, A. Nass, E. R. Nocera, C. Oppedisano, L. L. Pappalardo, B. Parsamyan, B. Pasquini, M. Pesek, A. Piccoli, C. Pisano, D. Pitonyak, J. Pretz, A. Prokudin, M. Radici, F. Rathmann, M. Rotondo, M. Santimaria, G. Schnell, R. Shankar, A. Signori, D. Sivers, S. Squerzanti, M. Stancari, E. Steffens, L. Sun, H. Suzuki, G. Tagliente, F. Tessarotto, C. Van Hulse, Q. Xu, Z. Ye, J. Zhang",
            "summary": "The goal of the LHCspin project is to develop innovative solutions for\nmeasuring the 3D structure of nucleons in high-energy polarized fixed-target\ncollisions at LHC, exploring new processes and exploiting new probes in a\nunique, previously unexplored, kinematic regime. A precise multi-dimensional\ndescription of the hadron structure has, in fact, the potential to deepen our\nunderstanding of the strong interactions and to provide a much more precise\nframework for measuring both Standard Model and Beyond Standard Model\nobservables. This ambitious task poses its basis on the recent experience with\nthe successful installation and operation of the SMOG2 unpolarized gas target\nin front of the LHCb spectrometer. Besides allowing for interesting physics\nstudies ranging from astrophysics to heavy-ion physics, SMOG2 provides an ideal\nbenchmark for studying beam-target dynamics at the LHC and demonstrates the\nfeasibility of simultaneous operation with beam-beam collisions. With the\ninstallation of the proposed polarized target system, LHCb will become the\nfirst experiment to simultaneously collect data from unpolarized beam-beam\ncollisions at $\\sqrt{s}$=14 TeV and polarized and unpolarized beam-target\ncollisions at $\\sqrt{s_{NN}}\\sim$100 GeV. LHCspin has the potential to open new\nfrontiers in physics by exploiting the capabilities of the world's most\npowerful collider and one of the most advanced spectrometers. This document\nalso highlights the need to perform an R\\&D campaign and the commissioning of\nthe apparatus at the LHC Interaction Region 4 during the Run 4, before its\nfinal installation in LHCb. This opportunity could also allow to undertake\npreliminary physics measurements with unprecedented conditions.",
            "pdf_url": "http://arxiv.org/pdf/2504.16034v1",
            "published": "2025-04-22 16:58:08+00:00",
            "updated": "2025-04-22 16:58:08+00:00"
        },
        {
            "title": "Cosmology and nuclear-physics implications of a subsolar gravitational-wave event",
            "authors": "Francesco Crescimbeni, Gabriele Franciolini, Paolo Pani, Massimo Vaglio",
            "summary": "Detecting a compact subsolar object would have profound implications in\nphysics, the reach of which depends on the nature of the object. Here we\nexplore such consequences for a putative subsolar-mass gravitational wave event\ndetected by the LIGO-Virgo-KAGRA Collaboration. We forecast that the nature of\na subsolar binary (made of light neutron stars, primordial black holes, or more\nexotic compact objects) can be inferred with a great statistical confidence\nlevel already during the ongoing fourth observing run, based on the large tidal\ndeformability effects on the signal. The detection of a primordial black hole\nwould have implications for cosmology and dark matter scenarios, while the\nmeasurement of the tidal deformability of a subsolar neutron star could rule\nout or confirm the existence of strange stars made of quarks.",
            "pdf_url": "http://arxiv.org/pdf/2408.14287v2",
            "published": "2024-08-26 14:16:22+00:00",
            "updated": "2025-04-22 16:52:27+00:00"
        },
        {
            "title": "Quantum Algorithm for Reversing Unknown Unitary Evolutions",
            "authors": "Yu-Ao Chen, Yin Mo, Yingjian Liu, Lei Zhang, Xin Wang",
            "summary": "Reversing an unknown quantum evolution is of central importance to quantum\ninformation processing and fundamental physics, yet it remains a formidable\nchallenge as conventional methods necessitate an infinite number of queries to\nfully characterize the quantum process. Here we introduce the Quantum Unitary\nReversal Algorithm (QURA), a deterministic and exact approach to universally\nreverse arbitrary unknown unitary transformations using $\\mathcal{O}(d^2)$\ncalls of the unitary, where $d$ is the system dimension. Our quantum algorithm\nresolves a fundamental problem of time-reversal simulations for closed quantum\nsystems by confirming the feasibility of reversing any unitary evolution\nwithout knowing the exact process. The algorithm also provides the construction\nof a key oracle for unitary inversion in many quantum algorithm frameworks,\nsuch as quantum singular value transformation. It notably reveals a sharp\nboundary between the quantum and classical computing realms and unveils a\nquadratic quantum advantage in computational complexity for this foundational\ntask.",
            "pdf_url": "http://arxiv.org/pdf/2403.04704v2",
            "published": "2024-03-07 17:59:11+00:00",
            "updated": "2025-04-22 16:42:33+00:00"
        },
        {
            "title": "Modeling Tidal Disruptions with Dynamical Tides",
            "authors": "Zihan Zhou, Giovanni Maria Tomaselli, Irvin Martínez-Rodríguez, Jingping Li",
            "summary": "Tidal disruption events (TDEs) occur when stars pass close enough to\nsupermassive black holes to be torn apart by tidal forces. Traditionally, these\nevents are studied with computationally intensive hydrodynamical simulations.\nIn this paper, we present a fast, physically motivated two-stage model for\nTDEs. In the first stage, we model the star's tidal deformation using linear\nstellar perturbation theory, treating the star as a collection of driven\nharmonic oscillators. When the tidal energy exceeds a fraction $\\gamma$ of the\nstar's gravitational binding energy (with $\\gamma \\sim \\mathcal{O}(1)$), we\ntransition to the second stage, where we model the disrupted material as free\nparticles. The parameter $\\gamma$ is determined with a one-time calibration to\nhydrodynamical simulations. This method enables fast computation of the energy\ndistribution $\\mathrm{d}M/\\mathrm{d}E$ and fallback rate\n$\\mathrm{d}M/\\mathrm{d}T$, while offering physical insight into the disruption\nprocess. We apply our model to MESA-generated profiles of middle-age\nmain-sequence stars. Our code is available on GitHub.",
            "pdf_url": "http://arxiv.org/pdf/2504.16025v1",
            "published": "2025-04-22 16:42:18+00:00",
            "updated": "2025-04-22 16:42:18+00:00"
        },
        {
            "title": "Non-Renormalizable SU(5) GUTs: Leptoquark-Induced Neutrino Masses",
            "authors": "Ilja Doršner, Mijo Matković, Shaikh Saad",
            "summary": "We revisit the doublet-triplet splitting problem within the $SU(5)$ gauge\ngroup framework to advocate a viable regime with the light scalar leptoquark of\nthe doublet-triplet splitting notoriety that is compatible with the current\nexperimental bounds on partial proton decay lifetimes. We explicitly\ndemonstrate, through a consistent use of higher-dimensional operators, how to\nimplement suppression of baryon number violating interactions of the\naforementioned color triplet. Our study thus offers an alternative approach to\nthe doublet-triplet splitting problem as it removes a need for an extreme mass\nhierarchy between the partners residing in the same representation. We\nfurthermore pursue two different extensions of two distinct symmetry breaking\nscenarios of $SU(5)$, one with a $24$-dimensional representation and the other\none with a $75$-dimensional representation, to produce comparative study of\nnovel consequences for the gauge coupling unification and the one-loop level\nneutrino mass generation. Our results point towards qualitatively novel $SU(5)$\nscenarios, where the light scalar leptoquarks, responsible for the neutrino\nmass generation, might be even accessible at colliders and thus serve as an\naccelerator accessible portal to the high-scale physics.",
            "pdf_url": "http://arxiv.org/pdf/2504.16022v1",
            "published": "2025-04-22 16:39:02+00:00",
            "updated": "2025-04-22 16:39:02+00:00"
        },
        {
            "title": "Polarized and unpolarized gluon PDFs: generative machine learning applications for lattice QCD matrix elements at short distance and large momentum",
            "authors": "Talal Ahmed Chowdhury, Taku Izubuchi, Methun Kamruzzaman, Nikhil Karthik, Tanjib Khan, Tianbo Liu, Arpon Paul, Jakob Schoenleber, Raza Sabbir Sufian",
            "summary": "Lattice quantum chromodynamics (QCD) calculations share a defining challenge\nby requiring a small finite range of spatial separation $z$ between quark/gluon\nbilinears for controllable power corrections in the perturbative QCD\nfactorization, and a large hadron boost $p_z$ for a successful determination of\ncollinear parton distribution functions (PDFs). However, these two requirements\nmake the determination of PDFs from lattice data very challenging. We present\nthe application of generative machine learning algorithms to estimate the\npolarized and unpolarized gluon correlation functions utilizing short-distance\ndata and extending the correlation up to $zp_z \\lesssim 14$, surpassing the\ncurrent capabilities of lattice QCD calculations. We train physics-informed\nmachine learning algorithms to learn from the short-distance correlation at\n$z\\lesssim 0.36$ fm and take the limit, $p_z \\to \\infty$, thereby minimizing\npossible contamination from the higher-twist effects for a successful\nreconstruction of the polarized gluon PDF. We also expose the bias and problems\nwith underestimating uncertainties associated with the use of model-dependent\nand overly constrained functional forms, such as $x^\\alpha(1-x)^\\beta$ and its\nvariants to extract PDFs from the lattice data. We propose the use of\ngenerative machine learning algorithms to mitigate these issues and present our\ndetermination of the polarized and unpolarized gluon PDFs in the nucleon.",
            "pdf_url": "http://arxiv.org/pdf/2409.17234v2",
            "published": "2024-09-25 18:00:02+00:00",
            "updated": "2025-04-22 16:35:36+00:00"
        },
        {
            "title": "Probing New Physics Through CP Violation in $B_{(s)}\\to Vμ^+μ^-$ Decays",
            "authors": "Robert Fleischer, Martijn van Hamersveld, Tim Kortekaas, Anders Rehult, K. Keri Vos",
            "summary": "Rare decays of the kind $B\\to K^*\\mu^+\\mu^-$ and $B_s\\to \\phi\\mu^+\\mu^-$ are\nkey players for testing the Standard Model. The current experimental data for\ntheir decay rates and angular observables show tensions with the theoretical\npredictions that may be indications of New Physics. We present a strategy to\nextract the relevant short-distance coefficients in the presence of new sources\nof CP violation, utilizing a synergy with $B\\to K\\mu^+\\mu^-$ decays. Using the\ncurrent data as a guideline, we illustrate the new method to determine the\ncomplex coefficients $C_9^{(\\prime)}$ and $C_{10}^{(\\prime)}$ using only four\nangular observables. Interestingly, the current experimental picture leaves\nsignificant room for CP-violating New Physics. We discuss also the link to\nleptonic $B^0_s\\to\\mu^+\\mu^-$ decays. We are looking forward to the\nimplementation of these strategies at the future high-precision frontier of\nflavour physics.",
            "pdf_url": "http://arxiv.org/pdf/2504.16014v1",
            "published": "2025-04-22 16:26:17+00:00",
            "updated": "2025-04-22 16:26:17+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Adversarial Observations in Weather Forecasting",
            "authors": "Erik Imgrund, Thorsten Eisenhofer, Konrad Rieck",
            "summary": "AI-based systems, such as Google's GenCast, have recently redefined the state\nof the art in weather forecasting, offering more accurate and timely\npredictions of both everyday weather and extreme events. While these systems\nare on the verge of replacing traditional meteorological methods, they also\nintroduce new vulnerabilities into the forecasting process. In this paper, we\ninvestigate this threat and present a novel attack on autoregressive diffusion\nmodels, such as those used in GenCast, capable of manipulating weather\nforecasts and fabricating extreme events, including hurricanes, heat waves, and\nintense rainfall. The attack introduces subtle perturbations into weather\nobservations that are statistically indistinguishable from natural noise and\nchange less than 0.1% of the measurements - comparable to tampering with data\nfrom a single meteorological satellite. As modern forecasting integrates data\nfrom nearly a hundred satellites and many other sources operated by different\ncountries, our findings highlight a critical security risk with the potential\nto cause large-scale disruptions and undermine public trust in weather\nprediction.",
            "pdf_url": "http://arxiv.org/pdf/2504.15942v1",
            "published": "2025-04-22 14:38:13+00:00",
            "updated": "2025-04-22 14:38:13+00:00"
        },
        {
            "title": "Clifford Group Equivariant Diffusion Models for 3D Molecular Generation",
            "authors": "Cong Liu, Sharvaree Vadgama, David Ruhe, Erik Bekkers, Patrick Forrè",
            "summary": "This paper explores leveraging the Clifford algebra's expressive power for\n$\\E(n)$-equivariant diffusion models. We utilize the geometric products between\nClifford multivectors and the rich geometric information encoded in Clifford\nsubspaces in \\emph{Clifford Diffusion Models} (CDMs). We extend the diffusion\nprocess beyond just Clifford one-vectors to incorporate all higher-grade\nmultivector subspaces. The data is embedded in grade-$k$ subspaces, allowing us\nto apply latent diffusion across complete multivectors. This enables CDMs to\ncapture the joint distribution across different subspaces of the algebra,\nincorporating richer geometric information through higher-order features. We\nprovide empirical results for unconditional molecular generation on the QM9\ndataset, showing that CDMs provide a promising avenue for generative modeling.",
            "pdf_url": "http://arxiv.org/pdf/2504.15773v1",
            "published": "2025-04-22 10:30:06+00:00",
            "updated": "2025-04-22 10:30:06+00:00"
        },
        {
            "title": "Markov Kernels, Distances and Optimal Control: A Parable of Linear Quadratic Non-Gaussian Distribution Steering",
            "authors": "Alexis M. H. Teter, Wenqing Wang, Sachin Shivakumar, Abhishek Halder",
            "summary": "For a controllable linear time-varying (LTV) pair\n$(\\boldsymbol{A}_t,\\boldsymbol{B}_t)$ and $\\boldsymbol{Q}_{t}$ positive\nsemidefinite, we derive the Markov kernel for the It\\^{o} diffusion\n${\\mathrm{d}}\\boldsymbol{x}_{t}=\\boldsymbol{A}_{t}\\boldsymbol{x}_t {\\mathrm{d}}\nt + \\sqrt{2}\\boldsymbol{B}_{t}{\\mathrm{d}}\\boldsymbol{w}_{t}$ with an\naccompanying killing of probability mass at rate\n$\\frac{1}{2}\\boldsymbol{x}^{\\top}\\boldsymbol{Q}_{t}\\boldsymbol{x}$. This Markov\nkernel is the Green's function for an associated linear\nreaction-advection-diffusion partial differential equation. Our result\ngeneralizes the recently derived kernel for the special case\n$\\left(\\boldsymbol{A}_t,\\boldsymbol{B}_t\\right)=\\left(\\boldsymbol{0},\\boldsymbol{I}\\right)$,\nand depends on the solution of an associated Riccati matrix ODE. A consequence\nof this result is that the linear quadratic non-Gaussian Schr\\\"{o}dinger bridge\nis exactly solvable. This means that the problem of steering a controlled LTV\ndiffusion from a given non-Gaussian distribution to another over a fixed\ndeadline while minimizing an expected quadratic cost can be solved using\ndynamic Sinkhorn recursions performed with the derived kernel. Our derivation\nfor the\n$\\left(\\boldsymbol{A}_t,\\boldsymbol{B}_t,\\boldsymbol{Q}_t\\right)$-parametrized\nkernel pursues a new idea that relies on finding a state-time dependent\ndistance-like functional given by the solution of a deterministic optimal\ncontrol problem. This technique breaks away from existing methods, such as\ngeneralizing Hermite polynomials or Weyl calculus, which have seen limited\nsuccess in the reaction-diffusion context. Our technique uncovers a new\nconnection between Markov kernels, distances, and optimal control. This\nconnection is of interest beyond its immediate application in solving the\nlinear quadratic Schr\\\"{o}dinger bridge problem.",
            "pdf_url": "http://arxiv.org/pdf/2504.15753v1",
            "published": "2025-04-22 10:07:43+00:00",
            "updated": "2025-04-22 10:07:43+00:00"
        },
        {
            "title": "On the Guidance of Flow Matching",
            "authors": "Ruiqi Feng, Tailin Wu, Chenglei Yu, Wenhao Deng, Peiyan Hu",
            "summary": "Flow matching has shown state-of-the-art performance in various generative\ntasks, ranging from image generation to decision-making, where guided\ngeneration is pivotal. However, the guidance of flow matching is more general\nthan and thus substantially different from that of its predecessor, diffusion\nmodels. Therefore, the challenge in guidance for general flow matching remains\nlargely underexplored. In this paper, we propose the first framework of general\nguidance for flow matching. From this framework, we derive a family of guidance\ntechniques that can be applied to general flow matching. These include a new\ntraining-free asymptotically exact guidance, novel training losses for\ntraining-based guidance, and two classes of approximate guidance that cover\nclassical gradient guidance methods as special cases. We theoretically\ninvestigate these different methods to give a practical guideline for choosing\nsuitable methods in different scenarios. Experiments on synthetic datasets,\nimage inverse problems, and offline reinforcement learning demonstrate the\neffectiveness of our proposed guidance methods and verify the correctness of\nour flow matching guidance framework. Code to reproduce the experiments can be\nfound at https://github.com/AI4Science-WestlakeU/flow_guidance.",
            "pdf_url": "http://arxiv.org/pdf/2502.02150v2",
            "published": "2025-02-04 09:27:57+00:00",
            "updated": "2025-04-22 08:45:10+00:00"
        }
    ]
}