{
    "Physics": [
        {
            "title": "A mathematical model for Nordic skiing",
            "authors": "Jane Shaw MacDonald, Rafael Ordoñez Cardales, John M. Stockie",
            "summary": "Nordic skiing provides fascinating opportunities for mathematical modelling\nstudies that exploit methods and insights from physics, applied mathematics,\ndata analysis, scientific computing and sports science. A typical ski course\nwinds over varied terrain with frequent changes in elevation and direction, and\nso its geometry is naturally described by a three-dimensional space curve. The\nskier travels along a course under the influence of various forces, and their\ndynamics can be described using a nonlinear system of ordinary differential\nequations (ODEs) that are derived from Newton's laws of motion. We develop an\nalgorithm for solving the governing equations that combines Hermite spline\ninterpolation, numerical quadrature and a high-order ODE solver. Numerical\nsimulations are compared with measurements of skiers on actual courses to\ndemonstrate the effectiveness of the model. Throughout, we aim to illustrate\nhow elementary concepts from undergraduate courses in calculus and scientific\ncomputing can be applied to study real problems in sport, which we hope will\nprovide stimulating examples for both instructors and students. At the same\ntime, we demonstrate how these concepts are capable of providing novel insights\ninto skiing that should also be of interest to sport scientists.",
            "pdf_url": "http://arxiv.org/pdf/2410.02767v2",
            "published": "2024-09-17 04:18:11+00:00",
            "updated": "2025-09-18 17:47:27+00:00"
        },
        {
            "title": "Top- and bottom-heavy vertical velocity structures: physical modes of layered atmospheric models",
            "authors": "Fiaz Ahmed, J. David Neelin",
            "summary": "Tropical East and West Pacific Oceans display differences in their vertical\nvelocity (or omega) profiles. The East Pacific is characterized by bottom-heavy\nprofiles, while the West Pacific is characterized by top-heavy profiles.\nAlthough inter-basin differences in the horizontal SST gradient are known to be\nimportant, physical reasons for why these omega structure variants exist are\nnot fully understood. This question is addressed using a steady, linear model\non an $f$-plane with $n$ atmospheric layers. Convection and radiation are\nparameterized as linear responses to thermodynamic perturbations with\nconvective nonlinearity approximated by convection on/off regimes. The free (or\neigen) modes of the model yield vertical structures resembling the observed\nbaroclinic modes of the tropical atmosphere, with each mode associated with a\ncharacteristic horizontal scale (the eigenvalue). In the standard parameter\nregime, the first-baroclinic mode has a large spatial scale ($\\sim$ 1500 km)\nwhile the second-baroclinic mode has a smaller spatial scale ($\\sim$ 250 km).\nWhen the model is forced with a strong- and weak-gradient surface temperature\n($T_s$) patterns, the resulting omega profiles assume bottom- and top-heavy\nstructures respectively -- mimicking the observed differences between East and\nWest Pacific Oceans. Additional dependence on the magnitude of the Coriolis\nforce is also observed. The connection between the vertical structure and the\nhorizontal scale of the baroclinic modes explains why a strong-gradient $T_s$\nprofile projects strongly onto the second-baroclinic mode yielding bottom-heavy\nomega profiles in the eastern Pacific, while a weak-gradient $T_s$ profile\nprojects strongly onto the first-baroclinic mode, yielding top-heavy omega\nprofiles typical of the Western Pacific.",
            "pdf_url": "http://arxiv.org/pdf/2509.15166v1",
            "published": "2025-09-18 17:17:22+00:00",
            "updated": "2025-09-18 17:17:22+00:00"
        },
        {
            "title": "Super resonance: Breaking the bandwidth limit of resonant modes and its application to flow control",
            "authors": "Adam R. Harris, Armin Kianfar, David Roca, Daniel Yago, Christoph Brehm, Mahmoud I. Hussein",
            "summary": "We report the discovery of super resonance--a new regime of resonant behavior\nin which a mode's out-of-phase response persists far beyond its classical\nbandwidth. This effect emerges from a coiled phononic structure composed of a\nlocally resonant elastic metamaterial and architected to support multiple\ninternal energy pathways. These pathways converge at a single structural point,\nenabling extended modal dominance and significantly broadening the frequency\nrange over which a resonant phase is sustained. We demonstrate by direct\nnumerical simulations the implications of this mechanism in the context of flow\ninstability control, where current approaches are inherently constrained by the\ncharacteristically narrow spectral bandwidth of conventional resonances. Using\na super-resonant phononic subsurface structure interfacing with a channel flow,\nwe show passive simultaneous suppression of four unstable flow perturbations\nacross a frequency range more than five times wider than that is achievable\nwith a standard resonance in an equivalent uncoiled structure. By enabling\nbroadband, passive control of flow instabilities, super resonance overcomes a\nlongstanding limitation in laminar flow control strategies. More broadly, it\nintroduces a powerful new tool for phase-engineered wave-matter interaction.\nThe ability to preserve out-of-phase modal response across wide spectral ranges\nestablishes a fundamental advance in the physics of resonance, with\nfar-reaching implications for suppressing fully developed turbulent flows and\nbeyond.",
            "pdf_url": "http://arxiv.org/pdf/2509.15142v1",
            "published": "2025-09-18 16:51:43+00:00",
            "updated": "2025-09-18 16:51:43+00:00"
        },
        {
            "title": "Learning Mechanistic Subtypes of Neurodegeneration with a Physics-Informed Variational Autoencoder Mixture Model",
            "authors": "Sanduni Pinnawala, Annabelle Hartanto, Ivor J. A. Simpson, Peter A. Wijeratne",
            "summary": "Modelling the underlying mechanisms of neurodegenerative diseases demands\nmethods that capture heterogeneous and spatially varying dynamics from sparse,\nhigh-dimensional neuroimaging data. Integrating partial differential equation\n(PDE) based physics knowledge with machine learning provides enhanced\ninterpretability and utility over classic numerical methods. However, current\nphysics-integrated machine learning methods are limited to considering a single\nPDE, severely limiting their application to diseases where multiple mechanisms\nare responsible for different groups (i.e., subtypes) and aggravating problems\nwith model misspecification and degeneracy. Here, we present a deep generative\nmodel for learning mixtures of latent dynamic models governed by physics-based\nPDEs, going beyond traditional approaches that assume a single PDE structure.\nOur method integrates reaction-diffusion PDEs within a variational autoencoder\n(VAE) mixture model framework, supporting inference of subtypes of\ninterpretable latent variables (e.g. diffusivity and reaction rates) from\nneuroimaging data. We evaluate our method on synthetic benchmarks and\ndemonstrate its potential for uncovering mechanistic subtypes of Alzheimer's\ndisease progression from positron emission tomography (PET) data.",
            "pdf_url": "http://arxiv.org/pdf/2509.15124v1",
            "published": "2025-09-18 16:29:45+00:00",
            "updated": "2025-09-18 16:29:45+00:00"
        },
        {
            "title": "Shedding Light on Dark Matter at the LHC with Machine Learning",
            "authors": "Ernesto Arganda, Martín de los Rios, Andres D. Perez, Subhojit Roy, Rosa M. Sandá Seoane, Carlos E. M. Wagner",
            "summary": "We investigate a WIMP dark matter (DM) candidate in the form of a\nsinglino-dominated lightest supersymmetric particle (LSP) within the\n$Z_3$-symmetric Next-to-Minimal Supersymmetric Standard Model. This framework\ngives rise to regions of parameter space where DM is obtained via\nco-annihilation with nearby higgsino-like electroweakinos and DM direct\ndetection~signals are suppressed, the so-called ``blind spots\". On the other\nhand, collider signatures remain promising due to enhanced radiative decay\nmodes of higgsinos into the singlino-dominated LSP and a photon, rather than\ninto leptons or hadrons. This motivates searches for radiatively decaying\nneutralinos, however, these signals face substantial background challenges, as\nthe decay products are typically soft due to the small mass-splits ($\\Delta m$)\nbetween the LSP and the higgsino-like coannihilation partners. We apply a\ndata-driven Machine Learning (ML) analysis that improves sensitivity to these\nsubtle signals, offering a powerful complement to traditional search strategies\nto discover a new physics scenario. Using an LHC integrated luminosity of\n$100~\\mathrm{fb}^{-1}$ at $14~\\mathrm{TeV}$, the method achieves a $5\\sigma$\ndiscovery reach for higgsino masses up to $225~\\mathrm{GeV}$ with $\\Delta\nm\\!\\lesssim\\!12~\\mathrm{GeV}$, and a $2\\sigma$ exclusion up to\n$285~\\mathrm{GeV}$ with $\\Delta m\\!\\lesssim\\!20~\\mathrm{GeV}$. These results\nhighlight the power of collider searches to probe DM candidates that remain\nhidden from current direct detection experiments, and provide a motivation for\na search by the LHC collaborations using ML methods.",
            "pdf_url": "http://arxiv.org/pdf/2509.15121v1",
            "published": "2025-09-18 16:27:19+00:00",
            "updated": "2025-09-18 16:27:19+00:00"
        },
        {
            "title": "Low-rank surrogate modeling and stochastic zero-order optimization for training of neural networks with black-box layers",
            "authors": "Andrei Chertkov, Artem Basharin, Mikhail Saygin, Evgeny Frolov, Stanislav Straupe, Ivan Oseledets",
            "summary": "The growing demand for energy-efficient, high-performance AI systems has led\nto increased attention on alternative computing platforms (e.g., photonic,\nneuromorphic) due to their potential to accelerate learning and inference.\nHowever, integrating such physical components into deep learning pipelines\nremains challenging, as physical devices often offer limited expressiveness,\nand their non-differentiable nature renders on-device backpropagation difficult\nor infeasible. This motivates the development of hybrid architectures that\ncombine digital neural networks with reconfigurable physical layers, which\neffectively behave as black boxes. In this work, we present a framework for the\nend-to-end training of such hybrid networks. This framework integrates\nstochastic zeroth-order optimization for updating the physical layer's internal\nparameters with a dynamic low-rank surrogate model that enables gradient\npropagation through the physical layer. A key component of our approach is the\nimplicit projector-splitting integrator algorithm, which updates the\nlightweight surrogate model after each forward pass with minimal hardware\nqueries, thereby avoiding costly full matrix reconstruction. We demonstrate our\nmethod across diverse deep learning tasks, including: computer vision, audio\nclassification, and language modeling. Notably, across all modalities, the\nproposed approach achieves near-digital baseline accuracy and consistently\nenables effective end-to-end training of hybrid models incorporating various\nnon-differentiable physical components (spatial light modulators, microring\nresonators, and Mach-Zehnder interferometers). This work bridges hardware-aware\ndeep learning and gradient-free optimization, thereby offering a practical\npathway for integrating non-differentiable physical components into scalable,\nend-to-end trainable AI systems.",
            "pdf_url": "http://arxiv.org/pdf/2509.15113v1",
            "published": "2025-09-18 16:17:44+00:00",
            "updated": "2025-09-18 16:17:44+00:00"
        },
        {
            "title": "Zero Indirect Band Gap in Non-Hermitian Systems",
            "authors": "Rahul S, Giandomenico Palumbo",
            "summary": "Zero indirect gaps in band models are typically viewed as unstable and\nachievable only through fine-tuning. Recent works, however, have revealed\nrobust semimetallic phases in Hermitian systems where the indirect gap remains\npinned at zero over a finite parameter range. Here, we extend this paradigm to\nnon-Hermitian lattice models by studying a one-dimensional diamond-like system\nwith gain and loss. We show that a zero indirect band gap can remain stable\nagainst non-Hermitian perturbations and identify the regimes where this\nrobustness persists. Remarkably, we find that the zero indirect gap induces a\nsuppression of the non-Hermitian skin effect distinct from other physical\nmechanics already discussed in the literature. Our results reveal new\nconnections between indirect gaps, exceptional points and non-Hermitian skin\neffect, opening avenues for experimental realizations.",
            "pdf_url": "http://arxiv.org/pdf/2509.15102v1",
            "published": "2025-09-18 16:02:24+00:00",
            "updated": "2025-09-18 16:02:24+00:00"
        },
        {
            "title": "A zero-dead-time strontium lattice clock with a stability at $10^{-19}$ level",
            "authors": "Xiao-Yong Liu, Peng Liu, Jie Li, Yu-Chen Zhang, Yuan-Bo Wang, Zhi-Peng Jia, Xiang Zhang, Xian-Qing Zhu, De-Quan Kong, Wen-Lan Song, Guo-Zhen Niu, Yu-Meng Yang, Pei-Jun Feng, Xiang-Pei Liu, Xing-Yang Cui, Ping Xu, Xiao Jiang, Juan Yin, Sheng-Kai Liao, Cheng-Zhi Peng, Han-Ning Dai, Yu-Ao Chen, Jian-Wei Pan",
            "summary": "Optical atomic clocks play a crucial role in fundamental physics,\nrelativistic geodesy, and the future redefinition of the SI second. Standard\noperation relies on cyclic interrogation sequences, which alternate between\natomic interrogation and dead time used for state preparation and readout. This\napproach introduces the Dick effect, where laser frequency noise aliases onto\nthe atomic transition frequency. Although reducing laser noise improves clock\nstability, the Dick effect remains a key limitation. In this work, we\ndemonstrate a zero-dead-time optical clock based on two interleaved ensembles\nof cold $^{87}\\text{Sr}$ atoms. Our system significantly suppresses this noise\nand achieves a fractional frequency instability at the $10^{-19}$ level between\n10,000 and 20,000 seconds over repeated measurements, with a best value of $2.9\n\\times 10^{-19}$ at $\\tau = 20,000$ seconds. The estimated long-term stability\nbased on the combined data of these measurements reaches $2.5 \\times 10^{-19}$\nat one day. These results represent a more than ninefold improvement over a\nconventional single-ensemble clock, highlighting its potential for\nnext-generation timekeeping applications.",
            "pdf_url": "http://arxiv.org/pdf/2509.15100v1",
            "published": "2025-09-18 15:57:21+00:00",
            "updated": "2025-09-18 15:57:21+00:00"
        },
        {
            "title": "Precise measurement of the $t\\bar{t}$ production cross-section and lepton differential distributions in $eμ$ dilepton events from $\\sqrt{s}=13$ TeV $pp$ collisions with the ATLAS detector",
            "authors": "ATLAS Collaboration",
            "summary": "The inclusive top quark pair ($t\\bar{t}$) cross-section $\\sigma_{t\\bar{t}}$\nhas been measured in $\\sqrt{s}=13$ TeV proton-proton collisions, using 140\nfb$^{-1}$ of data collected by the ATLAS experiment at the Large Hadron\nCollider. Using events with an opposite-charge $e\\mu$ pair and $b$-tagged jets,\nthe cross-section is measured to be: $\\sigma_{t\\bar{t}} = 829.3 \\pm\n1.3\\,\\mathrm{(stat)}\\ \\pm 8.0\\,\\mathrm{(syst)}\\ \\pm 7.3\\,\\mathrm{(lumi)}\\ \\pm\n1.9\\,\\mathrm{(beam)}\\,\\mathrm{pb},$ where the uncertainties reflect the limited\nsize of the data sample, experimental and theoretical systematic effects, the\nintegrated luminosity, and the proton beam energy, giving a total uncertainty\nof 1.3%. The result is used to determine the top quark pole mass via the\ndependence of the predicted cross-section on $m_t^\\mathrm{pole}$, giving\n$m_t^\\mathrm{pole}=172.8^{+1.5}_{-1.7}$ GeV. The same event sample is used to\nmeasure absolute and normalised differential cross-sections for the\n$t\\bar{t}\\rightarrow e\\mu\\nu\\bar{\\nu}b\\bar{b}$ process as a function of\nsingle-lepton and dilepton kinematic variables. Complementary measurements of\n$e\\mu b\\bar{b}$ production, treating both $t\\bar{t}$ and $Wt$ events as signal,\nare also provided. Both sets of differential cross-sections are compared to the\npredictions of various Monte Carlo event generators, demonstrating that the\nstate-of-the-art generators Powheg MiNNLO and Powheg $bb4l$ describe the data\nbetter than Powheg hvq.",
            "pdf_url": "http://arxiv.org/pdf/2509.15066v1",
            "published": "2025-09-18 15:29:53+00:00",
            "updated": "2025-09-18 15:29:53+00:00"
        },
        {
            "title": "Advanced Physics-Informed Neural Network with Residuals for Solving Complex Integral Equations",
            "authors": "Mahdi Movahedian Moghaddam, Kourosh Parand, Saeed Reza Kheradpisheh",
            "summary": "In this paper, we present the Residual Integral Solver Network (RISN), a\nnovel neural network architecture designed to solve a wide range of integral\nand integro-differential equations, including one-dimensional,\nmulti-dimensional, ordinary and partial integro-differential, systems,\nfractional types, and Helmholtz-type integral equations involving oscillatory\nkernels. RISN integrates residual connections with high-accuracy numerical\nmethods such as Gaussian quadrature and fractional derivative operational\nmatrices, enabling it to achieve higher accuracy and stability than traditional\nPhysics-Informed Neural Networks (PINN). The residual connections help mitigate\nvanishing gradient issues, allowing RISN to handle deeper networks and more\ncomplex kernels, particularly in multi-dimensional problems. Through extensive\nexperiments, we demonstrate that RISN consistently outperforms not only\nclassical PINNs but also advanced variants such as Auxiliary PINN (A-PINN) and\nSelf-Adaptive PINN (SA-PINN), achieving significantly lower Mean Absolute\nErrors (MAE) across various types of equations. These results highlight RISN's\nrobustness and efficiency in solving challenging integral and\nintegro-differential problems, making it a valuable tool for real-world\napplications where traditional methods often struggle.",
            "pdf_url": "http://arxiv.org/pdf/2501.16370v3",
            "published": "2025-01-22 19:47:03+00:00",
            "updated": "2025-09-18 15:27:52+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Fast and Fluent Diffusion Language Models via Convolutional Decoding and Rejective Fine-tuning",
            "authors": "Yeongbin Seo, Dongha Lee, Jaehyung Kim, Jinyoung Yeo",
            "summary": "Autoregressive (AR) language models generate text one token at a time, which\nlimits their inference speed. Diffusion-based language models offer a promising\nalternative, as they can decode multiple tokens in parallel. However, we\nidentify a key bottleneck in current diffusion LMs: the long decoding-window\nproblem, where tokens generated far from the input context often become\nirrelevant or repetitive. Previous solutions like semi-autoregressive address\nthis issue by splitting windows into blocks, but this sacrifices speed and\nbidirectionality, eliminating the main advantage of diffusion models. To\novercome this, we propose Convolutional decoding (Conv), a normalization-based\nmethod that narrows the decoding window without hard segmentation, leading to\nbetter fluency and flexibility. Additionally, we introduce Rejecting Rule-based\nFine-Tuning (R2FT), a post-hoc training scheme that better aligns tokens at\npositions far from context. Our methods achieve state-of-the-art results on\nopen-ended generation benchmarks (e.g., AlpacaEval) among diffusion LM\nbaselines, with significantly lower step size than previous works,\ndemonstrating both speed and quality improvements.",
            "pdf_url": "http://arxiv.org/pdf/2509.15188v1",
            "published": "2025-09-18 17:48:21+00:00",
            "updated": "2025-09-18 17:48:21+00:00"
        },
        {
            "title": "AnoF-Diff: One-Step Diffusion-Based Anomaly Detection for Forceful Tool Use",
            "authors": "Yating Lin, Zixuan Huang, Fan Yang, Dmitry Berenson",
            "summary": "Multivariate time-series anomaly detection, which is critical for identifying\nunexpected events, has been explored in the field of machine learning for\nseveral decades. However, directly applying these methods to data from forceful\ntool use tasks is challenging because streaming sensor data in the real world\ntends to be inherently noisy, exhibits non-stationary behavior, and varies\nacross different tasks and tools. To address these challenges, we propose a\nmethod, AnoF-Diff, based on the diffusion model to extract force-torque\nfeatures from time-series data and use force-torque features to detect\nanomalies. We compare our method with other state-of-the-art methods in terms\nof F1-score and Area Under the Receiver Operating Characteristic curve (AUROC)\non four forceful tool-use tasks, demonstrating that our method has better\nperformance and is more robust to a noisy dataset. We also propose the method\nof parallel anomaly score evaluation based on one-step diffusion and\ndemonstrate how our method can be used for online anomaly detection in several\nforceful tool use experiments.",
            "pdf_url": "http://arxiv.org/pdf/2509.15153v1",
            "published": "2025-09-18 16:58:00+00:00",
            "updated": "2025-09-18 16:58:00+00:00"
        },
        {
            "title": "Probing the Representational Power of Sparse Autoencoders in Vision Models",
            "authors": "Matthew Lyle Olson, Musashi Hinck, Neale Ratzlaff, Changbai Li, Phillip Howard, Vasudev Lal, Shao-Yen Tseng",
            "summary": "Sparse Autoencoders (SAEs) have emerged as a popular tool for interpreting\nthe hidden states of large language models (LLMs). By learning to reconstruct\nactivations from a sparse bottleneck layer, SAEs discover interpretable\nfeatures from the high-dimensional internal representations of LLMs. Despite\ntheir popularity with language models, SAEs remain understudied in the visual\ndomain. In this work, we provide an extensive evaluation the representational\npower of SAEs for vision models using a broad range of image-based tasks. Our\nexperimental results demonstrate that SAE features are semantically meaningful,\nimprove out-of-distribution generalization, and enable controllable generation\nacross three vision model architectures: vision embedding models, multi-modal\nLMMs and diffusion models. In vision embedding models, we find that learned SAE\nfeatures can be used for OOD detection and provide evidence that they recover\nthe ontological structure of the underlying model. For diffusion models, we\ndemonstrate that SAEs enable semantic steering through text encoder\nmanipulation and develop an automated pipeline for discovering\nhuman-interpretable attributes. Finally, we conduct exploratory experiments on\nmulti-modal LLMs, finding evidence that SAE features reveal shared\nrepresentations across vision and language modalities. Our study provides a\nfoundation for SAE evaluation in vision models, highlighting their strong\npotential improving interpretability, generalization, and steerability in the\nvisual domain.",
            "pdf_url": "http://arxiv.org/pdf/2508.11277v2",
            "published": "2025-08-15 07:29:42+00:00",
            "updated": "2025-09-18 16:45:16+00:00"
        },
        {
            "title": "WorldForge: Unlocking Emergent 3D/4D Generation in Video Diffusion Model via Training-Free Guidance",
            "authors": "Chenxi Song, Yanming Yang, Tong Zhao, Ruibo Li, Chi Zhang",
            "summary": "Recent video diffusion models demonstrate strong potential in spatial\nintelligence tasks due to their rich latent world priors. However, this\npotential is hindered by their limited controllability and geometric\ninconsistency, creating a gap between their strong priors and their practical\nuse in 3D/4D tasks. As a result, current approaches often rely on retraining or\nfine-tuning, which risks degrading pretrained knowledge and incurs high\ncomputational costs. To address this, we propose WorldForge, a training-free,\ninference-time framework composed of three tightly coupled modules. Intra-Step\nRecursive Refinement introduces a recursive refinement mechanism during\ninference, which repeatedly optimizes network predictions within each denoising\nstep to enable precise trajectory injection. Flow-Gated Latent Fusion leverages\noptical flow similarity to decouple motion from appearance in the latent space\nand selectively inject trajectory guidance into motion-related channels.\nDual-Path Self-Corrective Guidance compares guided and unguided denoising paths\nto adaptively correct trajectory drift caused by noisy or misaligned structural\nsignals. Together, these components inject fine-grained, trajectory-aligned\nguidance without training, achieving both accurate motion control and\nphotorealistic content generation. Extensive experiments across diverse\nbenchmarks validate our method's superiority in realism, trajectory\nconsistency, and visual fidelity. This work introduces a novel plug-and-play\nparadigm for controllable video synthesis, offering a new perspective on\nleveraging generative priors for spatial intelligence.",
            "pdf_url": "http://arxiv.org/pdf/2509.15130v1",
            "published": "2025-09-18 16:40:47+00:00",
            "updated": "2025-09-18 16:40:47+00:00"
        },
        {
            "title": "M4Diffuser: Multi-View Diffusion Policy with Manipulability-Aware Control for Robust Mobile Manipulation",
            "authors": "Ju Dong, Lei Zhang, Liding Zhang, Yao Ling, Yu Fu, Kaixin Bai, Zoltán-Csaba Márton, Zhenshan Bing, Zhaopeng Chen, Alois Christian Knoll, Jianwei Zhang",
            "summary": "Mobile manipulation requires the coordinated control of a mobile base and a\nrobotic arm while simultaneously perceiving both global scene context and\nfine-grained object details. Existing single-view approaches often fail in\nunstructured environments due to limited fields of view, exploration, and\ngeneralization abilities. Moreover, classical controllers, although stable,\nstruggle with efficiency and manipulability near singularities. To address\nthese challenges, we propose M4Diffuser, a hybrid framework that integrates a\nMulti-View Diffusion Policy with a novel Reduced and Manipulability-aware QP\n(ReM-QP) controller for mobile manipulation. The diffusion policy leverages\nproprioceptive states and complementary camera perspectives with both\nclose-range object details and global scene context to generate task-relevant\nend-effector goals in the world frame. These high-level goals are then executed\nby the ReM-QP controller, which eliminates slack variables for computational\nefficiency and incorporates manipulability-aware preferences for robustness\nnear singularities. Comprehensive experiments in simulation and real-world\nenvironments show that M4Diffuser achieves 7 to 56 percent higher success rates\nand reduces collisions by 3 to 31 percent over baselines. Our approach\ndemonstrates robust performance for smooth whole-body coordination, and strong\ngeneralization to unseen tasks, paving the way for reliable mobile manipulation\nin unstructured environments. Details of the demo and supplemental material are\navailable on our project website https://sites.google.com/view/m4diffuser.",
            "pdf_url": "http://arxiv.org/pdf/2509.14980v1",
            "published": "2025-09-18 14:09:53+00:00",
            "updated": "2025-09-18 14:09:53+00:00"
        }
    ]
}