{
    "Physics": [
        {
            "title": "Can We Trust Embodied Agents? Exploring Backdoor Attacks against Embodied LLM-based Decision-Making Systems",
            "authors": "Ruochen Jiao, Shaoyuan Xie, Justin Yue, Takami Sato, Lixu Wang, Yixuan Wang, Qi Alfred Chen, Qi Zhu",
            "summary": "Large Language Models (LLMs) have shown significant promise in real-world\ndecision-making tasks for embodied artificial intelligence, especially when\nfine-tuned to leverage their inherent common sense and reasoning abilities\nwhile being tailored to specific applications. However, this fine-tuning\nprocess introduces considerable safety and security vulnerabilities, especially\nin safety-critical cyber-physical systems. In this work, we propose the first\ncomprehensive framework for Backdoor Attacks against LLM-based Decision-making\nsystems (BALD) in embodied AI, systematically exploring the attack surfaces and\ntrigger mechanisms. Specifically, we propose three distinct attack mechanisms:\nword injection, scenario manipulation, and knowledge injection, targeting\nvarious components in the LLM-based decision-making pipeline. We perform\nextensive experiments on representative LLMs (GPT-3.5, LLaMA2, PaLM2) in\nautonomous driving and home robot tasks, demonstrating the effectiveness and\nstealthiness of our backdoor triggers across various attack channels, with\ncases like vehicles accelerating toward obstacles and robots placing knives on\nbeds. Our word and knowledge injection attacks achieve nearly 100% success rate\nacross multiple models and datasets while requiring only limited access to the\nsystem. Our scenario manipulation attack yields success rates exceeding 65%,\nreaching up to 90%, and does not require any runtime system intrusion. We also\nassess the robustness of these attacks against defenses, revealing their\nresilience. Our findings highlight critical security vulnerabilities in\nembodied LLM systems and emphasize the urgent need for safeguarding these\nsystems to mitigate potential risks.",
            "pdf_url": "http://arxiv.org/pdf/2405.20774v3",
            "published": "2024-05-27 17:59:43+00:00",
            "updated": "2025-04-30 17:59:57+00:00"
        },
        {
            "title": "Active Light Modulation to Counter Manipulation of Speech Visual Content",
            "authors": "Hadleigh Schwartz, Xiaofeng Yan, Charles J. Carver, Xia Zhou",
            "summary": "High-profile speech videos are prime targets for falsification, owing to\ntheir accessibility and influence. This work proposes Spotlight, a low-overhead\nand unobtrusive system for protecting live speech videos from visual\nfalsification of speaker identity and lip and facial motion. Unlike predominant\nfalsification detection methods operating in the digital domain, Spotlight\ncreates dynamic physical signatures at the event site and embeds them into all\nvideo recordings via imperceptible modulated light. These physical signatures\nencode semantically-meaningful features unique to the speech event, including\nthe speaker's identity and facial motion, and are cryptographically-secured to\nprevent spoofing. The signatures can be extracted from any video downstream and\nvalidated against the portrayed speech content to check its integrity. Key\nelements of Spotlight include (1) a framework for generating extremely compact\n(i.e., 150-bit), pose-invariant speech video features, based on\nlocality-sensitive hashing; and (2) an optical modulation scheme that embeds\n>200 bps into video while remaining imperceptible both in video and live.\nPrototype experiments on extensive video datasets show Spotlight achieves AUCs\n$\\geq$ 0.99 and an overall true positive rate of 100% in detecting falsified\nvideos. Further, Spotlight is highly robust across recording conditions, video\npost-processing techniques, and white-box adversarial attacks on its video\nfeature extraction methodologies.",
            "pdf_url": "http://arxiv.org/pdf/2504.21846v1",
            "published": "2025-04-30 17:55:24+00:00",
            "updated": "2025-04-30 17:55:24+00:00"
        },
        {
            "title": "On the Efficacy of the Peeling Decoder for the Quantum Expander Code",
            "authors": "Jefrin Sharmitha Prabhu, Abhinav Vaishya, Shobhit Bhatnagar, Aryaman Manish Kolhe, V. Lalitha, P. Vijay Kumar",
            "summary": "The problem of recovering from qubit erasures has recently gained attention\nas erasures occur in many physical systems such as photonic systems, trapped\nions, superconducting qubits and circuit quantum electrodynamics. While several\nlinear-time decoders for error correction are known, their error-correcting\ncapability is limited to half the minimum distance of the code, whereas erasure\ncorrection allows one to go beyond this limit. As in the classical case,\nstopping sets pose a major challenge in designing efficient erasure decoders\nfor quantum LDPC codes. In this paper, we show through simulation, that an\nattractive alternative here, is the use of quantum expander codes in\nconjunction with the peeling decoder that has linear complexity. We also\ndiscuss additional techniques including small-set-flip decoding, that can be\napplied following the peeling operation, to improve decoding performance and\ntheir associated complexity.",
            "pdf_url": "http://arxiv.org/pdf/2504.21845v1",
            "published": "2025-04-30 17:54:49+00:00",
            "updated": "2025-04-30 17:54:49+00:00"
        },
        {
            "title": "Hamiltonian Learning at Heisenberg Limit for Hybrid Quantum Systems",
            "authors": "Lixing Zhang, Ze-Xun Lin, Prineha Narang, Di Luo",
            "summary": "Hybrid quantum systems with different particle species are fundamental in\nquantum materials and quantum information science. In this work, we establish a\nrigorous theoretical framework proving that, given access to an unknown\nspin-boson type Hamiltonian, our algorithm achieves Heisenberg-limited\nestimation for all coupling parameters up to error $\\epsilon$ with a total\nevolution time ${O}(\\epsilon^{-1})$ using only ${O}({\\rm\npolylog}(\\epsilon^{-1}))$ measurements. It is also robust against small state\npreparation and measurement errors. In addition, we provide an alternative\nalgorithm based on distributed quantum sensing, which significantly reduces the\nevolution time per measurement. To validate our method, we demonstrate its\nefficiency in hybrid Hamiltonian learning and spectrum learning, with broad\napplications in AMO, condensed matter and high energy physics. Our results\nprovide a scalable and robust framework for precision Hamiltonian\ncharacterization in hybrid quantum platforms.",
            "pdf_url": "http://arxiv.org/pdf/2502.20373v3",
            "published": "2025-02-27 18:47:47+00:00",
            "updated": "2025-04-30 17:52:18+00:00"
        },
        {
            "title": "TRIMEG-GKX: an electromagnetic gyrokinetic particle code with a Piecewise Field-Aligned Finite Element Method for Micro- and Macro-Instability Studies in Tokamak Core Plasmas",
            "authors": "Zhixin Lu, Guo Meng, Roman Hatzky, Philipp Lauber, Matthias Hoelzl",
            "summary": "The features of the TRIMEG-GKX code are described with emphasis on the\nexploration using novel/different schemes compared to other gyrokinetic codes,\nparticularly the use of object-oriented programming, filter/buffer-free\ntreatment, and a high-order piecewise field-aligned finite element method. The\nTRIMEG-GKX code solves the electromagnetic gyrokinetic equation using the\nparticle-in-cell scheme, taking into account multi-species effects and shear\nAlfv\\'en physics. The mixed-variable/pullback scheme has been implemented to\nenable electromagnetic studies. This code is parallelized using particle\ndecomposition and domain cloning among computing nodes, replacing traditional\ndomain decomposition techniques. The applications to study the micro- and\nmacro-instabilities are demonstrated, including the energetic-particle-driven\nAlfv\\'en eigenmode, ion temperature gradient mode, and kinetic ballooning mode.\nGood performance is achieved in both ad hoc and experimentally reconstructed\nequilibria, such as those of the ASDEX Upgrade (AUG), Tokamak \\`a configuration\nvariable (TCV), and the Joint European Torus (JET). Future studies of edge\nphysics using the high-order $C^1$ finite element method for triangular meshes\nin the TRIMEG-C1 code will be built upon the same numerical methods.",
            "pdf_url": "http://arxiv.org/pdf/2504.21837v1",
            "published": "2025-04-30 17:47:31+00:00",
            "updated": "2025-04-30 17:47:31+00:00"
        },
        {
            "title": "Non-standard quantum algebras and infinite-dimensional PT-symmetric systems",
            "authors": "Ángel Ballesteros, Romina Ramírez, Marta Reboiro",
            "summary": "In this work, we introduce a PT-symmetric infinite-dimensional representation\nof the Uz(sl(2,R)) Hopf algebra, and we analyse a multiparametric family of\nHamiltonians constructed from such representation of the generators of this\nnon-standard quantum algebra. It is shown that all these Hamiltonians can be\nmapped to equivalent systems endowed with a position-dependent mass. From the\nlatter presentation, it is shown how appropriate point canonical\ntransformations can be further defined in order to transform them into\nHamiltonians with constant mass over suitable domains. By following this\napproach, the bound-state spectrum and the corresponding eigenfunctions of the\ninitial PT-symmetric Hamiltonians can be determined. It is worth stressing that\na relevant feature of some of the new Uz(sl(2,R)) systems here presented is\nfound to be their connection with double-well and P\\\"oschl-Teller potentials.\nIn fact, as an application we present a particular Hamiltonian that can be\nexpressed as an effective double-well trigonometric potential, which is\ncommonly used to model several relevant systems in molecular physics.",
            "pdf_url": "http://arxiv.org/pdf/2504.21833v1",
            "published": "2025-04-30 17:40:56+00:00",
            "updated": "2025-04-30 17:40:56+00:00"
        },
        {
            "title": "A Path to Quantum Simulations of Topological Phases: (2+1)D Wilson Fermions Coupled To U(1) Background Gauge Fields",
            "authors": "Sriram Bharadwaj, Emil Rosanowski, Simran Singh, Alice di Tucci, Changnan Peng, Karl Jansen, Lena Funcke, Di Luo",
            "summary": "Quantum simulation offers a powerful approach to studying quantum field\ntheories, particularly (2+1)D quantum electrodynamics (QED$_3$), which hosts a\nrich landscape of physical phenomena. A key challenge in lattice formulations\nis the proper realization of topological phases and the Chern-Simons terms,\nwhere fermion discretization plays a crucial role. In this work, we analyze\nstaggered and Wilson fermions coupled to $\\text{U}(1)$ background gauge fields\nin the Hamiltonian formulation and demonstrate that staggered fermions fail to\ninduce (2+1)D topological phases, while Wilson fermions admit a variety of\ntopological phases including Chern insulator and quantum spin Hall phases. We\nadditionally uncover a rich phase diagram for the two-flavor Wilson fermion\nmodel in the presence of a chemical potential. Our findings resolve existing\nambiguities in Hamiltonian formulations and provide a theoretical foundation\nfor future quantum simulations of gauge theories with topological phases. We\nfurther outline connections to experimental platforms, offering guidance for\nimplementations on near-term quantum computing architectures.",
            "pdf_url": "http://arxiv.org/pdf/2504.21828v1",
            "published": "2025-04-30 17:33:01+00:00",
            "updated": "2025-04-30 17:33:01+00:00"
        },
        {
            "title": "Practical classical error correction for parity-encoded spin systems",
            "authors": "Yoshihiro Nambu",
            "summary": "Quantum annealing (QA) has emerged as a promising candidate for fast solvers\nfor combinatorial optimization problems (COPs) and has attracted the interest\nof many researchers. Since COP is logically encoded in the Ising interaction\namong spins, its realization necessitates a spin system with all-to-all\nconnectivity, presenting technical challenges in the physical implementation of\nlarge-scale QA devices. W. Lechner, P. Hauke, and P. Zoller proposed a\nparity-encoding (PE) architecture consisting of an expanded spin system with\nonly local connectivity among them to circumvent this difficulty in developing\nnear-future QA devices. They suggested that this architecture not only\nalleviates implementation challenges and enhances scalability but also\npossesses intrinsic fault tolerance. This paper proposes a practical decoding\nmethod tailored to correlated spin-flip errors in spin readout of PE\narchitecture. Our work is based on the close connection between PE architecture\nand classical low-density parity-check (LDPC) codes. We show that the bit-flip\n(BF) decoding algorithm can correct independent and identically distributed\nerrors in the readout of the SLHZ system with comparable performance to the\nbelief propagation (BP) decoding algorithm. Then, we show evidence that the\nproposed BF decoding algorithm can efficiently correct correlated spinflip\nerrors by simulation. The result suggests that introducing post-readout BF\ndecoding reduces the computational cost of QA using the PE architecture and\nimproves the performance of global optimal solution search. Our results\nemphasize the importance of the proper selection of decoding algorithms to\nexploit the inherent fault tolerance potential of the PE architecture.",
            "pdf_url": "http://arxiv.org/pdf/2502.07170v4",
            "published": "2025-02-11 01:31:24+00:00",
            "updated": "2025-04-30 17:23:23+00:00"
        },
        {
            "title": "Data-driven model validation for neutrino-nucleus cross section measurements",
            "authors": "MicroBooNE collaboration, P. Abratenko, O. Alterkait, D. Andrade Aldana, L. Arellano, J. Asaadi, A. Ashkenazi, S. Balasubramanian, B. Baller, A. Barnard, G. Barr, D. Barrow, J. Barrow, V. Basque, J. Bateman, O. Benevides Rodrigues, S. Berkman, A. Bhanderi, A. Bhat, M. Bhattacharya, M. Bishai, A. Blake, B. Bogart, T. Bolton, M. B. Brunetti, L. Camilleri, Y. Cao, D. Caratelli, F. Cavanna, G. Cerati, A. Chappell, Y. Chen, J. M. Conrad, M. Convery, L. Cooper-Troendle, J. I. Crespo-Anadon, R. Cross, M. Del Tutto, S. R. Dennis, P. Detje, R. Diurba, Z. Djurcic, K. Duffy, S. Dytman, B. Eberly, P. Englezos, A. Ereditato, J. J. Evans, C. Fang, B. T. Fleming, W. Foreman, D. Franco, A. P. Furmanski, F. Gao, D. Garcia-Gamez, S. Gardiner, G. Ge, S. Gollapinni, E. Gramellini, P. Green, H. Greenlee, L. Gu, W. Gu, R. Guenette, P. Guzowski, L. Hagaman, M. D. Handley, O. Hen, C. Hilgenberg, G. A. Horton-Smith, Z. Imani, B. Irwin, M. S. Ismail, C. James, X. Ji, J. H. Jo, R. A. Johnson, Y. J. Jwa, D. Kalra, G. Karagiorgi, W. Ketchum, M. Kirby, T. Kobilarcik, N. Lane, J. -Y. Li, Y. Li, K. Lin, B. R. Littlejohn, L. Liu, W. C. Louis, X. Luo, T. Mahmud, C. Mariani, D. Marsden, J. Marshall, N. Martinez, D. A. Martinez Caicedo, S. Martynenko, A. Mastbaum, I. Mawby, N. McConkey, V. Meddage, L. Mellet, J. Mendez, J. Micallef, K. Miller, K. Mistry, T. Mohayai, A. Mogan, M. Mooney, A. F. Moor, C. D. Moore, L. Mora Lepin, M. M. Moudgalya, S. Mulleria Babu, D. Naples, A. Navrer-Agasson, N. Nayak, M. Nebot-Guinot, C. Nguyen, J. Nowak, N. Oza, O. Palamara, N. Pallat, V. Paolone, A. Papadopoulou, V. Papavassiliou, H. Parkinson, S. F. Pate, N. Patel, Z. Pavlovic, E. Piasetzky, K. Pletcher, I. Pophale, X. Qian, J. L. Raaf, V. Radeka, A. Rafique, M. Reggiani-Guzzo, L. Ren, L. Rochester, J. Rodriguez Rondon, M. Rosenberg, M. Ross-Lonergan, I. Safa, D. W. Schmitz, A. Schukraft, W. Seligman, M. H. Shaevitz, R. Sharankova, J. Shi, E. L. Snider, M. Soderberg, S. Soldner-Rembold, J. Spitz, M. Stancari, J. St. John, T. Strauss, A. M. Szelc, N. Taniuchi, K. Terao, C. Thorpe, D. Torbunov, D. Totani, M. Toups, A. Trettin, Y. -T. Tsai, J. Tyler, M. A. Uchida, T. Usher, B. Viren, J. Wang, M. Weber, H. Wei, A. J. White, S. Wolbers, T. Wongjirad, M. Wospakrik, K. Wresilo, W. Wu, E. Yandel, T. Yang, L. E. Yates, H. W. Yu, G. P. Zeller, J. Zennamo, C. Zhang",
            "summary": "Neutrino-nucleus cross section measurements are needed to improve interaction\nmodeling to meet the precision needs of neutrino experiments in efforts to\nmeasure oscillation parameters and search for physics beyond the Standard\nModel. We review the difficulties associated with modeling neutrino-nucleus\ninteractions that lead to a dependence on event generators in oscillation\nanalyses and cross section measurements alike. We then describe data-driven\nmodel validation techniques intended to address this model dependence. The\nmethod relies on utilizing various goodness-of-fit tests and the correlations\nbetween different observables and channels to probe the model for defects in\nthe phase space relevant for the desired analysis. These techniques shed light\non relevant mis-modeling, allowing it to be detected before it begins to bias\nthe cross section results. We compare more commonly used model validation\nmethods which directly validate the model against alternative ones to these\ndata-driven techniques and show their efficacy with fake data studies. These\nstudies demonstrate that employing data-driven model validation in cross\nsection measurements represents a reliable strategy to produce robust results\nthat will stimulate the desired improvements to interaction modeling.",
            "pdf_url": "http://arxiv.org/pdf/2411.03280v2",
            "published": "2024-11-05 17:20:58+00:00",
            "updated": "2025-04-30 17:15:45+00:00"
        },
        {
            "title": "Particle, kinetic and hydrodynamic models for sea ice floes. Part I: non-rotating floes",
            "authors": "Quanling Deng, Seung-Yeal Ha",
            "summary": "We introduce a comprehensive modeling framework for the dynamics of sea ice\nfloes using particle, kinetic, and hydrodynamic approaches. Building upon the\nfoundational work of Ha and Tadmor on the Cucker-Smale model for flocking, we\nderive a Vlasov-type kinetic formulation and a corresponding hydrodynamic\ndescription. The particle model incorporates essential physical properties of\nsea ice floes, including size, position, velocity, and interactions governed by\nNewtonian mechanics. By extending these principles, the kinetic model captures\nlarge-scale features through the phase-space distribution, and we also present\na hydrodynamic model using the velocity moments and a suitable closure\ncondition. In this paper, as an idea-introductory step, we assume that ice\nfloes are non-rotating and focus on the linear velocity dynamics. Our approach\nhighlights the role of contact forces, ocean drag effects, and conservation\nlaws in the multiscale description of sea ice dynamics, offering a pathway for\nthe improved understanding and prediction of sea ice behaviors in changing\nclimatic conditions.",
            "pdf_url": "http://arxiv.org/pdf/2504.21809v1",
            "published": "2025-04-30 17:13:10+00:00",
            "updated": "2025-04-30 17:13:10+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "BEVWorld: A Multimodal World Simulator for Autonomous Driving via Scene-Level BEV Latents",
            "authors": "Yumeng Zhang, Shi Gong, Kaixin Xiong, Xiaoqing Ye, Xiaofan Li, Xiao Tan, Fan Wang, Jizhou Huang, Hua Wu, Haifeng Wang",
            "summary": "World models have attracted increasing attention in autonomous driving for\ntheir ability to forecast potential future scenarios. In this paper, we propose\nBEVWorld, a novel framework that transforms multimodal sensor inputs into a\nunified and compact Bird's Eye View (BEV) latent space for holistic environment\nmodeling. The proposed world model consists of two main components: a\nmulti-modal tokenizer and a latent BEV sequence diffusion model. The\nmulti-modal tokenizer first encodes heterogeneous sensory data, and its decoder\nreconstructs the latent BEV tokens into LiDAR and surround-view image\nobservations via ray-casting rendering in a self-supervised manner. This\nenables joint modeling and bidirectional encoding-decoding of panoramic imagery\nand point cloud data within a shared spatial representation. On top of this,\nthe latent BEV sequence diffusion model performs temporally consistent\nforecasting of future scenes, conditioned on high-level action tokens, enabling\nscene-level reasoning over time. Extensive experiments demonstrate the\neffectiveness of BEVWorld on autonomous driving benchmarks, showcasing its\ncapability in realistic future scene generation and its benefits for downstream\ntasks such as perception and motion prediction.",
            "pdf_url": "http://arxiv.org/pdf/2407.05679v3",
            "published": "2024-07-08 07:26:08+00:00",
            "updated": "2025-04-30 13:43:51+00:00"
        },
        {
            "title": "GarmentDiffusion: 3D Garment Sewing Pattern Generation with Multimodal Diffusion Transformers",
            "authors": "Xinyu Li, Qi Yao, Yuanda Wang",
            "summary": "Garment sewing patterns are fundamental design elements that bridge the gap\nbetween design concepts and practical manufacturing. The generative modeling of\nsewing patterns is crucial for creating diversified garments. However, existing\napproaches are limited either by reliance on a single input modality or by\nsuboptimal generation efficiency. In this work, we present\n\\textbf{\\textit{GarmentDiffusion}}, a new generative model capable of producing\ncentimeter-precise, vectorized 3D sewing patterns from multimodal inputs (text,\nimage, and incomplete sewing pattern). Our method efficiently encodes 3D sewing\npattern parameters into compact edge token representations, achieving a\nsequence length that is $\\textbf{10}\\times$ shorter than that of the\nautoregressive SewingGPT in DressCode. By employing a diffusion transformer, we\nsimultaneously denoise all edge tokens along the temporal axis, while\nmaintaining a constant number of denoising steps regardless of dataset-specific\nedge and panel statistics. With all combination of designs of our model, the\nsewing pattern generation speed is accelerated by $\\textbf{100}\\times$ compared\nto SewingGPT. We achieve new state-of-the-art results on DressCodeData, as well\nas on the largest sewing pattern dataset, namely GarmentCodeData. The project\nwebsite is available at https://shenfu-research.github.io/Garment-Diffusion/.",
            "pdf_url": "http://arxiv.org/pdf/2504.21476v1",
            "published": "2025-04-30 09:56:59+00:00",
            "updated": "2025-04-30 09:56:59+00:00"
        },
        {
            "title": "Ditto: Motion-Space Diffusion for Controllable Realtime Talking Head Synthesis",
            "authors": "Tianqi Li, Ruobing Zheng, Minghui Yang, Jingdong Chen, Ming Yang",
            "summary": "Recent advances in diffusion models have endowed talking head synthesis with\nsubtle expressions and vivid head movements, but have also led to slow\ninference speed and insufficient control over generated results. To address\nthese issues, we propose Ditto, a diffusion-based talking head framework that\nenables fine-grained controls and real-time inference. Specifically, we utilize\nan off-the-shelf motion extractor and devise a diffusion transformer to\ngenerate representations in a specific motion space. We optimize the model\narchitecture and training strategy to address the issues in generating motion\nrepresentations, including insufficient disentanglement between motion and\nidentity, and large internal discrepancies within the representation. Besides,\nwe employ diverse conditional signals while establishing a mapping between\nmotion representation and facial semantics, enabling control over the\ngeneration process and correction of the results. Moreover, we jointly optimize\nthe holistic framework to enable streaming processing, real-time inference, and\nlow first-frame delay, offering functionalities crucial for interactive\napplications such as AI assistants. Extensive experimental results demonstrate\nthat Ditto generates compelling talking head videos and exhibits superiority in\nboth controllability and real-time performance.",
            "pdf_url": "http://arxiv.org/pdf/2411.19509v3",
            "published": "2024-11-29 07:01:31+00:00",
            "updated": "2025-04-30 09:42:00+00:00"
        },
        {
            "title": "Elucidating the Preconditioning in Consistency Distillation",
            "authors": "Kaiwen Zheng, Guande He, Jianfei Chen, Fan Bao, Jun Zhu",
            "summary": "Consistency distillation is a prevalent way for accelerating diffusion models\nadopted in consistency (trajectory) models, in which a student model is trained\nto traverse backward on the probability flow (PF) ordinary differential\nequation (ODE) trajectory determined by the teacher model. Preconditioning is a\nvital technique for stabilizing consistency distillation, by linear combining\nthe input data and the network output with pre-defined coefficients as the\nconsistency function. It imposes the boundary condition of consistency\nfunctions without restricting the form and expressiveness of the neural\nnetwork. However, previous preconditionings are hand-crafted and may be\nsuboptimal choices. In this work, we offer the first theoretical insights into\nthe preconditioning in consistency distillation, by elucidating its design\ncriteria and the connection to the teacher ODE trajectory. Based on these\nanalyses, we further propose a principled way dubbed \\textit{Analytic-Precond}\nto analytically optimize the preconditioning according to the consistency gap\n(defined as the gap between the teacher denoiser and the optimal student\ndenoiser) on a generalized teacher ODE. We demonstrate that Analytic-Precond\ncan facilitate the learning of trajectory jumpers, enhance the alignment of the\nstudent trajectory with the teacher's, and achieve $2\\times$ to $3\\times$\ntraining acceleration of consistency trajectory models in multi-step generation\nacross various datasets.",
            "pdf_url": "http://arxiv.org/pdf/2502.02922v3",
            "published": "2025-02-05 06:30:37+00:00",
            "updated": "2025-04-30 09:04:48+00:00"
        },
        {
            "title": "Diffusion Bridge Implicit Models",
            "authors": "Kaiwen Zheng, Guande He, Jianfei Chen, Fan Bao, Jun Zhu",
            "summary": "Denoising diffusion bridge models (DDBMs) are a powerful variant of diffusion\nmodels for interpolating between two arbitrary paired distributions given as\nendpoints. Despite their promising performance in tasks like image translation,\nDDBMs require a computationally intensive sampling process that involves the\nsimulation of a (stochastic) differential equation through hundreds of network\nevaluations. In this work, we take the first step in fast sampling of DDBMs\nwithout extra training, motivated by the well-established recipes in diffusion\nmodels. We generalize DDBMs via a class of non-Markovian diffusion bridges\ndefined on the discretized timesteps concerning sampling, which share the same\nmarginal distributions and training objectives, give rise to generative\nprocesses ranging from stochastic to deterministic, and result in diffusion\nbridge implicit models (DBIMs). DBIMs are not only up to 25$\\times$ faster than\nthe vanilla sampler of DDBMs but also induce a novel, simple, and insightful\nform of ordinary differential equation (ODE) which inspires high-order\nnumerical solvers. Moreover, DBIMs maintain the generation diversity in a\ndistinguished way, by using a booting noise in the initial sampling step, which\nenables faithful encoding, reconstruction, and semantic interpolation in image\ntranslation tasks. Code is available at\nhttps://github.com/thu-ml/DiffusionBridge.",
            "pdf_url": "http://arxiv.org/pdf/2405.15885v6",
            "published": "2024-05-24 19:08:30+00:00",
            "updated": "2025-04-30 08:56:54+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "ClusterLOB: Enhancing Trading Strategies by Clustering Orders in Limit Order Books",
            "authors": "Yichi Zhang, Mihai Cucuringu, Alexander Y. Shestopaloff, Stefan Zohren",
            "summary": "In the rapidly evolving world of financial markets, understanding the\ndynamics of limit order book (LOB) is crucial for unraveling market\nmicrostructure and participant behavior. We introduce ClusterLOB as a method to\ncluster individual market events in a stream of market-by-order (MBO) data into\ndifferent groups. To do so, each market event is augmented with six\ntime-dependent features. By applying the K-means++ clustering algorithm to the\nresulting order features, we are then able to assign each new order to one of\nthree distinct clusters, which we identify as directional, opportunistic, and\nmarket-making participants, each capturing unique trading behaviors. Our\nexperimental results are performed on one year of MBO data containing\nsmall-tick, medium-tick, and large-tick stocks from NASDAQ. To validate the\nusefulness of our clustering, we compute order flow imbalances across each\ncluster within 30-minute buckets during the trading day. We treat each\ncluster's imbalance as a signal that provides insights into trading strategies\nand participants' responses to varying market conditions. To assess the\neffectiveness of these signals, we identify the trading strategy with the\nhighest Sharpe ratio in the training dataset, and demonstrate that its\nperformance in the test dataset is superior to benchmark trading strategies\nthat do not incorporate clustering. We also evaluate trading strategies based\non order flow imbalance decompositions across different market event types,\nincluding add, cancel, and trade events, to assess their robustness in various\nmarket conditions. This work establishes a robust framework for clustering\nmarket participant behavior, which helps us to better understand market\nmicrostructure, and inform the development of more effective predictive trading\nsignals with practical applications in algorithmic trading and quantitative\nfinance.",
            "pdf_url": "http://arxiv.org/pdf/2504.20349v2",
            "published": "2025-04-29 01:37:33+00:00",
            "updated": "2025-04-30 01:11:18+00:00"
        }
    ]
}