{
    "Physics": [
        {
            "title": "Simulation of the high Mach number asymptote for bubble collapse in a compressible Euler fluid",
            "authors": "Daniels Krimans, Steven J. Ruuth, Seth Putterman",
            "summary": "Cavitation is a process where bubbles form and collapse within a fluid with\ndynamic, spatially varying pressure. This phenomenon can concentrate energy\ndensity by 12 orders of magnitude, creating light-emitting plasma or damaging\nnearby surfaces. A key question in cavitation theory and experiments is: what\nare the upper limits of energy density achievable through this spontaneous\nmultiscale process? Among the many physical processes at play, we focus on\nfluid compressibility, modeled using the Tait-Murnaghan equation of state for a\nhomentropic Euler fluid. We examine spherical cavities corresponding to\nexperimentally realizable sonoluminescing bubbles, whose radius changes by a\nfactor of over 100. These bubbles reach velocities exceeding the speed of sound\nof the surrounding fluid. However, all-Mach hydrodynamic solvers, such as those\nimplemented using the Basilisk software, can exhibit unphysical behavior even\nat early times when motion is nearly incompressible. To accurately capture high\nMach number motion and resolve dynamics in the sonoluminescence regime, we\nintroduced a uniform bubble approximation for the ideal gas inside the bubble.\nThis leading-order approximation clarifies the significant effects of\ncompressibility. Our results reproduce the equation-of-state-dependent\nasymptotic power-law region predicted by analytic calculations. This confirms\nour method's ability to capture high Mach number motion and suggests that the\nasymptotic regime could be experimentally observed. Convergence of this method\nis demonstrated for bubbles in both water and liquid lithium, showing that\ncompressibility slows collapse. Additionally, an outgoing shock wave in the\ncompressible fluid is resolved.",
            "pdf_url": "http://arxiv.org/pdf/2410.05244v1",
            "published": "2024-10-07 17:48:14+00:00",
            "updated": "2024-10-07 17:48:14+00:00"
        },
        {
            "title": "How charming can the Higgs be?",
            "authors": "Artemis Sofia Giannakopoulou, Patrick Meade, Mauro Valli",
            "summary": "The coupling of the Higgs boson to first and second generation fermions has\nyet to be measured experimentally. There still could be very large deviations\nin these couplings, as the origin of flavor is completely unknown.\nNevertheless, if Yukawa couplings are modified, especially for light\ngenerations, there are generically strong constraints from flavor-changing\nneutral currents (FCNCs). Therefore, it is imperative to understand whether\nthere exists viable UV physics consistent with current data that motivates\nfuture Higgs coupling probes. In particular, the charm-quark Yukawa is the next\nquark coupling that could be measured at the LHC if it is a few times larger\nthan the SM and compatible with flavor data. This is difficult to achieve in\nthe context of standard ansatz such as Minimal Flavor Violation. In this paper\nwe show that within the framework of Spontaneous Flavor Violation (SFV), using\na Two Higgs Doublet Model as an example, the Higgs can be sufficiently charming\nthat new LHC probes are relevant. In this charming region, we show that new\nHiggs states near the EW scale with large couplings to quarks are required,\nproviding complementary observables or new constraints on the SM Yukawa\ncouplings. The down-type SFV mechanism enabling the suppression of FCNCs also\nallows for independent modifications to the up-quark Yukawa coupling, which we\nexplore in detail as well.",
            "pdf_url": "http://arxiv.org/pdf/2410.05236v1",
            "published": "2024-10-07 17:41:57+00:00",
            "updated": "2024-10-07 17:41:57+00:00"
        },
        {
            "title": "Resisting high-energy impact events through gap engineering in superconducting qubit arrays",
            "authors": "Matt McEwen, Kevin C. Miao, Juan Atalaya, Alex Bilmes, Alex Crook, Jenna Bovaird, John Mark Kreikebaum, Nicholas Zobrist, Evan Jeffrey, Bicheng Ying, Andreas Bengtsson, Hung-Shen Chang, Andrew Dunsworth, Julian Kelly, Yaxing Zhang, Ebrahim Forati, Rajeev Acharya, Justin Iveland, Wayne Liu, Seon Kim, Brian Burkett, Anthony Megrant, Yu Chen, Charles Neill, Daniel Sank, Michel Devoret, Alex Opremcak",
            "summary": "Quantum error correction (QEC) provides a practical path to fault-tolerant\nquantum computing through scaling to large qubit numbers, assuming that\nphysical errors are sufficiently uncorrelated in time and space. In\nsuperconducting qubit arrays, high-energy impact events produce correlated\nerrors, violating this key assumption. Following such an event, phonons with\nenergy above the superconducting gap propagate throughout the device substrate,\nwhich in turn generate a temporary surge in quasiparticle (QP) density\nthroughout the array. When these QPs tunnel across the qubits' Josephson\njunctions, they induce correlated errors. Engineering different superconducting\ngaps across the qubit's Josephson junctions provides a method to resist this\nform of QP tunneling. By fabricating all-aluminum transmon qubits with both\nstrong and weak gap engineering on the same substrate, we observe starkly\ndifferent responses during high-energy impact events. Strongly gap engineered\nqubits do not show any degradation in T1 during impact events, while weakly gap\nengineered qubits show events of correlated degradation in T1. We also show\nthat strongly gap engineered qubits are robust to QP poisoning from increasing\noptical illumination intensity, whereas weakly gap engineered qubits display\nrapid degradation in coherence. Based on these results, gap engineering removes\nthe threat of high-energy impacts to QEC in superconducting qubit arrays.",
            "pdf_url": "http://arxiv.org/pdf/2402.15644v2",
            "published": "2024-02-23 23:03:11+00:00",
            "updated": "2024-10-07 17:37:20+00:00"
        },
        {
            "title": "Integrable Cosmological Models with an Arbitrary Number of Scalar Fields",
            "authors": "V. R. Ivanov, S. Yu. Vernov",
            "summary": "We consider cosmological models with an arbitrary number of scalar fields\nnonminimally coupled to gravity and construct new integrable cosmological\nmodels. In the constructed models, the Ricci scalar is an integral of motion\nirrespectively of the type of metric. The general solutions of evolution\nequations in the spatially flat FLRW metric have been found for models with the\nquartic potentials.",
            "pdf_url": "http://arxiv.org/pdf/2407.05002v2",
            "published": "2024-07-06 08:40:04+00:00",
            "updated": "2024-10-07 17:30:13+00:00"
        },
        {
            "title": "Update of the Brazilian Participation in the Next-Generation Collider Experiments",
            "authors": "W. L. Aldá Júnior, G. A. Alves, K. M. Amarilo, M. Barroso Ferreira Filho, C. A. Bernardes, E. M. da Costa, U. de Freitas Carneiro da Graça, D. de Jesus Damião, S. de Souza Fonseca, L. M. Domingues Mendes, M. Donadelli, G. Gil da Silveira, C. Hensel, C. Jahnke, H. Malbouisson, J . L. Marin, D. E. Martins, A. Massafferri, C. Mora Herrera, I. Nasteva, E. E. Purcino de Souza, F. S. Queiroz, M. Rangel, P. Rebello Teles, M. Thiel, T. R. F. P. Tomei, A. Vilela Pereira",
            "summary": "This proposal outlines the future plans of the Brazilian High-Energy Physics\n(HEP) community for upcoming collider experiments. With the construction of new\nparticle colliders on the horizon and the ongoing operation of the\nHigh-Luminosity LHC, several research groups in Brazil have put forward\ntechnical proposals, covering both hardware and software contributions, as part\nof the Brazilian contribution to the global effort. The primary goal remains to\nfoster a unified effort within the Brazilian HEP community, optimizing\nresources and expertise to deliver a high-impact contribution to the\ninternational HEP community.",
            "pdf_url": "http://arxiv.org/pdf/2410.05205v1",
            "published": "2024-10-07 17:08:21+00:00",
            "updated": "2024-10-07 17:08:21+00:00"
        },
        {
            "title": "Provably Positivity-Preserving Constrained Transport (PPCT) Second-Order Scheme for Ideal Magnetohydrodynamics",
            "authors": "Dongwen Pang, Kailiang Wu",
            "summary": "This paper proposes and analyzes a robust and efficient second-order\npositivity-preserving constrained transport (PPCT) scheme for ideal\nmagnetohydrodynamics (MHD) on non-staggered Cartesian meshes. The PPCT scheme\nensures two critical physical constraints: a globally discrete divergence-free\n(DDF) condition on the magnetic field and the positivity of density and\npressure. The method is inspired by a novel splitting technique from [T.A. Dao,\nM. Nazarov and I. Tomas, J. Comput. Phys., 508:113009, 2024], which divides the\nMHD system into an Euler subsystem with steady magnetic fields and a magnetic\nsubsystem with steady density and internal energy. To achieve these\nstructure-preserving properties, the PPCT scheme combines a\npositivity-preserving (PP) finite volume method for the Euler subsystem with a\nfinite difference constrained transport (CT) method for the magnetic subsystem\nvia Strang splitting. The finite volume method employs a new PP limiter that\nretains second-order accuracy and enforces the positivity of density and\npressure, with rigorous proof provided using the geometric quasilinearization\n(GQL) approach [K. Wu and C.-W. Shu, SIAM Review, 65:1031-1073, 2023]. For the\nmagnetic subsystem, we develop an implicit finite difference CT method that\nconserves energy and maintains a globally DDF constraint. This nonlinear system\nis efficiently solved to machine precision using an iterative algorithm. Since\nthe CT method is unconditionally energy-stable and conserves steady density and\ninternal energy, the PPCT scheme requires only a mild CFL condition for the\nfinite volume method to ensure stability and the PP property. While the focus\nis on 2D cases for clarity, the extension to 3D is discussed. Several\nchallenging numerical experiments, including highly magnetized MHD jets with\nhigh Mach numbers, validate the PPCT scheme's accuracy, robustness, and high\nresolution.",
            "pdf_url": "http://arxiv.org/pdf/2410.05173v1",
            "published": "2024-10-07 16:32:41+00:00",
            "updated": "2024-10-07 16:32:41+00:00"
        },
        {
            "title": "Hybrid optical sensor for combined thermal and dimensional monitoring in laser processing",
            "authors": "Simone Donadello",
            "summary": "Optical measurements enable non-contact and high-speed monitoring of physical\nprocesses, offering a non-invasive and versatile approach across a wide range\nof fields, from scientific research to industrial applications. In this work,\nan optical sensor capable of simultaneously measuring the distance and thermal\nemission of surfaces is presented, based on a simple laser diode probe. The\nprinciple of operation integrates triangulation with pyrometry in a single\ndevice, utilizing the monitor photodiode embedded within the probe package. By\nalternating the laser emission, the readout can rapidly switch between\ndimensional and thermal measurements, resulting in combined data acquisition.\nThe presented method is compact, easy to integrate, and cost-effective. The\nhybrid sensor is implemented into a laser processing setup, where a metallic\ntarget is heated and melted by a high-power laser beam. Its inline operation is\ndemonstrated in real-time for dynamic measurements of melt pool distance and\nradiance. This innovative approach can find applications in diverse fields,\nsuch as remote environmental sensing and closed-loop control systems for\nstabilizing high-temperature processes, including laser welding and additive\nmanufacturing.",
            "pdf_url": "http://arxiv.org/pdf/2410.05144v1",
            "published": "2024-10-07 15:55:28+00:00",
            "updated": "2024-10-07 15:55:28+00:00"
        },
        {
            "title": "Investigating Guiding Information for Adaptive Collocation Point Sampling in PINNs",
            "authors": "Jose Florido, He Wang, Amirul Khan, Peter K. Jimack",
            "summary": "Physics-informed neural networks (PINNs) provide a means of obtaining\napproximate solutions of partial differential equations and systems through the\nminimisation of an objective function which includes the evaluation of a\nresidual function at a set of collocation points within the domain. The quality\nof a PINNs solution depends upon numerous parameters, including the number and\ndistribution of these collocation points. In this paper we consider a number of\nstrategies for selecting these points and investigate their impact on the\noverall accuracy of the method. In particular, we suggest that no single\napproach is likely to be \"optimal\" but we show how a number of important\nmetrics can have an impact in improving the quality of the results obtained\nwhen using a fixed number of residual evaluations. We illustrate these\napproaches through the use of two benchmark test problems: Burgers' equation\nand the Allen-Cahn equation.",
            "pdf_url": "http://arxiv.org/pdf/2404.12282v2",
            "published": "2024-04-18 15:58:31+00:00",
            "updated": "2024-10-07 15:29:14+00:00"
        },
        {
            "title": "Solvability of MHS equations with Grad-Rubin boundary conditions in general domains",
            "authors": "Daniel Sánchez-Simón del Pino, Juan J. L. Velázquez",
            "summary": "In this paper we study the solvability of the magnetohydrostatic equations\nwith Grad-Rubin boundary conditions in general domains. Earlier results for\nthis problem were obtained in the recent years by D. Alonso-Or\\'an and J. L. L.\nVel\\'azquez, where particularly simple geometries were considered. In this\narticle we develop a theory that allows to solve these boundary value problems\nfor a larger class of domains. We will give precise applications to more\nphysically relevant situations, like the case of the space between two\ncircumferences or spheres and domains close to them.",
            "pdf_url": "http://arxiv.org/pdf/2410.05119v1",
            "published": "2024-10-07 15:22:07+00:00",
            "updated": "2024-10-07 15:22:07+00:00"
        },
        {
            "title": "Analyzing the $D^*D^*D^*$ system: Hexaquark states and the Efimov effect",
            "authors": "Pablo G. Ortega",
            "summary": "In this work we investigate the possible emergence of Efimov states in the\n$D^*D^*D^*$ system with $J^P=0^-$ and isospin $I=\\tfrac{1}{2}$, assuming the\nexistence of the heavy partner of the $T_{cc}^+$, dubbed $T_{cc}^*$, near the\n$D^*D^*$ threshold as predicted by Heavy-Quark Spin Symmetry. We find that\n$(I)J^P=(\\frac{1}{2})0^-$ three-body bound states can be formed, with\nproperties that suggest that the Efimov effect can be realised for reasonable\nvalues of the molecular probability and binding energy of the $T_{cc}^*$.",
            "pdf_url": "http://arxiv.org/pdf/2410.05118v1",
            "published": "2024-10-07 15:21:33+00:00",
            "updated": "2024-10-07 15:21:33+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "SePPO: Semi-Policy Preference Optimization for Diffusion Alignment",
            "authors": "Daoan Zhang, Guangchen Lan, Dong-Jun Han, Wenlin Yao, Xiaoman Pan, Hongming Zhang, Mingxiao Li, Pengcheng Chen, Yu Dong, Christopher Brinton, Jiebo Luo",
            "summary": "Reinforcement learning from human feedback (RLHF) methods are emerging as a\nway to fine-tune diffusion models (DMs) for visual generation. However,\ncommonly used on-policy strategies are limited by the generalization capability\nof the reward model, while off-policy approaches require large amounts of\ndifficult-to-obtain paired human-annotated data, particularly in visual\ngeneration tasks. To address the limitations of both on- and off-policy RLHF,\nwe propose a preference optimization method that aligns DMs with preferences\nwithout relying on reward models or paired human-annotated data. Specifically,\nwe introduce a Semi-Policy Preference Optimization (SePPO) method. SePPO\nleverages previous checkpoints as reference models while using them to generate\non-policy reference samples, which replace \"losing images\" in preference pairs.\nThis approach allows us to optimize using only off-policy \"winning images.\"\nFurthermore, we design a strategy for reference model selection that expands\nthe exploration in the policy space. Notably, we do not simply treat reference\nsamples as negative examples for learning. Instead, we design an anchor-based\ncriterion to assess whether the reference samples are likely to be winning or\nlosing images, allowing the model to selectively learn from the generated\nreference samples. This approach mitigates performance degradation caused by\nthe uncertainty in reference sample quality. We validate SePPO across both\ntext-to-image and text-to-video benchmarks. SePPO surpasses all previous\napproaches on the text-to-image benchmarks and also demonstrates outstanding\nperformance on the text-to-video benchmarks. Code will be released in\nhttps://github.com/DwanZhang-AI/SePPO.",
            "pdf_url": "http://arxiv.org/pdf/2410.05255v1",
            "published": "2024-10-07 17:56:53+00:00",
            "updated": "2024-10-07 17:56:53+00:00"
        },
        {
            "title": "Presto! Distilling Steps and Layers for Accelerating Music Generation",
            "authors": "Zachary Novack, Ge Zhu, Jonah Casebeer, Julian McAuley, Taylor Berg-Kirkpatrick, Nicholas J. Bryan",
            "summary": "Despite advances in diffusion-based text-to-music (TTM) methods, efficient,\nhigh-quality generation remains a challenge. We introduce Presto!, an approach\nto inference acceleration for score-based diffusion transformers via reducing\nboth sampling steps and cost per step. To reduce steps, we develop a new\nscore-based distribution matching distillation (DMD) method for the EDM-family\nof diffusion models, the first GAN-based distillation method for TTM. To reduce\nthe cost per step, we develop a simple, but powerful improvement to a recent\nlayer distillation method that improves learning via better preserving hidden\nstate variance. Finally, we combine our step and layer distillation methods\ntogether for a dual-faceted approach. We evaluate our step and layer\ndistillation methods independently and show each yield best-in-class\nperformance. Our combined distillation method can generate high-quality outputs\nwith improved diversity, accelerating our base model by 10-18x (230/435ms\nlatency for 32 second mono/stereo 44.1kHz, 15x faster than comparable SOTA) --\nthe fastest high-quality TTM to our knowledge. Sound examples can be found at\nhttps://presto-music.github.io/web/.",
            "pdf_url": "http://arxiv.org/pdf/2410.05167v1",
            "published": "2024-10-07 16:24:18+00:00",
            "updated": "2024-10-07 16:24:18+00:00"
        },
        {
            "title": "A Simulation-Free Deep Learning Approach to Stochastic Optimal Control",
            "authors": "Mengjian Hua, Matthieu Laurière, Eric Vanden-Eijnden",
            "summary": "We propose a simulation-free algorithm for the solution of generic problems\nin stochastic optimal control (SOC). Unlike existing methods, our approach does\nnot require the solution of an adjoint problem, but rather leverages Girsanov\ntheorem to directly calculate the gradient of the SOC objective on-policy. This\nallows us to speed up the optimization of control policies parameterized by\nneural networks since it completely avoids the expensive back-propagation step\nthrough stochastic differential equations (SDEs) used in the Neural SDE\nframework. In particular, it enables us to solve SOC problems in high dimension\nand on long time horizons. We demonstrate the efficiency of our approach in\nvarious domains of applications, including standard stochastic optimal control\nproblems, sampling from unnormalized distributions via construction of a\nSchr\\\"odinger-F\\\"ollmer process, and fine-tuning of pre-trained diffusion\nmodels. In all cases our method is shown to outperform the existing methods in\nboth the computing time and memory efficiency.",
            "pdf_url": "http://arxiv.org/pdf/2410.05163v1",
            "published": "2024-10-07 16:16:53+00:00",
            "updated": "2024-10-07 16:16:53+00:00"
        },
        {
            "title": "Human-Feedback Efficient Reinforcement Learning for Online Diffusion Model Finetuning",
            "authors": "Ayano Hiranaka, Shang-Fu Chen, Chieh-Hsin Lai, Dongjun Kim, Naoki Murata, Takashi Shibuya, Wei-Hsiang Liao, Shao-Hua Sun, Yuki Mitsufuji",
            "summary": "Controllable generation through Stable Diffusion (SD) fine-tuning aims to\nimprove fidelity, safety, and alignment with human guidance. Existing\nreinforcement learning from human feedback methods usually rely on predefined\nheuristic reward functions or pretrained reward models built on large-scale\ndatasets, limiting their applicability to scenarios where collecting such data\nis costly or difficult. To effectively and efficiently utilize human feedback,\nwe develop a framework, HERO, which leverages online human feedback collected\non the fly during model learning. Specifically, HERO features two key\nmechanisms: (1) Feedback-Aligned Representation Learning, an online training\nmethod that captures human feedback and provides informative learning signals\nfor fine-tuning, and (2) Feedback-Guided Image Generation, which involves\ngenerating images from SD's refined initialization samples, enabling faster\nconvergence towards the evaluator's intent. We demonstrate that HERO is 4x more\nefficient in online feedback for body part anomaly correction compared to the\nbest existing method. Additionally, experiments show that HERO can effectively\nhandle tasks like reasoning, counting, personalization, and reducing NSFW\ncontent with only 0.5K online feedback.",
            "pdf_url": "http://arxiv.org/pdf/2410.05116v1",
            "published": "2024-10-07 15:12:01+00:00",
            "updated": "2024-10-07 15:12:01+00:00"
        },
        {
            "title": "Autoregressive Image Diffusion: Generation of Image Sequence and Application in MRI",
            "authors": "Guanxiong Luo, Shoujin Huang, Martin Uecker",
            "summary": "Magnetic resonance imaging (MRI) is a widely used non-invasive imaging\nmodality. However, a persistent challenge lies in balancing image quality with\nimaging speed. This trade-off is primarily constrained by k-space measurements,\nwhich traverse specific trajectories in the spatial Fourier domain (k-space).\nThese measurements are often undersampled to shorten acquisition times,\nresulting in image artifacts and compromised quality. Generative models learn\nimage distributions and can be used to reconstruct high-quality images from\nundersampled k-space data. In this work, we present the autoregressive image\ndiffusion (AID) model for image sequences and use it to sample the posterior\nfor accelerated MRI reconstruction. The algorithm incorporates both\nundersampled k-space and pre-existing information. Models trained with fastMRI\ndataset are evaluated comprehensively. The results show that the AID model can\nrobustly generate sequentially coherent image sequences. In MRI applications,\nthe AID can outperform the standard diffusion model and reduce hallucinations,\ndue to the learned inter-image dependencies. The project code is available at\nhttps://github.com/mrirecon/aid.",
            "pdf_url": "http://arxiv.org/pdf/2405.14327v4",
            "published": "2024-05-23 08:57:10+00:00",
            "updated": "2024-10-07 15:10:03+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "The Fourier Cosine Method for Discrete Probability Distributions",
            "authors": "Xiaoyu Shen, Fang Fang, Chengguang Liu",
            "summary": "We provide a rigorous convergence proof demonstrating that the well-known\nsemi-analytical Fourier cosine (COS) formula for the inverse Fourier transform\nof continuous probability distributions can be extended to discrete probability\ndistributions, with the help of spectral filters. We establish general\nconvergence rates for these filters and further show that several classical\nspectral filters achieve convergence rates one order faster than previously\nrecognized in the literature on the Gibbs phenomenon. Our numerical experiments\ncorroborate the theoretical convergence results. Additionally, we illustrate\nthe computational speed and accuracy of the discrete COS method with\napplications in computational statistics and quantitative finance. The\ntheoretical and numerical results highlight the method's potential for solving\nproblems involving discrete distributions, particularly when the characteristic\nfunction is known, allowing the discrete Fourier transform (DFT) to be\nbypassed.",
            "pdf_url": "http://arxiv.org/pdf/2410.04487v1",
            "published": "2024-10-06 14:05:43+00:00",
            "updated": "2024-10-06 14:05:43+00:00"
        }
    ]
}