{
    "Physics": [
        {
            "title": "How interacting Bose gases scatter light",
            "authors": "Konstantinos Konstantinou, Yansheng Zhang, Paul H. C. Wong, Feiyang Wang, Yu-Kun Lu, Nishant Dogra, Christoph Eigen, Tanish Satoor, Wolfgang Ketterle, Zoran Hadzibabic",
            "summary": "The innate tendency of identical bosons to bunch, seen in the Hanbury\nBrown-Twiss effect and Bose-Einstein condensation, is a primary manifestation\nof quantum statistics. This tendency can enhance the rates of fundamental\nprocesses such as atom-atom and atom-light scattering if the atoms scatter into\nalready occupied quantum states. For non-interacting bosons, the enhancement of\nlight scattering is simply given by the bosonic-stimulation factor $1 + N_{\\rm\nf}$, where $N_{\\rm f}$ is the occupation of the atom's final momentum state.\nHere, we study scattering between off-resonant light and atoms in a\nquasi-homogeneous Bose gas with tunable interactions and show that even weak\ninteractions, which do not significantly alter the momentum distribution, have\na dramatic effect on the atom-light scattering. Due to (spatially local)\nbeyond-mean-field atomic correlations, weak repulsive interactions can\ncompletely suppress the bosonic enhancement of scattering, while attractive\nones increase the scattering rate. Moreover, if the interactions are rapidly\ntuned, light scattering reveals correlation dynamics that are orders of\nmagnitude faster than the momentum-space population dynamics. Its extreme\nsensitivity to dynamical beyond-mean-field effects makes off-resonant light\nscattering a simple and powerful probe of many-body physics in ultracold atomic\ngases.",
            "pdf_url": "http://arxiv.org/pdf/2503.24386v1",
            "published": "2025-03-31 17:59:48+00:00",
            "updated": "2025-03-31 17:59:48+00:00"
        },
        {
            "title": "Transverse orbital angular momentum: setting the record straight",
            "authors": "N. Tripathi, S. W. Hancock, H. M. Milchberg",
            "summary": "The nature of the transverse orbital angular momentum (tOAM) associated with\nspatiotemporal optical vortex (STOV) pulses has been the subject of recent\ndebate. We demonstrate that the approaches to tOAM presented in several recent\npapers are incorrect and lead to unphysical results, including erroneous claims\nof zero total tOAM. We emphasize the importance of calculating the OAM of any\nextended physical object at a common instant of time, and reemphasize the\nspecial status of the centre of energy as a reference point for all OAM\ncalculations. The theory presented in [Phys. Rev. Lett. 127, 193901 (2021)] is\nthe only correct classical field-based framework that both agrees with\nexperiments and provides a self consistent understanding of transverse OAM in\nspatiotemporal light fields.",
            "pdf_url": "http://arxiv.org/pdf/2503.24375v1",
            "published": "2025-03-31 17:53:59+00:00",
            "updated": "2025-03-31 17:53:59+00:00"
        },
        {
            "title": "Exploring light propagation in nonlinear electrodynamics: phase and group velocities and related phenomena",
            "authors": "T. W. Cruz, V. A. De Lorenci, E. Guzmán-Herrera, C. C. H. Ribeiro",
            "summary": "Nonlinear electrodynamics has been an important area of research for a long\ntime. Investigations based on nonlinear Lagrangians, such as Euler-Heisenberg\nand Born-Infeld, are instrumental in exploring the limits of classical and\nquantum field theories, providing valuable insights into strong-field\nphenomena. In this context, this work considers how light propagates in\nstrong-field environments, where such nonlinearities play significant roles,\noffering a way to investigate events in high-energy astrophysics, quantum\noptics, and fundamental physics beyond classical Maxwell's framework. Here,\nseveral aspects of light propagation in nonlinear electrodynamics are\ndiscussed. Phase and group velocities are derived and several interesting\nbehaviors are unveiled, such as birefringence, non-reciprocal propagation, and\nasymmetries between phase and group velocities in special configurations.\nSpecific solutions based on commonly studied nonlinear theories are also\ninvestigated, and phenomena like slow-light and one-way propagation are\ndiscussed.",
            "pdf_url": "http://arxiv.org/pdf/2503.24369v1",
            "published": "2025-03-31 17:49:51+00:00",
            "updated": "2025-03-31 17:49:51+00:00"
        },
        {
            "title": "The structure and topology of an amorphous metal-organic framework",
            "authors": "Thomas C. Nicholas, Daniel F. Thomas du Toit, Louise A. M. Rosset, Davide M. Proserpio, Andrew L. Goodwin, Volker L. Deringer",
            "summary": "Amorphous metal-organic frameworks are an important emerging materials class\nthat combine the attractive physical properties of the amorphous state with the\nversatility of metal-organic framework (MOF) chemistry. The structures of\namorphous MOFs have largely been inferred by drawing analogies to crystalline\npolymorphs and inorganic glasses, but ultimately the validity of such\nstructural models has been challenging to establish either experimentally or\ncomputationally. Here we use a unified data-driven approach, combining\nexperimental scattering data and active machine learning for interatomic\npotentials, to determine the structure of an amorphous zeolitic imidazolate\nframework (a-ZIF) -- the canonical amorphous MOF. Our results reveal clear\ndifferences between the structure of a-ZIF and that of other amorphous\ntetrahedral networks, allowing us to invalidate the long-standing assumption\nthat these inorganic and hybrid glasses are topologically equivalent. To this\nend, we introduce a systematic notation for the network topology of amorphous\nsolids, building a bridge to the successful use of topology analysis in\ncrystalline MOFs and to materials informatics. Our work provides insights into\nthe structure and topology of the archetypal amorphous MOF and opens up new\navenues for modelling and understanding amorphous framework materials more\ngenerally.",
            "pdf_url": "http://arxiv.org/pdf/2503.24367v1",
            "published": "2025-03-31 17:46:37+00:00",
            "updated": "2025-03-31 17:46:37+00:00"
        },
        {
            "title": "Projections for Key Measurements in Heavy Flavour Physics",
            "authors": "The ATLAS, Belle II, CMS, LHCb collaborations",
            "summary": "Precision studies of flavour-changing processes involving quarks and leptons\nprovide a number of ways to improve knowledge of the Standard Model and search\nfor physics beyond it. There are excellent short- and mid-term prospects for\nsignificantly improved measurements in heavy flavour physics (involving b and c\nhadrons and $\\tau$ leptons), with upgrades in progress or planned for the\nATLAS, CMS and LHCb experiments exploiting proton-proton collisions at CERN's\nLarge Hadron Collider, and for the Belle II experiment operating with\nelectron-positron collisions from the SuperKEKB accelerator in KEK. The\nexpected sensitivities that can be achieved from these experiments for a number\nof key observables are presented, highlighting the complementarity of the\ndifferent experiments and showing how the precision will improve with time.\nThis international programme in heavy flavour physics will result in\nunprecedented capability to probe this sector of the Standard Model and,\npotentially, observe imprints of physics at higher energy scales than can be\naccessed directly.",
            "pdf_url": "http://arxiv.org/pdf/2503.24346v1",
            "published": "2025-03-31 17:32:03+00:00",
            "updated": "2025-03-31 17:32:03+00:00"
        },
        {
            "title": "Quantum algorithms for cooling: a simple case study",
            "authors": "Daniel Molpeceres, Sirui Lu, J. Ignacio Cirac, Barbara Kraus",
            "summary": "Preparation of low-energy quantum many-body states has a wide range of\napplications in quantum information processing and condensed matter physics.\nQuantum cooling algorithms offer a promising alternative to other methods\nbased, for instance, on variational and adiabatic principles, or on dissipative\nstate preparation. In this work, we investigate a set of cooling algorithms in\na simple, solvable fermionic model which allows us to identify the mechanisms\nwhich underlie the cooling process and, also, those which prevent it. We derive\nanalytical expressions for the cooling dynamics, steady states, and cooling\nrates in the weak coupling limit. We find that multi-frequency and randomized\ncycle strategies can significantly enhance the performance of the quantum\nalgorithm and circumvent some of the obstacles. We also analyze the effects of\nnoise and evaluate the conditions under which cooling remains feasible.\nFurthermore, we present optimized cooling protocols that can significantly\nenhance cooling performance in the presence of noise. Additionally, we compare\ncooling and dissipative state preparation and show that, in the model analyzed\nhere, cooling generally achieves lower energies and is more resilient to noise.",
            "pdf_url": "http://arxiv.org/pdf/2503.24330v1",
            "published": "2025-03-31 17:19:12+00:00",
            "updated": "2025-03-31 17:19:12+00:00"
        },
        {
            "title": "Thermal transport in superconductor heterostructures: some recent progress",
            "authors": "Paramita Dutta",
            "summary": "This article reviews recent advances in low-temperature electronic thermal\ntransport properties of thermally biased superconductor heterostructures\nfocusing on the two-terminal transport. Since the last decade, ferromagnetism\nhas been widely used to enhance the thermoelectricity in heterostructures based\non ordinary superconductors. The possibility of getting giant thermoelectric\neffects with optimum thermal conductance by breaking the electron-hole symmetry\nof the ordinary superconductor boosted the research in this direction.\nRecently, attention has been paid to the role of triplet Cooper pairs that\nemerged in ferromagnetic junctions and the possibility of advanced\napplications. Other forms of magnetism, specifically antiferromagnetism and\naltermagnetism, have been investigated to unravel the behavior of the thermal\nand charge current in thermally biased junctions. In parallel to ordinary\nsuperconductors, junctions with unconventional superconductors have been\nexplored for the same purpose. Thermal transport in superconducting bilayers\nhas been studied using advanced materials like Dirac and topological materials,\nincluding Weyl semimetals. Significant attention has been paid to thermally\nbiased topological Josephson junctions to explore the phase-tunable current in\nrecent times. Weyl Josephson junctions, multi-terminal Josephson junctions, and\nvarious other multilayer junctions have also been studied to engineer large\nthermoelectric effects and various functionalities with potential applications\nin superconductor-based thermal device components.",
            "pdf_url": "http://arxiv.org/pdf/2503.24327v1",
            "published": "2025-03-31 17:17:25+00:00",
            "updated": "2025-03-31 17:17:25+00:00"
        },
        {
            "title": "Resolving the baryon assymmetry with RATS",
            "authors": "J. Josiek, M. Bernini-Peron, G. González-Torà, R. R. Lefever, E. C. Schösser",
            "summary": "Current leading theories of physics such as the Big Bang, the standard model\nof particle physics, and general relativity suggest that the universe should\ncontain an equal amount of matter and antimatter. Yet observations have found a\ndisproportionately large amount of matter, a phenomenon known as the baryon\nassymmetry problem. Since century-old established theories are traditionally\nimpossible to refute, the only possible explanation is that the remaining\nantimatter is hidden in plain sight and remains to be observed. We propose the\nexistence of anti-stars to solve the baryon assymetry in our new Reasonable\nAntimatter Theory of Stars (RATS). In this context, the RATS will create a\nframework to resolve the traditional tension between observers and theorists,\nand thus contribute to the peaceful and collaborative spirit of astronomy. Our\nmethod is the firing of neurons in our brains, typically known as a thought\nexperiment. We still have no idea why or how this works, but it must be good\nbecause most of science was created this way. Our results are the result of our\nmethods, which result in some text and the resulting conclusions. In order to\nencourage the reader to reach the end of this short paper, we do not want to\nspoil the conclusions here. Instead, the conclusions will conclude the paper.",
            "pdf_url": "http://arxiv.org/pdf/2503.24319v1",
            "published": "2025-03-31 17:07:37+00:00",
            "updated": "2025-03-31 17:07:37+00:00"
        },
        {
            "title": "A Linear Collider Vision for the Future of Particle Physics",
            "authors": "H. Abramowicz, E. Adli, F. Alharthi, M. Almanza-Soto, M. M. Altakach, S Ampudia Castelazo, D. Angal-Kalinin, R. B. Appleby, O. Apsimon, A. Arbey, O. Arquero, A. Aryshev, S. Asai, D. Attié, J. L. Avila-Jimenez, H. Baer, J. A. Bagger, Y. Bai, I. R. Bailey, C. Balazs, T Barklow, J. Baudot, P. Bechtle, T. Behnke, A. B. Bellerive, S. Belomestnykh, Y. Benhammou, J. Berenguer-Antequera, M. Berger, M. Berggren, M. Bertucci, M. Besançon, T. Biekötter, S. Bilanishvili, B. Bilki, B. Bilki, J. Björklund Svensson, V. M. Bjelland, C. Blanch, M. Boehler, S. Boogert, M. Boronat, V. Boudry, D. Bourilkov, I. Bozovic, J. Braathen, J. E. Brau, C. Breuning, J. -C. Brient, I. Brock, B. Brudnowski, K. Buesser, E. Bulyak, P. N. Burrows, A. Caldwell, F. G. Celiberto, E. Cenni, I. Chaikovska, R. Chehab, J. B. B. Chen, G. Chen, T. Chikamatsu, V. Cilento, P. Colas, M. Coman, F. Cornet, F. Cornet-Gomez, F. Corriveau, J. Cvach, R. D'Arcy, C. Damerell, A. Das, S. Dasu, J. de Blas, E. Del Core, M. Demarteau, H. Denizli, R. Dermisek, A. Dhar, S. Dittmaier, F. Djurabekova, E. M. Donegani, A. Doyle, P. Drobniak, T. A. du Pree, B. Dudar, H. Duran Yildiz, G. Durieux, J. Dutta, S. Easo, G. Eckerlin, U. Einhaus, E. Esarey, D. Espriu, L. R Evans, J. Farmer, A. Faus Golfe, M. Fernandez, J. C. Fernandez-Ortega, M. Formela, A. Formenti, B. Foster, N. Fourches, M. C. Fouz, A. Freitas, C. D. Fu, K. Fujii, J. Fujimoto, B. Fuks, J. Fuster, N. Fuster-Martínez, F. Gaede, M. Galletti, E. Gallo, S. Ganjour, M. V. Garzelli, R. L. Geng, S. Gessner, I. D. Gialamas, B. Gimeno, J. Goldstein, M. Goncerz, F. J. Gonzalez, D. González-Iglesias, S. G. Gori, J. Grames, P. Grannis, L. Gray, G. Grenier, H. Guler, H. E. Haber, K. Hamaguchi, N. Hamann, O. Hartbrich, G. Hütsi, S. Heinemeyer, G. Heinrich, C. Hensel, K. Hidaka, S. Hirose, A. H. Hoang, M. J. Hogan, W. Hollik, Y. Horii, R. Hosokawa, S. Huang, D. Hynds, M. I. Idzik, S. Iguro, Y. Iiyama, K. Ikematsu, A. Irles, A. Ishikawa, M. Ishino, I. P. Ivanov, Y. Iwashita, M. Jacewicz, R. Jaramillo, D. Jeans, C. Jing, R. M Jones, W. Kaabi, M. Kagan, J. Kalinowski, D. K Kalvik, J. Kaminski, S. Kanemura, K. Kannike, A. Karam, Y. Kato, K. Kawagoe, D. Käfer, L. Kennedy, J. Kersten, S. A. Khan, V. A. Khoze, W. Kilian, J. Klamka, P. Kluit, K. Kong, P. Koppenburg, A. Korsun, A. V. Kotwal, S. Kraml, K. Krüger, K. Kubo, T. Kubo, M. Kucharczyk, N. Kumar, A. Kumar, M. Kurata, Y. Kurihara, J. Kvasnicka, K. Kyoya, I. Laktineh, A. Latina, F. LeDiberder, A. Levy, M. Liepe, C. A. Lindstrøm, B. List, J. List, M. Litos, V. N. Litvinenko, A. Lopez-Virto, X. Lu, T. Luo, M. Lupberger, B. Madison, T. Madlener, J. Maeda, F. Mahmoudi, E. Maina, N. Majernik, R. Margraf-O'Neal, P. Martín-Luna, A. Martens, V. J. Martin, L. Marzola, V. I. Maslov, K. T. Matchev, S. Matsumoto, K. Mawatari, J. P. Márquez, M. M. Mühlleitner, P. A. McIntosh, K. Mekala, D. Melini, F. Meloni, A. Menéndez, S. Michizono, K. Mimasu, V. Miralles, W. Mitaroff, V. A. Mitsou, L. Monaco, G. Moortgat-Pick, M. Moreno-Llácer, T. Mori, J. M. Moron, S. Morton, D. Moya, M. Mulder, E. Musumeci, V. V. Mytrochenko, N. Nagata, E. Nagy, T. Nakada, J. Nakajima, K. Nakamura, E. A. Nanni, E. Nardi, S. Narita, M. T. Núñez Pardo de Vera, M. Nojiri, D. Ntounis, A. Ody, O. M. Ogreid, Y. Okada, C. Oleari, M. Olvegård, M. Omet, T. Omori, Y. Onel, H. Ono, W. Ootani, C. Orero, J. Osborne, K. Osterberg, J. Osterhoff, M. Ouchemhou, Q. Ouyang, S. Pagan Griso, R. Paparella, S. C. Park, J. Pata, J. R. Patterson, R. Pöschl, F. Peña, L. K Pedraza-Motavita, M. E. Peskin, F. Pilat, P. Piot, S. Plätzer, I. Polak, W. Porod, K. Potamianos, C. T. Potter, P. Poulose, J. G. Power, D. Protopopescu, H. R. Qi, J. Rabara Bailey, M. Raidal, J. P. Ralston, A. Rastogi, L. Reichenbach, J. Reuter, F. Richard, S. Riemann, R. A. Rimmer, T. Robens, A. Robson, G. Rodrigo, C. S. Rogan, J. Rojo, M. Q. Ruan, S. Rudrabhatla, A. Ruiz Jimeno, T. Saeki, H. Sakai, Y. Sakaki, F. Salvatore, T. Sanuki, S. Sasikumar, T Schörner, S. Schroeder, C. B. Schroeder, I. Schulthess, M. Schumacher, A. Schwartzman, Y. Seiya, A. Senol, H. Sert, D. Sertore, A. Seryi, T. Shidara, K. Sjobak, I. Smiljanic, S. Spannagel, M. Spira, M. Stanitzki, S. Stapnes, D. Storey, J. Strube, A. Subba, A. Subba, T. Suehara, H. Sugawara, K. Sugizaki, Z. Sun, R. Szafron, T. Takahashi, T. Takeshita, T. Tauchi, G. Taylor, N. Terunuma, D. Terzani, T. Teubner, J. Tian, J. Timmermans, M. Titov, R. Tomas Garcia, T. Tong, J. M. Torndal, M. Trautwein, A. Tricoli, K. Tsumura, B. Tuchming, D. Tuckler, M. Tytgat, A. Ukleja, C. Vallee, R. Van Kooten, J. van Tilborg, A. Vauth, M. Vellasco, C. Vernieri, L. Verra, M. Vicente Barreto Pinto, I. Vidakovic, H. Videau, E. Viklund, I. Vila, M. Villaplana, M. Vos, N. Vukasinovic, N. Walker, K. Wandall-Christensen, Y. Wang, Z. Was, T. Watanabe, N. K. Watson, G. Weiglein, J. D. Wells, H. Wennlöf, M. Wenskat, S. Westhoff, J. W. Wetzel, A. P. White, P. H. Williams, M. Williams, G. W. Wilson, M. Wing, A. Winter, M. Winter, T. Wojton, J. C. Wood, X. Xia, K. Yagyu, H. Yamamoto, A. Yamamoto, K. Yamamoto, Y. Yamamoto, S. Yamashita, M. Yamauchi, K. Yokoya, M. Yoshioka, J. Zalesak, A. F. Zarnecki, K. Zembaczynski, D. Zerwas, Y. Zhang, J. Zhang, M. Zielinski, M. Zobov",
            "summary": "In this paper we review the physics opportunities at linear $e^+e^-$\ncolliders with a special focus on high centre-of-mass energies and beam\npolarisation, take a fresh look at the various accelerator technologies\navailable or under development and, for the first time, discuss how a facility\nfirst equipped with a technology mature today could be upgraded with\ntechnologies of tomorrow to reach much higher energies and/or luminosities. In\naddition, we will discuss detectors and alternative collider modes, as well as\nopportunities for beyond-collider experiments and R\\&D facilities as part of a\nlinear collider facility (LCF). The material of this paper will support all\nplans for $e^+e^-$ linear colliders and additional opportunities they offer,\nindependently of technology choice or proposed site, as well as R\\&D for\nadvanced accelerator technologies. This joint perspective on the physics goals,\nearly technologies and upgrade strategies has been developed by the LCVision\nteam based on an initial discussion at LCWS2024 in Tokyo and a follow-up at the\nLCVision Community Event at CERN in January 2025. It heavily builds on decades\nof achievements of the global linear collider community, in particular in the\ncontext of CLIC and ILC.",
            "pdf_url": "http://arxiv.org/pdf/2503.19983v2",
            "published": "2025-03-25 18:09:46+00:00",
            "updated": "2025-03-31 16:53:57+00:00"
        },
        {
            "title": "Which features of quantum physics are not fundamentally quantum but are due to indeterminism?",
            "authors": "Flavio Del Santo, Nicolas Gisin",
            "summary": "What is fundamentally quantum? We argue that most of the features, problems,\nand paradoxes -- such as the measurement problem, the Wigner's friend paradox\nand its proposed solutions, single particle nonlocality, and no-cloning --\nallegedly attributed to quantum physics have a classical analogue if one is to\ninterpret classical physics as fundamentally indeterministic. What really\ncharacterizes non-classical effects are incompatible physical quantities,\nwhich, in quantum quantum theory are associated to the fundamental constant\n$\\hbar$.",
            "pdf_url": "http://arxiv.org/pdf/2409.10601v3",
            "published": "2024-09-16 18:00:01+00:00",
            "updated": "2025-03-31 16:47:40+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "ORAL: Prompting Your Large-Scale LoRAs via Conditional Recurrent Diffusion",
            "authors": "Rana Muhammad Shahroz Khan, Dongwen Tang, Pingzhi Li, Kai Wang, Tianlong Chen",
            "summary": "Parameter generation has emerged as a novel paradigm for neural network\ndevelopment, offering an alternative to traditional neural network training by\nsynthesizing high-quality model weights directly. In the context of Low-Rank\nAdaptation (LoRA) for evolving ($\\textit{i.e.}$, constantly updated) large\nlanguage models (LLMs), this approach promises efficient adaptation without\ncostly retraining. However, existing methods face critical limitations in\nsimultaneously achieving scalability and controllability. In this paper, we\nintroduce $\\texttt{ORAL}$, a novel $\\textbf{conditional recurrent diffusion}$\nframework that addresses these challenges. $\\texttt{ORAL}$ incorporates a novel\nconditioning mechanism that integrates model architecture and textual task\nspecifications, enabling the generation of task-specific LoRA parameters that\ncan seamlessly transfer across evolving foundation models. Our approach\nsuccessfully scales to billions-of-parameter LLMs and maintains\ncontrollability. Through extensive experiments across seven language tasks,\nfour vision tasks, and three multimodal tasks using five pre-trained LLMs, we\ndemonstrate that $\\texttt{ORAL}$ generates high-quality LoRA parameters that\nachieve comparable or superior performance to vanilla trained counterparts.",
            "pdf_url": "http://arxiv.org/pdf/2503.24354v1",
            "published": "2025-03-31 17:34:59+00:00",
            "updated": "2025-03-31 17:34:59+00:00"
        },
        {
            "title": "NoProp: Training Neural Networks without Back-propagation or Forward-propagation",
            "authors": "Qinyu Li, Yee Whye Teh, Razvan Pascanu",
            "summary": "The canonical deep learning approach for learning requires computing a\ngradient term at each layer by back-propagating the error signal from the\noutput towards each learnable parameter. Given the stacked structure of neural\nnetworks, where each layer builds on the representation of the layer below,\nthis approach leads to hierarchical representations. More abstract features\nlive on the top layers of the model, while features on lower layers are\nexpected to be less abstract. In contrast to this, we introduce a new learning\nmethod named NoProp, which does not rely on either forward or backwards\npropagation. Instead, NoProp takes inspiration from diffusion and flow matching\nmethods, where each layer independently learns to denoise a noisy target. We\nbelieve this work takes a first step towards introducing a new family of\ngradient-free learning methods, that does not learn hierarchical\nrepresentations -- at least not in the usual sense. NoProp needs to fix the\nrepresentation at each layer beforehand to a noised version of the target,\nlearning a local denoising process that can then be exploited at inference. We\ndemonstrate the effectiveness of our method on MNIST, CIFAR-10, and CIFAR-100\nimage classification benchmarks. Our results show that NoProp is a viable\nlearning algorithm which achieves superior accuracy, is easier to use and\ncomputationally more efficient compared to other existing back-propagation-free\nmethods. By departing from the traditional gradient based learning paradigm,\nNoProp alters how credit assignment is done within the network, enabling more\nefficient distributed learning as well as potentially impacting other\ncharacteristics of the learning process.",
            "pdf_url": "http://arxiv.org/pdf/2503.24322v1",
            "published": "2025-03-31 17:08:57+00:00",
            "updated": "2025-03-31 17:08:57+00:00"
        },
        {
            "title": "Enhancing Image Resolution of Solar Magnetograms: A Latent Diffusion Model Approach",
            "authors": "Francesco Pio Ramunno, Paolo Massa, Vitaliy Kinakh, Brandon Panos, André Csillaghy, Slava Voloshynovskiy",
            "summary": "The spatial properties of the solar magnetic field are crucial to decoding\nthe physical processes in the solar interior and their interplanetary effects.\nHowever, observations from older instruments, such as the Michelson Doppler\nImager (MDI), have limited spatial or temporal resolution, which hinders the\nability to study small-scale solar features in detail. Super resolving these\nolder datasets is essential for uniform analysis across different solar cycles,\nenabling better characterization of solar flares, active regions, and magnetic\nnetwork dynamics. In this work, we introduce a novel diffusion model approach\nfor Super-Resolution and we apply it to MDI magnetograms to match the\nhigher-resolution capabilities of the Helioseismic and Magnetic Imager (HMI).\nBy training a Latent Diffusion Model (LDM) with residuals on downscaled HMI\ndata and fine-tuning it with paired MDI/HMI data, we can enhance the resolution\nof MDI observations from 2\"/pixel to 0.5\"/pixel. We evaluate the quality of the\nreconstructed images by means of classical metrics (e.g., PSNR, SSIM, FID and\nLPIPS) and we check if physical properties, such as the unsigned magnetic flux\nor the size of an active region, are preserved. We compare our model with\ndifferent variations of LDM and Denoising Diffusion Probabilistic models\n(DDPMs), but also with two deterministic architectures already used in the past\nfor performing the Super-Resolution task. Furthermore, we show with an analysis\nin the Fourier domain that the LDM with residuals can resolve features smaller\nthan 2\", and due to the probabilistic nature of the LDM, we can asses their\nreliability, in contrast with the deterministic models. Future studies aim to\nsuper-resolve the temporal scale of the solar MDI instrument so that we can\nalso have a better overview of the dynamics of the old events.",
            "pdf_url": "http://arxiv.org/pdf/2503.24271v1",
            "published": "2025-03-31 16:16:26+00:00",
            "updated": "2025-03-31 16:16:26+00:00"
        },
        {
            "title": "Visual Acoustic Fields",
            "authors": "Yuelei Li, Hyunjin Kim, Fangneng Zhan, Ri-Zhao Qiu, Mazeyu Ji, Xiaojun Shan, Xueyan Zou, Paul Liang, Hanspeter Pfister, Xiaolong Wang",
            "summary": "Objects produce different sounds when hit, and humans can intuitively infer\nhow an object might sound based on its appearance and material properties.\nInspired by this intuition, we propose Visual Acoustic Fields, a framework that\nbridges hitting sounds and visual signals within a 3D space using 3D Gaussian\nSplatting (3DGS). Our approach features two key modules: sound generation and\nsound localization. The sound generation module leverages a conditional\ndiffusion model, which takes multiscale features rendered from a\nfeature-augmented 3DGS to generate realistic hitting sounds. Meanwhile, the\nsound localization module enables querying the 3D scene, represented by the\nfeature-augmented 3DGS, to localize hitting positions based on the sound\nsources. To support this framework, we introduce a novel pipeline for\ncollecting scene-level visual-sound sample pairs, achieving alignment between\ncaptured images, impact locations, and corresponding sounds. To the best of our\nknowledge, this is the first dataset to connect visual and acoustic signals in\na 3D context. Extensive experiments on our dataset demonstrate the\neffectiveness of Visual Acoustic Fields in generating plausible impact sounds\nand accurately localizing impact sources. Our project page is at\nhttps://yuelei0428.github.io/projects/Visual-Acoustic-Fields/.",
            "pdf_url": "http://arxiv.org/pdf/2503.24270v1",
            "published": "2025-03-31 16:16:10+00:00",
            "updated": "2025-03-31 16:16:10+00:00"
        },
        {
            "title": "DiET-GS: Diffusion Prior and Event Stream-Assisted Motion Deblurring 3D Gaussian Splatting",
            "authors": "Seungjun Lee, Gim Hee Lee",
            "summary": "Reconstructing sharp 3D representations from blurry multi-view images are\nlong-standing problem in computer vision. Recent works attempt to enhance\nhigh-quality novel view synthesis from the motion blur by leveraging\nevent-based cameras, benefiting from high dynamic range and microsecond\ntemporal resolution. However, they often reach sub-optimal visual quality in\neither restoring inaccurate color or losing fine-grained details. In this\npaper, we present DiET-GS, a diffusion prior and event stream-assisted motion\ndeblurring 3DGS. Our framework effectively leverages both blur-free event\nstreams and diffusion prior in a two-stage training strategy. Specifically, we\nintroduce the novel framework to constraint 3DGS with event double integral,\nachieving both accurate color and well-defined details. Additionally, we\npropose a simple technique to leverage diffusion prior to further enhance the\nedge details. Qualitative and quantitative results on both synthetic and\nreal-world data demonstrate that our DiET-GS is capable of producing\nsignificantly better quality of novel views compared to the existing baselines.\nOur project page is https://diet-gs.github.io",
            "pdf_url": "http://arxiv.org/pdf/2503.24210v1",
            "published": "2025-03-31 15:27:07+00:00",
            "updated": "2025-03-31 15:27:07+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "CSPO: Cross-Market Synergistic Stock Price Movement Forecasting with Pseudo-volatility Optimization",
            "authors": "Sida Lin, Yankai Chen, Yiyan Qi, Chenhao Ma, Bokai Cao, Yifei Zhang, Xue Liu, Jian Guo",
            "summary": "The stock market, as a cornerstone of the financial markets, places\nforecasting stock price movements at the forefront of challenges in\nquantitative finance. Emerging learning-based approaches have made significant\nprogress in capturing the intricate and ever-evolving data patterns of modern\nmarkets. With the rapid expansion of the stock market, it presents two\ncharacteristics, i.e., stock exogeneity and volatility heterogeneity, that\nheighten the complexity of price forecasting. Specifically, while stock\nexogeneity reflects the influence of external market factors on price\nmovements, volatility heterogeneity showcases the varying difficulty in\nmovement forecasting against price fluctuations. In this work, we introduce the\nframework of Cross-market Synergy with Pseudo-volatility Optimization (CSPO).\nSpecifically, CSPO implements an effective deep neural architecture to leverage\nexternal futures knowledge. This enriches stock embeddings with cross-market\ninsights and thus enhances the CSPO's predictive capability. Furthermore, CSPO\nincorporates pseudo-volatility to model stock-specific forecasting confidence,\nenabling a dynamic adaptation of its optimization process to improve accuracy\nand robustness. Our extensive experiments, encompassing industrial evaluation\nand public benchmarking, highlight CSPO's superior performance over existing\nmethods and effectiveness of all proposed modules contained therein.",
            "pdf_url": "http://arxiv.org/pdf/2503.22740v1",
            "published": "2025-03-26 18:58:15+00:00",
            "updated": "2025-03-26 18:58:15+00:00"
        }
    ]
}