{
    "Physics": [
        {
            "title": "Thouless pumping in a driven-dissipative Kerr resonator array",
            "authors": "S. Ravets, N. Pernet, N. Mostaan, N. Goldman, J. Bloch",
            "summary": "Thouless pumping is an emblematic manifestation of topology in physics,\nreferring to the ability to induce a quantized transport of charge across a\nsystem by simply varying one of its parameters periodically in time. The\noriginal concept of Thouless pumping involves a non-interacting system, and has\nbeen implemented in several platforms. One current challenge in the field is to\nextend this concept to interacting systems. In this article, we propose a\nThouless pump that solely relies on nonlinear physics, within a chain of\ncoupled Kerr resonators. Leveraging the driven-dissipative nature of the\nsystem, we modulate in space and time the onsite Kerr interaction energies, and\ngenerate 1+1-dimensional topological bands in the Bogoliubov spectrum of\nexcitations. These bands present the same topology as the ones obtained within\nthe Harper-Hofstadter framework, and the Wannier states associated to each band\nexperience a net displacement and show quantized transport according to the\nbands Chern numbers. Remarkably, we find driving configurations leading to band\ninversion, revealing an interaction-induced topological transition. Our\nnumerical simulations are performed using realistic parameters inspired from\nexciton polaritons, which form a platform of choice for investigating driven\ntopological phases of matter.",
            "pdf_url": "http://arxiv.org/pdf/2407.02627v2",
            "published": "2024-07-02 19:38:14+00:00",
            "updated": "2024-10-31 17:55:50+00:00"
        },
        {
            "title": "The time-dependent bivariational principle: Theoretical foundation for real-time propagation methods of coupled-cluster type",
            "authors": "Simen Kvaal, Håkon Richard Fredheim, Mads Greisen Højlund, Thomas Bondo Pedersen",
            "summary": "Real-time propagation methods for chemistry and physics are invariably\nformulated using variational techniques. The time-dependent bivariational\nprinciple (TD-BIVP) is known to be the proper framework for coupled-cluster\ntype methods, and is here studied from a differential geometric point of view.\nIt is demonstrated how two distinct classical Hamilton's equations of motion\narise from considering the real and imaginary parts of the action integral. The\nlatter is new, and can in principle be used to develop novel propagation\nmethods. Conservation laws and Poisson brackets are introduced, completing the\nanalogy with classical mechanics. An overview of established real-time\npropagation methods is given in the context of our formulation of the TD-BIVP,\nnamely time-dependent traditional coupled-cluster theory, orbital-adaptive\ncoupled-cluster theory, time-dependent orthogonal optimized coupled-cluster\ntheory, and equation-of-motion coupled cluster theory.",
            "pdf_url": "http://arxiv.org/pdf/2410.24192v1",
            "published": "2024-10-31 17:51:44+00:00",
            "updated": "2024-10-31 17:51:44+00:00"
        },
        {
            "title": "Neutrino quantum kinetics in two spatial dimensions",
            "authors": "Marie Cornelius, Shashank Shalgar, Irene Tamborra",
            "summary": "Our understanding of neutrino flavor conversion in the innermost regions of\ncore-collapse supernovae and neutron star mergers is mostly limited to\nspherically symmetric configurations that facilitate the numerical solution of\nthe quantum kinetic equations. In this paper, we simulate neutrino quantum\nkinetics within a (2+1+1) dimensional setup: we model the flavor evolution\nduring neutrino decoupling from matter in two spatial dimensions, one neutrino\nmomentum variable, and time; taking into account non-forward neutral current\nand charged current collisions of neutrinos with the matter background, as well\nas neutrino advection. In order to mimic fluctuations in the neutrino emission\nand matter background, and explore their effect on the flavor evolution, we\nintroduce perturbations in the collision term as well as in the vacuum term of\nthe Hamiltonian. Because of such perturbations, the initial symmetry of the\nneutrino field across the simulation annulus is broken and flavor conversion is\nqualitatively affected, with regions of larger flavor conversion alternating\nacross the simulation annulus. In addition, neutrino advection is responsible\nfor spreading flavor waves across neighboring spatial regions. Although based\non a simplified setup, our findings highlight the importance of modeling\nneutrino quantum kinetics in multi-dimensions to assess the impact of neutrinos\non the physics of compact astrophysical sources and nucleosynthesis.",
            "pdf_url": "http://arxiv.org/pdf/2407.04769v2",
            "published": "2024-07-05 18:00:01+00:00",
            "updated": "2024-10-31 17:50:59+00:00"
        },
        {
            "title": "The Importance of Being Scalable: Improving the Speed and Accuracy of Neural Network Interatomic Potentials Across Chemical Domains",
            "authors": "Eric Qu, Aditi S. Krishnapriyan",
            "summary": "Scaling has been critical in improving model performance and generalization\nin machine learning. It involves how a model's performance changes with\nincreases in model size or input data, as well as how efficiently computational\nresources are utilized to support this growth. Despite successes in other\nareas, the study of scaling in Neural Network Interatomic Potentials (NNIPs)\nremains limited. NNIPs act as surrogate models for ab initio quantum mechanical\ncalculations. The dominant paradigm here is to incorporate many physical domain\nconstraints into the model, such as rotational equivariance. We contend that\nthese complex constraints inhibit the scaling ability of NNIPs, and are likely\nto lead to performance plateaus in the long run. In this work, we take an\nalternative approach and start by systematically studying NNIP scaling\nstrategies. Our findings indicate that scaling the model through attention\nmechanisms is efficient and improves model expressivity. These insights\nmotivate us to develop an NNIP architecture designed for scalability: the\nEfficiently Scaled Attention Interatomic Potential (EScAIP). EScAIP leverages a\nmulti-head self-attention formulation within graph neural networks, applying\nattention at the neighbor-level representations. Implemented with\nhighly-optimized attention GPU kernels, EScAIP achieves substantial gains in\nefficiency--at least 10x faster inference, 5x less memory usage--compared to\nexisting NNIPs. EScAIP also achieves state-of-the-art performance on a wide\nrange of datasets including catalysts (OC20 and OC22), molecules (SPICE), and\nmaterials (MPTrj). We emphasize that our approach should be thought of as a\nphilosophy rather than a specific model, representing a proof-of-concept for\ndeveloping general-purpose NNIPs that achieve better expressivity through\nscaling, and continue to scale efficiently with increased computational\nresources and training data.",
            "pdf_url": "http://arxiv.org/pdf/2410.24169v1",
            "published": "2024-10-31 17:35:57+00:00",
            "updated": "2024-10-31 17:35:57+00:00"
        },
        {
            "title": "Arrows of time in bouncing cosmologies",
            "authors": "Marco de Cesare",
            "summary": "Different approaches to quantum gravity, such as loop quantum cosmology and\ngroup field theory, predict the resolution of the initial cosmological\nsingularity via a bounce: a regular spacetime region that connects the\nexpanding branch of the universe to a contracting branch. The cosmological\narrow of time, which by definition points in the direction of cosmic expansion,\nis reversed at the bounce. Nonetheless, it is still possible to discriminate\nbetween the two branches by considering different arrows, as defined for\ninstance by the growth of perturbations. After reviewing general aspects of the\ntime arrow problem in cosmology, we examine the properties of different arrows\nof time in bouncing cosmologies, focusing on the loop quantum cosmology bounce\nas a case study. These issues are examined in detail for an exact solution to\nthe effective Friedmann equations of loop quantum cosmology with pressureless\ndust and a cosmological constant, which is a simplified version of the\n$\\Lambda$CDM bounce scenario.",
            "pdf_url": "http://arxiv.org/pdf/2405.01380v2",
            "published": "2024-05-02 15:21:32+00:00",
            "updated": "2024-10-31 17:33:32+00:00"
        },
        {
            "title": "2D magnetic stability",
            "authors": "Douglas Lundholm",
            "summary": "This article is a contribution to the proceedings of the 33rd/35th\nInternational Colloquium on Group Theoretical Methods in Physics (ICGTMP,\nGroup33/35) held in Cotonou, Benin, July 15-19, 2024. The stability of matter\nis an old and mathematically difficult problem, relying both on the uncertainty\nprinciple of quantum mechanics and on the exclusion principle of quantum\nstatistics. We consider here the stability of the self-interacting\nalmost-bosonic anyon gas, generalizing the Gross-Pitaevskii / nonlinear\nSchr\\\"odinger energy functionals to include magnetic self interactions. We show\nthat there is a type of supersymmetry in the model which holds only for higher\nvalues of the magnetic coupling but is broken for lower values, and that in the\nformer case supersymmetric ground states exist precisely at even-integer\nquantized values of the coupling. These states constitute a manifold of\nexplicit solitonic vortex solutions whose densities solve a generalized\nLiouville equation, and can be regarded as nonlinear generalizations of Landau\nlevels. The reported work is joint with Alireza Ataei and Dinh-Thi Nguyen and\nmakes an earlier analysis of self-dual abelian Chern-Simons-Higgs theory by\nJackiw and Pi, Hagen, and others, mathematically rigorous.",
            "pdf_url": "http://arxiv.org/pdf/2410.24156v1",
            "published": "2024-10-31 17:12:27+00:00",
            "updated": "2024-10-31 17:12:27+00:00"
        },
        {
            "title": "Modeling Brownian Motion as a Timelapse of the Physical, Persistent, Trajectory",
            "authors": "Ludovico Cademartiri",
            "summary": "While it is very common to model diffusion as a random walk by assuming\nmemorylessness of the trajectory and diffusive step lengths, these assumptions\ncan lead to significant errors. This paper describes the extent to which a\nphysical trajectory of a Brownian particle can be described by a random flight.\nAnalysis of simple timelapses of physical trajectories (calculated over\ncollisional timescales using a velocity autocorrelation function that captures\nthe hydrodynamic and acoustic effects induced by the solvent) gave us two\nobservations: (i) subsampled trajectories become genuinely memoryless only when\nthe time step is ~200 times larger than the relaxation time, and (ii) the\ndistribution of the step lengths has variances that remain significantly\nsmaller than 2Dt (usually by a factor of ~2). This last fact is due to the\ncombination of two effects: diffusional MSD is mathematically superballistic at\nshort timescales and subsampled trajectories are moving averages of the\nunderlying physical trajectory. In other words, the MSD of the physical\ntrajectory at long time intervals asymptotically approaches 2Dt, but the MSD of\nthe subsampled steps does not, even when the associated time interval is\nseveral hundred times larger than the relaxation time. I discuss how to best\naccount for this effect in computational approaches.",
            "pdf_url": "http://arxiv.org/pdf/2410.24137v1",
            "published": "2024-10-31 17:00:18+00:00",
            "updated": "2024-10-31 17:00:18+00:00"
        },
        {
            "title": "Optics tuning simulations for FCC-ee using Python Accelerator Toolbox",
            "authors": "Elaf Musa, Ilya Agapov, Tessa Charles",
            "summary": "The development of ultra-low emittance storage rings, such as the e+/e-\nFuture Circular Collider (FCC-ee) with a circumference of about 90 km, aims to\nachieve unprecedented luminosity and beam size. One significant challenge is\ncorrecting the optics, which becomes increasingly difficult as we target lower\nemittances. In this paper, we investigate optics correction methods to address\nthese challenges. We examined the impact of arc region magnet alignment errors\nin the baseline optics for the FCC-ee lattice at Z energy. To establish\nrealistic alignment tolerances, we developed a sequence of correction steps\nusing the Python Accelerator Toolbox (PyAT) to correct the lattice optics,\nachieve the nominal emittance, Dynamic Aperture (DA), and in the end, the\ndesign luminosity. The correction scheme has been recently optimized and better\nmachine performance demonstrated. A comparison was conducted between two optics\ncorrection approaches: Linear Optics from Closed Orbits (LOCO) with phase\nadvance + $\\eta_x$ and coupling Resonance Driving Terms (RDTs) + $\\eta_y$. The\nlatter method demonstrated better performance in achieving the target emittance\nand enhancing the DA.",
            "pdf_url": "http://arxiv.org/pdf/2410.24129v1",
            "published": "2024-10-31 16:53:32+00:00",
            "updated": "2024-10-31 16:53:32+00:00"
        },
        {
            "title": "More global randomness from less random local gates",
            "authors": "Ryotaro Suzuki, Hosho Katsura, Yosuke Mitsuhashi, Tomohiro Soejima, Jens Eisert, Nobuyuki Yoshioka",
            "summary": "Random circuits giving rise to unitary designs are key tools in quantum\ninformation science and many-body physics. In this work, we investigate a class\nof random quantum circuits with a specific gate structure. Within this\nframework, we prove that one-dimensional structured random circuits with\nnon-Haar random local gates can exhibit substantially more global randomness\ncompared to Haar random circuits with the same underlying circuit architecture.\nIn particular, we derive all the exact eigenvalues and eigenvectors of the\nsecond-moment operators for these structured random circuits under a solvable\ncondition, by establishing a link to the Kitaev chain, and show that their\nspectral gaps can exceed those of Haar random circuits. Our findings have\napplications in improving circuit depth bounds for randomized benchmarking and\nthe generation of approximate unitary 2-designs from shallow random circuits.",
            "pdf_url": "http://arxiv.org/pdf/2410.24127v1",
            "published": "2024-10-31 16:51:52+00:00",
            "updated": "2024-10-31 16:51:52+00:00"
        },
        {
            "title": "gSeaGen code by KM3NeT: an efficient tool to propagate muons simulated with CORSIKA",
            "authors": "S. Aiello, A. Albert, A. R. Alhebsi, M. Alshamsi, S. Alves Garre, A. Ambrosone, F. Ameli, M. Andre, E. Androutsou, L. Aphecetche, M. Ardid, S. Ardid, H. Atmani, J. Aublin, F. Badaracco, L. Bailly-Salins, Z. Bardačová, B. Baret, A. Bariego-Quintana, Y. Becherini, M. Bendahman, F. Benfenati, M. Benhassi, M. Bennani, D. M. Benoit, E. Berbee, V. Bertin, C. Beyer, S. Biagi, M. Boettcher, D. Bonanno, A. B. Bouasla, J. Boumaaza, M. Bouta, M. Bouwhuis, C. Bozza, R. M. Bozza, H. Brânzaş, F. Bretaudeau, M. Breuhaus, R. Bruijn, J. Brunner, R. Bruno, E. Buis, R. Buompane, J. Busto, B. Caiffi, D. Calvo, A. Capone, F. Carenini, V. Carretero, T. Cartraud, P. Castaldi, V. Cecchini, S. Celli, L. Cerisy, M. Chabab, M. Chadolias, A. Chen, S. Cherubini, T. Chiarusi, M. Circella, R. Cocimano, J. A. B. Coelho, A. Coleiro, A. Condorelli, R. Coniglione, P. Coyle, A. Creusot, G. Cuttone, R. Dallier, Y. Darras, A. De Benedittis, B. De Martino, G. De Wasseige, V. Decoene, I. Del Rosso, L. S. Di Mauro, I. Di Palma, A. F. Díaz, D. Diego-Tortosa, C. Distefano, A. Domi, C. Donzaud, D. Dornic, E. Drakopoulou, D. Drouhin, J. -G. Ducoin, R. Dvornický, T. Eberl, E. Eckerová, A. Eddymaoui, T. van Eeden, M. Eff, D. van Eijk, I. El Bojaddaini, S. El Hedri, V. Ellajosyula, A. Enzenhöfer, G. Ferrara, M. D. Filipović, F. Filippini, D. Franciotti, L. A. Fusco, S. Gagliardini, T. Gal, J. García Méndez, A. Garcia Soto, C. Gatius Oliver, N. Geißelbrecht, E. Genton, H. Ghaddari, L. Gialanella, B. K. Gibson, E. Giorgio, I. Goos, P. Goswami, S. R. Gozzini, R. Gracia, C. Guidi, B. Guillon, M. Gutiérrez, C. Haack, H. van Haren, V. Hassieiev, A. Heijboer, L. Hennig, J. J. Hernández-Rey, W. Idrissi Ibnsalih, G. Illuminati, D. Joly, M. de Jong, P. de Jong, B. J. Jung, P. Kalaczyński, G. Kistauri, C. Kopper, A. Kouchner, V. Kueviakoe, V. Kulikovskiy, R. Kvatadze, M. Labalme, R. Lahmann, M. Lamoureux, G. Larosa, C. Lastoria, A. Lazo, S. Le Stum, G. Lehaut, V. Lemaître, E. Leonora, N. Lessing, G. Levi, M. Lindsey Clark, F. Longhitano, F. Magnani, J. Majumdar, L. Malerba, F. Mamedov, A. Manfreda, M. Marconi, A. Margiotta, A. Marinelli, C. Markou, L. Martin, M. Mastrodicasa, S. Mastroianni, J. Mauro, G. Miele, P. Migliozzi, E. Migneco, M. L. Mitsou, C. M. Mollo, L. Morales-Gallegos, G. Moretti, A. Moussa, I. Mozun Mateo, R. Muller, M. R. Musone, M. Musumeci, S. Navas, A. Nayerhoda, C. A. Nicolau, B. Nkosi, B. Ó Fearraigh, V. Oliviero, A. Orlando, E. Oukacha, D. Paesani, J. Palacios González, G. Papalashvili, V. Parisi, E. J. Pastor Gomez, A. M. Păun, G. E. Păvălaş, I. Pelegris, S. Peña Martínez, M. Perrin-Terrin, V. Pestel, R. Pestes, P. Piattelli, C. Poirè, V. Popa, T. Pradier, J. Prado, S. Pulvirenti, C. A. Quiroz-Rangel, U. Rahaman, N. Randazzo, S. Razzaque, I. C. Rea, D. Real, G. Riccobene, J. Robinson, A. Romanov, A. Šaina, F. Salesa Greus, D. F. E. Samtleben, A. Sánchez Losa, S. Sanfilippo, M. Sanguineti, D. Santonocito, P. Sapienza, J. Schnabel, J. Schumann, H. M. Schutte, J. Seneca, N. Sennan, B. Setter, I. Sgura, R. Shanidze, A. Sharma, Y. Shitov, F. Šimkovic, A. Simonelli, A. Sinopoulou, B. Spisso, M. Spurio, D. Stavropoulos, I. Štekl, M. Taiuti, Y. Tayalati, H. Thiersen, S. Thoudam, P. de la Torre, I. Tosta e Melo, E. Tragia, B. Trocmé, V. Tsourapis, A. Tudorache, E. Tzamariudaki, A. Ukleja, A. Vacheret, V. Valsecchi, V. Van Elewyck, G. Vannoye, G. Vasileiadis, F. Vazquez de Sola, A. Veutro, S. Viola, D. Vivolo, A. van Vliet, H. Warnhofer, S. Weissbrod, E. de Wolf, I. Lhenry-Yvon, G. Zarpapis, S. Zavatarelli, A. Zegarelli, D. Zito, J. D. Zornoza, J. Zúñiga, N. Zywucka",
            "summary": "The KM3NeT Collaboration has tackled a common challenge faced by the\nastroparticle physics community, namely adapting the experiment-specific\nsimulation software to work with the CORSIKA air shower simulation output. The\nproposed solution is an extension of the open-source code gSeaGen, allowing for\nthe transport of muons generated by CORSIKA to a detector of any size at an\narbitrary depth. The gSeaGen code was not only extended in terms of\nfunctionalities but also underwent a thorough redesign of the muon propagation\nroutine, resulting in a more accurate and efficient simulation. This paper\npresents the capabilities of the new gSeaGen code as well as prospects for\nfurther developments.",
            "pdf_url": "http://arxiv.org/pdf/2410.24115v1",
            "published": "2024-10-31 16:45:38+00:00",
            "updated": "2024-10-31 16:45:38+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Bridging Geometric States via Geometric Diffusion Bridge",
            "authors": "Shengjie Luo, Yixian Xu, Di He, Shuxin Zheng, Tie-Yan Liu, Liwei Wang",
            "summary": "The accurate prediction of geometric state evolution in complex systems is\ncritical for advancing scientific domains such as quantum chemistry and\nmaterial modeling. Traditional experimental and computational methods face\nchallenges in terms of environmental constraints and computational demands,\nwhile current deep learning approaches still fall short in terms of precision\nand generality. In this work, we introduce the Geometric Diffusion Bridge\n(GDB), a novel generative modeling framework that accurately bridges initial\nand target geometric states. GDB leverages a probabilistic approach to evolve\ngeometric state distributions, employing an equivariant diffusion bridge\nderived by a modified version of Doob's $h$-transform for connecting geometric\nstates. This tailored diffusion process is anchored by initial and target\ngeometric states as fixed endpoints and governed by equivariant transition\nkernels. Moreover, trajectory data can be seamlessly leveraged in our GDB\nframework by using a chain of equivariant diffusion bridges, providing a more\ndetailed and accurate characterization of evolution dynamics. Theoretically, we\nconduct a thorough examination to confirm our framework's ability to preserve\njoint distributions of geometric states and capability to completely model the\nunderlying dynamics inducing trajectory distributions with negligible error.\nExperimental evaluations across various real-world scenarios show that GDB\nsurpasses existing state-of-the-art approaches, opening up a new pathway for\naccurately bridging geometric states and tackling crucial scientific challenges\nwith improved accuracy and applicability.",
            "pdf_url": "http://arxiv.org/pdf/2410.24220v1",
            "published": "2024-10-31 17:59:53+00:00",
            "updated": "2024-10-31 17:59:53+00:00"
        },
        {
            "title": "DiffPano: Scalable and Consistent Text to Panorama Generation with Spherical Epipolar-Aware Diffusion",
            "authors": "Weicai Ye, Chenhao Ji, Zheng Chen, Junyao Gao, Xiaoshui Huang, Song-Hai Zhang, Wanli Ouyang, Tong He, Cairong Zhao, Guofeng Zhang",
            "summary": "Diffusion-based methods have achieved remarkable achievements in 2D image or\n3D object generation, however, the generation of 3D scenes and even\n$360^{\\circ}$ images remains constrained, due to the limited number of scene\ndatasets, the complexity of 3D scenes themselves, and the difficulty of\ngenerating consistent multi-view images. To address these issues, we first\nestablish a large-scale panoramic video-text dataset containing millions of\nconsecutive panoramic keyframes with corresponding panoramic depths, camera\nposes, and text descriptions. Then, we propose a novel text-driven panoramic\ngeneration framework, termed DiffPano, to achieve scalable, consistent, and\ndiverse panoramic scene generation. Specifically, benefiting from the powerful\ngenerative capabilities of stable diffusion, we fine-tune a single-view\ntext-to-panorama diffusion model with LoRA on the established panoramic\nvideo-text dataset. We further design a spherical epipolar-aware multi-view\ndiffusion model to ensure the multi-view consistency of the generated panoramic\nimages. Extensive experiments demonstrate that DiffPano can generate scalable,\nconsistent, and diverse panoramic images with given unseen text descriptions\nand camera poses.",
            "pdf_url": "http://arxiv.org/pdf/2410.24203v1",
            "published": "2024-10-31 17:57:02+00:00",
            "updated": "2024-10-31 17:57:02+00:00"
        },
        {
            "title": "Invisible Image Watermarks Are Provably Removable Using Generative AI",
            "authors": "Xuandong Zhao, Kexun Zhang, Zihao Su, Saastha Vasan, Ilya Grishchenko, Christopher Kruegel, Giovanni Vigna, Yu-Xiang Wang, Lei Li",
            "summary": "Invisible watermarks safeguard images' copyrights by embedding hidden\nmessages only detectable by owners. They also prevent people from misusing\nimages, especially those generated by AI models. We propose a family of\nregeneration attacks to remove these invisible watermarks. The proposed attack\nmethod first adds random noise to an image to destroy the watermark and then\nreconstructs the image. This approach is flexible and can be instantiated with\nmany existing image-denoising algorithms and pre-trained generative models such\nas diffusion models. Through formal proofs and extensive empirical evaluations,\nwe demonstrate that pixel-level invisible watermarks are vulnerable to this\nregeneration attack. Our results reveal that, across four different pixel-level\nwatermarking schemes, the proposed method consistently achieves superior\nperformance compared to existing attack techniques, with lower detection rates\nand higher image quality. However, watermarks that keep the image semantically\nsimilar can be an alternative defense against our attacks. Our finding\nunderscores the need for a shift in research/industry emphasis from invisible\nwatermarks to semantic-preserving watermarks. Code is available at\nhttps://github.com/XuandongZhao/WatermarkAttacker",
            "pdf_url": "http://arxiv.org/pdf/2306.01953v3",
            "published": "2023-06-02 23:29:28+00:00",
            "updated": "2024-10-31 17:47:21+00:00"
        },
        {
            "title": "AR-Pro: Counterfactual Explanations for Anomaly Repair with Formal Properties",
            "authors": "Xiayan Ji, Anton Xue, Eric Wong, Oleg Sokolsky, Insup Lee",
            "summary": "Anomaly detection is widely used for identifying critical errors and\nsuspicious behaviors, but current methods lack interpretability. We leverage\ncommon properties of existing methods and recent advances in generative models\nto introduce counterfactual explanations for anomaly detection. Given an input,\nwe generate its counterfactual as a diffusion-based repair that shows what a\nnon-anomalous version should have looked like. A key advantage of this approach\nis that it enables a domain-independent formal specification of explainability\ndesiderata, offering a unified framework for generating and evaluating\nexplanations. We demonstrate the effectiveness of our anomaly explainability\nframework, AR-Pro, on vision (MVTec, VisA) and time-series (SWaT, WADI, HAI)\nanomaly datasets. The code used for the experiments is accessible at:\nhttps://github.com/xjiae/arpro.",
            "pdf_url": "http://arxiv.org/pdf/2410.24178v1",
            "published": "2024-10-31 17:43:53+00:00",
            "updated": "2024-10-31 17:43:53+00:00"
        },
        {
            "title": "Ab Initio Structure Solutions from Nanocrystalline Powder Diffraction Data",
            "authors": "Gabe Guo, Tristan Saidi, Maxwell Terban, Michele Valsecchi, Simon JL Billinge, Hod Lipson",
            "summary": "A major challenge in materials science is the determination of the structure\nof nanometer sized objects. Here we present a novel approach that uses a\ngenerative machine learning model based on diffusion processes that is trained\non 45,229 known structures. The model factors both the measured diffraction\npattern as well as relevant statistical priors on the unit cell of atomic\ncluster structures. Conditioned only on the chemical formula and the\ninformation-scarce finite-size broadened powder diffraction pattern, we find\nthat our model, PXRDnet, can successfully solve simulated nanocrystals as small\nas 10 angstroms across 200 materials of varying symmetry and complexity,\nincluding structures from all seven crystal systems. We show that our model can\nsuccessfully and verifiably determine structural candidates four out of five\ntimes, with average error among these candidates being only 7% (as measured by\npost-Rietveld refinement R-factor). Furthermore, PXRDnet is capable of solving\nstructures from noisy diffraction patterns gathered in real-world experiments.\nWe suggest that data driven approaches, bootstrapped from theoretical\nsimulation, will ultimately provide a path towards determining the structure of\npreviously unsolved nano-materials.",
            "pdf_url": "http://arxiv.org/pdf/2406.10796v2",
            "published": "2024-06-16 03:45:03+00:00",
            "updated": "2024-10-31 17:29:37+00:00"
        }
    ]
}