{
    "Physics": [
        {
            "title": "Operational interpretation of the Stabilizer Entropy",
            "authors": "Lennart Bittel, Lorenzo Leone",
            "summary": "Magic-state resource theory is a fundamental framework with far-reaching\napplications in quantum error correction and the classical simulation of\nquantum systems. Recent advances have significantly deepened our understanding\nof magic as a resource across diverse domains, including many-body physics,\nnuclear and particle physics, and quantum chemistry. Central to this progress\nis the stabilizer R\\'enyi entropy, a computable and experimentally accessible\nmagic monotone. Despite its widespread adoption, a rigorous operational\ninterpretation of the stabilizer entropy has remained an open problem. In this\nwork, we provide such an interpretation in the context of quantum property\ntesting. By showing that the stabilizer entropy is the most robust measurable\nmagic monotone, we demonstrate that the Clifford orbit of a quantum state\nbecomes exponentially indistinguishable from Haar-random states, at a rate\ngoverned by the stabilizer entropy $M(\\psi)$ and the number of available\ncopies. This implies that the Clifford orbit forms an approximate state\n$k$-design, with an approximation error $\\Theta(\\exp(-M(\\psi))$. Conversely, we\nestablish that the optimal probability of distinguishing a given quantum state\nfrom the set of stabilizer states is also governed by its stabilizer entropy.\nThese results reveal that the stabilizer entropy quantitatively characterizes\nthe transition from stabilizer states to universal quantum states, thereby\noffering a comprehensive operational perspective of the stabilizer entropy as a\nquantum resource.",
            "pdf_url": "http://arxiv.org/pdf/2507.22883v1",
            "published": "2025-07-30 17:58:40+00:00",
            "updated": "2025-07-30 17:58:40+00:00"
        },
        {
            "title": "Non-periodic Boundary Conditions for Euler Class and Dynamical Signatures of Obstruction",
            "authors": "Osama A. Alsaiari, Adrien Bouhon, Robert-Jan Slager, F. Nur Ünal",
            "summary": "While the landscape of free-fermion phases has drastically been expanded in\nthe last decades, recently novel multi-gap topological phases were proposed\nwhere groups of bands can acquire new invariants such as Euler class. As in\nconventional single-gap topologies, obstruction plays an inherent role that so\nfar has only been incidentally addressed. We here systematically investigate\nthe nuances of the relation between the non-Bravais lattice configurations and\nthe Brillouin zone boundary conditions (BZBCs) for any number of dimensions.\nClarifying the nomenclature, we provide a general periodictization recipe to\nobtain a gauge with an almost Brillouin-zone-periodic Bloch Hamiltonian both\ngenerally and upon imposing a reality condition on Hamiltonians for Euler\nclass. Focusing on three-band $\\mathcal{C}_2$ symmetric Euler systems in two\ndimensions as a guiding example, we present a procedure to enumerate the\npossible lattice configurations, and thus the unique BZBCs possibilities. We\nestablish a comprehensive classification for the identified BZBC patterns\naccording to the parity constraints they impose on the Euler invariant,\nhighlighting how it extends to more bands and higher dimensions. Moreover, by\nbuilding upon previous work utilizing Hopf maps, we illustrate physical\nconsequences of non-trivial BZBCs in the quench dynamics of non-Bravais lattice\nEuler systems, reflecting the parity of the Euler invariant. We numerically\nconfirm our results and corresponding observable signatures, and discuss\npossible experimental implementations. Our work presents a general framework to\nstudy the role of non-trivial boundary conditions and obstructions on multi-gap\ntopology that can be employed for arbitrary number bands or in higher\ndimensions.",
            "pdf_url": "http://arxiv.org/pdf/2507.22874v1",
            "published": "2025-07-30 17:49:19+00:00",
            "updated": "2025-07-30 17:49:19+00:00"
        },
        {
            "title": "Non-diagonal contributions to $ZγV^\\ast$ vertex, polarizations and bounds on $Z\\overline{t}q$ couplings",
            "authors": "A. I. Hernández-Juárez, G. Tavares-Velasco, R. Gaitán",
            "summary": "We study the flavor-changing neutral current contributions to the trilinear\nneutral gauge boson couplings $Z\\gamma V^\\ast$ ($V=Z$, $\\gamma$) at the\none-loop level. Only the $CP$-conserving form factor $h_3^Z$ is induced, with\nthe relevant contributions arising from top quark couplings. To our numerical\nanalysis, constraints on the $Z\\overline{t}q$ ($q=c$, $u$) couplings are\nobtained from current LHC data, leading to bounds of\n$|g_{\\text{V}}^{tu}|\\text{,}|g_{\\text{A}}^{tu}|\\leqslant 0.007$ and\n$|g_{\\text{V}}^{tc}|\\text{,}|g_{\\text{A}}^{tc}|\\leqslant 0.0095$ for the vector\nand axial couplings. The new contributions to the $h_3^Z$ form factor are of\norder $10^{-7}$. Furthermore, we analyze the polarized partial decay widths of\nthe $V^\\ast\\rightarrow Z\\gamma$ process, and a new type of left-right asymmetry\nis also discussed. We find that in the presence of new physics, the polarized\n$\\Gamma(V^\\ast\\rightarrow Z\\gamma)$ exhibits significant deviations from the SM\nprediction, resulting in a non-zero asymmetry.",
            "pdf_url": "http://arxiv.org/pdf/2203.16819v3",
            "published": "2022-03-31 06:01:29+00:00",
            "updated": "2025-07-30 17:35:09+00:00"
        },
        {
            "title": "Demonstration of the rotational viscosity transfer across scales in Navier-Stokes turbulence",
            "authors": "Satori Tsuzuki",
            "summary": "Mechanical effects that span multiple physical scales -- such as the\ninfluence of vanishing molecular viscosity on large-scale flow structures under\nspecific conditions -- play a critical role in real fluid systems. The spin\nangular momentum-conserving Navier--Stokes equations offer a theoretical\nframework for describing such multiscale fluid dynamics by decomposing total\nangular momentum into bulk and intrinsic spin components. However, this\nframework still assumes locally non-solid rotational flows, a condition that\nremains empirically unverified. This study addresses such unvalidated\nassumptions intrinsic to the model and extends it within the framework of\nturbulence hierarchy theory. The theory suggests that under certain conditions,\nsmall-scale structures may transfer to larger scales through the rotational\nviscosity. To verify this, we conducted spectral analyses of freely decaying\ntwo-dimensional turbulence initialized with a vortex-concentrated distribution.\nThe results indicate that rotational viscosity exhibits interscale transfer\nbehavior, revealing a new mechanism by which order can propagate from small to\nlarge scales in Navier--Stokes turbulence.",
            "pdf_url": "http://arxiv.org/pdf/2504.14114v2",
            "published": "2025-04-19 00:13:24+00:00",
            "updated": "2025-07-30 17:20:16+00:00"
        },
        {
            "title": "Axisymmetric Gyrokinetic Simulation of ASDEX-Upgrade Scrape-off Layer Using a Conservative Implicit BGK Collision Operator",
            "authors": "D. Liu, J. Juno, G. W. Hammett, A. Hakim, A. Shukla, M. Francisquez",
            "summary": "Collisions play an important role in turbulence and transport of fusion\nplasmas. For kinetic simulations, as the collisionality increases in the domain\nof interest, the size of the time step to resolve the collisional physics can\nbecome overly restrictive in an explicit time integration scheme, leading to\nhigh computational cost. With the aim of overcoming such restriction, we have\nimplemented an implicit Bhatnagar-Gross-Krook (BGK) collision operator for use\nin the discontinuous Galerkin (DG) full-f gyrokinetic solver within the Gkeyll\nframework, which, when combined with Gkeyll's traditional explicit time\nintegrator for collisionless advection, can significantly increase the time\nstep in gyrokinetic simulations of highly collisional regimes. To ensure\nconservation of density, momentum, and energy, we utilize an iterative scheme\nto correct the discretized approximation to the equilibrium Maxwellian\ndistribution to which the BGK collision operator relaxes. We have further\ngeneralized the BGK infrastructure, both the implicit scheme and the correction\nroutine, to handle cross species collisions. This improved implicit and\nconservative BGK operator is benchmarked against the more accurate but more\ncomputationally expensive Lenard-Bernstein-Dougherty (LBD) operator which has\nbeen utilized in prior studies with Gkeyll. The implicit BGK operator enables\n2D axisymmetric simulations of the ASDEX-Upgrade scrape-off layer to run 56\ntimes faster to completion than the simulations with the LBD operator, because\nthe BGK operator is more robust and converges at a lower resolution than is\nrequired by the LBD operator. Additionally, in this more collisional limit, we\ndemonstrate that the results of our simulations utilizing the implicit BGK\noperator agreed well with simulations utilizing the more computationally\nexpensive LBD operator.",
            "pdf_url": "http://arxiv.org/pdf/2507.22821v1",
            "published": "2025-07-30 16:36:30+00:00",
            "updated": "2025-07-30 16:36:30+00:00"
        },
        {
            "title": "Signatures of Quantum Gravity in Gravitational Wave Memory",
            "authors": "Nils Deppe, Lavinia Heisenberg, Lawrence E. Kidder, David Maibach, Sizheng Ma, Jordan Moxon, Kyle C. Nelli, William Throwe, Nils L. Vu",
            "summary": "We study the impact of quantum corrections to gravitational waveforms on the\ngravitational wave memory effect. In certain quantum gravity theories and\nsemi-classical frameworks, black holes (or other exotic compact objects)\nexhibit reflective properties that cause quasi-normal modes of a binary merger\nwaveform to partially reflect off the horizon. If these reflections reach the\ndetector, the measured gravitational wave signal may show echo-like features\nfollowing the initial ringdown phase. Detecting such echoes, or their indirect\nsignatures, would offer compelling evidence for the quantum nature of black\nholes. Given that direct detection of echoes requires finely tuned waveform\ntemplates, exploring alternative imprints of this phenomenon is crucial. In\nthis work, we pursue this goal by calculating corrections to the null memory\narising from echo-like features, formulated in terms of the Newman-Penrose\nscalar ${\\Psi}_0$. We demonstrate that the morphology of the resulting features\nis model-independent rendering them conceptually much easier to detect in real\ninterferometer data than the raw echo. The corresponding signal-to-noise ratio\nof echo-induced features appearing in the gravitational wave memory is\nestimated subsequently. We further compute the physical fluxes associated to\nthe echo at both the black hole horizon and null infinity and identify novel\ndistinguishing features of the underlying reflectivity models in measurement\ndata.",
            "pdf_url": "http://arxiv.org/pdf/2502.20584v2",
            "published": "2025-02-27 22:57:38+00:00",
            "updated": "2025-07-30 16:25:17+00:00"
        },
        {
            "title": "Hop-Decorate: An Automated Atomistic Workflow for Generating Defect Transport Data in Chemically Complex Materials",
            "authors": "Peter Hatton, Blas Pedro Uberuaga, Danny Perez",
            "summary": "Chemically complex materials (CCMs) exhibit extraordinary functional\nproperties but pose significant challenges for atomistic modeling due to their\nvast configurational heterogeneity. We introduce Hop-Decorate (HopDec), a\nhigh-throughput, Python-based atomistic workflow that automates the generation\nof defect transport data in CCMs. HopDec integrates accelerated molecular\ndynamics with a novel redecoration algorithm to efficiently sample migration\npathways across chemically diverse local environments. The method constructs a\ndefect-state graph in which transitions are associated with distributions of\nkinetic and thermodynamic parameters, enabling direct input into kinetic Monte\nCarlo and other mesoscale models. We demonstrate HopDec's capabilities through\napplications to a Cu-Ni alloy and the spinel oxide (Fe,Ni)Cr2O4, revealing\nsimple predictive relationships in the former and complex migration behaviors\ndriven by cation disorder in the latter. These results highlight HopDec's\nability to extract physically meaningful trends and support reduced-order or\nmachine-learned models of defect kinetics, bridging atomic-scale simulations\nand mesoscale predictions in complex material systems.",
            "pdf_url": "http://arxiv.org/pdf/2506.16835v2",
            "published": "2025-06-20 08:39:29+00:00",
            "updated": "2025-07-30 16:18:58+00:00"
        },
        {
            "title": "Measurement of the Total Compton Scattering Cross Section between 6.5 and 11 GeV",
            "authors": "GlueX Collaboration, F. Afzal, C. S. Akondi, M. Albrecht, M. Amaryan, S. Arrigo, V. Arroyave, A. Asaturyan, A. Austregesilo, Z. Baldwin, F. Barbosa, J. Barlow, E. Barriga, R. Barsotti, D. Barton, V. Baturin, V. V. Berdnikov, T. Black, W. Boeglin, M. Boer, W. J. Briscoe, T. Britton, R. Brunner, S. Cao, E. Chudakov, G. Chung, P. L. Cole, O. Cortes, V. Crede, M. M. Dalton, D. Darulis, A. Deur, S. Dobbs, A. Dolgolenko, M. Dugger, R. Dzhygadlo, D. Ebersole, M. Edo, T. Erbora, P. Eugenio, A. Fabrizi, C. Fanelli, S. Fang, M. Fritsch, S. Furletov, L. Gan, H. Gao, A. Gardner, A. Gasparian, D. I. Glazier, C. Gleason, V. S. Goryachev, B. Grube, J. Guo, L. Guo, J. Hernandez, K. Hernandez, N. D. Hoffman, D. Hornidge, G. M. Huber, P. Hurck, W. Imoehl, D. G. Ireland, M. M. Ito, I. Jaegle, N. S. Jarvis, T. Jeske, M. Jing, R. T. Jones, V. Kakoyan, G. Kalicy, V. Khachatryan, C. Kourkoumelis, A. LaDuke, I. Larin, D. Lawrence, D. I. Lersch, H. Li, B. Liu, K. Livingston, L. Lorenti, V. Lyubovitskij, A. Mahmood, H. Marukyan, V. Matveev, M. McCaughan, M. McCracken, C. A. Meyer, R. Miskimen, R. E. Mitchell, K. Mizutani, P. Moran, V. Neelamana, L. Ng, E. Nissen, S. Orešić, A. I. Ostrovidov, Z. Papandreou, C. Paudel, R. Pedroni, L. Pentchev, K. J. Peters, E. Prather, L. Puthiya Veetil, S. Rakshit, J. Reinhold, A. Remington, B. G. Ritchie, J. Ritman, G. Rodriguez, D. Romanov, K. Saldana, C. Salgado, S. Schadmand, A. M. Schertz, K. Scheuer, A. Schick, A. Schmidt, R. A. Schumacher, J. Schwiening, M. Scott, N. Septian, P. Sharp, V. J. Shen, X. Shen, M. R. Shepherd, J. Sikes, H. Singh, A. Smith, E. S. Smith, D. I. Sober, A. Somov, S. Somov, J. R. Stevens, I. I. Strakovsky, B. Sumner, K. Suresh, V. V. Tarasov, S. Taylor, A. Teymurazyan, A. Thiel, M. Thomson, T. Viducic, T. Whitlatch, N. Wickramaarachchi, Y. Wunderlich, B. Yu, J. Zarling, Z. Zhang, X. Zhou, B. Zihlmann",
            "summary": "The total cross section for Compton scattering off atomic electrons,\n$\\gamma+e\\rightarrow\\gamma'+e'$, was measured using photons with energies\nbetween 6.5 and 11.1 GeV incident on a $^9$Be target as part of the PrimEx-eta\nexperiment in Hall D at Jefferson Lab. This is the first measurement of this\nfundamental QED process within this energy range. The total uncertainties of\nthe cross section, combining the statistical and systematic components in\nquadrature, averaged to 3.4% across all energy bins. This not only demonstrates\nthe capability of this experimental setup to perform precision cross-section\nmeasurements at forward angles but also allows us to compare with\nstate-of-the-art QED calculations.",
            "pdf_url": "http://arxiv.org/pdf/2505.07994v2",
            "published": "2025-05-12 18:48:07+00:00",
            "updated": "2025-07-30 16:07:03+00:00"
        },
        {
            "title": "Amorphous Solid Model of Vectorial Hopfield Neural Networks",
            "authors": "F. Gallavotti, A. Zaccone",
            "summary": "We present a vectorial extension of the Hopfield associative memory model\ninspired by the theory of amorphous solids, where binary neural states are\nreplaced by unit vectors $\\mathbf{s}_i \\in \\mathbb{R}^3$ on the sphere $S^2$.\nThe generalized Hebbian learning rule creates a block-structured weight matrix\nthrough outer products of stored pattern vectors, analogous to the Hessian\nmatrix structure in amorphous solids. We demonstrate that this model exhibits\nquantifiable structural properties characteristic of disordered materials:\nenergy landscapes with deep minima for stored patterns versus random\nconfigurations (energy gaps $\\sim 7$ units), strongly anisotropic correlations\nencoded in the weight matrix (anisotropy ratios $\\sim 10^2$), and\norder-disorder transitions controlled by the pattern density $\\gamma = P/(N\n\\cdot d)$. The enhanced memory capacity ($\\gamma_c \\approx 0.55$ for a\nfully-connected network) compared to binary networks ($\\gamma_c \\approx 0.138$)\nand the emergence of orientational correlations establish connections between\nassociative memory mechanisms and amorphous solid physics, particularly in\nsystems with continuous orientational degrees of freedom. We also unveil the\nscaling with the coordination number $Z$ of the memory capacity: $\\gamma_c \\sim\n(Z-6)$ from the isostatic point $Z_c =6$ of the 3D elastic network, which\nclosely mirrors the scaling of the shear modulus $G \\sim (Z-6)$ in 3D\ncentral-force spring networks.",
            "pdf_url": "http://arxiv.org/pdf/2507.22787v1",
            "published": "2025-07-30 15:51:54+00:00",
            "updated": "2025-07-30 15:51:54+00:00"
        },
        {
            "title": "General quantum computation on photons assisted with double single-sided cavity system",
            "authors": "Jiu-Ming Li, Jun-Yan Liu, Yuan-Yuan Liu, Xiao-Ming Xiu, Shao-Ming Fei",
            "summary": "We propose a physical system consisting of two optical cavities and a\ntwo-level system (TLS), which can be viewed as a double single-sided cavity\nsystem. The two cavities are crossed each other in a mutually perpendicular way\nand are both single-sided. The TLS is coupled to the two cavities. The\nuniversal input-output relation of the system, the reflection and transmission\ncoefficients are derived by exploiting the probability amplitude method. Then\nby using the nitrogen-vacancy center instead of the TLS, we generate the\ncontrolled-phase gate and the controlled-controlled-phase gate on the photon\nqubits, with simple protocols that can be accomplished in both weak and strong\ncoupling regimes. The protocols are shown to give rise to high fidelities and\ngate efficiencies.",
            "pdf_url": "http://arxiv.org/pdf/2507.22773v1",
            "published": "2025-07-30 15:36:38+00:00",
            "updated": "2025-07-30 15:36:38+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "G-Core: A Simple, Scalable and Balanced RLHF Trainer",
            "authors": "Junyu Wu, Weiming Chang, Xiaotao Liu, Guanyou He, Haoqiang Hong, Boqi Liu, Hongtao Tian, Tao Yang, Yunsheng Shi, Feng Lin, Ting Yao",
            "summary": "Reinforcement Learning from Human Feedback (RLHF) has become an increasingly\npopular paradigm for training large language models (LLMs) and diffusion\nmodels. While existing RLHF training systems have enabled significant progress,\nthey often face challenges in scaling to multi-modal and diffusion workflows\nand adapting to dynamic workloads. In particular, current approaches may\nencounter limitations in controller scalability, flexible resource placement,\nand efficient orchestration when handling complex RLHF pipelines, especially in\nscenarios involving dynamic sampling or generative reward modeling. In this\npaper, we present \\textbf{G-Core}, a simple, scalable, and balanced RLHF\ntraining framework designed to address these challenges. G-Core introduces a\nparallel controller programming model, enabling flexible and efficient\norchestration of complex RLHF workflows without the bottlenecks of a single\ncentralized controller. Furthermore, we propose a dynamic placement schema that\nadaptively partitions resources and schedules workloads, significantly reducing\nhardware idle time and improving utilization, even under highly variable\ntraining conditions. G-Core has successfully trained models that support WeChat\nproduct features serving a large-scale user base, demonstrating its\neffectiveness and robustness in real-world scenarios. Our results show that\nG-Core advances the state of the art in RLHF training, providing a solid\nfoundation for future research and deployment of large-scale, human-aligned\nmodels.",
            "pdf_url": "http://arxiv.org/pdf/2507.22789v1",
            "published": "2025-07-30 15:55:08+00:00",
            "updated": "2025-07-30 15:55:08+00:00"
        },
        {
            "title": "The Effect of Stochasticity in Score-Based Diffusion Sampling: a KL Divergence Analysis",
            "authors": "Bernardo P. Schaeffer, Ricardo M. S. Rosa, Glauco Valle",
            "summary": "Sampling in score-based diffusion models can be performed by solving either a\nreverse-time stochastic differential equation (SDE) parameterized by an\narbitrary time-dependent stochasticity parameter or a probability flow ODE,\ncorresponding to the stochasticity parameter set to zero. In this work, we\nstudy the effect of this stochasticity on the generation process through bounds\non the Kullback-Leibler (KL) divergence, complementing the analysis with\nnumerical and analytical examples. Our main results apply to linear forward\nSDEs with additive noise and Lipschitz-continuous score functions, and quantify\nhow errors from the prior distribution and score approximation propagate under\ndifferent choices of the stochasticity parameter. The theoretical bounds are\nderived using log-Sobolev inequalities for the marginals of the forward\nprocess, which enable a more effective control of the KL divergence decay along\nsampling. For exact score functions, we find that stochasticity acts as an\nerror-correcting mechanism, decreasing KL divergence along the sampling\ntrajectory. For an approximate score function, there is a trade-off between\nerror correction and score error amplification, so that stochasticity can\neither improve or worsen the performance, depending on the structure of the\nscore error. Numerical experiments on simple datasets and a fully analytical\nexample are included to illustrate and enlighten the theoretical results.",
            "pdf_url": "http://arxiv.org/pdf/2506.11378v2",
            "published": "2025-06-13 01:01:07+00:00",
            "updated": "2025-07-30 15:34:07+00:00"
        },
        {
            "title": "Ultra3D: Efficient and High-Fidelity 3D Generation with Part Attention",
            "authors": "Yiwen Chen, Zhihao Li, Yikai Wang, Hu Zhang, Qin Li, Chi Zhang, Guosheng Lin",
            "summary": "Recent advances in sparse voxel representations have significantly improved\nthe quality of 3D content generation, enabling high-resolution modeling with\nfine-grained geometry. However, existing frameworks suffer from severe\ncomputational inefficiencies due to the quadratic complexity of attention\nmechanisms in their two-stage diffusion pipelines. In this work, we propose\nUltra3D, an efficient 3D generation framework that significantly accelerates\nsparse voxel modeling without compromising quality. Our method leverages the\ncompact VecSet representation to efficiently generate a coarse object layout in\nthe first stage, reducing token count and accelerating voxel coordinate\nprediction. To refine per-voxel latent features in the second stage, we\nintroduce Part Attention, a geometry-aware localized attention mechanism that\nrestricts attention computation within semantically consistent part regions.\nThis design preserves structural continuity while avoiding unnecessary global\nattention, achieving up to 6.7x speed-up in latent generation. To support this\nmechanism, we construct a scalable part annotation pipeline that converts raw\nmeshes into part-labeled sparse voxels. Extensive experiments demonstrate that\nUltra3D supports high-resolution 3D generation at 1024 resolution and achieves\nstate-of-the-art performance in both visual fidelity and user preference.",
            "pdf_url": "http://arxiv.org/pdf/2507.17745v2",
            "published": "2025-07-23 17:57:16+00:00",
            "updated": "2025-07-30 15:17:22+00:00"
        },
        {
            "title": "Inferring biological processes with intrinsic noise from cross-sectional data",
            "authors": "Suryanarayana Maddu, Victor Chardès, Michael. J. Shelley",
            "summary": "Inferring dynamical models from data continues to be a significant challenge\nin computational biology, especially given the stochastic nature of many\nbiological processes. We explore a common scenario in omics, where\nstatistically independent cross-sectional samples are available at a few time\npoints, and the goal is to infer the underlying diffusion process that\ngenerated the data. Existing inference approaches often simplify or ignore\nnoise intrinsic to the system, compromising accuracy for the sake of\noptimization ease. We circumvent this compromise by inferring the phase-space\nprobability flow that shares the same time-dependent marginal distributions as\nthe underlying stochastic process. Our approach, probability flow inference\n(PFI), disentangles force from intrinsic stochasticity while retaining the\nalgorithmic ease of ODE inference. Analytically, we prove that for\nOrnstein-Uhlenbeck processes the regularized PFI formalism yields a unique\nsolution in the limit of well-sampled distributions. In practical applications,\nwe show that PFI enables accurate parameter and force estimation in\nhigh-dimensional stochastic reaction networks, and that it allows inference of\ncell differentiation dynamics with molecular noise, outperforming\nstate-of-the-art approaches.",
            "pdf_url": "http://arxiv.org/pdf/2410.07501v2",
            "published": "2024-10-10 00:33:25+00:00",
            "updated": "2025-07-30 14:06:57+00:00"
        },
        {
            "title": "Equivariant Flow Matching for Point Cloud Assembly",
            "authors": "Ziming Wang, Nan Xue, Rebecka Jörnsten",
            "summary": "The goal of point cloud assembly is to reconstruct a complete 3D shape by\naligning multiple point cloud pieces. This work presents a novel equivariant\nsolver for assembly tasks based on flow matching models. We first theoretically\nshow that the key to learning equivariant distributions via flow matching is to\nlearn related vector fields. Based on this result, we propose an assembly\nmodel, called equivariant diffusion assembly (Eda), which learns related vector\nfields conditioned on the input pieces. We further construct an equivariant\npath for Eda, which guarantees high data efficiency of the training process.\nOur numerical results show that Eda is highly competitive on practical\ndatasets, and it can even handle the challenging situation where the input\npieces are non-overlapped.",
            "pdf_url": "http://arxiv.org/pdf/2505.21539v2",
            "published": "2025-05-24 14:27:20+00:00",
            "updated": "2025-07-30 13:55:45+00:00"
        }
    ]
}