{
    "Physics": [
        {
            "title": "Axionic quantum criticality of generalized Weyl semimetals",
            "authors": "Gabriel Malave, Rodrigo Soto-Garrido, Vladimir Juricic, Bitan Roy",
            "summary": "We formulate a field theoretic description for $d$-dimensional interacting\nnodal semimetals, featuring dispersion that scales with the linear ($n$th)\npower of momentum along $d_L$ ($d_M$) mutually orthogonal directions around a\nfew isolated points in the reciprocal space with $d_L+d_M=d$, and residing at\nthe brink of isotropic insulation, described by $N_b$-component bosonic order\nparameter fields. The resulting renormalization group (RG) procedure, tailored\nto capture the associated quantum critical phenomena, is controlled by a\n`small' parameter $\\epsilon=2-d_M$ and $1/N_f$, where $N_f$ is the number of\nidentical fermion copies (flavor number). When applied to three-dimensional\ninteracting general Weyl semimetals ($d_L=1$ and $d_M=2$), characterized by the\nAbelian monopole charge $n>1$, living at the shore of the axionic insulation\n($N_b=2$), a leading order RG analysis suggests Gaussian nature of the\nunderlying quantum phase transition, around which the critical exponents assume\nmean-field values. A traditional field theoretic RG analysis yields same\noutcomes for simple Weyl semimetals ($n=1$, $d_L=3$, and $d_M=0$).\nConsequently, emergent marginal Fermi liquids showcase only logarithmic\ncorrections to physical observables at intermediate scales of measurements.",
            "pdf_url": "http://arxiv.org/pdf/2412.09609v1",
            "published": "2024-12-12 18:59:34+00:00",
            "updated": "2024-12-12 18:59:34+00:00"
        },
        {
            "title": "Next-to-leading order evolution of structure functions without PDFs",
            "authors": "Tuomas Lappi, Heikki Mäntysaari, Hannu Paukkunen, Mirja Tevio",
            "summary": "We formulate and numerically solve the\nDokshitzer-Gribov-Lipatov-Altarelli-Parisi~(DGLAP) evolution equations at\nnext-to-leading order in perturbation theory directly for a basis of 6\nphysical, observable structure functions in deeply inelastic scattering. By\nexpressing the evolution in the physical basis one evades the factorization\nscale and scheme dependence. Working in terms of observable quantities, rather\nthan parametrizing and fitting unobservable parton distribution functions\n(PDFs), provides an unambiguous way to confront predictions of perturbative\nQuantum Chromodynamics with experimental measurements. We compare numerical\nresults for the DGLAP evolution for structure functions in the physical basis\nto the conventional evolution with PDFs.",
            "pdf_url": "http://arxiv.org/pdf/2412.09589v1",
            "published": "2024-12-12 18:56:09+00:00",
            "updated": "2024-12-12 18:56:09+00:00"
        },
        {
            "title": "SimAvatar: Simulation-Ready Avatars with Layered Hair and Clothing",
            "authors": "Xueting Li, Ye Yuan, Shalini De Mello, Gilles Daviet, Jonathan Leaf, Miles Macklin, Jan Kautz, Umar Iqbal",
            "summary": "We introduce SimAvatar, a framework designed to generate simulation-ready\nclothed 3D human avatars from a text prompt. Current text-driven human avatar\ngeneration methods either model hair, clothing, and the human body using a\nunified geometry or produce hair and garments that are not easily adaptable for\nsimulation within existing simulation pipelines. The primary challenge lies in\nrepresenting the hair and garment geometry in a way that allows leveraging\nestablished prior knowledge from foundational image diffusion models (e.g.,\nStable Diffusion) while being simulation-ready using either physics or neural\nsimulators. To address this task, we propose a two-stage framework that\ncombines the flexibility of 3D Gaussians with simulation-ready hair strands and\ngarment meshes. Specifically, we first employ three text-conditioned 3D\ngenerative models to generate garment mesh, body shape and hair strands from\nthe given text prompt. To leverage prior knowledge from foundational diffusion\nmodels, we attach 3D Gaussians to the body mesh, garment mesh, as well as hair\nstrands and learn the avatar appearance through optimization. To drive the\navatar given a pose sequence, we first apply physics simulators onto the\ngarment meshes and hair strands. We then transfer the motion onto 3D Gaussians\nthrough carefully designed mechanisms for each body part. As a result, our\nsynthesized avatars have vivid texture and realistic dynamic motion. To the\nbest of our knowledge, our method is the first to produce highly realistic,\nfully simulation-ready 3D avatars, surpassing the capabilities of current\napproaches.",
            "pdf_url": "http://arxiv.org/pdf/2412.09545v1",
            "published": "2024-12-12 18:35:26+00:00",
            "updated": "2024-12-12 18:35:26+00:00"
        },
        {
            "title": "Les Houches lectures on two-dimensional gravity and holography",
            "authors": "Gustavo J. Turiaci",
            "summary": "Lecture notes prepared for the Les Houches school \"Quantum Geometry:\nMathematical Methods for Gravity, Gauge Theories and Non-Perturbative Physics\"\nthat took place during the summer 2024. We cover the techniques to perform the\nexact gravitational path integral of two-dimensional dilaton-gravity, and\nsupergravity, over spacetimes with arbitrary topology, with an application to\nblack holes. We discuss the connection with random matrix models and moduli\nspaces of hyperbolic surfaces briefly, since those concepts were covered in\nother lectures of the school.",
            "pdf_url": "http://arxiv.org/pdf/2412.09537v1",
            "published": "2024-12-12 18:28:47+00:00",
            "updated": "2024-12-12 18:28:47+00:00"
        },
        {
            "title": "Interpolating amplitudes",
            "authors": "Víctor Bresó, Gudrun Heinrich, Vitaly Magerya, Anton Olsson",
            "summary": "While the calculation of scattering amplitudes at higher orders in\nperturbation theory has reached a high degree of maturity, their usage to\nproduce physical predictions within Monte Carlo programs is often hampered by\nthe slow evaluation of the multi-loop amplitudes, especially so for amplitudes\ncalculated numerically. As a remedy, interpolation frameworks have been\nsuccessfully used in lower dimensions, but for higher-dimensional problems,\nsuch as the five dimensions of a 2 -> 3 phase space, efficient and reliable\nsolutions are sparse.\n  This work aims to fill this gap by reviewing state-of-the-art interpolation\nmethods, and by assessing their performance for concrete examples drawn from\nparticle physics. Specifically, we investigate interpolation methods based on\npolynomials, splines, spatially adaptive sparse grids, and neural networks\n(multilayer perceptron and Lorentz-Equivariant Geometric Algebra Transformer).\nOur additional aim is to motivate further studies of the interpolation of\nscattering amplitudes among both physicists and mathematicians.",
            "pdf_url": "http://arxiv.org/pdf/2412.09534v1",
            "published": "2024-12-12 18:23:55+00:00",
            "updated": "2024-12-12 18:23:55+00:00"
        },
        {
            "title": "High Precision Binding Energies from Physics Informed Machine Learning",
            "authors": "Ian Bentley, James Tedder, Marwan Gebran, Ayan Paul",
            "summary": "Twelve physics informed machine learning models have been trained to model\nbinding energy residuals. Our approach begins with determining the difference\nbetween measured experimental binding energies and three different mass models.\nThen four machine learning approaches are used to train on each energy\ndifference. The most successful ML technique both in interpolation and\nextrapolation is the least squares boosted ensemble of trees. The best model\nresulting from that technique utilizes eight physical features to model the\ndifference between experimental atomic binding energy values in AME 2012 and\nthe Duflo Zucker mass model. This resulted in a model that fit the training\ndata with a standard deviation of 17 keV and that has a standard deviation of\n92 keV when compared all of the values in the AME 2020. The extrapolation\ncapability of each model is discussed and the accuracy of predicting new mass\nmeasurements has also been tested.",
            "pdf_url": "http://arxiv.org/pdf/2412.09504v1",
            "published": "2024-12-12 17:54:34+00:00",
            "updated": "2024-12-12 17:54:34+00:00"
        },
        {
            "title": "Loss function to optimise signal significance in particle physics",
            "authors": "Jai Bardhan, Cyrin Neeraj, Subhadip Mitra, Tanumoy Mandal",
            "summary": "We construct a surrogate loss to directly optimise the significance metric\nused in particle physics. We evaluate our loss function for a simple event\nclassification task using a linear model and show that it produces decision\nboundaries that change according to the cross sections of the processes\ninvolved. We find that the models trained with the new loss have higher signal\nefficiency for similar values of estimated signal significance compared to ones\ntrained with a cross-entropy loss, showing promise to improve sensitivity of\nparticle physics searches at colliders.",
            "pdf_url": "http://arxiv.org/pdf/2412.09500v1",
            "published": "2024-12-12 17:48:57+00:00",
            "updated": "2024-12-12 17:48:57+00:00"
        },
        {
            "title": "Framework for the Forced Soliton Equation: Regularization, Numerical Solutions, and Perturbation Theory",
            "authors": "Zachary J. Allamon, Quentin A. Hales, Andrew B. Royston, Douglas L. Rutledge, Erica A. Yozie",
            "summary": "The forced soliton equation is the starting point for semiclassical\ncomputations with solitons away from the small momentum transfer regime. This\npaper develops necessary analytical and numerical tools for analyzing solutions\nto the forced soliton equation in the context of two-dimensional models with\nkinks. Results include a finite degree of freedom regularization of soliton\nsector physics based on periodic and anti-periodic lattice models, a detailed\nanalysis of numerical solutions, and the development of perturbation theory in\nthe soliton momentum transfer to mass ratio Delta P/M. Numerical solutions at\nlarge transfer, greater or similar to the soliton mass, are capable of\nexhibiting, in a smooth and controlled fashion, extreme phenomena such as\nsoliton-antisoliton pair creation and superluminal collective coordinate\nvelocities, which we investigate.",
            "pdf_url": "http://arxiv.org/pdf/2412.09487v1",
            "published": "2024-12-12 17:37:54+00:00",
            "updated": "2024-12-12 17:37:54+00:00"
        },
        {
            "title": "Realization of strongly-interacting Meissner phases in large bosonic flux ladders",
            "authors": "Alexander Impertro, SeungJung Huh, Simon Karch, Julian F. Wienand, Immanuel Bloch, Monika Aidelsburger",
            "summary": "Periodically driven quantum systems can realize novel phases of matter that\nare not present in time-independent Hamiltonians. One important application is\nthe engineering of synthetic gauge fields, which opens the realm of topological\nmany-body physics to neutral atom quantum simulators. In this work, we leverage\na neutral atom quantum simulator to experimentally realize the\nstrongly-interacting Mott-Meissner phase in large-scale, bosonic flux ladders\nwith 48 sites at half filling. By combining quantum gas microscopy with local\nbasis rotations, we reveal the emerging equilibrium particle currents with\nlocal resolution across large systems. We find chiral currents exhibiting a\ncharacteristic interaction scaling, providing direct experimental evidence of\nthe interacting Mott-Meissner phase. Moreover, we benchmark density\ncorrelations with numerical simulations and find that the effective temperature\nof the system is on the order of the tunnel coupling. Our results demonstrate\nthe feasibility of scaling periodically driven quantum systems to large,\nstrongly correlated phases, paving the way for exploring topological quantum\nmatter with single-atom resolution and control.",
            "pdf_url": "http://arxiv.org/pdf/2412.09481v1",
            "published": "2024-12-12 17:27:49+00:00",
            "updated": "2024-12-12 17:27:49+00:00"
        },
        {
            "title": "Finite-PINN: A Physics-Informed Neural Network Architecture for Solving Solid Mechanics Problems with General Geometries",
            "authors": "Haolin Li, Yuyang Miao, Zahra Sharif Khodaei, M. H. Aliabadi",
            "summary": "PINN models have demonstrated impressive capabilities in addressing fluid PDE\nproblems, and their potential in solid mechanics is beginning to emerge. This\nstudy identifies two key challenges when using PINN to solve general solid\nmechanics problems. These challenges become evident when comparing the\nlimitations of PINN with the well-established numerical methods commonly used\nin solid mechanics, such as the finite element method (FEM). Specifically: a)\nPINN models generate solutions over an infinite domain, which conflicts with\nthe finite boundaries typical of most solid structures; and b) the solution\nspace utilised by PINN is Euclidean, which is inadequate for addressing the\ncomplex geometries often present in solid structures.\n  This work proposes a PINN architecture used for general solid mechanics\nproblems, termed the Finite-PINN model. The proposed model aims to effectively\naddress these two challenges while preserving as much of the original\nimplementation of PINN as possible. The unique architecture of the Finite-PINN\nmodel addresses these challenges by separating the approximation of stress and\ndisplacement fields, and by transforming the solution space from the\ntraditional Euclidean space to a Euclidean-topological joint space. Several\ncase studies presented in this paper demonstrate that the Finite-PINN model\nprovides satisfactory results for a variety of problem types, including both\nforward and inverse problems, in both 2D and 3D contexts. The developed\nFinite-PINN model offers a promising tool for addressing general solid\nmechanics problems, particularly those not yet well-explored in current\nresearch.",
            "pdf_url": "http://arxiv.org/pdf/2412.09453v1",
            "published": "2024-12-12 17:06:21+00:00",
            "updated": "2024-12-12 17:06:21+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Training Free Guided Flow Matching with Optimal Control",
            "authors": "Luran Wang, Chaoran Cheng, Yizhen Liao, Yanru Qu, Ge Liu",
            "summary": "Controlled generation with pre-trained Diffusion and Flow Matching models has\nvast applications. One strategy for guiding ODE-based generative models is\nthrough optimizing a target loss $R(x_1)$ while staying close to the prior\ndistribution. Along this line, some recent work showed the effectiveness of\nguiding flow model by differentiating through its ODE sampling process. Despite\nthe superior performance, the theoretical understanding of this line of methods\nis still preliminary, leaving space for algorithm improvement. Moreover,\nexisting methods predominately focus on Euclidean data manifold, and there is a\ncompelling need for guided flow methods on complex geometries such as SO(3),\nwhich prevails in high-stake scientific applications like protein design. We\npresent OC-Flow, a general and theoretically grounded training-free framework\nfor guided flow matching using optimal control. Building upon advances in\noptimal control theory, we develop effective and practical algorithms for\nsolving optimal control in guided ODE-based generation and provide a systematic\ntheoretical analysis of the convergence guarantee in both Euclidean and SO(3).\nWe show that existing backprop-through-ODE methods can be interpreted as\nspecial cases of Euclidean OC-Flow. OC-Flow achieved superior performance in\nextensive experiments on text-guided image manipulation, conditional molecule\ngeneration, and all-atom peptide design.",
            "pdf_url": "http://arxiv.org/pdf/2410.18070v2",
            "published": "2024-10-23 17:53:11+00:00",
            "updated": "2024-12-12 17:23:31+00:00"
        },
        {
            "title": "Learned Compression for Compressed Learning",
            "authors": "Dan Jacobellis, Neeraja J. Yadwadkar",
            "summary": "Modern sensors produce increasingly rich streams of high-resolution data. Due\nto resource constraints, machine learning systems discard the vast majority of\nthis information via resolution reduction. Compressed-domain learning allows\nmodels to operate on compact latent representations, allowing higher effective\nresolution for the same budget. However, existing compression systems are not\nideal for compressed learning. Linear transform coding and end-to-end learned\ncompression systems reduce bitrate, but do not uniformly reduce dimensionality;\nthus, they do not meaningfully increase efficiency. Generative autoencoders\nreduce dimensionality, but their adversarial or perceptual objectives lead to\nsignificant information loss. To address these limitations, we introduce WaLLoC\n(Wavelet Learned Lossy Compression), a neural codec architecture that combines\nlinear transform coding with nonlinear dimensionality-reducing autoencoders.\nWaLLoC sandwiches a shallow, asymmetric autoencoder and entropy bottleneck\nbetween an invertible wavelet packet transform. Across several key metrics,\nWaLLoC outperforms the autoencoders used in state-of-the-art latent diffusion\nmodels. WaLLoC does not require perceptual or adversarial losses to represent\nhigh-frequency detail, providing compatibility with modalities beyond RGB\nimages and stereo audio. WaLLoC's encoder consists almost entirely of linear\noperations, making it exceptionally efficient and suitable for mobile\ncomputing, remote sensing, and learning directly from compressed data. We\ndemonstrate WaLLoC's capability for compressed-domain learning across several\ntasks, including image classification, colorization, document understanding,\nand music source separation. Our code, experiments, and pre-trained audio and\nimage codecs are available at https://ut-sysml.org/walloc",
            "pdf_url": "http://arxiv.org/pdf/2412.09405v1",
            "published": "2024-12-12 16:09:57+00:00",
            "updated": "2024-12-12 16:09:57+00:00"
        },
        {
            "title": "UFO: Enhancing Diffusion-Based Video Generation with a Uniform Frame Organizer",
            "authors": "Delong Liu, Zhaohui Hou, Mingjie Zhan, Shihao Han, Zhicheng Zhao, Fei Su",
            "summary": "Recently, diffusion-based video generation models have achieved significant\nsuccess. However, existing models often suffer from issues like weak\nconsistency and declining image quality over time. To overcome these\nchallenges, inspired by aesthetic principles, we propose a non-invasive plug-in\ncalled Uniform Frame Organizer (UFO), which is compatible with any\ndiffusion-based video generation model. The UFO comprises a series of adaptive\nadapters with adjustable intensities, which can significantly enhance the\nconsistency between the foreground and background of videos and improve image\nquality without altering the original model parameters when integrated. The\ntraining for UFO is simple, efficient, requires minimal resources, and supports\nstylized training. Its modular design allows for the combination of multiple\nUFOs, enabling the customization of personalized video generation models.\nFurthermore, the UFO also supports direct transferability across different\nmodels of the same specification without the need for specific retraining. The\nexperimental results indicate that UFO effectively enhances video generation\nquality and demonstrates its superiority in public video generation benchmarks.\nThe code will be publicly available at https://github.com/Delong-liu-bupt/UFO.",
            "pdf_url": "http://arxiv.org/pdf/2412.09389v1",
            "published": "2024-12-12 15:56:26+00:00",
            "updated": "2024-12-12 15:56:26+00:00"
        },
        {
            "title": "Diffusion Model with Representation Alignment for Protein Inverse Folding",
            "authors": "Chenglin Wang, Yucheng Zhou, Zijie Zhai, Jianbing Shen, Kai Zhang",
            "summary": "Protein inverse folding is a fundamental problem in bioinformatics, aiming to\nrecover the amino acid sequences from a given protein backbone structure.\nDespite the success of existing methods, they struggle to fully capture the\nintricate inter-residue relationships critical for accurate sequence\nprediction. We propose a novel method that leverages diffusion models with\nrepresentation alignment (DMRA), which enhances diffusion-based inverse folding\nby (1) proposing a shared center that aggregates contextual information from\nthe entire protein structure and selectively distributes it to each residue;\nand (2) aligning noisy hidden representations with clean semantic\nrepresentations during the denoising process. This is achieved by predefined\nsemantic representations for amino acid types and a representation alignment\nmethod that utilizes type embeddings as semantic feedback to normalize each\nresidue. In experiments, we conduct extensive evaluations on the CATH4.2\ndataset to demonstrate that DMRA outperforms leading methods, achieving\nstate-of-the-art performance and exhibiting strong generalization capabilities\non the TS50 and TS500 datasets.",
            "pdf_url": "http://arxiv.org/pdf/2412.09380v1",
            "published": "2024-12-12 15:47:59+00:00",
            "updated": "2024-12-12 15:47:59+00:00"
        },
        {
            "title": "Diffusion Predictive Control with Constraints",
            "authors": "Ralf Römer, Alexander von Rohr, Angela P. Schoellig",
            "summary": "Diffusion models have recently gained popularity for policy learning in\nrobotics due to their ability to capture high-dimensional and multimodal\ndistributions. However, diffusion policies are inherently stochastic and\ntypically trained offline, limiting their ability to handle unseen and dynamic\nconditions where novel constraints not represented in the training data must be\nsatisfied. To overcome this limitation, we propose diffusion predictive control\nwith constraints (DPCC), an algorithm for diffusion-based control with explicit\nstate and action constraints that can deviate from those in the training data.\nDPCC uses constraint tightening and incorporates model-based projections into\nthe denoising process of a trained trajectory diffusion model. This allows us\nto generate constraint-satisfying, dynamically feasible, and goal-reaching\ntrajectories for predictive control. We show through simulations of a robot\nmanipulator that DPCC outperforms existing methods in satisfying novel\ntest-time constraints while maintaining performance on the learned control\ntask.",
            "pdf_url": "http://arxiv.org/pdf/2412.09342v1",
            "published": "2024-12-12 15:10:22+00:00",
            "updated": "2024-12-12 15:10:22+00:00"
        }
    ]
}