{
    "Physics": [
        {
            "title": "On the phase diagram of extensive-rank symmetric matrix denoising beyond rotational invariance",
            "authors": "Jean Barbier, Francesco Camilli, Justin Ko, Koki Okajima",
            "summary": "Matrix denoising is central to signal processing and machine learning. Its\nstatistical analysis when the matrix to infer has a factorised structure with a\nrank growing proportionally to its dimension remains a challenge, except when\nit is rotationally invariant. In this case the information theoretic limits and\nan efficient Bayes-optimal denoising algorithm, called rotational invariant\nestimator [1,2], are known. Beyond this setting few results can be found. The\nreason is that the model is not a usual spin system because of the growing rank\ndimension, nor a matrix model (as appearing in high-energy physics) due to the\nlack of rotation symmetry, but rather a hybrid between the two. Here we make\nprogress towards the understanding of Bayesian matrix denoising when the signal\nis a factored matrix $XX^\\intercal$ that is not rotationally invariant. Monte\nCarlo simulations suggest the existence of a \\emph{denoising-factorisation\ntransition} separating a phase where denoising using the rotational invariant\nestimator remains Bayes-optimal due to universality properties of the same\nnature as in random matrix theory, from one where universality breaks down and\nbetter denoising is possible, though algorithmically hard. We argue that it is\nonly beyond the transition that factorisation, i.e., estimating $X$ itself,\nbecomes possible up to irresolvable ambiguities. On the theory side, we combine\nmean-field techniques in an interpretable multiscale fashion in order to access\nthe minimum mean-square error and mutual information. Interestingly, our\nalternative method yields equations reproducible by the replica approach of\n[3]. Using numerical insights, we delimit the portion of phase diagram where we\nconjecture the mean-field theory to be exact, and correct it using universality\nwhen it is not. Our complete ansatz matches well the numerics in the whole\nphase diagram when considering finite size effects.",
            "pdf_url": "http://arxiv.org/pdf/2411.01974v2",
            "published": "2024-11-04 10:50:37+00:00",
            "updated": "2025-03-14 17:58:33+00:00"
        },
        {
            "title": "Self-Supervised Learning Strategies for Jet Physics",
            "authors": "Patrick Rieck, Kyle Cranmer, Etienne Dreyer, Eilam Gross, Nilotpal Kakati, Dmitrii Kobylanskii, Garrett W. Merz, Nathalie Soybelman",
            "summary": "We extend the re-simulation-based self-supervised learning approach to\nlearning representations of hadronic jets in colliders by exploiting the Markov\nproperty of the standard simulation chain. Instead of masking, cropping, or\nother forms of data augmentation, this approach simulates pairs of events where\nthe initial portion of the simulation is shared, but the subsequent stages of\nthe simulation evolve independently. When paired with a contrastive loss\nfunction, this naturally leads to representations that capture the physics in\nthe initial stages of the simulation. In particular, we force the hard\nscattering and parton shower to be shared and let the hadronization and\ninteraction with the detector evolve independently. We then evaluate the\nutility of these representations on downstream tasks.",
            "pdf_url": "http://arxiv.org/pdf/2503.11632v1",
            "published": "2025-03-14 17:49:21+00:00",
            "updated": "2025-03-14 17:49:21+00:00"
        },
        {
            "title": "Direct observation of angular momentum transfer among crystal lattice modes",
            "authors": "Olga Minakova, Carolina Paiva, Maximilian Frenzel, Michael S. Spencer, Joanna M. Urban, Christoph Ringkamp, Martin Wolf, Gregor Mussler, Dominik M. Juraschek, Sebastian F. Maehrlein",
            "summary": "The discrete rotational symmetry of crystals leads to the conservation of\nquantized angular momentum in solids. While the exchange of energy and linear\nmomentum between lattice vibrations (phonons) via anharmonic coupling is a\ncornerstone of solid-state physics, conservation and transfer of angular\nmomentum within the lattice remains a postulate. Recently, phonon angular\nmomentum, often in the form of chiral phonons, has been linked to giant\nmagnetic fields, thermal Hall conductivity, dynamical multiferroicity,\nultrafast demagnetization, or magnetic switching. However, the inherent process\nof phonon to phonon angular momentum transfer, fundamentally required to reach\nany magnetization equilibrium and imperative for all spin relaxation phenomena\nin solids, remains elusive. Here, we demonstrate the coherent transfer of\nangular momentum from one lattice mode to another by establishing helical\nnonlinear phononics. We directly observe rotational phonon-phonon Umklapp\nscattering dictated by pseudo angular momentum conservation and the threefold\nrotational symmetry of the topological insulator bismuth selenide. We identify\nnonlinear phonon-phonon coupling as an angular momentum transfer channel,\nconfirmed by our ab-initio calculations. Besides bearing universal implications\nfor angular momentum dissipation abundant in nature, our work actively reverses\nthe natural flow, leading to the nonlinear upconversion of lattice angular\nmomentum. We thus open the field of helical and chiral nonlinear phononics,\nrepresenting a selective handle for ultrafast control of spins, topology and\nchiral quasi-particles.",
            "pdf_url": "http://arxiv.org/pdf/2503.11626v1",
            "published": "2025-03-14 17:45:33+00:00",
            "updated": "2025-03-14 17:45:33+00:00"
        },
        {
            "title": "Noise immunity in quantum optical systems through non-Hermitian topology",
            "authors": "Jamison Sloan, Sachin Vaidya, Nicholas Rivera, Marin Soljačić",
            "summary": "Multimode nonlinear optical systems are highly valued for their ability to\nwithstand large amounts of optical power, transmit data with high bandwidth,\nperform physical computations, generate quantum correlations, and much more.\nFor many of these applications, both classical and quantum noise place\nlimitations on important performance metrics. Moreover, it is well known that\nnonlinear systems tend to develop noise due to their sensitivity to initial\nconditions, thus motivating the development of general principles which can be\nused to control and mitigate noise in such systems. In this work, we show that\nnon-reciprocity can enable the unidirectional flow of noise from the\nnon-equilibrium steady states of nonlinear driven-dissipative systems. We\ndemonstrate that this unidirectional flow results from the non-Hermitian skin\neffect (NHSE) for quantum noise. This effect provides a robust mechanism for\nisolating parts of the system from degradation due to excess injected noise.\nOur findings may lead to novel design principles for multimode amplifiers or\noscillators that support high power handling while mitigating the buildup of\nnoise. Moreover, our approach provides a new means to connect non-Hermitian\ntopology with nonlinear many-body systems, which is expected to lead to\ntopological descriptions of interacting states of light.",
            "pdf_url": "http://arxiv.org/pdf/2503.11620v1",
            "published": "2025-03-14 17:40:54+00:00",
            "updated": "2025-03-14 17:40:54+00:00"
        },
        {
            "title": "Deep thermalization under charge-conserving quantum dynamics",
            "authors": "Rui-An Chang, Harshank Shrotriya, Wen Wei Ho, Matteo Ippoliti",
            "summary": "\"Deep thermalization\" describes the emergence of universal wavefunction\ndistributions in quantum many-body dynamics, appearing on a local subsystem\nupon measurement of its environment. In this work, we study in detail the\neffect of continuous internal symmetries and associated conservation laws on\ndeep thermalization. Concretely, we consider quantum spin systems with a $U(1)$\nsymmetry associated with the conservation of magnetization (or `charge'), and\nanalyze how the choice of initial states (specifically, their degree of charge\nfluctuations) and the choice of measurement basis (specifically, whether or not\nit can reveal information about the local charge density) determine the ensuing\nuniversal wavefunction distributions. We put forth a universal ansatz for the\nlimiting form of the projected ensemble, motivated by maximum-entropy\nprinciples rooted in statistical physics and quantum information theory. This\nlimiting form depends on a polynomial amount of data on the initial state and\nmeasurement basis, a `coarse-graining' that is an essential feature of bona\nfide thermodynamic ensembles. We support our ansatz with three complementary\napproaches: (i) a rigorous proof in the simplest case of no charge fluctuations\nin either the initial state or the measurement basis; (ii) analytical\ncalculations using a `replica limit' approach, applicable when charge\nfluctuations are allowed in either the input state or the measurement basis but\nnot both; (iii) extensive numerical simulations of finite-sized systems in the\nmost general case. Our findings demonstrate a rich interplay between symmetries\nand the information extracted by measurements, which allows deep thermalization\nto exhibit a range of universal behaviors far beyond regular thermalization.",
            "pdf_url": "http://arxiv.org/pdf/2408.15325v2",
            "published": "2024-08-27 18:00:01+00:00",
            "updated": "2025-03-14 17:40:42+00:00"
        },
        {
            "title": "Floquet-ADAPT-VQE: A Quantum Algorithm to Simulate Non-Equilibrium Physics in Periodically Driven Systems",
            "authors": "Abhishek Kumar, Karunya Shirali, Nicholas J. Mayhall, Sophia E. Economou, Edwin Barnes",
            "summary": "Non-equilibrium many-body quantum systems exhibit many fascinating phenomena\nabsent in equilibrium systems, but simulating them on classical computers is\nchallenging. We propose a hybrid quantum-classical algorithm,\nFloquet-ADAPT-VQE, to simulate the non-equilibrium physics of periodically\ndriven quantum systems. We utilize the Floquet-Hilbert space, a composition of\nauxiliary and physical spaces, to transform the Hamiltonian into a\ntime-independent form. We define a cost function based on the square of the\nshifted extended Floquet Hamiltonian and show how to prepare Floquet\neigenstates using Floquet-ADAPT-VQE. We also obtain a suitable auxiliary\ninitial state whose squared Floquet energy is independent of the number of\nauxiliary qubits as well as the driving frequency, which leads to better\nconvergence with fewer ADAPT iterations. Additionally, we provide a framework\nto calculate the time-dependent expectation value of observables in the Floquet\nstate with fixed-depth quantum circuit. We demonstrate our algorithm by\nperforming numerical simulations on a periodically driven XYZ model with a\nmagnetic field. We also explore potential applications of our algorithm for\nstudying various non-equilibrium phenomena in periodically driven systems.",
            "pdf_url": "http://arxiv.org/pdf/2503.11613v1",
            "published": "2025-03-14 17:32:52+00:00",
            "updated": "2025-03-14 17:32:52+00:00"
        },
        {
            "title": "Model-Agnostic Knowledge Guided Correction for Improved Neural Surrogate Rollout",
            "authors": "Bharat Srikishan, Daniel O'Malley, Mohamed Mehana, Nicholas Lubbers, Nikhil Muralidhar",
            "summary": "Modeling the evolution of physical systems is critical to many applications\nin science and engineering. As the evolution of these systems is governed by\npartial differential equations (PDEs), there are a number of computational\nsimulations which resolve these systems with high accuracy. However, as these\nsimulations incur high computational costs, they are infeasible to be employed\nfor large-scale analysis. A popular alternative to simulators are neural\nnetwork surrogates which are trained in a data-driven manner and are much more\ncomputationally efficient. However, these surrogate models suffer from high\nrollout error when used autoregressively, especially when confronted with\ntraining data paucity. Existing work proposes to improve surrogate rollout\nerror by either including physical loss terms directly in the optimization of\nthe model or incorporating computational simulators as `differentiable layers'\nin the neural network. Both of these approaches have their challenges, with\nphysical loss functions suffering from slow convergence for stiff PDEs and\nsimulator layers requiring gradients which are not always available, especially\nin legacy simulators. We propose the Hybrid PDE Predictor with Reinforcement\nLearning (HyPER) model: a model-agnostic, RL based, cost-aware model which\ncombines a neural surrogate, RL decision model, and a physics simulator (with\nor without gradients) to reduce surrogate rollout error significantly. In\naddition to reducing in-distribution rollout error by 47%-78%, HyPER learns an\nintelligent policy that is adaptable to changing physical conditions and\nresistant to noise corruption. Code available at\nhttps://github.com/scailab/HyPER.",
            "pdf_url": "http://arxiv.org/pdf/2503.10048v2",
            "published": "2025-03-13 05:00:23+00:00",
            "updated": "2025-03-14 17:02:11+00:00"
        },
        {
            "title": "Penguin decays of B mesons",
            "authors": "Aritra Biswas",
            "summary": "We propose a set of optimized observables using penguin mediated $\\bar{B}_d$\nand $\\bar{B}_s$ decays to $K^{(*)}\\bar{K}^{(*)}$ and $K^*\\phi$ final states\nthat exhibhit a reduced sensitivity to power corrections than the corresponding\nbranching ratios. Using these observables, branching ratios for the related\nvector-vector and pseudoscalar-pseudoscalar modes and branching ratios for\nmodes involving other relevant pseudoscalar-vector final states ($K\\phi$,\n$K^*\\bar{K})$, we attempt to resolve the emergent combined pattern by assuming\nnew physics contributions to the weak effective operators at the scale of the\nmass of the $b$ quark that are already present in the Standard Model. We find\nthat the simplest scenario that can offer a simultaneous explanation is the\ntwo-operator scenario $Q_{4s,d}-Q_{6s,d}$. We briefly discuss how future\nexperimental measurements may alter this picture and try to motivate such\nmeasurements for specific modes from our analysis.",
            "pdf_url": "http://arxiv.org/pdf/2503.11587v1",
            "published": "2025-03-14 16:56:40+00:00",
            "updated": "2025-03-14 16:56:40+00:00"
        },
        {
            "title": "The Line operators in the G2HDM model",
            "authors": "Rui Yang, Jiaming Guo, Linghai Li, Xun Xue, Tzu-Chiang Yuan",
            "summary": "We investigate the global structure of the Gauged Two-Higgs-Doublet Model\n(G2HDM), a framework that extends the Standard Model by introducing a dark\nsector governed by the gauge symmetry $U(1)_X \\times SU(2)_H$. The full gauge\nsymmetry of the theory, including the visible sector, is given by the universal\ncovering group $\\tilde{G} = U(1)_Y \\times SU(2)_L \\times SU(3)_C \\times U(1)_X\n\\times SU(2)_H$. However, the true gauge group may instead be a quotient $G =\n\\tilde{G} / \\Gamma$, where $\\Gamma$ is the center of $\\tilde{G}$ or a subgroup\nthereof, leading to different global structures that cannot be distinguished by\nlocal experiments.We explore the physical implications of these global\nstructures, analyzing their effects on Wilson, 't Hooft, and dyonic line\noperators, as well as the periodicity of the CP-violating $\\theta$-angles\nassociated with each group factor. Furthermore, we determine the minimal\nelectric and magnetic charges that arise after electroweak symmetry breaking,\nhighlighting their dependence on the choice of $\\Gamma$. These findings provide\na systematic characterization of the G2HDM's global properties and their\npotential phenomenological consequences.",
            "pdf_url": "http://arxiv.org/pdf/2412.14949v2",
            "published": "2024-12-19 15:27:58+00:00",
            "updated": "2025-03-14 16:53:39+00:00"
        },
        {
            "title": "Nonlinear optical metasurfaces empowered by bound-states in the continuum",
            "authors": "Ji Tong Wang, Nicolae C. Panoiu",
            "summary": "Optical bound-states in the continuum (BICs) have greatly enriched the field\nof nonlinear optics with novel ways to control and manipulate light-matter\ninteraction at the nanoscale. This has been made possible by their unique\nphysical properties, including effective confinement of light, non-trivial\ntopological features, and robustness upon the propagation of the optical field\nboth in the real and momentum space. Regarding the exploration of nonlinear\noptical response in various photonic nanostructures supporting BICs, particular\nattention has been paid to optical metasurfaces, chiefly due to their ability\nto control the light flow at subwavelength scale, design and fabrication\nflexibility, and convenient phase-matching conditions. In this review, we\noutline and discuss recent advances in metasurface-based frequency conversion\nprocesses utilizing the versatile physics of BICs, with a particular emphasis\non the main physics background pertaining to nonlinear optical phenomena and\noptics of BICs, as well as state-of-the-art functionalities enabled by\nBIC-driven nonlinear metasurfaces. These applications include harmonic\ngeneration, harmonic chiroptical effects, generation of complex quantum states,\nand broadband terahertz generation. In addition, several emerging research\nfields and the existing challenges of photonic nanodevices relying on BICs are\ndiscussed.",
            "pdf_url": "http://arxiv.org/pdf/2503.11581v1",
            "published": "2025-03-14 16:46:56+00:00",
            "updated": "2025-03-14 16:46:56+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "From Denoising Score Matching to Langevin Sampling: A Fine-Grained Error Analysis in the Gaussian Setting",
            "authors": "Samuel Hurault, Matthieu Terris, Thomas Moreau, Gabriel Peyré",
            "summary": "Sampling from an unknown distribution, accessible only through discrete\nsamples, is a fundamental problem at the core of generative AI. The current\nstate-of-the-art methods follow a two-step process: first estimating the score\nfunction (the gradient of a smoothed log-distribution) and then applying a\ngradient-based sampling algorithm. The resulting distribution's correctness can\nbe impacted by several factors: the generalization error due to a finite number\nof initial samples, the error in score matching, and the diffusion error\nintroduced by the sampling algorithm. In this paper, we analyze the sampling\nprocess in a simple yet representative setting-sampling from Gaussian\ndistributions using a Langevin diffusion sampler. We provide a sharp analysis\nof the Wasserstein sampling error that arises from the multiple sources of\nerror throughout the pipeline. This allows us to rigorously track how the\nanisotropy of the data distribution (encoded by its power spectrum) interacts\nwith key parameters of the end-to-end sampling method, including the noise\namplitude, the step sizes in both score matching and diffusion, and the number\nof initial samples. Notably, we show that the Wasserstein sampling error can be\nexpressed as a kernel-type norm of the data power spectrum, where the specific\nkernel depends on the method parameters. This result provides a foundation for\nfurther analysis of the tradeoffs involved in optimizing sampling accuracy,\nsuch as adapting the noise amplitude to the choice of step sizes.",
            "pdf_url": "http://arxiv.org/pdf/2503.11615v1",
            "published": "2025-03-14 17:35:00+00:00",
            "updated": "2025-03-14 17:35:00+00:00"
        },
        {
            "title": "Master Stability Functions in Complex Networks",
            "authors": "Suman Acharyya, Priodyuti Pradhan, Chandrakala Meena",
            "summary": "Synchronization is an emergent and fundamental phenomenon in nature and\nengineered systems. Understanding the stability of a synchronized phenomenon is\ncrucial for ensuring functionality in various complex systems. The stability of\nthe synchronization phenomenon is extensively studied using the Master\nStability Function (MSF). This powerful and elegant tool plays a pivotal role\nin determining the stability of synchronization states, providing deep insights\ninto synchronization in coupled systems. Although MSF analysis has been used\nfor 25 years to study the stability of synchronization states, a systematic\ninvestigation of MSF across various networked systems remains missing from the\nliterature. In this article, we present a simplified and unified MSF analysis\nfor diverse undirected and directed networked systems. We begin with the\nanalytical MSF framework for pairwise-coupled identical systems with diffusive\nand natural coupling schemes and extend our analysis to directed networks and\nmultilayer networks, considering both intra-layer and inter-layer interactions.\nFurthermore, we revisit the MSF framework to incorporate higher-order\ninteractions alongside pairwise interactions. To enhance understanding, we also\nprovide a numerical analysis of synchronization in coupled R\\\"ossler systems\nunder pairwise diffusive coupling and propose algorithms for determining the\nMSF, identifying stability regimes, and classifying MSF functions. Overall, the\nprimary goal of this review is to present a systematic study of MSF in coupled\ndynamical networks in a clear and structured manner, making this powerful tool\nmore accessible. Furthermore, we highlight cases where the study of\nsynchronization states using MSF remains underexplored. Additionally, we\ndiscuss recent research focusing on MSF analysis using time series data and\nmachine learning approaches.",
            "pdf_url": "http://arxiv.org/pdf/2412.19163v2",
            "published": "2024-12-26 10:47:00+00:00",
            "updated": "2025-03-14 17:23:18+00:00"
        },
        {
            "title": "Towards Few-Call Model Stealing via Active Self-Paced Knowledge Distillation and Diffusion-Based Image Generation",
            "authors": "Vlad Hondru, Radu Tudor Ionescu",
            "summary": "Diffusion models showcase strong capabilities in image synthesis, being used\nin many computer vision tasks with great success. To this end, we propose to\nexplore a new use case, namely to copy black-box classification models without\nhaving access to the original training data, the architecture, and the weights\nof the model, i.e. the model is only exposed through an inference API. More\nspecifically, we can only observe the (soft or hard) labels for some image\nsamples passed as input to the model. Furthermore, we consider an additional\nconstraint limiting the number of model calls, mostly focusing our research on\nfew-call model stealing. In order to solve the model extraction task given the\napplied restrictions, we propose the following framework. As training data, we\ncreate a synthetic data set (called proxy data set) by leveraging the ability\nof diffusion models to generate realistic and diverse images. Given a maximum\nnumber of allowed API calls, we pass the respective number of samples through\nthe black-box model to collect labels. Finally, we distill the knowledge of the\nblack-box teacher (attacked model) into a student model (copy of the attacked\nmodel), harnessing both labeled and unlabeled data generated by the diffusion\nmodel. We employ a novel active self-paced learning framework to make the most\nof the proxy data during distillation. Our empirical results on three data sets\nconfirm the superiority of our framework over four state-of-the-art methods in\nthe few-call model extraction scenario. We release our code for free\nnon-commercial use at https://github.com/vladhondru25/model-stealing.",
            "pdf_url": "http://arxiv.org/pdf/2310.00096v2",
            "published": "2023-09-29 19:09:27+00:00",
            "updated": "2025-03-14 16:52:55+00:00"
        },
        {
            "title": "Bottom-up Iterative Anomalous Diffusion Detector (BI-ADD)",
            "authors": "Junwoo Park, Nataliya Sokolovska, Clément Cabriel, Ignacio Izeddin, Judith Miné-Hattab",
            "summary": "In recent years, the segmentation of short molecular trajectories with\nvarying diffusive properties has drawn particular attention of researchers,\nsince it allows studying the dynamics of a particle. In the past decade,\nmachine learning methods have shown highly promising results, also in\nchangepoint detection and segmentation tasks. Here, we introduce a novel\niterative method to identify the changepoints in a molecular trajectory, i.e.,\nframes, where the diffusive behavior of a particle changes. A trajectory in our\ncase follows a fractional Brownian motion and we estimate the diffusive\nproperties of the trajectories. The proposed BI-ADD combines unsupervised and\nsupervised learning methods to detect the changepoints. Our approach can be\nused for the analysis of molecular trajectories at the individual level and\nalso be extended to multiple particle tracking, which is an important challenge\nin fundamental biology. We validated BI-ADD in various scenarios within the\nframework of the AnDi2 Challenge 2024 dedicated to single particle tracking.\nOur method is implemented in Python and is publicly available for research\npurposes.",
            "pdf_url": "http://arxiv.org/pdf/2503.11529v1",
            "published": "2025-03-14 15:57:31+00:00",
            "updated": "2025-03-14 15:57:31+00:00"
        },
        {
            "title": "Towards A Correct Usage of Cryptography in Semantic Watermarks for Diffusion Models",
            "authors": "Jonas Thietke, Andreas Müller, Denis Lukovnikov, Asja Fischer, Erwin Quiring",
            "summary": "Semantic watermarking methods enable the direct integration of watermarks\ninto the generation process of latent diffusion models by only modifying the\ninitial latent noise. One line of approaches building on Gaussian Shading\nrelies on cryptographic primitives to steer the sampling process of the latent\nnoise. However, we identify several issues in the usage of cryptographic\ntechniques in Gaussian Shading, particularly in its proof of lossless\nperformance and key management, causing ambiguity in follow-up works, too. In\nthis work, we therefore revisit the cryptographic primitives for semantic\nwatermarking. We introduce a novel, general proof of lossless performance based\non IND\\$-CPA security for semantic watermarks. We then discuss the\nconfiguration of the cryptographic primitives in semantic watermarks with\nrespect to security, efficiency, and generation quality.",
            "pdf_url": "http://arxiv.org/pdf/2503.11404v1",
            "published": "2025-03-14 13:45:46+00:00",
            "updated": "2025-03-14 13:45:46+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Chat-TS: Enhancing Multi-Modal Reasoning Over Time-Series and Natural Language Data",
            "authors": "Paul Quinlan, Qingguo Li, Xiaodan Zhu",
            "summary": "Time-series analysis is critical for a wide range of fields such as\nhealthcare, finance, transportation, and energy, among many others. The\npractical applications often involve analyzing time-series data alongside\ncontextual information in the form of natural language to support informed\ndecisions. However, current time-series models are limited in their ability to\nperform reasoning that involves both time-series and their textual content. In\nthis work, we address this gap by introducing \\textit{Chat-TS}, a large\nlanguage model (LLM) based framework, designed to support reasoning over time\nseries and textual data. Unlike traditional models, Chat-TS integrates\ntime-series tokens into LLMs' vocabulary, enhancing its reasoning ability over\nboth modalities without compromising the core natural language capabilities,\nenabling practical analysis and reasoning across modalities. To support\nlearning and evaluation in this setup, we contribute new datasets: the\n\\textit{TS Instruct Training Dataset} which pairs diverse time-series data with\nrelevant text instructions and responses for instruction tuning, the \\textit{TS\nInstruct Question and Answer (QA) Gold Dataset} which provides multiple-choice\nquestions designed to evaluate multimodal reasoning, and a \\textit{TS Instruct\nQuantitative Probing Set} which contains a small subset of the TS Instruct QA\ntasks alongside math and decision-making questions for LLM evaluation. We\ndesigned a training strategy to preserve the inherent reasoning capabilities of\nLLMs while augmenting them for time-series reasoning. Experiments show that\nChat-TS achieves state-of-the-art performance in multi-modal reasoning tasks by\nmaintaining strong natural language proficiency while improving time-series\nreasoning. ~\\footnote{To ensure replicability and facilitate future research,\nall models, datasets, and code will be available at [\\texttt{Github-URL}].}",
            "pdf_url": "http://arxiv.org/pdf/2503.10883v1",
            "published": "2025-03-13 21:05:11+00:00",
            "updated": "2025-03-13 21:05:11+00:00"
        }
    ]
}