{
    "Physics": [
        {
            "title": "Quantum Sensing Radiative Decays of Neutrinos and Dark Matter Particles",
            "authors": "Zhongtian Dong, Doojin Kim, Kyoungchul Kong, Myeonghun Park, Miguel A. Soto Alcaraz",
            "summary": "We explore a novel strategy for detecting the radiative decay of very weakly\ninteracting particles by leveraging the extreme sensitivity of quantum devices,\nsuch as superconducting transmon qubits and trapped ion systems, to faint\nelectromagnetic signals. By modeling the effective electric field induced by\nthe decay photons, we evaluate the response of quantum sensors across two\nparticle physics scenarios: the cosmic neutrino background and two-component\ndark matter. We assess the discovery potential of these devices and outline the\nparameter space accessible under current experimental capabilities. Our\nanalysis demonstrates that quantum sensors can probe radiative decays of dark\nmatter candidates using existing technology, while probing neutrino magnetic\nmoments beyond current limits will require scalable quantum architectures with\nenhanced coherence.",
            "pdf_url": "http://arxiv.org/pdf/2508.09139v1",
            "published": "2025-08-12 17:59:59+00:00",
            "updated": "2025-08-12 17:59:59+00:00"
        },
        {
            "title": "Training-Free Text-Guided Color Editing with Multi-Modal Diffusion Transformer",
            "authors": "Zixin Yin, Xili Dai, Ling-Hao Chen, Deyu Zhou, Jianan Wang, Duomin Wang, Gang Yu, Lionel M. Ni, Heung-Yeung Shum",
            "summary": "Text-guided color editing in images and videos is a fundamental yet unsolved\nproblem, requiring fine-grained manipulation of color attributes, including\nalbedo, light source color, and ambient lighting, while preserving physical\nconsistency in geometry, material properties, and light-matter interactions.\nExisting training-free methods offer broad applicability across editing tasks\nbut struggle with precise color control and often introduce visual\ninconsistency in both edited and non-edited regions. In this work, we present\nColorCtrl, a training-free color editing method that leverages the attention\nmechanisms of modern Multi-Modal Diffusion Transformers (MM-DiT). By\ndisentangling structure and color through targeted manipulation of attention\nmaps and value tokens, our method enables accurate and consistent color\nediting, along with word-level control of attribute intensity. Our method\nmodifies only the intended regions specified by the prompt, leaving unrelated\nareas untouched. Extensive experiments on both SD3 and FLUX.1-dev demonstrate\nthat ColorCtrl outperforms existing training-free approaches and achieves\nstate-of-the-art performances in both edit quality and consistency.\nFurthermore, our method surpasses strong commercial models such as FLUX.1\nKontext Max and GPT-4o Image Generation in terms of consistency. When extended\nto video models like CogVideoX, our approach exhibits greater advantages,\nparticularly in maintaining temporal coherence and editing stability. Finally,\nour method also generalizes to instruction-based editing diffusion models such\nas Step1X-Edit and FLUX.1 Kontext dev, further demonstrating its versatility.",
            "pdf_url": "http://arxiv.org/pdf/2508.09131v1",
            "published": "2025-08-12 17:57:04+00:00",
            "updated": "2025-08-12 17:57:04+00:00"
        },
        {
            "title": "Constrained free energy minimization for the design of thermal states and stabilizer thermodynamic systems",
            "authors": "Michele Minervini, Madison Chin, Jacob Kupperman, Nana Liu, Ivy Luo, Meghan Ly, Soorya Rethinasamy, Kathie Wang, Mark M. Wilde",
            "summary": "A quantum thermodynamic system is described by a Hamiltonian and a list of\nconserved, non-commuting charges, and a fundamental goal is to determine the\nminimum energy of the system subject to constraints on the charges. Recently,\n[Liu et al., arXiv:2505.04514] proposed first- and second-order classical and\nhybrid quantum-classical algorithms for solving a dual chemical potential\nmaximization problem, and they proved that these algorithms converge to global\noptima by means of gradient-ascent approaches. In this paper, we benchmark\nthese algorithms on several problems of interest in thermodynamics, including\none- and two-dimensional quantum Heisenberg models with nearest and\nnext-to-nearest neighbor interactions and with the charges set to the total\n$x$, $y$, and $z$ magnetizations. We also offer an alternative compelling\ninterpretation of these algorithms as methods for designing ground and thermal\nstates of controllable Hamiltonians, with potential applications in molecular\nand material design. Furthermore, we introduce stabilizer thermodynamic systems\nas thermodynamic systems based on stabilizer codes, with the Hamiltonian\nconstructed from a given code's stabilizer operators and the charges\nconstructed from the code's logical operators. We benchmark the aforementioned\nalgorithms on several examples of stabilizer thermodynamic systems, including\nthose constructed from the one-to-three-qubit repetition code, the perfect\none-to-five-qubit code, and the two-to-four-qubit error-detecting code.\nFinally, we observe that the aforementioned hybrid quantum-classical\nalgorithms, when applied to stabilizer thermodynamic systems, can serve as\nalternative methods for encoding qubits into stabilizer codes at a fixed\ntemperature, and we provide an effective method for warm-starting these\nencoding algorithms whenever a single qubit is encoded into multiple physical\nqubits.",
            "pdf_url": "http://arxiv.org/pdf/2508.09103v1",
            "published": "2025-08-12 17:31:13+00:00",
            "updated": "2025-08-12 17:31:13+00:00"
        },
        {
            "title": "A quantum computing approach to efficiently simulating correlated materials using impurity models and dynamical mean field theory",
            "authors": "Norman Hogan, Efekan Kökcü, Thomas Steckmann, Liam P. Doak, Carlos Mejuto-Zaera, Daan Camps, Roel Van Beeumen, Wibe A. de Jong, A. F. Kemper",
            "summary": "The accurate theoretical description of materials with strongly correlated\nelectrons is a formidable challenge, at the forefront of condensed matter\nphysics and computational chemistry alike, and it is one of the targets for\nquantum computing. Dynamical Mean Field Theory (DMFT) is a successful approach\nthat predicts behaviors of such systems by incorporating some correlated\nbehavior, but it is limited by the need to calculate the Green's function for\nthe impurity model. This work proposes a framework for DMFT calculations on\nquantum computers, focusing on near-term applications. It leverages the\nstructure of the impurity problem, combining a low-rank Gaussian subspace\nrepresentation of the ground state and a compressed, short-depth quantum\ncircuit that joins the Gaussian state preparation with the time evolution to\ncompute the necessary Green's functions. We demonstrate the convergence of the\nDMFT algorithm using the Gaussian subspace in a noise-free setting, and show\nthe hardware viability of the circuit compression by extracting the impurity\nGreen's function on IBM quantum processors for a single impurity coupled to\nthree bath orbitals (8 physical qubits and 1 ancilla). We discuss the potential\npaths forward towards realizing this use case of quantum computing in materials\nscience.",
            "pdf_url": "http://arxiv.org/pdf/2508.05738v2",
            "published": "2025-08-07 18:00:01+00:00",
            "updated": "2025-08-12 17:23:53+00:00"
        },
        {
            "title": "Simulating single-photon experiments with a quantum computer",
            "authors": "Priyasheel Prasad, Marco Russo, Bartolomeo Montrucchio",
            "summary": "In this work, we simulate the behavior of photons in a laboratory experiment\nusing a quantum computer and examine how the simulation results compare with\nthe theoretical predictions. The experiment involves both protective and\nnon-protective measurements. While the latter involves complete wavefunction\ncollapse, the former combines weak interactions with a protective mechanism\nthereby preserving the photon wave function coherence until its final\ndetection. The simulation gives insights as to how efficient quantum computers\ncan be in simulating actual physical systems as the amount of computation\nincreases.",
            "pdf_url": "http://arxiv.org/pdf/2508.09095v1",
            "published": "2025-08-12 17:22:06+00:00",
            "updated": "2025-08-12 17:22:06+00:00"
        },
        {
            "title": "Anisotropic exciton-polaritons reveal non-Hermitian topology in van der Waals materials",
            "authors": "Devarshi Chakrabarty, Avijit Dhara, Pritam Das, Kritika Ghosh, Ayan Roy Chaudhuri, Sajal Dhara",
            "summary": "Topological band theory has expanded into various domains in applied physics,\noffering significant potential for future technologies. Recent developments\nindicate that unique bulk band topology perceived for electrons can be realized\nin a system of light-matter quasiparticles with reduced crystal symmetry\nutilizing tunable light-matter interaction. In this work we realize\ntopologically non-trivial energy band dispersion of exciton-polaritons confined\nin two-dimensional anisotropic materials inside an optical microcavity, and\nshow the emergence of exceptional points (EPs) due to non-Hermitian topology\narising from excitonic dipole oscillators with finite quasiparticle lifetime.\nFourier-plane imaging reveals two pairs of EPs connected by bulk Fermi arcs for\neach of the transverse electric and magnetic polarized modes. An anisotropic\nLorentz oscillator model captures the exact band dispersion observed in our\nexperiment in two-dimensional momentum space. Our findings establish\nanisotropic two-dimensional materials as a platform for exploring non-Hermitian\ntopological physics, with implications for polarization-controlled optical\ntechnologies.",
            "pdf_url": "http://arxiv.org/pdf/2508.09083v1",
            "published": "2025-08-12 17:04:07+00:00",
            "updated": "2025-08-12 17:04:07+00:00"
        },
        {
            "title": "Weak measurement in strong laser field physics",
            "authors": "Philipp Stammer, Javier Rivera-Dean, Marcelo F. Ciappina, Maciej Lewenstein",
            "summary": "The advantage of attosecond measurements is the possibility of time-resolving\nultrafast quantum phenomena of electron dynamics. Many such measurements are of\ninterferometric nature, and therefore give access to the phase. Likewise, weak\nmeasurements are intrinsically interferometric and specifically take advantage\nof interfering probability amplitudes, therefore encoding the phase information\nof the process. In this work, we show that attosecond interferometry\nexperiments can be seen as a weak measurement, which unveils how this notion is\nconnected to strong field physics and attosecond science. In particular, we\nshow how the electron trajectory picks up a new phase, which occurs due to the\nweak measurement of the process. This phase can show significant contributions\nin the presence of spectral features of the measured system. Furthermore,\nextending this approach to include non-classical driving fields shows that the\ngenerated harmonics exhibit non-trivial features in their quantum state and\nphoton statistics. This opens the path towards investigations of attosecond\nquantum interferometry experiments.",
            "pdf_url": "http://arxiv.org/pdf/2508.09048v1",
            "published": "2025-08-12 16:09:31+00:00",
            "updated": "2025-08-12 16:09:31+00:00"
        },
        {
            "title": "Finite-dimensional approximations of generalized squeezing",
            "authors": "Sahel Ashhab, Felix Fischer, Davide Lonigro, Daniel Braak, Daniel Burgarth",
            "summary": "We show unexpected behaviour in simulations of generalized squeezing\nperformed with finite-dimensional truncations of the Fock space: even for\nextremely large dimension of the state space, the results depend on whether the\ntruncation dimension is even or odd. This situation raises the question whether\nthe simulation results are physically meaningful. We demonstrate that, in fact,\nthe two truncation schemes correspond to two well-defined, distinct unitary\nevolutions whose generators are defined on different subsets of the\ninfinite-dimensional Fock space. This is a consequence of the fact that the\ngeneralized squeezing Hamiltonian is not self-adjoint on states with finite\nexcitations, but possesses multiple self-adjoint extensions. Furthermore, we\npresent results on the spectrum of the squeezing operators corresponding to\neven and odd truncation size that elucidate the properties of the two different\nself-adjoint extensions corresponding to the even and odd truncation scheme. To\nmake the squeezing operator applicable to a physical system, we must regularize\nit by other terms that depend on the specifics of the experimental\nimplementation. We show that the addition of a Kerr interaction term in the\nHamiltonian leads to uniquely converging simulations, with no dependence on the\nparity of the truncation size, and demonstrate that the Kerr term indeed\nrenders the Hamiltonian self-adjoint and thus physically interpretable.",
            "pdf_url": "http://arxiv.org/pdf/2508.09041v1",
            "published": "2025-08-12 16:02:45+00:00",
            "updated": "2025-08-12 16:02:45+00:00"
        },
        {
            "title": "Characterization of the optical response from variant InGaN nanowires emitting within the green spectral gap",
            "authors": "Mohsen Esmaeilzadeh, Pablo Tieben, Soumyadip Chatterjee, Apurba Laha, Andreas W. Schel",
            "summary": "This study provides a comprehensive physical and optical investigation of\nInGaN nanowires (NWs) designed to address the challenges posed by the green gap\nregion. We conduct a detailed analysis of the morphology, structure, and\noptical characteristics of the NWs using characterization techniques such as\nscanning electron microscopy, cathodoluminescence spectroscopy, and confocal\nscanning microscopy. Notably, increasing the indium concentration causes a\nredshift in emission and alters the luminescence properties across different\nsegments of NWs.\n  Our findings provide valuable insight into the correlation between indium\ncompositional nonuniformity and the optical emission properties of NWs. These\ninsights contribute to optimizing the growth condition, color accuracy, and\nenhancing optical efficiency of NWs, highlighting their potential for next\ngeneration high-performance LEDs and optoelectronics devices.",
            "pdf_url": "http://arxiv.org/pdf/2508.08977v1",
            "published": "2025-08-12 14:40:28+00:00",
            "updated": "2025-08-12 14:40:28+00:00"
        },
        {
            "title": "Virtual thermodynamic potential and black hole criticality",
            "authors": "Dumitru Astefanesei, Gonzalo Casanova, Raul Rojas",
            "summary": "We propose a new way to relate the black hole thermodynamics and geometry by\ngeneralizing the Euclidean formalism to include \"virtual geometries\", which do\nnot necessarily satisfy Einstein equations. This provides a physically well\nmotivated route to study black hole criticality and obtain the Landau Ginzburg\npotential. We compute the \"virtual thermodynamic potential\" and show that it\nsatisfies a modified quantum statistical relation that is compatible with the\nfirst law of black hole thermodynamics supplemented with an extra term,\ninterpreted as virtual work in previous literature. The novelty is that, within\nour formalism, we can explicitly compute this term as the first derivative of\nthe virtual thermodynamic potential with respect to the horizon radius that is\nconsidered as the order parameter. Imposing the physical condition that the\nfirst derivative vanishes is at the basis of the matching between the first law\nof black hole thermodynamics and (one of the) Einstein equations evaluated at\nthe horizon. Interestingly, imposing the physical conditions that the second\nand third derivatives vanish, we can concretely study the criticality and\nexistence of swallow tails. As a specific example, we apply this formalism to\nan exact four dimensional asymptotically flat hairy black hole, namely the\ngeneralized Kaluza Klein (KK) black hole when the dilaton potential is\nincluded, and show that it is thermodynamically stable and has a non-trivial\ncritical behaviour corresponding to an inverted swallowtail.",
            "pdf_url": "http://arxiv.org/pdf/2507.18719v2",
            "published": "2025-07-24 18:07:40+00:00",
            "updated": "2025-08-12 14:15:15+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Time Is a Feature: Exploiting Temporal Dynamics in Diffusion Language Models",
            "authors": "Wen Wang, Bozhen Fang, Chenchen Jing, Yongliang Shen, Yangyi Shen, Qiuyu Wang, Hao Ouyang, Hao Chen, Chunhua Shen",
            "summary": "Diffusion large language models (dLLMs) generate text through iterative\ndenoising, yet current decoding strategies discard rich intermediate\npredictions in favor of the final output. Our work here reveals a critical\nphenomenon, temporal oscillation, where correct answers often emerge in the\nmiddle process, but are overwritten in later denoising steps. To address this\nissue, we introduce two complementary methods that exploit temporal\nconsistency: 1) Temporal Self-Consistency Voting, a training-free, test-time\ndecoding strategy that aggregates predictions across denoising steps to select\nthe most consistent output; and 2) a post-training method termed Temporal\nConsistency Reinforcement, which uses Temporal Semantic Entropy (TSE), a\nmeasure of semantic stability across intermediate predictions, as a reward\nsignal to encourage stable generations. Empirical results across multiple\nbenchmarks demonstrate the effectiveness of our approach. Using the negative\nTSE reward alone, we observe a remarkable average improvement of 24.7% on the\nCountdown dataset over an existing dLLM. Combined with the accuracy reward, we\nachieve absolute gains of 2.0% on GSM8K, 4.3% on MATH500, 6.6% on SVAMP, and\n25.3% on Countdown, respectively. Our findings underscore the untapped\npotential of temporal dynamics in dLLMs and offer two simple yet effective\ntools to harness them.",
            "pdf_url": "http://arxiv.org/pdf/2508.09138v1",
            "published": "2025-08-12 17:59:57+00:00",
            "updated": "2025-08-12 17:59:57+00:00"
        },
        {
            "title": "TIDE : Temporal-Aware Sparse Autoencoders for Interpretable Diffusion Transformers in Image Generation",
            "authors": "Victor Shea-Jay Huang, Le Zhuo, Yi Xin, Zhaokai Wang, Fu-Yun Wang, Yuchi Wang, Renrui Zhang, Peng Gao, Hongsheng Li",
            "summary": "Diffusion Transformers (DiTs) are a powerful yet underexplored class of\ngenerative models compared to U-Net-based diffusion architectures. We propose\nTIDE-Temporal-aware sparse autoencoders for Interpretable Diffusion\ntransformErs-a framework designed to extract sparse, interpretable activation\nfeatures across timesteps in DiTs. TIDE effectively captures temporally-varying\nrepresentations and reveals that DiTs naturally learn hierarchical semantics\n(e.g., 3D structure, object class, and fine-grained concepts) during\nlarge-scale pretraining. Experiments show that TIDE enhances interpretability\nand controllability while maintaining reasonable generation quality, enabling\napplications such as safe image editing and style transfer.",
            "pdf_url": "http://arxiv.org/pdf/2503.07050v2",
            "published": "2025-03-10 08:35:51+00:00",
            "updated": "2025-08-12 15:22:30+00:00"
        },
        {
            "title": "Urban-STA4CLC: Urban Theory-Informed Spatio-Temporal Attention Model for Predicting Post-Disaster Commercial Land Use Change",
            "authors": "Ziyi Guo, Yan Wang",
            "summary": "Natural disasters such as hurricanes and wildfires increasingly introduce\nunusual disturbance on economic activities, which are especially likely to\nreshape commercial land use pattern given their sensitive to customer\nvisitation. However, current modeling approaches are limited in capturing such\ncomplex interplay between human activities and commercial land use change under\nand following disturbances. Such interactions have been more effectively\ncaptured in current resilient urban planning theories. This study designs and\ncalibrates a Urban Theory-Informed Spatio-Temporal Attention Model for\nPredicting Post-Disaster Commercial Land Use Change (Urban-STA4CLC) to predict\nboth the yearly decline and expansion of commercial land use at census block\nlevel under cumulative impact of disasters on human activities over two years.\nGuided by urban theories, Urban-STA4CLC integrates both spatial and temporal\nattention mechanisms with three theory-informed modules. Resilience theory\nguides a disaster-aware temporal attention module that captures visitation\ndynamics. Spatial economic theory informs a multi-relational spatial attention\nmodule for inter-block representation. Diffusion theory contributes a\nregularization term that constrains land use transitions. The model performs\nsignificantly better than non-theoretical baselines in predicting commercial\nland use change under the scenario of recurrent hurricanes, with around 19%\nimprovement in F1 score (0.8763). The effectiveness of the theory-guided\nmodules was further validated through ablation studies. The research\ndemonstrates that embedding urban theory into commercial land use modeling\nmodels may substantially enhance the capacity to capture its gains and losses.\nThese advances in commercial land use modeling contribute to land use research\nthat accounts for cumulative impacts of recurrent disasters and shifts in\neconomic activity patterns.",
            "pdf_url": "http://arxiv.org/pdf/2508.08976v1",
            "published": "2025-08-12 14:39:42+00:00",
            "updated": "2025-08-12 14:39:42+00:00"
        },
        {
            "title": "3DFacePolicy: Audio-Driven 3D Facial Animation Based on Action Control",
            "authors": "Xuanmeng Sha, Liyun Zhang, Tomohiro Mashita, Naoya Chiba, Yuki Uranishi",
            "summary": "Audio-driven 3D facial animation has achieved significant progress in both\nresearch and applications. While recent baselines struggle to generate natural\nand continuous facial movements due to their frame-by-frame vertex generation\napproach, we propose 3DFacePolicy, a pioneer work that introduces a novel\ndefinition of vertex trajectory changes across consecutive frames through the\nconcept of \"action\". By predicting action sequences for each vertex that encode\nframe-to-frame movements, we reformulate vertex generation approach into an\naction-based control paradigm. Specifically, we leverage a robotic control\nmechanism, diffusion policy, to predict action sequences conditioned on both\naudio and vertex states. Extensive experiments on VOCASET and BIWI datasets\ndemonstrate that our approach significantly outperforms state-of-the-art\nmethods and is particularly expert in dynamic, expressive and naturally smooth\nfacial animations.",
            "pdf_url": "http://arxiv.org/pdf/2409.10848v2",
            "published": "2024-09-17 02:30:34+00:00",
            "updated": "2025-08-12 14:24:42+00:00"
        },
        {
            "title": "Cut2Next: Generating Next Shot via In-Context Tuning",
            "authors": "Jingwen He, Hongbo Liu, Jiajun Li, Ziqi Huang, Yu Qiao, Wanli Ouyang, Ziwei Liu",
            "summary": "Effective multi-shot generation demands purposeful, film-like transitions and\nstrict cinematic continuity. Current methods, however, often prioritize basic\nvisual consistency, neglecting crucial editing patterns (e.g., shot/reverse\nshot, cutaways) that drive narrative flow for compelling storytelling. This\nyields outputs that may be visually coherent but lack narrative sophistication\nand true cinematic integrity. To bridge this, we introduce Next Shot Generation\n(NSG): synthesizing a subsequent, high-quality shot that critically conforms to\nprofessional editing patterns while upholding rigorous cinematic continuity.\nOur framework, Cut2Next, leverages a Diffusion Transformer (DiT). It employs\nin-context tuning guided by a novel Hierarchical Multi-Prompting strategy. This\nstrategy uses Relational Prompts to define overall context and inter-shot\nediting styles. Individual Prompts then specify per-shot content and\ncinematographic attributes. Together, these guide Cut2Next to generate\ncinematically appropriate next shots. Architectural innovations, Context-Aware\nCondition Injection (CACI) and Hierarchical Attention Mask (HAM), further\nintegrate these diverse signals without introducing new parameters. We\nconstruct RawCuts (large-scale) and CuratedCuts (refined) datasets, both with\nhierarchical prompts, and introduce CutBench for evaluation. Experiments show\nCut2Next excels in visual consistency and text fidelity. Crucially, user\nstudies reveal a strong preference for Cut2Next, particularly for its adherence\nto intended editing patterns and overall cinematic continuity, validating its\nability to generate high-quality, narratively expressive, and cinematically\ncoherent subsequent shots.",
            "pdf_url": "http://arxiv.org/pdf/2508.08244v2",
            "published": "2025-08-11 17:56:59+00:00",
            "updated": "2025-08-12 12:41:32+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Technical Report: Full-Stack Fine-Tuning for the Q Programming Language",
            "authors": "Brendan R. Hogan, Will Brown, Adel Boyarsky, Anderson Schneider, Yuriy Nevmyvaka",
            "summary": "Even though large language models are becoming increasingly capable, it is\nstill unreasonable to expect them to excel at tasks that are under-represented\non the Internet. Leveraging LLMs for specialized applications, particularly in\nniche programming languages and private domains, remains challenging and\nlargely unsolved. In this work, we address this gap by presenting a\ncomprehensive, open-source approach for adapting LLMs to the Q programming\nlanguage, a popular tool in quantitative finance that is much less present on\nthe Internet compared to Python, C, Java, and other ``mainstream\" languages and\nis therefore not a strong suit of general-purpose AI models. We introduce a new\nLeetcode style evaluation dataset for Q, benchmark major frontier models on the\ndataset, then do pretraining, supervised fine tuning, and reinforcement\nlearning to train a suite of reasoning and non-reasoning models based on the\nQwen-2.5 series, spanning five parameter sizes (1.5B, 3B, 7B, 14B, 32B). Our\nbest model achieves a pass@1 accuracy of 59 percent on our Q benchmark,\nsurpassing the best-performing frontier model, Claude Opus-4 by 29.5 percent.\nAdditionally, all models, even our 1.5B model, outperform GPT-4.1 on this task.\nIn addition to releasing models, code, and data, we provide a detailed\nblueprint for dataset construction, model pretraining, supervised fine-tuning,\nand reinforcement learning. Our methodology is broadly applicable, and we\ndiscuss how these techniques can be extended to other tasks, including those\nwhere evaluation may rely on soft or subjective signals.",
            "pdf_url": "http://arxiv.org/pdf/2508.06813v2",
            "published": "2025-08-09 04:22:07+00:00",
            "updated": "2025-08-12 15:49:05+00:00"
        },
        {
            "title": "Chimera: Harnessing Multi-Agent LLMs for Automatic Insider Threat Simulation",
            "authors": "Jiongchi Yu, Xiaofei Xie, Qiang Hu, Yuhan Ma, Ziming Zhao",
            "summary": "Insider threats, which can lead to severe losses, remain a major security\nconcern. While machine learning-based insider threat detection (ITD) methods\nhave shown promising results, their progress is hindered by the scarcity of\nhigh-quality data. Enterprise data is sensitive and rarely accessible, while\npublicly available datasets, when limited in scale due to cost, lack sufficient\nreal-world coverage; and when purely synthetic, they fail to capture rich\nsemantics and realistic user behavior. To address this, we propose Chimera, the\nfirst large language model (LLM)-based multi-agent framework that automatically\nsimulates both benign and malicious insider activities and collects diverse\nlogs across diverse enterprise environments. Chimera models each employee with\nagents that have role-specific behavior and integrates modules for group\nmeetings, pairwise interactions, and autonomous scheduling, capturing realistic\norganizational dynamics. It incorporates 15 types of insider attacks (e.g., IP\ntheft, system sabotage) and has been deployed to simulate activities in three\nsensitive domains: technology company, finance corporation, and medical\ninstitution, producing a new dataset, ChimeraLog. We assess ChimeraLog via\nhuman studies and quantitative analysis, confirming its diversity, realism, and\npresence of explainable threat patterns. Evaluations of existing ITD methods\nshow an average F1-score of 0.83, which is significantly lower than 0.99 on the\nCERT dataset, demonstrating ChimeraLog's higher difficulty and utility for\nadvancing ITD research.",
            "pdf_url": "http://arxiv.org/pdf/2508.07745v2",
            "published": "2025-08-11 08:24:48+00:00",
            "updated": "2025-08-12 07:58:02+00:00"
        },
        {
            "title": "Free Lunches with Vanishing Risks Most Likely Exist",
            "authors": "Eckhard Platen, Kevin Fergusson",
            "summary": "The hypothesis that there do not exist free lunches with vanishing risk\n(FLVRs) in the real market underpins the popular risk-neutral pricing and\nhedging methodology in quantitative finance. The paper documents the fact that\nthis hypothesis can be safely rejected. It performs extremely accurately the\nhedging of an extreme-maturity zero-coupon bond (ZCB). This hedge is part of a\nportfolio that starts with zero initial wealth and invests dynamically in a\ntotal return stock market index and the savings account to generate at the\nmaturity date of the extreme-maturity ZCB a strictly positive amount with\nstrictly positive probability, which represents an FLVR. The fact that FLVRs\nnaturally exist in the real market can be accommodated theoretically under the\nbenchmark approach.",
            "pdf_url": "http://arxiv.org/pdf/2508.07108v1",
            "published": "2025-08-09 21:33:57+00:00",
            "updated": "2025-08-09 21:33:57+00:00"
        }
    ]
}