{
    "Physics": [
        {
            "title": "Modeling wind farm noise emission and propagation: effects of flow layout",
            "authors": "J. Colas, A. Emmanuelli, D. Dragna, R. J. A. M. Stevens",
            "summary": "This study demonstrates how wind farm flow physics influence noise generation\nand downstream propagation through numerical simulations. The flow field is\nmodeled using large-eddy simulations (LES), and the time-averaged output serves\nas input to acoustic models that predict wind turbine noise. In the first\nturbine row, turbulence-induced noise (TIN) and trailing edge noise (TEN)\ncontribute equally, with TIN dominating at low frequencies and TEN at higher\nfrequencies. Downstream, TEN decreases due to lower wind speeds, while TIN\nmostly persists due to increased turbulence dissipation. These effects are more\npronounced in aligned wind farms, where stronger wake interactions occur, than\nin staggered layouts. However, staggered farms produce more noise overall\nbecause turbines operate at higher wind speeds.Additionally, wind farm flow\nsignificantly affects sound propagation downwind. The wake superposition\nmodifies sound focusing leading to different amplification area than for an\nisolated turbine. For a staggered layout it particularly shows enhanced sound\nfocusing downwind due to the position of the turbine wakes. This leads to\nhigher sound levels and higher amplitude modulation downwind for the wind farm\ncompared to an aligned layout. These phenomena are not captured by models based\non isolated turbines. These findings underscore the importance of integrating\nflow and acoustic models to more accurately assess the environmental impact of\nwind farms.",
            "pdf_url": "http://arxiv.org/pdf/2508.13128v1",
            "published": "2025-08-18 17:36:41+00:00",
            "updated": "2025-08-18 17:36:41+00:00"
        },
        {
            "title": "Probing Spin and Lifetime Correlations in Entangled Hyperon-AntiHyperon Pairs",
            "authors": "Aihong Tang",
            "summary": "Quantum entanglement has now been demonstrated in several hadronic systems,\nrevealing that non-classical spin correlations survive even through the\nstrong-interaction hadronization process. To date, however, all studies have\nfocused exclusively on angular observables, leaving the possibility untouched\nthat quantum coherence might also influence the decay times of entangled\npartners. In this work we propose data-driven tests of spin-lifetime and\nlifetime-lifetime correlations for Lambda-antiLambda pairs produced in\nhigh-energy collisions. By examining the opening-angle distribution in slices\nof Delta t, constructing a pair-wise spin-lifetime correlator, and testing a\nsimple lifetime-lifetime covariance, we search for deviations from independent\nexponential decay that align with known spin correlations. Observation of\nnonzero lifetime correlations would compel a reassessment of how entanglement\nmanifests in decaying systems, revealing hitherto unexplored temporal\ncoherence.",
            "pdf_url": "http://arxiv.org/pdf/2507.18507v2",
            "published": "2025-07-24 15:26:26+00:00",
            "updated": "2025-08-18 17:25:26+00:00"
        },
        {
            "title": "Rare event sampling for moving targets: extremes of temperature and daily precipitation in a general circulation model",
            "authors": "Justin Finkel, Paul A. O'Gorman",
            "summary": "Extreme weather events epitomize high cost: to society through their physical\nimpacts, and to computer servers that are used to simulate them to provide\ninformation to mitigate those impacts. It costs hundreds of years to sample a\nfew once-per-century events with straightforward model integration, but that\ncost can be much reduced with rare event sampling, which nudges ensembles of\nsimulations to convert moderate events to severe ones, e.g., by steering a\ncyclone directly through a region of interest. With proper statistical\naccounting, rare event algorithms can provide quantitative climate risk\nassessment at reduced cost. But this can only work if ensemble members diverge\nfast enough. Sudden, transient events characteristic of Earth's midlatitude\nstorm track regions, such as heavy precipitation and heat extremes, pose a\nparticular challenge because they come and go faster than an ensemble can\nexplore the possibilities. Here we extend standard rare event algorithms to\nhandle this challenging case in an idealized atmospheric general circulation\nmodel, achieving 5-10 times sped-up estimation of long return periods, such as\n100-150 years from only 20 years of simulation for extremes of daily\nprecipitation and surface temperature. The algorithm, called TEAMS\n(``trying-early adaptive multilevel splitting''), was developed previously in\nFinkel and O'Gorman (2024) using a toy chaotic system, and relies on a key\nparameter -- the advance split time -- which may be estimated based on simple\ndiagnostics of ensemble dispersion rates. The results are promising for\naccelerated risk assessment across a wide range of physical hazards using more\nrealistic and complex models with acute computational constraints.",
            "pdf_url": "http://arxiv.org/pdf/2508.13120v1",
            "published": "2025-08-18 17:24:26+00:00",
            "updated": "2025-08-18 17:24:26+00:00"
        },
        {
            "title": "Noise signatures of a charged Sachdev-Ye-Kitaev dot in mesoscopic transport",
            "authors": "Andrei I. Pavlov, Mikhail N. Kiselev",
            "summary": "We investigate quantum noise in a mesoscopic quantum dot serving as a\nrealization of the charged Sachdev-Ye-Kitaev (SYK) model weakly coupled to a\nfermionic lead via a tunnel contact. We find noise signatures under voltage and\ntemperature biases that can serve as clear markers of the SYK physics in\nexperiments with related setups. We develop a linear response theory that\ntreats all types of noise on the same footing and generalizes a concept of\ntransport coefficients for charge and heat currents, as well as relations\nbetween them, to equilibrium noise power. Within this theory, we find\ncharacteristic scaling of the noise coefficients with temperature in all\nregimes that can be relevant for experimental realizations of the SYK dots,\nfind a set of universal constants, with their values being unique to the SYK\nphysics, that connect these coefficients, and characterize noise manifestations\nof the Coulomb blockade. Beyond SYK systems, these results may serve as a\ngeneral framework for identification of non-Fermi-liquid signatures in\nmesoscopic transport and provide additional observables for experiments on\nthermoelectric phenomena.",
            "pdf_url": "http://arxiv.org/pdf/2508.13098v1",
            "published": "2025-08-18 17:07:54+00:00",
            "updated": "2025-08-18 17:07:54+00:00"
        },
        {
            "title": "AutoChemSchematic AI: Agentic Physics-Aware Automation for Chemical Manufacturing Scale-Up",
            "authors": "Sakhinana Sagar Srinivas, Shivam Gupta, Venkataramana Runkana",
            "summary": "Recent advances in generative AI have accelerated the discovery of novel\nchemicals and materials. However, scaling these discoveries to industrial\nproduction remains a major bottleneck due to the synthesis gap -- the need to\ndevelop entirely new manufacturing processes. This challenge requires detailed\nengineering blueprints: PFDs for equipment layouts and material/energy flows,\nand PIDs for process plant operations. Current AI systems cannot yet reliably\ngenerate these critical engineering schematics, creating a fundamental obstacle\nto manufacturing scale-up of novel discoveries. We present a closed-loop,\nphysics-aware framework for automated generation of industrially viable PFDs\nand PIDs. The framework integrates three key components: (1) domain-specialized\nsmall language models (SLMs) trained for auto-generation of PFDs and PIDs, (2)\na hierarchical knowledge graph containing process flow and instrumentation\ndescriptions for 1,020+ chemicals for Graph Retrieval-Augmented Generation\n(GRAG), and (3) an open-source chemical process simulator for modeling,\nsimulation, optimization, and analysis of novel chemical processes. The SLMs\nare trained through a multi-stage pipeline on synthetic datasets, with process\nsimulator-in-the-loop validation ensuring feasibility. To enhance computational\nefficiency, the framework implements structural pruning (width and depth)\nguided by importance heuristics to reduce language model size while preserving\naccuracy, followed by advanced inference optimizations including\nFlashAttention, Lookahead Decoding, PagedAttention with KV-cache quantization,\nand Test-Time Inference Scaling. Experimental results demonstrate that our\nframework generates simulator-validated process descriptions with high\nfidelity.",
            "pdf_url": "http://arxiv.org/pdf/2505.24584v3",
            "published": "2025-05-30 13:32:00+00:00",
            "updated": "2025-08-18 16:52:22+00:00"
        },
        {
            "title": "Poisson-Nernst-Planck charging dynamics of an electric double layer capacitor: symmetric and asymmetric binary electrolytes",
            "authors": "Ivan Palaia, Adelchi J. Asta, Megh Dutta, Patrick B. Warren, Benjamin Rotenberg, Emmanuel Trizac",
            "summary": "A parallel plate capacitor containing an electrolytic solution is the\nsimplest model of a supercapacitor, or electric double layer capacitor. Using\nboth analytical and numerical techniques, we solve the Poisson-Nernst-Planck\nequations for such a system, describing the mean-field charging dynamics of the\ncapacitor, when a constant potential difference is abruptly applied to its\nplates. Working at constant total number of ions, we focus on the physical\nprocesses involved in the relaxation and, whenever possible, give its\nfunctional shape and exact time constants. We first review and study the case\nof a symmetric binary electrolyte, where we assume the two ionic species to\nhave the same charges and diffusivities. We then relax these assumptions and\npresent results for a generic strong (i.e. fully dissociated) binary\nelectrolyte. At low electrolyte concentration, the relaxation is simple to\nunderstand, as the dynamics of positive and negative ions appear decoupled. At\nhigher electrolyte concentration, we distinguish several regimes. In the linear\nregime (low voltages), relaxation is multi-exponential, it starts by the\nbuild-up of the equilibrium charge profile and continues with neutral mass\ndiffusion, and the relevant time scales feature both the average and the\nNernst-Hartley diffusion coefficients. In the purely nonlinear regime\n(intermediate voltages), the initial relaxation is slowed down exponentially\ndue to increased capacitance, while bulk effects become more and more evident.\nIn the fully nonlinear regime (high voltages), the dynamics of charge and mass\nare completely entangled and, asymptotically, the relaxation is linear in time.\nWe finally discuss non-ideal behavior in real capacitors and provide conditions\nfor which mean-field is expected to hold.",
            "pdf_url": "http://arxiv.org/pdf/2303.07859v3",
            "published": "2023-03-14 12:50:41+00:00",
            "updated": "2025-08-18 16:51:27+00:00"
        },
        {
            "title": "Effective permeability conditions for diffusive transport through impermeable membranes with gaps",
            "authors": "Molly Brennan, Edwina F. Yeo, Philip Pearce, Mohit P. Dalwadi",
            "summary": "Membranes regulate transport in a wide variety of industrial and biological\napplications. The microscale geometry of the membrane can significantly affect\noverall transport through the membrane, but the precise nature of this\nmultiscale coupling is not well characterised in general. Motivated by the\napplication of transport across a bacterial membrane, in this paper we use\nformal multiscale analysis to derive explicit effective coupling conditions for\nmacroscale transport across a two-dimensional impermeable membrane with\nperiodically spaced gaps, and validate these with numerical simulations. We\nderive analytic expressions for effective macroscale quantities associated with\nthe membrane, such as the permeability, in terms of the microscale geometry.\nOur results generalise the classic constitutive membrane coupling conditions to\na wider range of membrane geometries and time-varying scenarios. Specifically,\nwe demonstrate that if the exterior concentration varies in time, for membranes\nwith long channels, the transport gains a memory property where the coupling\nconditions depend on the system history. By applying our effective conditions\nin the context of small molecule transport through gaps in bacterial membranes\ncalled porins, we predict that bacterial membrane permeability is primarily\ndominated by the thickness of the membrane. Furthermore, we predict how\nalterations to membrane microstructure, for example via changes to porin\nexpression, might affect overall transport, including when external\nconcentrations vary in time. These results will apply to a broad range of\nphysical applications with similar membrane structures, from medical and\nindustrial filtration to carbon capture.",
            "pdf_url": "http://arxiv.org/pdf/2508.10694v2",
            "published": "2025-08-14 14:36:43+00:00",
            "updated": "2025-08-18 16:48:12+00:00"
        },
        {
            "title": "Primary hairs may create echoes",
            "authors": "R. A. Konoplya, A. Zhidenko",
            "summary": "In most scenarios studied so far, the appearance of echoes in the ringdown\nsignal requires modifications external to the black hole itself, such as the\npresence of matter in the near-horizon region, quantum field clouds, or exotic\ncompact objects like wormholes that effectively introduce additional peaks in\nthe effective potential. In this work we show that echoes can naturally arise\nin a different setting: black holes endowed with primary Proca-Gauss-Bonnet\nhair. We demonstrate that the primary hair modifies the effective potential in\nsuch a way that a second peak is formed, giving rise to late-time echoes\nwithout invoking any external environment or exotic horizon-scale physics.\nUsing both the higher-order WKB method with Pad\\'e resummation and time-domain\nintegration, we compute the quasinormal spectrum for scalar and Dirac test\nfields and show the appearance of these echoes. Our results highlight a novel\nmechanism by which primary hairs alone can leave observable imprints on the\nringdown signal of black holes in modified gravity.",
            "pdf_url": "http://arxiv.org/pdf/2508.13069v1",
            "published": "2025-08-18 16:42:34+00:00",
            "updated": "2025-08-18 16:42:34+00:00"
        },
        {
            "title": "Regular BTZ black holes from an infinite tower of corrections",
            "authors": "Pedro G. S. Fernandes",
            "summary": "We explore $2+1$-dimensional scalar-tensor theories derived from well-defined\ndimensional regularizations of the Lovelock invariants. In the limit where an\ninfinite series of corrections is included, we obtain theories that admit fully\nregular black hole solutions. We analyze the properties of these regular black\nholes, investigate geodesics in these spacetimes, and examine the tidal forces,\nfinding they remain finite everywhere.",
            "pdf_url": "http://arxiv.org/pdf/2504.08565v2",
            "published": "2025-04-11 14:20:32+00:00",
            "updated": "2025-08-18 16:39:37+00:00"
        },
        {
            "title": "Quantum Phase Estimation Beyond the Gaussian Limit",
            "authors": "Kimin Park, Tanjung Krisnanda, Yvonne Gao, Radim Filip",
            "summary": "Quantum metrology aims to enhance measurement precision beyond the standard\nquantum limit (SQL), the benchmark set by classical resources, enabling\nadvances in sensing, imaging, and fundamental physics. A critical milestone\nbeyond the SQL is surpassing the Gaussian bound -- the fundamental precision\nlimit achievable with any Gaussian state, such as optimally squeezed states.\nCertain non-Gaussian states, specifically asymmetric superpositions of coherent\nstates (SCS) and superpositions of a vacuum and a Fock state (ON states), can\noutperform this Gaussian bound within an intermediate energy range. In\nparticular, asymmetric SCS emerge as a highly practical resource for near-term\nquantum sensing architectures operating beyond the Gaussian limit due to their\nefficient preparation and processing via a constant-complexity protocol. Our\ncomprehensive analysis under realistic loss, noise, and detection schemes\nquantifies the critical trade-off between achievable precision and the\noperational range of the non-Gaussian advantage. This work sheds light on the\nfundamental impact of non-Gaussianity and asymmetry on metrological tasks, and\noffers insights on how to leverage such resources in realistic near-term\nquantum enhanced sensors beyond the Gaussian limit.",
            "pdf_url": "http://arxiv.org/pdf/2508.13046v1",
            "published": "2025-08-18 16:03:28+00:00",
            "updated": "2025-08-18 16:03:28+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "MDPO: Overcoming the Training-Inference Divide of Masked Diffusion Language Models",
            "authors": "Haoyu He, Katrin Renz, Yong Cao, Andreas Geiger",
            "summary": "Diffusion language models, as a promising alternative to traditional\nautoregressive (AR) models, enable faster generation and richer conditioning on\nbidirectional context. However, they suffer from a key discrepancy between\ntraining and inference: during inference, MDLMs progressively reveal the\nstructure of the generated sequence by producing fewer and fewer masked tokens,\nwhereas this structure is ignored in training as tokens are masked at random.\nAlthough this discrepancy between training and inference can lead to suboptimal\nperformance, it has been largely overlooked by previous works, leaving closing\nthis gap between the two stages an open problem. To address this, we frame the\nproblem of learning effective denoising trajectories as a sequential\ndecision-making problem and use the resulting framework to apply reinforcement\nlearning. We propose a novel Masked Diffusion Policy Optimization (MDPO) to\nexploit the Markov property diffusion possesses and explicitly train the model\nunder the same progressive refining schedule used at inference. MDPO matches\nthe performance of the previous state-of-the-art (SOTA) method with 60x fewer\ngradient updates, while achieving average improvements of 9.6% on MATH500 and\n54.2% on Countdown over SOTA when trained within the same number of weight\nupdates. Additionally, we improve the remasking strategy of MDLMs as a plug-in\ninference replacement to overcome the limitation that the model cannot refine\ntokens flexibly. This simple yet effective training-free strategy, what we\nrefer to as RCR, consistently improves performance and yields additional gains\nwhen combined with MDPO. Our findings establish great potential for\ninvestigating the discrepancy between pre-training and inference of MDLMs.\nCode: https://github.com/autonomousvision/mdpo. Project Page:\nhttps://cli212.github.io/MDPO/.",
            "pdf_url": "http://arxiv.org/pdf/2508.13148v1",
            "published": "2025-08-18 17:58:13+00:00",
            "updated": "2025-08-18 17:58:13+00:00"
        },
        {
            "title": "Denoising diffusion models for inverse design of inflatable structures with programmable deformations",
            "authors": "Sara Karimi, Nikolaos N. Vlassis",
            "summary": "Programmable structures are systems whose undeformed geometries and material\nproperty distributions are deliberately designed to achieve prescribed deformed\nconfigurations under specific loading conditions. Inflatable structures are a\nprominent example, using internal pressurization to realize large, nonlinear\ndeformations in applications ranging from soft robotics and deployable\naerospace systems to biomedical devices and adaptive architecture. We present a\ngenerative design framework based on denoising diffusion probabilistic models\n(DDPMs) for the inverse design of elastic structures undergoing large,\nnonlinear deformations under pressure-driven actuation. The method formulates\nthe inverse design as a conditional generation task, using geometric\ndescriptors of target deformed states as inputs and outputting image-based\nrepresentations of the undeformed configuration. Representing these\nconfigurations as simple images is achieved by establishing a pre- and\npostprocessing pipeline that involves a fixed image processing, simulation\nsetup, and descriptor extraction methods. Numerical experiments with scalar and\nhigher-dimensional descriptors show that the framework can quickly produce\ndiverse undeformed configurations that achieve the desired deformations when\ninflated, enabling parallel exploration of viable design candidates while\naccommodating complex constraints.",
            "pdf_url": "http://arxiv.org/pdf/2508.13097v1",
            "published": "2025-08-18 17:07:51+00:00",
            "updated": "2025-08-18 17:07:51+00:00"
        },
        {
            "title": "From Transthoracic to Transesophageal: Cross-Modality Generation using LoRA Diffusion",
            "authors": "Emmanuel Oladokun, Yuxuan Ou, Anna Novikova, Daria Kulikova, Sarina Thomas, Jurica Šprem, Vicente Grau",
            "summary": "Deep diffusion models excel at realistic image synthesis but demand large\ntraining sets-an obstacle in data-scarce domains like transesophageal\nechocardiography (TEE). While synthetic augmentation has boosted performance in\ntransthoracic echo (TTE), TEE remains critically underrepresented, limiting the\nreach of deep learning in this high-impact modality.\n  We address this gap by adapting a TTE-trained, mask-conditioned diffusion\nbackbone to TEE with only a limited number of new cases and adapters as small\nas $10^5$ parameters. Our pipeline combines Low-Rank Adaptation with MaskR$^2$,\na lightweight remapping layer that aligns novel mask formats with the\npretrained model's conditioning channels. This design lets users adapt models\nto new datasets with a different set of anatomical structures to the base\nmodel's original set.\n  Through a targeted adaptation strategy, we find that adapting only MLP layers\nsuffices for high-fidelity TEE synthesis. Finally, mixing less than 200 real\nTEE frames with our synthetic echoes improves the dice score on a multiclass\nsegmentation task, particularly boosting performance on underrepresented\nright-heart structures. Our results demonstrate that (1) semantically\ncontrolled TEE images can be generated with low overhead, (2) MaskR$^2$\neffectively transforms unseen mask formats into compatible formats without\ndamaging downstream task performance, and (3) our method generates images that\nare effective for improving performance on a downstream task of multiclass\nsegmentation.",
            "pdf_url": "http://arxiv.org/pdf/2508.13077v1",
            "published": "2025-08-18 16:48:53+00:00",
            "updated": "2025-08-18 16:48:53+00:00"
        },
        {
            "title": "Reinforced Context Order Recovery for Adaptive Reasoning and Planning",
            "authors": "Long Ma, Fangwei Zhong, Yizhou Wang",
            "summary": "Modern causal language models, followed by rapid developments in discrete\ndiffusion models, can now produce a wide variety of interesting and useful\ncontent. However, these families of models are predominantly trained to output\ntokens with a fixed (left-to-right) or random order, which may deviate from the\nlogical order in which tokens are generated originally. In this paper, we\nobserve that current causal and diffusion models encounter difficulties in\nproblems that require adaptive token generation orders to solve tractably,\nwhich we characterize with the $\\mathcal{V}$-information framework. Motivated\nby this, we propose Reinforced Context Order Recovery (ReCOR), a\nreinforcement-learning-based framework to extract adaptive, data-dependent\ntoken generation orders from text data without annotations. Self-supervised by\ntoken prediction statistics, ReCOR estimates the hardness of predicting every\nunfilled token and adaptively selects the next token during both training and\ninference. Experiments on challenging reasoning and planning datasets\ndemonstrate the superior performance of ReCOR compared with baselines,\nsometimes outperforming oracle models supervised with the ground-truth order.",
            "pdf_url": "http://arxiv.org/pdf/2508.13070v1",
            "published": "2025-08-18 16:42:55+00:00",
            "updated": "2025-08-18 16:42:55+00:00"
        },
        {
            "title": "Improving Text Style Transfer using Masked Diffusion Language Models with Inference-time Scaling",
            "authors": "Tejomay Kishor Padole, Suyash P Awate, Pushpak Bhattacharyya",
            "summary": "Masked diffusion language models (MDMs) have recently gained traction as a\nviable generative framework for natural language. This can be attributed to its\nscalability and ease of training compared to other diffusion model paradigms\nfor discrete data, establishing itself as the state-of-the-art\nnon-autoregressive generator for discrete data. Diffusion models, in general,\nhave shown excellent ability to improve the generation quality by leveraging\ninference-time scaling either by increasing the number of denoising steps or by\nusing external verifiers on top of the outputs of each step to guide the\ngeneration. In this work, we propose a verifier-based inference-time scaling\nmethod that aids in finding a better candidate generation during the denoising\nprocess of the MDM. Our experiments demonstrate the application of MDMs for\nstandard text-style transfer tasks and establish MDMs as a better alternative\nto autoregressive language models. Additionally, we show that a simple\nsoft-value-based verifier setup for MDMs using off-the-shelf pre-trained\nembedding models leads to significant gains in generation quality even when\nused on top of typical classifier-free guidance setups in the existing\nliterature.",
            "pdf_url": "http://arxiv.org/pdf/2508.10995v2",
            "published": "2025-08-14 18:01:22+00:00",
            "updated": "2025-08-18 15:41:22+00:00"
        }
    ]
}