{
    "Physics": [
        {
            "title": "Emergent Non-Markovian Gain in Open Quantum Systems",
            "authors": "H. Z. Shen, Cheng Shang, Yan-Hui Zhou, X. X. Yi",
            "summary": "Non-Markovian dynamics go beyond the Markovian approximation by capturing\nmemory effects and information backflow in open quantum systems, which are\ncrucial for describing realistic physical processes. In this work, we study the\nexact non-Markovian dynamics of a driven cavity coupled to an anisotropic\nthree-dimensional photonic-crystal environment via counterrotating-wave\ninteractions. We derive an exact analytical expression for the cavity amplitude\nsatisfying the integro-differential equation, which includes the contributions\nof the bound states outside the continuum and the dissipative parts with the\ncontinuum spectrum. Based on the characteristic function method, we derive the\nexact non-Markovian master equation for the cavity, which contributes to the\ngain of the cavity. We give the physical origin of non-Markovian gain in the\npresence of bound states in the system consisting of cavity and environment,\nwhich has no Markovian counterparts due to the nonexponential gain in the\nnon-Markovian structured environment. We find that three different types of\nbound states can be formed in the system, containing one bound state with no\ninversion of photon number, two bound states with the periodic equal-amplitude\noscillation, and the gain with two complex roots without the bound states\nformation. We derive a current equation including the source from the driving\nfield, the transient current induced by the change in the number of photons,\nand the two-photon current caused by the counterrotating-wave term. The results\nare compared with those given by the rotating-wave interactions and extended to\na more general quantum network involving an arbitrary number of coupled\ncavities. Our findings may pave the way for a deeper understanding of\nnon-Markovian dynamics with gain in quantum networks involving\ncounterrotating-wave effects.",
            "pdf_url": "http://arxiv.org/pdf/2503.21739v1",
            "published": "2025-03-27 17:50:46+00:00",
            "updated": "2025-03-27 17:50:46+00:00"
        },
        {
            "title": "A Selective Homomorphic Encryption Approach for Faster Privacy-Preserving Federated Learning",
            "authors": "Abdulkadir Korkmaz, Praveen Rao",
            "summary": "Federated learning is a machine learning method that supports training models\non decentralized devices or servers, where each holds its local data, removing\nthe need for data exchange. This approach is especially useful in healthcare,\nas it enables training on sensitive data without needing to share them. The\nnature of federated learning necessitates robust security precautions due to\ndata leakage concerns during communication. To address this issue, we propose a\nnew approach that employs selective encryption, homomorphic encryption,\ndifferential privacy, and bit-wise scrambling to minimize data leakage while\nachieving good execution performance. Our technique , FAS (fast and secure\nfederated learning) is used to train deep learning models on medical imaging\ndata. We implemented our technique using the Flower framework and compared with\na state-of-the-art federated learning approach that also uses selective\nhomomorphic encryption. Our experiments were run in a cluster of eleven\nphysical machines to create a real-world federated learning scenario on\ndifferent datasets. We observed that our approach is up to 90\\% faster than\napplying fully homomorphic encryption on the model weights. In addition, we can\navoid the pretraining step that is required by our competitor and can save up\nto 46% in terms of total execution time. While our approach was faster, it\nobtained similar security results as the competitor.",
            "pdf_url": "http://arxiv.org/pdf/2501.12911v3",
            "published": "2025-01-22 14:37:44+00:00",
            "updated": "2025-03-27 17:44:27+00:00"
        },
        {
            "title": "Global isotopic analysis of rotational spectroscopic data for barium monofluoride, BaF",
            "authors": "Alex Preston, Graceson Aufderheide, Will Ballard, Richard Mawhorter, Jens-Uwe Grabow",
            "summary": "New high-precision microwave spectroscopic measurements and analysis of\nrotational energy level transitions in the ground vibronic state of the\nopen-shell BaF molecule are reported with the purpose of contributing to\nstudies of physics beyond the Standard Model. BaF is currently among the key\ncandidate molecules being examined in the searches for a measurable electron\nelectric dipole moment, eEDM, as well as the nuclear anapole moment. Employing\nFourier-transform microwave spectroscopy, these new pure rotational transition\nfrequencies for the 138Ba19F, 137Ba19F, 136Ba19F, 135Ba19F, and 134Ba19F\nisotopologues are analyzed here in a combined global fit with previous\nmicrowave data sets for 138Ba19F (v = 0 - 4), 137Ba19F, and 136Ba19F using the\nprogram SPFIT. As a result, hyperfine parameters are significantly improved,\nand we observe a distinctive structure in a Born-Oppenheimer breakdown (BOB)\nanalysis of the primary rotational constant. This can be understood using the\nnuclear field shifts due to the known isotopic variation in the size of barium\nnuclei and in combination with the smaller linear mass-dependent BOB terms.",
            "pdf_url": "http://arxiv.org/pdf/2503.21688v1",
            "published": "2025-03-27 16:54:53+00:00",
            "updated": "2025-03-27 16:54:53+00:00"
        },
        {
            "title": "Everything everywhere all at once: a probability-based enhanced sampling approach to rare events",
            "authors": "Enrico Trizio, Peilin Kang, Michele Parrinello",
            "summary": "The problem of studying rare events is central to many areas of computer\nsimulations. In a recent paper [Kang, P., et al., Nat. Comput. Sci. 4, 451-460,\n2024], we have shown that a powerful way of solving this problem passes through\nthe computation of the committor function, and we have demonstrated how the\ncommittor can be iteratively computed in a variational way and the transition\nstate ensemble efficiently sampled. Here, we greatly ameliorate this procedure\nby combining it with a metadynamics-like enhanced sampling approach in which a\nlogarithmic function of the committor is used as a collective variable. This\nintegrated procedure leads to an accurate and balanced sampling of the free\nenergy surface in which transition states and metastable basins are studied\nwith the same thoroughness. We also show that our approach can be used in cases\nin which competing reactive paths are possible and intermediate metastable are\nencountered. In addition, we demonstrate how physical insights can be obtained\nfrom the optimized committor model and the sampled data, thus providing a full\ncharacterization of the rare event under study. We ascribe the success of this\napproach to the use of a probability-based description of rare events.",
            "pdf_url": "http://arxiv.org/pdf/2410.17029v4",
            "published": "2024-10-22 13:56:18+00:00",
            "updated": "2025-03-27 16:52:20+00:00"
        },
        {
            "title": "Continuous and Discrete Symmetries in a 4D Field-Theoretic Model: Symmetry Operators and Their Algebraic Structures",
            "authors": "R. P. Malik",
            "summary": "Within the framework of Becchi-Rouet-Stora-Tyutin (BRST) formalism, we show\nthe existence of (i) a couple of off-shell nilpotent (i.e. fermionic) BRST and\nco-BRST symmetry transformations, and (ii) a full set of non-nilpotent (i.e.\nbosonic) symmetry transformations for an appropriate Lagrangian density that\ndescribes the combined system of the free Abelian 3-form and 1-form gauge\ntheories in the physical four (3 + 1)-dimensions of the flat Minkowskian\nspacetime. We concentrate on the full algebraic structures of the above\ncontinuous symmetry transformation operators along with a couple of very useful\ndiscrete duality symmetry transformation operators existing in our four (3 +\n1)-dimensional (4D) field-theoretic model. We establish the relevance of the\nalgebraic structures, respected by the above discrete and continuous symmetry\noperators, to the algebraic structures that are obeyed by the de Rham\ncohomological operators of differential geometry. One of the highlights of our\npresent endeavor is the observation that there are no ``exotic'' fields with\nthe negative kinetic terms in our present 4D field-theoretic example for Hodge\ntheory.",
            "pdf_url": "http://arxiv.org/pdf/2503.21680v1",
            "published": "2025-03-27 16:49:23+00:00",
            "updated": "2025-03-27 16:49:23+00:00"
        },
        {
            "title": "Cognitive Science-Inspired Evaluation of Core Capabilities for Object Understanding in AI",
            "authors": "Danaja Rutar, Alva Markelius, Konstantinos Voudouris, José Hernández-Orallo, Lucy Cheke",
            "summary": "One of the core components of our world models is 'intuitive physics' - an\nunderstanding of objects, space, and causality. This capability enables us to\npredict events, plan action and navigate environments, all of which rely on a\ncomposite sense of objecthood. Despite its importance, there is no single,\nunified account of objecthood, though multiple theoretical frameworks provide\ninsights. In the first part of this paper, we present a comprehensive overview\nof the main theoretical frameworks in objecthood research - Gestalt psychology,\nenactive cognition, and developmental psychology - and identify the core\ncapabilities each framework attributes to object understanding, as well as what\nfunctional roles they play in shaping world models in biological agents. Given\nthe foundational role of objecthood in world modelling, understanding\nobjecthood is also essential in AI. In the second part of the paper, we\nevaluate how current AI paradigms approach and test objecthood capabilities\ncompared to those in cognitive science. We define an AI paradigm as a\ncombination of how objecthood is conceptualised, the methods used for studying\nobjecthood, the data utilised, and the evaluation techniques. We find that,\nwhilst benchmarks can detect that AI systems model isolated aspects of\nobjecthood, the benchmarks cannot detect when AI systems lack functional\nintegration across these capabilities, not solving the objecthood challenge\nfully. Finally, we explore novel evaluation approaches that align with the\nintegrated vision of objecthood outlined in this paper. These methods are\npromising candidates for advancing from isolated object capabilities toward\ngeneral-purpose AI with genuine object understanding in real-world contexts.",
            "pdf_url": "http://arxiv.org/pdf/2503.21668v1",
            "published": "2025-03-27 16:35:02+00:00",
            "updated": "2025-03-27 16:35:02+00:00"
        },
        {
            "title": "Fracton and Non-Lorentzian Particle Duality: Gauge Field Couplings and Geometric Implications",
            "authors": "M. M. Ahmadi-Jahmani, A. Parvizi",
            "summary": "Fractons, characterized by restricted mobility and governed by higher-moment\nconservation laws, represent a novel phase of matter with deep connections to\ntensor gauge theories and emergent gravity. This work systematically explores\nthe duality between fractons and non-Lorentzian particles -- Carroll and\nGalilean -- within electromagnetic (EM) fields. By constructing canonical\nactions for fractons in rank-2 gauge fields, we derive their equations of\nmotion and demonstrate that static fractons exhibit duality with\nelectric-sector of Carroll particles, while mobile fracton dipoles correspond\nto both electric and magnetic sectors of Galilean particles. The algebraic\nunderpinnings of these dualities are clarified through symmetry analyses,\nrevealing structural parallels between the fracton and Carroll/Galilean\nalgebras. Furthermore, by gauging the fracton algebra, we develop a geometric\nframework for fracton gravity, linking it to non-Lorentzian spacetime\ngeometries. These results unify fracton dynamics with non-relativistic and\nultra-relativistic limits of physics, offering insights into emergent gravity\nand exotic condensed matter systems.",
            "pdf_url": "http://arxiv.org/pdf/2503.21660v1",
            "published": "2025-03-27 16:24:08+00:00",
            "updated": "2025-03-27 16:24:08+00:00"
        },
        {
            "title": "Logging the conformal life of Ramanujan's $π$",
            "authors": "Faizan Bhat, Aninda Sinha",
            "summary": "In 1914, Ramanujan presented 17 infinite series for $1/\\pi$. We examine the\nphysics origin of these remarkable formulae by connecting them to 2D\nlogarithmic conformal field theories (LCFTs) which arise in various contexts\nsuch as the fractional quantum hall effect, percolation and polymers. In light\nof the LCFT connection, we investigate such infinite series in terms of the\nphysics data, i.e., the operator spectrum and OPE coefficients of the CFT and\nthe conformal block expansion. These considerations lead to novel\napproximations for $1/\\pi$. The rapid convergence of the Ramanujan series\nmotivates us to take advantage of the crossing symmetry of the LCFT correlators\nto find new and efficient representations. To achieve this, we use the\nparametric crossing symmetric dispersion relation which was recently developed\nfor string amplitudes. Quite strikingly, we find remarkable simplifications in\nthe new representations, where, in the Legendre relation, the entire\ncontribution to $1/\\pi$ comes from the logarithmic identity operator, hinting\nat a universal property of LCFTs. Additionally, the dispersive representation\ngives us a new handle on the double-lightcone limit.",
            "pdf_url": "http://arxiv.org/pdf/2503.21656v1",
            "published": "2025-03-27 16:21:08+00:00",
            "updated": "2025-03-27 16:21:08+00:00"
        },
        {
            "title": "Electric conductivity in graphene: Kubo model versus a nonlocal quantum field theory model",
            "authors": "Pablo Rodriguez-Lopez, Jian-Sheng Wang, Mauro Antezza",
            "summary": "We compare three models of graphene electric conductivity: a non-local Kubo\nmodel, a local model derived by Falkovsky, and finally, a non-local quantum\nfield theory (QFT) polarization-based model. These models are supposed to\nprovide consistent results since they are derived from the same Hamiltonian.\nWhile we confirm that the local model is a proper $\\textbf{q}\\to\\textbf{0}$\nlimit of both the non-local Kubo and the non-local QFT model (once losses are\nadded to this last model), we find hard inconsistencies in the non-local QFT\nmodel as derived and currently used in literature. In particular, in the\ngenuine non-local region ($\\textbf{q}\\neq\\textbf{0}$), the available QFT model\nshows an intrinsic non-physical plasma-like behavior for the interband\ntransversal electric conductivity at low frequencies (even after introducing\nthe unavoidable losses). The Kubo model, instead, shows the expected behavior,\ni.e., an almost constant electric conductivity as a function of frequency\n$\\omega$ with a gap for frequencies $\\hbar\\omega<\\sqrt{(\\hbar v_F\nq)^{2}+4m^{2}}$. We show that the Kubo and QFT models can be expressed using an\nidentical Polarization operator $\\Pi_{\\mu\\nu}(\\omega,\\textbf{q})$, but they\nemploy different expressions for the electric conductivity\n$\\sigma_{\\mu\\nu}(\\omega,\\textbf{q})$. In particular, the Kubo model uses a\nstandard regularized expression, a direct consequence of Ohm's Law and\ncausality, as we rigorously re-derive. We show that, once the standard\nregularized expression for $\\sigma_{\\mu\\nu}(\\omega,\\textbf{q})$ is used in the\nQFT model, and losses are included, the Kubo and QFT model coincide, and all\nits anomalies naturally disappear. Our findings show the necessity to\nappropriately define and regularize the electric conductivity to connect it\nwith the available QFT model.",
            "pdf_url": "http://arxiv.org/pdf/2403.02279v3",
            "published": "2024-03-04 18:09:08+00:00",
            "updated": "2025-03-27 16:09:48+00:00"
        },
        {
            "title": "Vortex-Free Intrinsic Orbital Angular Momentum",
            "authors": "Wenxiang Yan, Zheng Yuan, Yuan Gao, Xian Long, Zhi-Cheng Ren, Xi-Lin Wang, Jianping Ding, Hui-Tian Wang",
            "summary": "For three decades, optical orbital angular momentum (OAM) has been synonymous\nwith phase vortices. Here, our research challenges this paradigm by\ndemonstrating a vortex-free intrinsic OAM arising from three-dimensional\ncaustic trajectories in structured light fields, distinct from traditional\nvortex-based mechanisms. Optical OAM was traditionally considered rare,\npredominantly manifesting during high-order atomic and molecular transitions.\nThe conceptual shift initiated by Allen et al. in 1992, which showed that laser\nbeams with optical vortex--characterized by their twisted wavefronts--naturally\ncarry intrinsic OAM, laid the groundwork for subsequent studies. However, the\nexploration of intrinsic OAM in vortex-free laser modes remains a largely\nuntapped area. Addressing this gap, our research proposes a third category of\noptical intrinsic angular momentum--termed \"vortex-free OAM\"--that complements\nspin angular momentum (SAM) in circularly polarized beams and OAM in vortex\nbeams. This new form of OAM is governed by a hydrodynamic analogy between light\npropagation and fluid dynamics, linking the orbital motion of energy\nstreamlines to quantifiable angular momentum. Through numerical simulations,\nexperimental measurements, and investigations of the mechanical transfer of OAM\nto trapped particles using optical tweezers, we establish vortex-free OAM as a\nuniversal property of structured fields with three-dimensional caustic\ntrajectories. Furthermore, we propose a unified hydrodynamic framework that\ntranscends traditional wavefront-centric models, facilitating the\ngeneralization of OAM analysis to both vortex and vortex-free regimes. This\nframework not only enhances our understanding of the physical origin of optical\nangular momentum but also unlocks new opportunities in optical manipulation,\nclassical and quantum communications, and light-matter interaction\ntechnologies.",
            "pdf_url": "http://arxiv.org/pdf/2503.21632v1",
            "published": "2025-03-27 15:54:58+00:00",
            "updated": "2025-03-27 15:54:58+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "StyleMotif: Multi-Modal Motion Stylization using Style-Content Cross Fusion",
            "authors": "Ziyu Guo, Young Yoon Lee, Joseph Liu, Yizhak Ben-Shabat, Victor Zordan, Mubbasir Kapadia",
            "summary": "We present StyleMotif, a novel Stylized Motion Latent Diffusion model,\ngenerating motion conditioned on both content and style from multiple\nmodalities. Unlike existing approaches that either focus on generating diverse\nmotion content or transferring style from sequences, StyleMotif seamlessly\nsynthesizes motion across a wide range of content while incorporating stylistic\ncues from multi-modal inputs, including motion, text, image, video, and audio.\nTo achieve this, we introduce a style-content cross fusion mechanism and align\na style encoder with a pre-trained multi-modal model, ensuring that the\ngenerated motion accurately captures the reference style while preserving\nrealism. Extensive experiments demonstrate that our framework surpasses\nexisting methods in stylized motion generation and exhibits emergent\ncapabilities for multi-modal motion stylization, enabling more nuanced motion\nsynthesis. Source code and pre-trained models will be released upon acceptance.\nProject Page: https://stylemotif.github.io",
            "pdf_url": "http://arxiv.org/pdf/2503.21775v1",
            "published": "2025-03-27 17:59:46+00:00",
            "updated": "2025-03-27 17:59:46+00:00"
        },
        {
            "title": "A Unified Framework for Diffusion Bridge Problems: Flow Matching and Schrödinger Matching into One",
            "authors": "Minyoung Kim",
            "summary": "The bridge problem is to find an SDE (or sometimes an ODE) that bridges two\ngiven distributions. The application areas of the bridge problem are enormous,\namong which the recent generative modeling (e.g., conditional or unconditional\nimage generation) is the most popular. Also the famous Schr\\\"{o}dinger bridge\nproblem, a widely known problem for a century, is a special instance of the\nbridge problem. Two most popular algorithms to tackle the bridge problems in\nthe deep learning era are: (conditional) flow matching and iterative fitting\nalgorithms, where the former confined to ODE solutions, and the latter\nspecifically for the Schr\\\"{o}dinger bridge problem. The main contribution of\nthis article is in two folds: i) We provide concise reviews of these algorithms\nwith technical details to some extent; ii) We propose a novel unified\nperspective and framework that subsumes these seemingly unrelated algorithms\n(and their variants) into one. In particular, we show that our unified\nframework can instantiate the Flow Matching (FM) algorithm, the (mini-batch)\noptimal transport FM algorithm, the (mini-batch) Schr\\\"{o}dinger bridge FM\nalgorithm, and the deep Schr\\\"{o}dinger bridge matching (DSBM) algorithm as its\nspecial cases. We believe that this unified framework will be useful for\nviewing the bridge problems in a more general and flexible perspective, and in\nturn can help researchers and practitioners to develop new bridge algorithms in\ntheir fields.",
            "pdf_url": "http://arxiv.org/pdf/2503.21756v1",
            "published": "2025-03-27 17:57:03+00:00",
            "updated": "2025-03-27 17:57:03+00:00"
        },
        {
            "title": "TripoSG: High-Fidelity 3D Shape Synthesis using Large-Scale Rectified Flow Models",
            "authors": "Yangguang Li, Zi-Xin Zou, Zexiang Liu, Dehu Wang, Yuan Liang, Zhipeng Yu, Xingchao Liu, Yuan-Chen Guo, Ding Liang, Wanli Ouyang, Yan-Pei Cao",
            "summary": "Recent advancements in diffusion techniques have propelled image and video\ngeneration to unprecedented levels of quality, significantly accelerating the\ndeployment and application of generative AI. However, 3D shape generation\ntechnology has so far lagged behind, constrained by limitations in 3D data\nscale, complexity of 3D data processing, and insufficient exploration of\nadvanced techniques in the 3D domain. Current approaches to 3D shape generation\nface substantial challenges in terms of output quality, generalization\ncapability, and alignment with input conditions. We present TripoSG, a new\nstreamlined shape diffusion paradigm capable of generating high-fidelity 3D\nmeshes with precise correspondence to input images. Specifically, we propose:\n1) A large-scale rectified flow transformer for 3D shape generation, achieving\nstate-of-the-art fidelity through training on extensive, high-quality data. 2)\nA hybrid supervised training strategy combining SDF, normal, and eikonal losses\nfor 3D VAE, achieving high-quality 3D reconstruction performance. 3) A data\nprocessing pipeline to generate 2 million high-quality 3D samples, highlighting\nthe crucial rules for data quality and quantity in training 3D generative\nmodels. Through comprehensive experiments, we have validated the effectiveness\nof each component in our new framework. The seamless integration of these parts\nhas enabled TripoSG to achieve state-of-the-art performance in 3D shape\ngeneration. The resulting 3D shapes exhibit enhanced detail due to\nhigh-resolution capabilities and demonstrate exceptional fidelity to input\nimages. Moreover, TripoSG demonstrates improved versatility in generating 3D\nmodels from diverse image styles and contents, showcasing strong generalization\ncapabilities. To foster progress and innovation in the field of 3D generation,\nwe will make our model publicly available.",
            "pdf_url": "http://arxiv.org/pdf/2502.06608v3",
            "published": "2025-02-10 16:07:54+00:00",
            "updated": "2025-03-27 17:25:50+00:00"
        },
        {
            "title": "Adaptive Orchestration for Large-Scale Inference on Heterogeneous Accelerator Systems Balancing Cost, Performance, and Resilience",
            "authors": "Yahav Biran, Imry Kissos",
            "summary": "The surge in generative AI workloads has created a need for scalable\ninference systems that can flexibly harness both GPUs and specialized\naccelerators while containing operational costs. This paper proposes a\nhardware-agnostic control loop that adaptively allocates requests across\nheterogeneous accelerators based on real-time cost and capacity signals. The\napproach sustains low latency and high throughput by dynamically shifting\nbetween cost-optimized and capacity-optimized modes, ensuring the most\nefficient use of expensive compute resources under fluctuating availability.\nEvaluated using the Stable Diffusion model, the framework consistently meets\nlatency targets, automatically redirects traffic during capacity shortfalls,\nand capitalizes on lower-cost accelerators when possible. These results\nhighlight how a feedback-driven deployment strategy, spanning the entire\nsoftware and hardware stack, can help organizations efficiently scale\ngenerative AI workloads while maintaining resilience in the face of limited\naccelerator capacity.",
            "pdf_url": "http://arxiv.org/pdf/2503.20074v2",
            "published": "2025-03-25 21:20:11+00:00",
            "updated": "2025-03-27 17:16:44+00:00"
        },
        {
            "title": "Progressive Rendering Distillation: Adapting Stable Diffusion for Instant Text-to-Mesh Generation without 3D Data",
            "authors": "Zhiyuan Ma, Xinyue Liang, Rongyuan Wu, Xiangyu Zhu, Zhen Lei, Lei Zhang",
            "summary": "It is highly desirable to obtain a model that can generate high-quality 3D\nmeshes from text prompts in just seconds. While recent attempts have adapted\npre-trained text-to-image diffusion models, such as Stable Diffusion (SD), into\ngenerators of 3D representations (e.g., Triplane), they often suffer from poor\nquality due to the lack of sufficient high-quality 3D training data. Aiming at\novercoming the data shortage, we propose a novel training scheme, termed as\nProgressive Rendering Distillation (PRD), eliminating the need for 3D\nground-truths by distilling multi-view diffusion models and adapting SD into a\nnative 3D generator. In each iteration of training, PRD uses the U-Net to\nprogressively denoise the latent from random noise for a few steps, and in each\nstep it decodes the denoised latent into 3D output. Multi-view diffusion\nmodels, including MVDream and RichDreamer, are used in joint with SD to distill\ntext-consistent textures and geometries into the 3D outputs through score\ndistillation. Since PRD supports training without 3D ground-truths, we can\neasily scale up the training data and improve generation quality for\nchallenging text prompts with creative concepts. Meanwhile, PRD can accelerate\nthe inference speed of the generation model in just a few steps. With PRD, we\ntrain a Triplane generator, namely TriplaneTurbo, which adds only $2.5\\%$\ntrainable parameters to adapt SD for Triplane generation. TriplaneTurbo\noutperforms previous text-to-3D generators in both efficiency and quality.\nSpecifically, it can produce high-quality 3D meshes in 1.2 seconds and\ngeneralize well for challenging text input. The code is available at\nhttps://github.com/theEricMa/TriplaneTurbo.",
            "pdf_url": "http://arxiv.org/pdf/2503.21694v1",
            "published": "2025-03-27 16:59:15+00:00",
            "updated": "2025-03-27 16:59:15+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "From Deep Learning to LLMs: A survey of AI in Quantitative Investment",
            "authors": "Bokai Cao, Saizhuo Wang, Xinyi Lin, Xiaojun Wu, Haohan Zhang, Lionel M. Ni, Jian Guo",
            "summary": "Quantitative investment (quant) is an emerging, technology-driven approach in\nasset management, increasingy shaped by advancements in artificial\nintelligence. Recent advances in deep learning and large language models (LLMs)\nfor quant finance have improved predictive modeling and enabled agent-based\nautomation, suggesting a potential paradigm shift in this field. In this\nsurvey, taking alpha strategy as a representative example, we explore how AI\ncontributes to the quantitative investment pipeline. We first examine the early\nstage of quant research, centered on human-crafted features and traditional\nstatistical models with an established alpha pipeline. We then discuss the rise\nof deep learning, which enabled scalable modeling across the entire pipeline\nfrom data processing to order execution. Building on this, we highlight the\nemerging role of LLMs in extending AI beyond prediction, empowering autonomous\nagents to process unstructured data, generate alphas, and support\nself-iterative workflows.",
            "pdf_url": "http://arxiv.org/pdf/2503.21422v1",
            "published": "2025-03-27 12:10:15+00:00",
            "updated": "2025-03-27 12:10:15+00:00"
        }
    ]
}