{
    "Physics": [
        {
            "title": "Neutrino Nonstandard Interactions and Lepton Flavor Universality violation at SND@LHC via charm production",
            "authors": "Bhubanjyoti Bhattacharya, Alakabha Datta, Elena Graverini, Lopamudra Mukherjee, Divya Sachdeva, John Waite",
            "summary": "In this work, we explore the effect of neutrino nonstandard interactions\n(NSI) involving the charm quark at SND@LHC. Using an effective description of\nnew physics in terms of four-fermion operators involving a charm quark, we\nconstrain the Wilson coefficients of the effective interaction from two and\nthree-body charmed meson decays. In our fit, we include charmed meson decays\nnot only to pseudoscalar final states but also to vector final states and\ninclude decays to the $\\eta$ and $\\eta^\\prime$ final states. We also consider\nconstraints from charmed baryon decays. We then study the effect of new physics\nin neutrino scattering processes, involving charm production at SND@LHC, for\nvarious benchmark new physics couplings obtained from the low energy fits.\nFinally, we also study the effects of lepton universality violation (LUV)\nassuming that the new physics coupling is not lepton universal.",
            "pdf_url": "http://arxiv.org/pdf/2408.11897v3",
            "published": "2024-08-21 18:00:02+00:00",
            "updated": "2025-01-02 18:59:27+00:00"
        },
        {
            "title": "Design, Construction, and Test of Compact, Distributed-Charge, X-Band Accelerator Systems that Enable Image-Guided, VHEE FLASH Radiotherapy",
            "authors": "Christopher P. J. Barty, J. Martin Algots, Alexander J. Amador, James C. R. Barty, Shawn M. Betts, Marcelo A. Castañeda, Matthew M. Chu, Michael E. Daley, Ricardo A. De Luna Lopez, Derek A. Diviak, Haytham H. Effarah, Roberto Feliciano, Adan Garcia, Keith J. Grabiel, Alex S. Griffin, Frederic V. Hartemann, Leslie Heid, Yoonwoo Hwang, Gennady Imeshev, Michael Jentschel, Christopher A. Johnson, Kenneth W. Kinosian, Agnese Lagzda, Russell J. Lochrie, Michael W. May, Everardo Molina, Christopher L. Nagel, Henry J. Nagel, Kyle R. Peirce, Zachary R. Peirce, Mauricio E. Quiñonez, Ferenc Raksi, Kelanu Ranganath, Trevor Reutershan, Jimmie Salazar, Mitchell E. Schneider, Michael W. L. Seggebruch, Joy Y. Yang, Nathan H. Yeung, Collette B. Zapata, Luis E. Zapata, Eric J. Zepeda, Jingyuan Zhang",
            "summary": "The design and optimization of laser-Compton x-ray systems based on compact\ndistributed charge accelerator structures can enable micron-scale imaging of\ndisease and the concomitant production of beams of Very High Energy Electrons\n(VHEEs) capable of producing FLASH-relevant dose rates. The physics of\nlaser-Compton x-ray scattering ensures that the scattered x-rays follow exactly\nthe trajectory of the incident electrons, thus providing a route to\nimage-guided, VHEE FLASH radiotherapy. The keys to a compact architecture\ncapable of producing both laser-Compton x-rays and VHEEs are the use of X-band\nRF accelerator structures which have been demonstrated to operate with over 100\nMeV/m acceleration gradients. The operation of these structures in a\ndistributed charge mode in which each radiofrequency (RF) cycle of the drive RF\npulse is filled with a low-charge, high-brightness electron bunch is enabled by\nthe illumination of a high-brightness photogun with a train of UV laser pulses\nsynchronized to the frequency of the underlying accelerator system. The UV\npulse trains are created by a patented pulse synthesis approach which utilizes\nthe RF clock of the accelerator to phase and amplitude modulate a narrow band\ncontinuous wave (CW) seed laser. In this way it is possible to produce up to 10\n$\\mu$A of average beam current from the accelerator. Such high current from a\ncompact accelerator enables production of sufficient x-rays via laser-Compton\nscattering for clinical imaging and does so from a machine of \"clinical\"\nfootprint. At the same time, the production of 1000 or greater individual\nmicro-bunches per RF pulse enables > 10 nC of charge to be produced in a\nmacrobunch of < 100 ns. The design, construction, and test of the 100-MeV class\nprototype system in Irvine, CA is also presented.",
            "pdf_url": "http://arxiv.org/pdf/2408.04082v2",
            "published": "2024-08-07 20:53:41+00:00",
            "updated": "2025-01-02 18:52:03+00:00"
        },
        {
            "title": "PyAtoms: An interactive tool for rapidly simulating atomic scanning tunneling microscopy images of 2D materials, moiré systems and superlattices",
            "authors": "Christopher Gutiérrez, Asari G. Prado",
            "summary": "We present PyAtoms, an interactive open-source software that quickly and\neasily simulates atomic-scale scanning tunneling microscopy (STM) images of\ntwo-dimensional (2D) layered materials, moir\\'{e} systems, and superlattices.\nRooted in a Fourier-space description of ideal atomic lattice images, PyAtoms\nis a Python-based graphical user interface (GUI) with robust capabilities for\ntuning lattice parameters (lattice constants, strain, number of layers, twist\nangles) and STM imaging parameters (pixels, scan size, scan angle) and provides\ntime estimates for spectroscopic measurements. These capabilities allow users\nto efficiently plan time-consuming STM experiments. We provide an overview of\nPyAtoms' current features, describe its underlying mathematical principles, and\nthen demonstrate simulations of several 2D materials including graphene with\nvariable sub-lattice asymmetry, twisted tri-layer graphene moir\\'{e} systems,\nand charge- and bond-density wave systems (2$H$-NbSe$_2$, 1$T$-TaS$_2$,\nKekul\\'{e}-distorted graphene, K$_{0.3}$MoO$_3$). Finally, we show that PyAtoms\ncan be used as a useful educational tool in entry- and senior-level physics\ncourses.",
            "pdf_url": "http://arxiv.org/pdf/2412.18332v2",
            "published": "2024-12-24 10:35:21+00:00",
            "updated": "2025-01-02 18:11:43+00:00"
        },
        {
            "title": "Landau Level Single-Electron Pumping",
            "authors": "E. Pyurbeeva, M. D. Blumenthal, J. A. Mol, H. Howe, H. E. Beere, T. Mitchell, D. A. Ritchie, M. Pepper",
            "summary": "We present the first detailed study of the effect of a strong magnetic field\non single-electron pumping in a device utilising a finger-gate split-gate\nconfiguration. In the quantum Hall regime, we demonstrate electron pumping from\nLandau levels in the leads, where the measurements exhibit pronounced\noscillations in the lengths of the pumping plateaus with the magnetic field,\nreminiscent of Shubnikov-de Haas oscillations. This similarity indicates that\nthe pumping process is dependent on the density of states of the 2D electron\ngas over a narrow energy window. Based on these observations, we develop a new\ntheoretical description of the operation of single-electron pumps which for the\nfirst time allows for the determination of the physical parameters of the\nexperiment; such as the capture energy of the electrons, the broadening of the\nquantised Landau levels in the leads, and the quantum lifetime of the\nelectrons.",
            "pdf_url": "http://arxiv.org/pdf/2406.13615v3",
            "published": "2024-06-19 15:09:51+00:00",
            "updated": "2025-01-02 17:54:47+00:00"
        },
        {
            "title": "A family of instanton-invariants for four-manifolds and their relation to Khovanov homology",
            "authors": "Michael Bleher",
            "summary": "This article reviews Witten's gauge-theoretic approach to Khovanov homology\nfrom the perspective of Haydys-Witten instanton Floer theory. Expanding on\nWitten's arguments, we introduce a one-parameter family of instanton Floer\nhomology groups $HF_{\\theta}(W^4)$, which, based on physical arguments, are\nexpected to be topological invariants of the four-manifold $W^4$. In analogy to\nthe original Yang-Mills instanton Floer theory, these groups are defined by the\nsolutions of the $\\theta$-Kapustin-Witten equations on $W^4$ modulo instanton\nsolutions of the Haydys-Witten equations that interpolate between them on the\nfive-dimensional cylinder $\\mathbb{R}_s \\times W^4$. The relation to knot\ninvariants arises when the four-manifold is the geometric blowup $W^4 = [X^3\n\\times \\mathbb{R}^+, K]$ along a knot $K \\subset X^3 \\times \\{0\\}$ embedded in\nits three-dimensional boundary. The boundaries and corners of this manifold\nrequire the specification of boundary conditions that preserve the topological\ninvariance of the construction and are fundamentally linked to various\ndimensional reductions of the Haydys-Witten equations. We provide a\ncomprehensive discussion of these dimensional reductions and relate them to\nwell-known gauge-theoretic equations in lower dimensions, including the\n$\\theta$-Kapustin-Witten equations, twisted extended Bogomolny equations, and\ntwisted octonionic Nahm equations. Along the way, we record novel results on\nthe elliptic regularity of the Haydys-Witten equations with twisted Nahm pole\nboundary conditions. The upshot of the article is a tentative definition of\nHaydys-Witten Floer theory and a precise restatement of Witten's conjecture: an\nequality between the Haydys-Witten Floer homology $HF^\\bullet_{\\pi/2}([S^3\n\\times \\mathbb{R}^+, K])$ and Khovanov homology $Kh^\\bullet(K)$.",
            "pdf_url": "http://arxiv.org/pdf/2412.13285v2",
            "published": "2024-12-17 19:29:48+00:00",
            "updated": "2025-01-02 17:52:07+00:00"
        },
        {
            "title": "Variational autoencoders with latent high-dimensional steady geometric flows for dynamics",
            "authors": "Andrew Gracyk",
            "summary": "We develop Riemannian approaches to variational autoencoders (VAEs) for\nPDE-type ambient data with regularizing geometric latent dynamics, which we\nrefer to as VAE-DLM, or VAEs with dynamical latent manifolds. We redevelop the\nVAE framework such that manifold geometries, subject to our geometric flow,\nembedded in Euclidean space are learned in the intermediary latent space\ndeveloped by encoders and decoders. By tailoring the geometric flow in which\nthe latent space evolves, we induce latent geometric properties of our\nchoosing, which are reflected in empirical performance. We reformulate the\ntraditional evidence lower bound (ELBO) loss with a considerate choice of\nprior. We develop a linear geometric flow with a steady-state regularizing\nterm. This flow requires only automatic differentiation of one time derivative,\nand can be solved in moderately high dimensions in a physics-informed approach,\nallowing more expressive latent representations. We discuss how this flow can\nbe formulated as a gradient flow, and maintains entropy away from metric\nsingularity. This, along with an eigenvalue penalization condition, helps\nensure the manifold is sufficiently large in measure, nondegenerate, and a\ncanonical geometry, which contribute to a robust representation. Our methods\nfocus on the modified multi-layer perceptron architecture with tanh activations\nfor the manifold encoder-decoder. We demonstrate, on our datasets of interest,\nour methods perform at least as well as the traditional VAE, and oftentimes\nbetter. Our methods can outperform this and a VAE endowed with our proposed\narchitecture, frequently reducing out-of-distribution (OOD) error between 15%\nto 35% on select datasets. We highlight our method on ambient PDEs whose\nsolutions maintain minimal variation in late times. We provide empirical\njustification towards how we can improve robust learning for external dynamics\nwith VAEs.",
            "pdf_url": "http://arxiv.org/pdf/2410.10137v4",
            "published": "2024-10-14 04:07:45+00:00",
            "updated": "2025-01-02 17:02:16+00:00"
        },
        {
            "title": "Harnessing Hardware Acceleration in High-Energy Physics through High-Level Synthesis Techniques",
            "authors": "Pelayo Leguina López, Santiago Folgueras",
            "summary": "At the Large Hadron Collider, the vast amount of data from experiments\ndemands not only sophisticated algorithms but also substantial computational\npower for efficient processing. This paper introduces hardware acceleration as\nan essential advancement for high-energy physics data analysis, focusing\nspecifically on the application of High-Level Synthesis (HLS) to bridge the gap\nbetween complex software algorithms and their hardware implementation. We will\nexplore how HLS facilitates the direct implementation of software algorithms\ninto hardware platforms such as FPGAs, enhancing processing speeds and enabling\nreal-time data analysis. This will be highlighted through the case study of a\ntrack-finding algorithm for muon reconstruction with the CMS experiment,\ndemonstrating HLS's role in translating computational tasks into high-speed,\nlow-latency hardware solutions for particle detection and reconstruction. Key\ntechniques in HLS, including parallel processing, pipelining, and memory\noptimization, will be discussed, illustrating how they contribute to the\nefficient acceleration of algorithms in high-energy physics. We will also cover\ndesign methodologies and iterative processes in HLS to optimize performance and\nresource utilization, alongside a brief mention of additional techniques like\nalgorithm approximation and hardware / software co-design. In short, this paper\nwill underscore the potential of hardware acceleration in high-energy physics\nresearch, emphasizing HLS as a powerful tool for physicists to enhance\ncomputational efficiency and foster groundbreaking discoveries.",
            "pdf_url": "http://arxiv.org/pdf/2501.01338v1",
            "published": "2025-01-02 16:43:05+00:00",
            "updated": "2025-01-02 16:43:05+00:00"
        },
        {
            "title": "Commutative Evolution Laws in Holographic Cellular Automata: AdS/CFT, Near-Extremal D3-Branes, and a Deep Learning Approach",
            "authors": "Hyunju Go",
            "summary": "According to 't Hooft, restoring Poincar\\'e invariance in a holographic\ncellular automaton (CA) requires two distinct evolution laws that commute. We\nexplore how this is realized in the AdS/CFT framework, assuming commutativity\nas a fundamental principle--much like general covariance once did--for encoding\ncurvature. In our setup, physical processes in a given spacetime are encoded in\na CA; to preserve Poincar\\'e symmetry, the spacetime curvature must effectively\nvanish, so we consider a near-extremal black D3-brane solution, in which both\nthe stretched horizon and the conformal boundary are approximated by Minkowski\nspace. AdS/CFT implies a spatial evolution law connecting these hypersurfaces.\nCommutativity means the final state does not depend on the order of time\nevolution on each hypersurface and spatial evolution between them, forcing the\ntime evolution law on the horizon and boundary to coincide. To satisfy all\nthese conditions, we aim to demonstrate that the spatial evolution law\ninevitably encapsulates the curvature of the bulk, including quantum effects.\nFor a computational model, we compactify the hyperplanes to tori, reducing the\ndegrees of freedom to a finite number; taking these tori to infinite size then\nrestores Poincar\\'e symmetry. We propose a deep learning algorithm that, given\na known time evolution law and commutativity, deduces the corresponding spatial\nevolution law.",
            "pdf_url": "http://arxiv.org/pdf/2012.06441v8",
            "published": "2020-12-10 15:17:40+00:00",
            "updated": "2025-01-02 16:40:41+00:00"
        },
        {
            "title": "Gravitational waves from color restoration in a leptoquark model of radiative neutrino masses",
            "authors": "Mårten Bertenstam, Marco Finetti, António P. Morais, Roman Pasechnik, Johan Rathsman",
            "summary": "We study the first-order phase transitions and the emerging stochastic\ngravitational wave spectrum in a minimal leptoquark extension of the Standard\nModel that explains active neutrino oscillation data while satisfying current\nflavor physics constraints. This model exhibits diverse phase transition\npatterns, including color symmetry-breaking scenarios in the early Universe.\nStrong correlations between model parameters and gravitational-wave signals\nyield testable predictions for future experiments such as LISA, BBO, and\nDECIGO. Specifically, a detectable signal in the mHz$\\unicode{x2013}$0.1~Hz\nfrequency range features color-restoration and leptoquark masses near\n$1.5~\\mathrm{TeV}$. With this article, we also present the first application in\nthe literature of \\texttt{Dratopi}. This is a soon-to-be-released tool for\nphase transition analysis using the dimensional reduction formalism, that\ninterfaces the \\texttt{DRalgo} package with \\texttt{Python} and a slightly\nmodified version of \\texttt{CosmoTransitions}.",
            "pdf_url": "http://arxiv.org/pdf/2501.01286v1",
            "published": "2025-01-02 14:54:43+00:00",
            "updated": "2025-01-02 14:54:43+00:00"
        },
        {
            "title": "DeWitt wave functions for de Sitter JT gravity",
            "authors": "Wilfried Buchmuller, Arthur Hebecker, Alexander Westphal",
            "summary": "Jackiw-Teitelboim (JT) gravity in two-dimensional de Sitter space is an\nintriguing model for cosmological \"wave functions of the universe\". Its\nminisuperspace version already contains all physical information. The size of\ncompact slices is parametrized by a scale factor $h > 0$. The dilaton $\\phi$ is\nchosen to have positive values, $\\phi > 0$, and interpreted as size of an\nadditional compact slice in a higher-dimensional theory. At the boundaries\n$h=0$, $\\phi=0$, where the volume of the universe vanishes, the curvature is\ngenerically singular. According to a conjecture by DeWitt, solutions of the\nWheeler-DeWitt (WDW) equation should vanish at singular loci. Recently, the\nbehaviour of JT wave functions at large field values $h$, $\\phi$ has been\nobtained by means of a path integral over Schwarzian degrees of freedom of a\nboundary curve. We systematically analyze solutions of the WDW equation with\nSchwarzian asymptotic behaviour. We find real analytic solutions that vanish on\nthe entire boundary, in agreement with DeWitt's conjecture. Projection to\nexpanding and contracting branches may lead to singularities, which can however\nbe avoided by an appropriate superposition of solutions. Our analysis also\nillustrates the limitations of semiclassical wave functions.",
            "pdf_url": "http://arxiv.org/pdf/2412.09211v2",
            "published": "2024-12-12 12:04:40+00:00",
            "updated": "2025-01-02 14:42:52+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Object-level Visual Prompts for Compositional Image Generation",
            "authors": "Gaurav Parmar, Or Patashnik, Kuan-Chieh Wang, Daniil Ostashev, Srinivasa Narasimhan, Jun-Yan Zhu, Daniel Cohen-Or, Kfir Aberman",
            "summary": "We introduce a method for composing object-level visual prompts within a\ntext-to-image diffusion model. Our approach addresses the task of generating\nsemantically coherent compositions across diverse scenes and styles, similar to\nthe versatility and expressiveness offered by text prompts. A key challenge in\nthis task is to preserve the identity of the objects depicted in the input\nvisual prompts, while also generating diverse compositions across different\nimages. To address this challenge, we introduce a new KV-mixed cross-attention\nmechanism, in which keys and values are learned from distinct visual\nrepresentations. The keys are derived from an encoder with a small bottleneck\nfor layout control, whereas the values come from a larger bottleneck encoder\nthat captures fine-grained appearance details. By mixing keys and values from\nthese complementary sources, our model preserves the identity of the visual\nprompts while supporting flexible variations in object arrangement, pose, and\ncomposition. During inference, we further propose object-level compositional\nguidance to improve the method's identity preservation and layout correctness.\nResults show that our technique produces diverse scene compositions that\npreserve the unique characteristics of each visual prompt, expanding the\ncreative potential of text-to-image generation.",
            "pdf_url": "http://arxiv.org/pdf/2501.01424v1",
            "published": "2025-01-02 18:59:44+00:00",
            "updated": "2025-01-02 18:59:44+00:00"
        },
        {
            "title": "Reconstruction vs. Generation: Taming Optimization Dilemma in Latent Diffusion Models",
            "authors": "Jingfeng Yao, Xinggang Wang",
            "summary": "Latent diffusion models with Transformer architectures excel at generating\nhigh-fidelity images. However, recent studies reveal an optimization dilemma in\nthis two-stage design: while increasing the per-token feature dimension in\nvisual tokenizers improves reconstruction quality, it requires substantially\nlarger diffusion models and more training iterations to achieve comparable\ngeneration performance. Consequently, existing systems often settle for\nsub-optimal solutions, either producing visual artifacts due to information\nloss within tokenizers or failing to converge fully due to expensive\ncomputation costs. We argue that this dilemma stems from the inherent\ndifficulty in learning unconstrained high-dimensional latent spaces. To address\nthis, we propose aligning the latent space with pre-trained vision foundation\nmodels when training the visual tokenizers. Our proposed VA-VAE (Vision\nfoundation model Aligned Variational AutoEncoder) significantly expands the\nreconstruction-generation frontier of latent diffusion models, enabling faster\nconvergence of Diffusion Transformers (DiT) in high-dimensional latent spaces.\nTo exploit the full potential of VA-VAE, we build an enhanced DiT baseline with\nimproved training strategies and architecture designs, termed LightningDiT. The\nintegrated system achieves state-of-the-art (SOTA) performance on ImageNet\n256x256 generation with an FID score of 1.35 while demonstrating remarkable\ntraining efficiency by reaching an FID score of 2.11 in just 64\nepochs--representing an over 21 times convergence speedup compared to the\noriginal DiT. Models and codes are available at:\nhttps://github.com/hustvl/LightningDiT.",
            "pdf_url": "http://arxiv.org/pdf/2501.01423v1",
            "published": "2025-01-02 18:59:40+00:00",
            "updated": "2025-01-02 18:59:40+00:00"
        },
        {
            "title": "Text2Data: Low-Resource Data Generation with Textual Control",
            "authors": "Shiyu Wang, Yihao Feng, Tian Lan, Ning Yu, Yu Bai, Ran Xu, Huan Wang, Caiming Xiong, Silvio Savarese",
            "summary": "Natural language serves as a common and straightforward signal for humans to\ninteract seamlessly with machines. Recognizing the importance of this\ninterface, the machine learning community is investing considerable effort in\ngenerating data that is semantically coherent with textual instructions. While\nstrides have been made in text-to-data generation spanning image editing, audio\nsynthesis, video creation, and beyond, low-resource areas characterized by\nexpensive annotations or complex data structures, such as molecules, motion\ndynamics, and time series, often lack textual labels. This deficiency impedes\nsupervised learning, thereby constraining the application of advanced\ngenerative models for text-to-data tasks. In response to these challenges in\nthe low-resource scenario, we propose Text2Data, a novel approach that utilizes\nunlabeled data to understand the underlying data distribution through an\nunsupervised diffusion model. Subsequently, it undergoes controllable\nfinetuning via a novel constraint optimization-based learning objective that\nensures controllability and effectively counteracts catastrophic forgetting.\nComprehensive experiments demonstrate that Text2Data is able to achieve\nenhanced performance regarding controllability across various modalities,\nincluding molecules, motions and time series, when compared to existing\nbaselines.",
            "pdf_url": "http://arxiv.org/pdf/2402.10941v2",
            "published": "2024-02-08 03:41:39+00:00",
            "updated": "2025-01-02 17:47:09+00:00"
        },
        {
            "title": "Stable-V2A: Synthesis of Synchronized Sound Effects with Temporal and Semantic Controls",
            "authors": "Riccardo Fosco Gramaccioni, Christian Marinoni, Emilian Postolache, Marco Comunità, Luca Cosmo, Joshua D. Reiss, Danilo Comminiello",
            "summary": "Sound designers and Foley artists usually sonorize a scene, such as from a\nmovie or video game, by manually annotating and sonorizing each action of\ninterest in the video. In our case, the intent is to leave full creative\ncontrol to sound designers with a tool that allows them to bypass the more\nrepetitive parts of their work, thus being able to focus on the creative\naspects of sound production. We achieve this presenting Stable-V2A, a two-stage\nmodel consisting of: an RMS-Mapper that estimates an envelope representative of\nthe audio characteristics associated with the input video; and Stable-Foley, a\ndiffusion model based on Stable Audio Open that generates audio semantically\nand temporally aligned with the target video. Temporal alignment is guaranteed\nby the use of the envelope as a ControlNet input, while semantic alignment is\nachieved through the use of sound representations chosen by the designer as\ncross-attention conditioning of the diffusion process. We train and test our\nmodel on Greatest Hits, a dataset commonly used to evaluate V2A models. In\naddition, to test our model on a case study of interest, we introduce Walking\nThe Maps, a dataset of videos extracted from video games depicting animated\ncharacters walking in different locations. Samples and code available on our\ndemo page at https://ispamm.github.io/Stable-V2A.",
            "pdf_url": "http://arxiv.org/pdf/2412.15023v2",
            "published": "2024-12-19 16:37:19+00:00",
            "updated": "2025-01-02 16:16:08+00:00"
        },
        {
            "title": "Generative Modelling with High-Order Langevin Dynamics",
            "authors": "Ziqiang Shi, Rujie Liu",
            "summary": "Diffusion generative modelling (DGM) based on stochastic differential\nequations (SDEs) with score matching has achieved unprecedented results in data\ngeneration. In this paper, we propose a novel fast high-quality generative\nmodelling method based on high-order Langevin dynamics (HOLD) with score\nmatching. This motive is proved by third-order Langevin dynamics. By augmenting\nthe previous SDEs, e.g. variance exploding or variance preserving SDEs for\nsingle-data variable processes, HOLD can simultaneously model position,\nvelocity, and acceleration, thereby improving the quality and speed of the data\ngeneration at the same time. HOLD is composed of one Ornstein-Uhlenbeck process\nand two Hamiltonians, which reduce the mixing time by two orders of magnitude.\nEmpirical experiments for unconditional image generation on the public data set\nCIFAR-10 and CelebA-HQ show that the effect is significant in both Frechet\ninception distance (FID) and negative log-likelihood, and achieves the\nstate-of-the-art FID of 1.85 on CIFAR-10.",
            "pdf_url": "http://arxiv.org/pdf/2404.12814v3",
            "published": "2024-04-19 11:49:01+00:00",
            "updated": "2025-01-02 13:06:57+00:00"
        }
    ]
}