{
    "Physics": [
        {
            "title": "Parsing the Language of Expression: Enhancing Symbolic Regression with Domain-Aware Symbolic Priors",
            "authors": "Sikai Huang, Yixin Berry Wen, Tara Adusumilli, Kusum Choudhary, Haizhao Yang",
            "summary": "Symbolic regression is essential for deriving interpretable expressions that\nelucidate complex phenomena by exposing the underlying mathematical and\nphysical relationships in data. In this paper, we present an advanced symbolic\nregression method that integrates symbol priors from diverse scientific domains\n- including physics, biology, chemistry, and engineering - into the regression\nprocess. By systematically analyzing domain-specific expressions, we derive\nprobability distributions of symbols to guide expression generation. We propose\nnovel tree-structured recurrent neural networks (RNNs) that leverage these\nsymbol priors, enabling domain knowledge to steer the learning process.\nAdditionally, we introduce a hierarchical tree structure for representing\nexpressions, where unary and binary operators are organized to facilitate more\nefficient learning. To further accelerate training, we compile characteristic\nexpression blocks from each domain and include them in the operator dictionary,\nproviding relevant building blocks. Experimental results demonstrate that\nleveraging symbol priors significantly enhances the performance of symbolic\nregression, resulting in faster convergence and higher accuracy.",
            "pdf_url": "http://arxiv.org/pdf/2503.09592v1",
            "published": "2025-03-12 17:57:48+00:00",
            "updated": "2025-03-12 17:57:48+00:00"
        },
        {
            "title": "A mechanism to generate varying speed of light via Higgs-dilaton coupling: Theory and cosmological applications",
            "authors": "Hoang Ky Nguyen",
            "summary": "We allow the Higgs field $\\Phi$ to interact with a dilaton field $\\chi$ of\nthe background spacetime via the coupling $\\chi^2\\,\\Phi^\\dagger\\Phi$. Upon\nspontaneous gauge symmetry breaking, the Higgs VEV becomes proportional to\n$\\chi$. While traditionally this linkage is employed to make the Planck mass\nand particle masses dependent on $\\chi$, we present an $\\textit alternative$\nmechanism: the Higgs VEV will be used to construct Planck's constant $\\hbar$\nand speed of light $c$. Specifically, each open set vicinity of a given point\n$x^*$ on the spacetime manifold is equipped with a replica of the\nGlashow-Weinberg-Salam action operating with its own effective values of\n$\\hbar_*$ and $c_*$ per $\\hbar_*\\propto\\chi^{-1/2}(x^*)$ and\n$c_*\\propto\\chi^{1/2}(x^*)$, causing these ``fundamental constants'' to vary\nalongside the dynamical field $\\chi$. Moreover, in each open set around $x^*$,\nthe prevailing value $\\chi(x^*)$ determines the length and time scales for\nphysical processes occurring in this region as $l\\propto\\chi^{-1}(x^*)$ and\n$\\tau\\propto\\chi^{-3/2}(x^*)$. This leads to an $\\textit anisotropic$ relation\n$\\tau^{-1}\\propto l^{-3/2}$ between the rate of clocks and the length of rods,\nresulting in a distinct set of novel physical phenomena. For late-time\ncosmology, the variation of $c$ along the trajectory of light waves from\ndistant supernovae towards the Earth-based observer necessitates modifications\nto the Lema\\^itre redshift relation and the Hubble law. These modifications are\ncapable of: (1) Accounting for the Pantheon Catalog of SNeIa $\\textit{through a\ndeclining speed of light in an expanding Einstein--de Sitter universe}$, thus\navoiding the need for dark energy; (2) Revitalizing\nBlanchard-Douspis-Rowan-Robinson-Sarkar's CMB power spectrum analysis that\nbypassed dark energy [A&A 412, 35 (2003)]; and (3) Resolving the $H_0$ tension\nwithout requiring a dynamical dark energy component.",
            "pdf_url": "http://arxiv.org/pdf/2408.02583v3",
            "published": "2024-08-05 16:00:08+00:00",
            "updated": "2025-03-12 17:54:06+00:00"
        },
        {
            "title": "The Stochastic Light Confinement of LiquidO",
            "authors": "LiquidO Collaboration, J. Apilluelo, L. Asquith, E. F. Bannister, N. P. Barradas, J. L. Beney, M. Berberan e Santos, X. de la Bernardie, T. J. C. Bezerra, M. Bongrand, C. Bourgeois, D. Breton, C. Buck, J. Busto, K. Burns, A. Cabrera, A. Cadiou, E. Calvo, E. Chauveau, B. J. Cattermole, M. Chen, P. Chimenti, D. F. Cowen, S. Dusini, A. Earle, M. Felizardo, C. Frigerio Martins, J. Galán, J. A. García, R. Gazzini, A. Gibson-Foster, C. Girard-Carillo, B. Gramlich, M. Grassi, W. C. Griffith, J. J. Gómez-Cadenas, M. Guitière, F. Haddad, J. Hartnell, A. Holin, I. G. Irastorza, I. Jovanovic, A. Kling, L. Koch, P. Lasorak, J. F. Le Du, C. Lefebvre, F. Lefevre, P. Loaiza, J. A. Lock, G. Luzón, J. Maalmi, J. P. Malhado, F. Mantovani, J. G. Marques, C. Marquet, M. Martínez, D. Navas-Nicolás, H. Nunokawa, M. Obolensky, J. P. Ochoa-Ricoux, T. Palmeira, C. Palomares, B. Pedras, D. Petyt, P. Pillot, A. Pin, J. C. C. Porter, M. S. Pravikoff, N. Rodrigues, M. Roche, R. Rosero, B. Roskovec, N. Roy, M. L. Sarsa, S. Schoppmann, A. Serafini, C. Shepherd-Themistocleous, W. Shorrock, M. Silva, L. Simard, S. R. Soleti, H. Th. J. Steiger, D. Stocco, V. Strati, J. S. Stutzmann, F. Suekane, A. Tunc, N. Tuccori, A. Verdugo, B. Viaud, S. M. Wakely, A. Weber, G. Wendel, A. S. Wilhelm, M. Yeh, F. Yermia",
            "summary": "Light-based detectors have been widely used in fundamental research and\nindustry since their inception in the 1930s. The energy particles deposit in\nthese detectors is converted to optical signals via the Cherenkov and\nscintillation mechanisms that are then propagated through transparent media to\nphotosensors placed typically on the detector's periphery, sometimes up to tens\nof metres away. LiquidO is a new technique pioneering the use of opaque media\nto stochastically confine light around each energy deposition while collecting\nit with an array of fibres that thread the medium. This approach preserves\ntopological event information otherwise lost in the conventional approach,\nenabling real-time imaging down to the MeV scale. Our article demonstrates\nLiquidO's imaging principle with a ten-litre prototype, revealing successful\nlight confinement of 90% of the detected light within a 5 cm radius sphere,\nusing a custom opaque scintillator with a scattering length on the order of a\nfew millimetres. These high-resolution imaging capabilities unlock\nopportunities in fundamental physics research and applications beyond. The\nabsolute amount of light detected is also studied, including possible\ndata-driven extrapolations to LiquidO-based detectors beyond prototyping\nlimitations. Additionally, LiquidO's timing capabilities are explored through\nits ability to distinguish Cherenkov light from a slow scintillator.",
            "pdf_url": "http://arxiv.org/pdf/2503.02541v2",
            "published": "2025-03-04 12:07:14+00:00",
            "updated": "2025-03-12 17:43:04+00:00"
        },
        {
            "title": "Regulating Sommerfeld resonances for multi-state systems and higher partial waves",
            "authors": "Aditya Parikh, Ryosuke Sato, Tracy R. Slatyer",
            "summary": "Long-range attractive interactions between dark matter particles can\nsignificantly enhance their annihilation, particularly at low velocities. This\n``Sommerfeld enhancement'' is typically computed by evaluating the deformation\nof the two-particle wavefunction due to the long-range potential, while\nignoring the physics associated with the annihilation, and then scaling the\nappropriate annihilation matrix elements by factors that depend on the\nwavefunction in the limit where the particles approach zero relative\nseparation. It has long been recognized that this approach is a valid\napproximation only in the limit where the annihilation rate is small, and\nbreaks down in the regime where the enhanced annihilation rate approaches the\nunitarity bound, in which case ignoring the impact of the annihilation physics\non the two-particle wavefunction cannot be justified and leads to apparent\nviolations of unitarity. In the case where the physics relevant to annihilation\noccurs at a parametrically shorter distance scale (higher energy scale)\ncompared with the long-range potential, we provide a simple prescription for\ncorrecting the Sommerfeld enhancement for the effects of the short-range\nphysics, valid for all partial waves and for systems where multiple states are\ncoupled by the long-range potential.",
            "pdf_url": "http://arxiv.org/pdf/2410.18168v2",
            "published": "2024-10-23 18:00:00+00:00",
            "updated": "2025-03-12 17:40:27+00:00"
        },
        {
            "title": "Kinematic Stratifications",
            "authors": "Veronica Calvo Cortes, Hadleigh Frost, Bernd Sturmfels",
            "summary": "We study stratifications of regions in the space of symmetric matrices. Their\npoints are Mandelstam matrices for momentum vectors in particle physics.\nKinematic strata in these regions are indexed by signs and rank two matroids.\nMatroid strata of Lorentzian quadratic forms arise when all signs are\nnon-negative. We characterize the posets of strata, for massless and massive\nparticles, with and without momentum conservation.",
            "pdf_url": "http://arxiv.org/pdf/2503.09571v1",
            "published": "2025-03-12 17:40:09+00:00",
            "updated": "2025-03-12 17:40:09+00:00"
        },
        {
            "title": "Collider-quality electron bunches from an all-optical plasma photoinjector",
            "authors": "Arohi Jain, Jiayang Yan, Jacob R. Pierce, Tanner T. Simpson, Mikhail Polyanskiy, William Li, Marcus Babzien, Mark Palmer, Michael Downer, Roman Samulyak, Chan Joshi, Warren B. Mori, John P. Palastro, Navid Vafaei-Najafabadi",
            "summary": "We present a novel approach for generating collider-quality electron bunches\nusing a plasma photoinjector. The approach leverages recently developed\ntechniques for the spatiotemporal control of laser pulses to produce a moving\nionization front in a nonlinear plasma wave. The moving ionization front\ngenerates an electron bunch with a current profile that balances the\nlongitudinal electric field of an electron beam-driven plasma wave, creating a\nuniform accelerating field across the bunch. Particle-in-cell (PIC) simulations\nof the ionization stage show the formation of an electron bunch with 220 pC\ncharge and low emittance ($\\epsilon_x = 171$ nm-rad, $\\epsilon_y = 76$ nm-rad).\nQuasistatic PIC simulations of the acceleration stage show that the bunch is\nefficiently accelerated to 20 GeV over 2 meters with a final energy spread of\nless than 1\\% and emittances of $\\epsilon_x = 177$ nm-rad and $\\epsilon_y = 82$\nnm-rad. This high-quality electron bunch meets the requirements outlined by the\nSnowmass process for intermediate-energy colliders and compares favorably to\nthe beam quality of proposed and existing accelerator facilities. The results\nestablish the feasibility of plasma photoinjectors for future collider\napplications making a significant step towards the realization of\nhigh-luminosity, compact accelerators for particle physics research.",
            "pdf_url": "http://arxiv.org/pdf/2503.09557v1",
            "published": "2025-03-12 17:21:57+00:00",
            "updated": "2025-03-12 17:21:57+00:00"
        },
        {
            "title": "Holographic complex potential of a quarkonium from deep learning",
            "authors": "Mahdi Mansouri, Kazem Bitaghsir Fadafan, Xun Chen",
            "summary": "Utilizing an emergent metric developed from deep learning techniques, we\ndetermine the complex potential associated with static quarkonium. This study\nexplores the disintegration process of quarkonium by analyzing the real\ncomponent of this potential, which is crucial for understanding its stability\nin various conditions. We show that the dissociation length, the critical\ndistance at which a quark and antiquark pair disintegrate, decreases as the\ntemperature increases. Furthermore, our assessment of the imaginary component\nof the potential indicates an increase in the magnitude of the imaginary\npotential for quarkonium as temperatures rise. This enhancement contributes to\nthe quarkonium's suppression within the quark-gluon plasma, mirroring the\nanticipated outcomes from QCD. Our findings not only confirm the theoretical\npredictions but also demonstrate the efficacy of deep learning methods in\nadvancing our understanding of high-energy particle physics.",
            "pdf_url": "http://arxiv.org/pdf/2406.06285v2",
            "published": "2024-06-10 14:09:21+00:00",
            "updated": "2025-03-12 17:18:37+00:00"
        },
        {
            "title": "Using Convolutional Neural Networks to Accelerate 3D Coherent Synchrotron Radiation Computations",
            "authors": "Christopher Leon, Petr M. Anisimov, Nikolai Yampolsky, Alexander Scheinker",
            "summary": "Calculating the effects of Coherent Synchrotron Radiation (CSR) is one of the\nmost computationally expensive tasks in accelerator physics. Here, we use\nconvolutional neural networks (CNN's), along with a latent conditional\ndiffusion (LCD) model, trained on physics-based simulations to speed up\ncalculations. Specifically, we produce the 3D CSR wakefields generated by\nelectron bunches in circular orbit in the steady-state condition. Two datasets\nare used for training and testing the models: wakefields generated by\nthree-dimensional Gaussian electron distributions and wakefields from a sum of\nup to 25 three-dimensional Gaussian distributions. The CNN's are able to\naccurately produce the 3D wakefields $\\sim 250-1000$ times faster than the\nnumerical calculations, while the LCD has a gain of a factor of $\\sim 34$. We\nalso test the extrapolation and out-of-distribution generalization ability of\nthe models. They generalize well on distributions with larger spreads than what\nthey were trained on, but struggle with smaller spreads.",
            "pdf_url": "http://arxiv.org/pdf/2503.09551v1",
            "published": "2025-03-12 17:08:13+00:00",
            "updated": "2025-03-12 17:08:13+00:00"
        },
        {
            "title": "Grounding Video Models to Actions through Goal Conditioned Exploration",
            "authors": "Yunhao Luo, Yilun Du",
            "summary": "Large video models, pretrained on massive amounts of Internet video, provide\na rich source of physical knowledge about the dynamics and motions of objects\nand tasks. However, video models are not grounded in the embodiment of an\nagent, and do not describe how to actuate the world to reach the visual states\ndepicted in a video. To tackle this problem, current methods use a separate\nvision-based inverse dynamic model trained on embodiment-specific data to map\nimage states to actions. Gathering data to train such a model is often\nexpensive and challenging, and this model is limited to visual settings similar\nto the ones in which data are available. In this paper, we investigate how to\ndirectly ground video models to continuous actions through self-exploration in\nthe embodied environment -- using generated video states as visual goals for\nexploration. We propose a framework that uses trajectory level action\ngeneration in combination with video guidance to enable an agent to solve\ncomplex tasks without any external supervision, e.g., rewards, action labels,\nor segmentation masks. We validate the proposed approach on 8 tasks in Libero,\n6 tasks in MetaWorld, 4 tasks in Calvin, and 12 tasks in iThor Visual\nNavigation. We show how our approach is on par with or even surpasses multiple\nbehavior cloning baselines trained on expert demonstrations while without\nrequiring any action annotations.",
            "pdf_url": "http://arxiv.org/pdf/2411.07223v2",
            "published": "2024-11-11 18:43:44+00:00",
            "updated": "2025-03-12 17:03:25+00:00"
        },
        {
            "title": "Quantum position verification in one shot: parallel repetition of the $f$-BB84 and $f$-routing protocols",
            "authors": "Llorenç Escolà-Farràs, Florian Speelman",
            "summary": "Quantum position verification (QPV) aims to verify an untrusted prover's\nlocation by timing communication with them. To reduce uncertainty, it is\ndesirable for this verification to occur in a single round. However, previous\nprotocols achieving one-round secure QPV had critical drawbacks: attackers\npre-sharing an EPR pair per qubit could perfectly break them, and their\nsecurity depended on quantum information traveling at the speed of light in\nvacuum, a major experimental challenge in quantum networks. In this work, we\nprove that a single round of interaction suffices for secure position\nverification while overcoming these limitations. We show that security for a\none-round protocol can rely only on the size of the classical information\nrather than quantum resources, making implementation more feasible, even with a\nqubit error tolerance of up to 3.6%, which is experimentally achievable with\ncurrent technology -- and showing that the timing constraints have to apply\nonly to classical communication. In short, we establish parallel repetition of\nthe $f$-BB84 and $f$-routing QPV protocols. As a consequence of our techniques,\nwe also demonstrate an order-of-magnitude improvement in the error tolerance\nfor the sequential repetition version of these protocols, compared to the\nprevious bounds of Nature Physics 18, 623-626 (2022).",
            "pdf_url": "http://arxiv.org/pdf/2503.09544v1",
            "published": "2025-03-12 17:00:32+00:00",
            "updated": "2025-03-12 17:00:32+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Minimax Optimality of the Probability Flow ODE for Diffusion Models",
            "authors": "Changxiao Cai, Gen Li",
            "summary": "Score-based diffusion models have become a foundational paradigm for modern\ngenerative modeling, demonstrating exceptional capability in generating samples\nfrom complex high-dimensional distributions. Despite the dominant adoption of\nprobability flow ODE-based samplers in practice due to their superior sampling\nefficiency and precision, rigorous statistical guarantees for these methods\nhave remained elusive in the literature. This work develops the first\nend-to-end theoretical framework for deterministic ODE-based samplers that\nestablishes near-minimax optimal guarantees under mild assumptions on target\ndata distributions. Specifically, focusing on subgaussian distributions with\n$\\beta$-H\\\"older smooth densities for $\\beta\\leq 2$, we propose a smooth\nregularized score estimator that simultaneously controls both the $L^2$ score\nerror and the associated mean Jacobian error. Leveraging this estimator within\na refined convergence analysis of the ODE-based sampling process, we\ndemonstrate that the resulting sampler achieves the minimax rate in total\nvariation distance, modulo logarithmic factors. Notably, our theory\ncomprehensively accounts for all sources of error in the sampling process and\ndoes not require strong structural conditions such as density lower bounds or\nLipschitz/smooth scores on target distributions, thereby covering a broad range\nof practical data distributions.",
            "pdf_url": "http://arxiv.org/pdf/2503.09583v1",
            "published": "2025-03-12 17:51:29+00:00",
            "updated": "2025-03-12 17:51:29+00:00"
        },
        {
            "title": "Block Diffusion: Interpolating Between Autoregressive and Diffusion Language Models",
            "authors": "Marianne Arriola, Aaron Gokaslan, Justin T Chiu, Zhihan Yang, Zhixuan Qi, Jiaqi Han, Subham Sekhar Sahoo, Volodymyr Kuleshov",
            "summary": "Diffusion language models offer unique benefits over autoregressive models\ndue to their potential for parallelized generation and controllability, yet\nthey lag in likelihood modeling and are limited to fixed-length generation. In\nthis work, we introduce a class of block diffusion language models that\ninterpolate between discrete denoising diffusion and autoregressive models.\nBlock diffusion overcomes key limitations of both approaches by supporting\nflexible-length generation and improving inference efficiency with KV caching\nand parallel token sampling. We propose a recipe for building effective block\ndiffusion models that includes an efficient training algorithm, estimators of\ngradient variance, and data-driven noise schedules to minimize the variance.\nBlock diffusion sets a new state-of-the-art performance among diffusion models\non language modeling benchmarks and enables generation of arbitrary-length\nsequences. We provide the code, along with the model weights and blog post on\nthe project page: https://m-arriola.com/bd3lms/",
            "pdf_url": "http://arxiv.org/pdf/2503.09573v1",
            "published": "2025-03-12 17:43:40+00:00",
            "updated": "2025-03-12 17:43:40+00:00"
        },
        {
            "title": "DAWN-FM: Data-Aware and Noise-Informed Flow Matching for Solving Inverse Problems",
            "authors": "Shadab Ahamed, Eldad Haber",
            "summary": "Inverse problems, which involve estimating parameters from incomplete or\nnoisy observations, arise in various fields such as medical imaging,\ngeophysics, and signal processing. These problems are often ill-posed,\nrequiring regularization techniques to stabilize the solution. In this work, we\nemploy Flow Matching (FM), a generative framework that integrates a\ndeterministic processes to map a simple reference distribution, such as a\nGaussian, to the target distribution. Our method DAWN-FM: Data-AWare and\nNoise-informed Flow Matching incorporates data and noise embedding, allowing\nthe model to access representations about the measured data explicitly and also\naccount for noise in the observations, making it particularly robust in\nscenarios where data is noisy or incomplete. By learning a time-dependent\nvelocity field, FM not only provides accurate solutions but also enables\nuncertainty quantification by generating multiple plausible outcomes. Unlike\npre-trained diffusion models, which may struggle in highly ill-posed settings,\nour approach is trained specifically for each inverse problem and adapts to\nvarying noise levels. We validate the effectiveness and robustness of our\nmethod through extensive numerical experiments on tasks such as image\ndeblurring and tomography.",
            "pdf_url": "http://arxiv.org/pdf/2412.04766v2",
            "published": "2024-12-06 04:18:49+00:00",
            "updated": "2025-03-12 17:30:41+00:00"
        },
        {
            "title": "The R2D2 Deep Neural Network Series for Scalable Non-Cartesian Magnetic Resonance Imaging",
            "authors": "Yiwei Chen, Amir Aghabiglou, Shijie Chen, Motahare Torki, Chao Tang, Ruud B. van Heeswijk, Yves Wiaux",
            "summary": "We introduce the R2D2 Deep Neural Network (DNN) series paradigm for fast and\nscalable image reconstruction from highly-accelerated non-Cartesian k-space\nacquisitions in Magnetic Resonance Imaging (MRI). While unrolled DNN\narchitectures provide a robust image formation approach via data-consistency\nlayers, embedding non-uniform fast Fourier transform operators in a DNN can\nbecome impractical to train at large scale, e.g in 2D MRI with a large number\nof coils, or for higher-dimensional imaging. Plug-and-play approaches that\nalternate a learned denoiser blind to the measurement setting with a\ndata-consistency step are not affected by this limitation but their highly\niterative nature implies slow reconstruction. To address this scalability\nchallenge, we leverage the R2D2 paradigm that was recently introduced to enable\nultra-fast reconstruction for large-scale Fourier imaging in radio astronomy.\nR2D2's reconstruction is formed as a series of residual images iteratively\nestimated as outputs of DNN modules taking the previous iteration's data\nresidual as input. The method can be interpreted as a learned version of the\nMatching Pursuit algorithm. A series of R2D2 DNN modules were sequentially\ntrained in a supervised manner on the fastMRI dataset and validated for 2D\nmulti-coil MRI in simulation and on real data, targeting highly under-sampled\nradial k-space sampling. Results suggest that a series with only few DNNs\nachieves superior reconstruction quality over its unrolled incarnation R2D2-Net\n(whose training is also much less scalable), and over the state-of-the-art\ndiffusion-based \"Decomposed Diffusion Sampler\" approach (also characterised by\na slower reconstruction process).",
            "pdf_url": "http://arxiv.org/pdf/2503.09559v1",
            "published": "2025-03-12 17:24:47+00:00",
            "updated": "2025-03-12 17:24:47+00:00"
        },
        {
            "title": "Sparse Autoencoder as a Zero-Shot Classifier for Concept Erasing in Text-to-Image Diffusion Models",
            "authors": "Zhihua Tian, Sirun Nan, Ming Xu, Shengfang Zhai, Wenjie Qu, Jian Liu, Kui Ren, Ruoxi Jia, Jiaheng Zhang",
            "summary": "Text-to-image (T2I) diffusion models have achieved remarkable progress in\ngenerating high-quality images but also raise people's concerns about\ngenerating harmful or misleading content. While extensive approaches have been\nproposed to erase unwanted concepts without requiring retraining from scratch,\nthey inadvertently degrade performance on normal generation tasks. In this\nwork, we propose Interpret then Deactivate (ItD), a novel framework to enable\nprecise concept removal in T2I diffusion models while preserving overall\nperformance. ItD first employs a sparse autoencoder (SAE) to interpret each\nconcept as a combination of multiple features. By permanently deactivating the\nspecific features associated with target concepts, we repurpose SAE as a\nzero-shot classifier that identifies whether the input prompt includes target\nconcepts, allowing selective concept erasure in diffusion models. Moreover, we\ndemonstrate that ItD can be easily extended to erase multiple concepts without\nrequiring further training. Comprehensive experiments across celebrity\nidentities, artistic styles, and explicit content demonstrate ItD's\neffectiveness in eliminating targeted concepts without interfering with normal\nconcept generation. Additionally, ItD is also robust against adversarial\nprompts designed to circumvent content filters. Code is available at:\nhttps://github.com/NANSirun/Interpret-then-deactivate.",
            "pdf_url": "http://arxiv.org/pdf/2503.09446v1",
            "published": "2025-03-12 14:46:40+00:00",
            "updated": "2025-03-12 14:46:40+00:00"
        }
    ]
}