{
    "Physics": [
        {
            "title": "Exploring nontrivial topology at quantum criticality in a superconducting processor",
            "authors": "Ziqi Tan, Ke Wang, Sheng Yang, Fanhao Shen, Feitong Jin, Xuhao Zhu, Yujie Ji, Shibo Xu, Jiachen Chen, Yaozu Wu, Chuanyu Zhang, Yu Gao, Ning Wang, Yiren Zou, Aosai Zhang, Tingting Li, Zehang Bao, Zitian Zhu, Jiarun Zhong, Zhengyi Cui, Yihang Han, Yiyang He, Han Wang, Jianan Yang, Yanzhe Wang, Jiayuan Shen, Gongyu Liu, Zixuan Song, Jinfeng Deng, Hang Dong, Pengfei Zhang, Shao-Kai Jian, Hekang Li, Zhen Wang, Qiujiang Guo, Chao Song, Xue-Jia Yu, H. Wang, Hai-Qing Lin, Fei Wu",
            "summary": "The discovery of nontrivial topology in quantum critical states has\nintroduced a new paradigm for classifying quantum phase transitions and\nchallenges the conventional belief that topological phases are typically\nassociated with a bulk energy gap. However, realizing and characterizing such\ntopologically nontrivial quantum critical states with large particle numbers\nremains an outstanding experimental challenge in statistical and condensed\nmatter physics. Programmable quantum processors can directly prepare and\nmanipulate exotic quantum many-body states, offering a powerful path for\nexploring the physics behind these states. Here, we present an experimental\nexploration of the critical cluster Ising model by preparing its low-lying\ncritical states on a superconducting processor with up to $100$ qubits. We\ndevelop an efficient method to probe the boundary $g$-function based on\nprepared low-energy states, which allows us to uniquely identify the nontrivial\ntopology of the critical systems under study. Furthermore, by adapting the\nentanglement Hamiltonian tomography technique, we recognize two-fold\ntopological degeneracy in the entanglement spectrum under periodic boundary\ncondition, experimentally verifying the universal bulk-boundary correspondence\nin topological critical systems. Our results demonstrate the low-lying critical\nstates as useful quantum resources for investigating the interplay between\ntopology and quantum criticality.",
            "pdf_url": "http://arxiv.org/pdf/2501.04679v1",
            "published": "2025-01-08 18:39:44+00:00",
            "updated": "2025-01-08 18:39:44+00:00"
        },
        {
            "title": "Lattice Boltzmann simulation reveals supercritical bifurcation in flow mode transitions of power-law fluids in the four-roll mill",
            "authors": "Yuan Yu, Xiao Jiang, Qingqing Gu, Chuandong Lin, Qingyong Zhu, Hai-zhuan Yuan",
            "summary": "The four-roll mill has been traditionally viewed as a device generating\nsimple extensional flow with a central stagnation point. Our systematic\ninvestigation using a two-relaxation-time regularized lattice Boltzmann\n(TRT-RLB) model reveals unexpected richness in the flow physics, identifying\ntwo previously unreported supercritical bifurcation modes: a quadrifoliate\nvortex mode featuring four symmetrical counter-rotating vortices, and a\ndumbbell-shaped quad-vortex mode where vortices detach from but remain\nsymmetric about the stagnation point. The numerical framework, representing the\nfirst successful extension of TRT-RLB method to power-law fluid dynamics,\nenables comprehensive mapping of flow characteristics across Reynolds numbers\n($1 \\leq Re \\leq 50$), power-law indices ($0.7 \\leq n \\leq 1.3$), and geometric\nconfigurations. The transition from quadrifoliate vortex mode exhibits distinct\npathways depending on the power-law index: at relatively small $n$, the flow\nundergoes a direct supercritical bifurcation to simple extensional flow, while\nat relatively large $n$, it evolves through an intermediate dumbbell-shaped\nstate. Among geometric parameters, the roller radius $r$ emerges as the\ndominant factor controlling bifurcation points and vortex dimensions, whereas\nthe roller-container gap $\\delta$ exerts minimal influence on flow regimes. The\ntransitions between flow modes can be precisely characterized through the\nevolution of vortex dimensions and velocity gradients at the stagnation point,\nproviding quantitative criteria for flow regime identification. These findings\nenrich our fundamental understanding of bifurcation phenomena in extensional\ndevices and provide quantitative guidelines for achieving desired flow patterns\nin four-roll mill applications.",
            "pdf_url": "http://arxiv.org/pdf/2501.04655v1",
            "published": "2025-01-08 18:07:47+00:00",
            "updated": "2025-01-08 18:07:47+00:00"
        },
        {
            "title": "Semileptonic decay of the triply heavy $Ω_{ccb}$ to the observed $Ξ^{++}_{cc}$ state",
            "authors": "Z. Rajabi Najjar, K. Azizi, H. R. Moshfegh",
            "summary": "We investigate the weak semileptonic decay of the $ \\Omega^{+}_{ccb}\n\\rightarrow \\Xi^{++}_{cc} ~{\\ell}\\bar\\nu_{\\ell}$, where a triply heavy baryon\nwith spin 1/2 decays into the observed doubly heavy baryon with spin 1/2, using\nQCD sum rule method in all lepton channels. We compute the six relevant vector\nand axial vector form factors entering the low energy matrix elements in full\ntheory. The invariant form factors are building blocks, using the fit faction\nof which in terms of $ q^2 $ in whole physical region, we calculate the\nexclusive widths in three lepton channels. Our predictions may help the present\nand future experiments in the course of their search for doubly and triply\nheavy baryons.",
            "pdf_url": "http://arxiv.org/pdf/2410.01602v3",
            "published": "2024-10-02 14:40:10+00:00",
            "updated": "2025-01-08 17:22:25+00:00"
        },
        {
            "title": "Geometric Formula for 2d Ising Zeros: Examples & Numerics",
            "authors": "Iñaki Garay, Etera R. Livine",
            "summary": "A geometric formula for the zeros of the partition function of the\ninhomogeneous 2d Ising model was recently proposed in terms of the angles of 2d\ntriangulations embedded in the flat 3d space. Here we proceed to an analytical\ncheck of this formula on the cubic graph, dual to a double pyramid, and provide\na thorough numerical check by generating random 2d planar triangulations. Our\nmethod is to generate Delaunay triangulations of the 2-sphere then performing\nrandom local rescalings. For every 2d triangulations, we compute the\ncorresponding Ising couplings from the triangle angles and the dihedral angles,\nand check directly that the Ising partition function vanishes for these\ncouplings (and grows in modulus in their neighborhood). In particular, we lift\nan ambiguity of the original formula on the sign of the dihedral angles and\nestablish a convention in terms of convexity/concavity. Finally, we extend our\nnumerical analysis to 2d toroidal triangulations and show that the geometric\nformula does not work and will need to be generalized, as originally expected,\nin order to accommodate for non-trivial topologies.",
            "pdf_url": "http://arxiv.org/pdf/2409.11109v3",
            "published": "2024-09-17 12:04:09+00:00",
            "updated": "2025-01-08 17:03:21+00:00"
        },
        {
            "title": "Fast physics-based launcher optimization for electron cyclotron current drive",
            "authors": "N A Lopez, A Alieva, S A M McNamara, X Zhang",
            "summary": "With the increased urgency to design fusion pilot plants, fast optimization\nof electron cyclotron current drive (ECCD) launchers is paramount.\nTraditionally, this is done by coarsely sampling the 4-D parameter space of\npossible launch conditions consisting of (1) the launch location (constrained\nto lie along the reactor vessel), (2) the launch frequency, (3) the toroidal\nlaunch angle, and (4) the poloidal launch angle. For each initial condition, a\nray-tracing simulation is performed to evaluate the ECCD efficiency.\nUnfortunately, this approach often requires millions of simulations to build up\na dataset that adequately covers the plasma volume, which must then be repeated\nevery time the design point changes. Here we adopt a different approach. Rather\nthan launching rays from the plasma periphery and hoping for the best, we\ninstead directly reconstruct the optimal ray for driving current at a given\nflux surface using a reduced physics model coupled with a commercial\nray-tracing code. Repeating this throughout the plasma volume requires only\nhundreds of simulations, constituting a ten-thousand-fold speedup. The new\nmethod is validated on two separate example tokamak profiles, and is shown to\nreliably drive localized current at the specified flux surface with the same\noptimal efficiency as obtained from the traditional approach.",
            "pdf_url": "http://arxiv.org/pdf/2501.04619v1",
            "published": "2025-01-08 17:03:08+00:00",
            "updated": "2025-01-08 17:03:08+00:00"
        },
        {
            "title": "Manifolds, Random Matrices and Spectral Gaps: The geometric phases of generative diffusion",
            "authors": "Enrico Ventura, Beatrice Achilli, Gianluigi Silvestri, Carlo Lucibello, Luca Ambrogioni",
            "summary": "In this paper, we investigate the latent geometry of generative diffusion\nmodels under the manifold hypothesis. For this purpose, we analyze the spectrum\nof eigenvalues (and singular values) of the Jacobian of the score function,\nwhose discontinuities (gaps) reveal the presence and dimensionality of distinct\nsub-manifolds. Using a statistical physics approach, we derive the spectral\ndistributions and formulas for the spectral gaps under several distributional\nassumptions, and we compare these theoretical predictions with the spectra\nestimated from trained networks. Our analysis reveals the existence of three\ndistinct qualitative phases during the generative process: a trivial phase; a\nmanifold coverage phase where the diffusion process fits the distribution\ninternal to the manifold; a consolidation phase where the score becomes\northogonal to the manifold and all particles are projected on the support of\nthe data. This `division of labor' between different timescales provides an\nelegant explanation of why generative diffusion models are not affected by the\nmanifold overfitting phenomenon that plagues likelihood-based models, since the\ninternal distribution and the manifold geometry are produced at different time\npoints during generation.",
            "pdf_url": "http://arxiv.org/pdf/2410.05898v5",
            "published": "2024-10-08 10:55:40+00:00",
            "updated": "2025-01-08 16:43:41+00:00"
        },
        {
            "title": "Motion and hydrodynamic resistance of an elastic bead confined in a square microchannel",
            "authors": "Charles Paul Moore, Hiba Belkadi, Brouna Safi, Gabriel Amselem, Charles N. Baroud",
            "summary": "Cells and other soft particles are often forced to flow in confined\ngeometries in both laboratory and natural environments, where the elastic\ndeformation induces an additional drag and pressure drop across the particle.\nIn contrast with other multiphase flows, the physical parameters that determine\nthis additional pressure are still not known. Here we start by measuring the\npressure drop across a single spherical hydrogel particle as it flows in a\nmicrofluidic comparator. This pressure is found to depend on the amount of\nconfinement, elastic modulus, fluid viscosity and velocity. A model for the\nforce balance on the particle is then proposed, by incorporating the above\ningredients and relying on simulations of bead geometry and lubrication flow\nconsiderations. The final model collapses the force measurements forces onto a\nsingle scaling law spanning several decades, while providing physical insights\nby recalling elements from classic multiphase flows and contact mechanics.",
            "pdf_url": "http://arxiv.org/pdf/2501.04592v1",
            "published": "2025-01-08 16:15:19+00:00",
            "updated": "2025-01-08 16:15:19+00:00"
        },
        {
            "title": "Mixture-of-Experts Graph Transformers for Interpretable Particle Collision Detection",
            "authors": "Donatella Genovese, Alessandro Sgroi, Alessio Devoto, Samuel Valentine, Lennox Wood, Cristiano Sebastiani, Stefano Giagu, Monica D'Onofrio, Simone Scardapane",
            "summary": "The Large Hadron Collider at CERN produces immense volumes of complex data\nfrom high-energy particle collisions, demanding sophisticated analytical\ntechniques for effective interpretation. Neural Networks, including Graph\nNeural Networks, have shown promise in tasks such as event classification and\nobject identification by representing collisions as graphs. However, while\nGraph Neural Networks excel in predictive accuracy, their \"black box\" nature\noften limits their interpretability, making it difficult to trust their\ndecision-making processes. In this paper, we propose a novel approach that\ncombines a Graph Transformer model with Mixture-of-Expert layers to achieve\nhigh predictive performance while embedding interpretability into the\narchitecture. By leveraging attention maps and expert specialization, the model\noffers insights into its internal decision-making, linking predictions to\nphysics-informed features. We evaluate the model on simulated events from the\nATLAS experiment, focusing on distinguishing rare Supersymmetric signal events\nfrom Standard Model background. Our results highlight that the model achieves\ncompetitive classification accuracy while providing interpretable outputs that\nalign with known physics, demonstrating its potential as a robust and\ntransparent tool for high-energy physics data analysis. This approach\nunderscores the importance of explainability in machine learning methods\napplied to high energy physics, offering a path toward greater trust in\nAI-driven discoveries.",
            "pdf_url": "http://arxiv.org/pdf/2501.03432v2",
            "published": "2025-01-06 23:28:19+00:00",
            "updated": "2025-01-08 15:57:01+00:00"
        },
        {
            "title": "Revolutionizing Quantum Mechanics: The Birth and Evolution of the Many-Worlds Interpretation",
            "authors": "Arnub Ghosh",
            "summary": "The Many-worlds Interpretation (MWI) of quantum mechanics has captivated\nphysicists and philosophers alike since its inception in the mid-20th century.\nThis paper explores the historical roots, evolution, and implications of the\nMWI within the context of quantum theory. Beginning with an overview of early\ndevelopments in quantum mechanics and the emergence of foundational\ninterpretations, we delve into the origins of the MWI through the\ngroundbreaking work of physicist Hugh Everett III. Everett's doctoral thesis\nproposed a radical solution to the measurement problem, positing the existence\nof multiple branching universes to account for quantum phenomenon. We trace the\nevolution of the MWI, examining its refinement and elaboration by subsequent\nphysicists such as John Wheeler. Furthermore, we discuss the MWI's impact on\ncontemporary physics, including its connections to quantum information theory\nand ongoing experimental tests. By providing a comprehensive analysis of the\nMWI's historical development and current relevance, this paper offers insights\ninto one of the most provocative interpretations of quantum mechanics and its\nimplications for our understanding of the universe.",
            "pdf_url": "http://arxiv.org/pdf/2405.06924v3",
            "published": "2024-05-11 06:04:34+00:00",
            "updated": "2025-01-08 15:38:34+00:00"
        },
        {
            "title": "Monotonicity of the Relative Entropy and the Two-sided Bogoliubov Inequality in von Neumann Algebras",
            "authors": "Benedikt M. Reible",
            "summary": "This text studies, on the one hand, certain monotonicity properties of the\nAraki-Uhlmann relative entropy and, on the other hand, unbounded perturbation\ntheory of KMS-states which facilitates a proof of the two-sided Bogoliubov\ninequality in general von Neumann algebras. After introducing the necessary\nbackground from the theory of operator algebras and Tomita-Takesaki modular\ntheory, the relative entropy functional is defined and its basic properties are\nstudied. In particular, a full and detailed proof of Uhlmann's important\nmonotonicity theorem for the relative entropy is provided. This theorem will\nthen be used to derive a number of monotonicity inequalities for the relative\nentropy of normal functionals induced by vectors of the form $V \\varOmega, V\n\\varPhi \\in \\mathcal{H}$, where $V \\in \\mathscr{B}(\\mathcal{H})$ is a suitable\ntransformation. After that, an introduction to perturbation theory in von\nNeumann algebras is given, with an emphasis on unbounded perturbations of\nKMS-states following the framework of Derezi\\'{n}ski-Jak\\v{s}i\\'{c}-Pillet.\nThis mathematical apparatus will then be used to extend the two-sided\nBogoliubov inequality for the relative free energy, which was very recently\nproved for quantum-mechanical systems, to arbitrary von Neumann algebras.",
            "pdf_url": "http://arxiv.org/pdf/2501.04564v1",
            "published": "2025-01-08 15:25:14+00:00",
            "updated": "2025-01-08 15:25:14+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Beyond Sight: Finetuning Generalist Robot Policies with Heterogeneous Sensors via Language Grounding",
            "authors": "Joshua Jones, Oier Mees, Carmelo Sferrazza, Kyle Stachowicz, Pieter Abbeel, Sergey Levine",
            "summary": "Interacting with the world is a multi-sensory experience: achieving effective\ngeneral-purpose interaction requires making use of all available modalities --\nincluding vision, touch, and audio -- to fill in gaps from partial observation.\nFor example, when vision is occluded reaching into a bag, a robot should rely\non its senses of touch and sound. However, state-of-the-art generalist robot\npolicies are typically trained on large datasets to predict robot actions\nsolely from visual and proprioceptive observations. In this work, we propose\nFuSe, a novel approach that enables finetuning visuomotor generalist policies\non heterogeneous sensor modalities for which large datasets are not readily\navailable by leveraging natural language as a common cross-modal grounding. We\ncombine a multimodal contrastive loss with a sensory-grounded language\ngeneration loss to encode high-level semantics. In the context of robot\nmanipulation, we show that FuSe enables performing challenging tasks that\nrequire reasoning jointly over modalities such as vision, touch, and sound in a\nzero-shot setting, such as multimodal prompting, compositional cross-modal\nprompting, and descriptions of objects it interacts with. We show that the same\nrecipe is applicable to widely different generalist policies, including both\ndiffusion-based generalist policies and large vision-language-action (VLA)\nmodels. Extensive experiments in the real world show that FuSeis able to\nincrease success rates by over 20% compared to all considered baselines.",
            "pdf_url": "http://arxiv.org/pdf/2501.04693v1",
            "published": "2025-01-08 18:57:33+00:00",
            "updated": "2025-01-08 18:57:33+00:00"
        },
        {
            "title": "A Statistical Theory of Contrastive Pre-training and Multimodal Generative AI",
            "authors": "Kazusato Oko, Licong Lin, Yuhang Cai, Song Mei",
            "summary": "Multi-modal generative AI systems, such as those combining vision and\nlanguage, rely on contrastive pre-training to learn representations across\ndifferent modalities. While their practical benefits are widely acknowledged, a\nrigorous theoretical understanding of the contrastive pre-training framework\nremains limited. This paper develops a theoretical framework to explain the\nsuccess of contrastive pre-training in downstream tasks, such as zero-shot\nclassification, conditional diffusion models, and vision-language models. We\nintroduce the concept of approximate sufficient statistics, a generalization of\nthe classical sufficient statistics, and show that near-minimizers of the\ncontrastive pre-training loss are approximately sufficient, making them\nadaptable to diverse downstream tasks. We further propose the Joint Generative\nHierarchical Model for the joint distribution of images and text, showing that\ntransformers can efficiently approximate relevant functions within this model\nvia belief propagation. Building on this framework, we derive sample complexity\nguarantees for multi-modal learning based on contrastive pre-trained\nrepresentations. Numerical simulations validate these theoretical findings,\ndemonstrating the strong generalization performance of contrastively\npre-trained transformers in various multi-modal tasks.",
            "pdf_url": "http://arxiv.org/pdf/2501.04641v1",
            "published": "2025-01-08 17:47:06+00:00",
            "updated": "2025-01-08 17:47:06+00:00"
        },
        {
            "title": "Diffusion Map Autoencoder",
            "authors": "Julio Candanedo",
            "summary": "In this work, we explore various modifications to diffusion maps (DMAP),\nincluding their incorporation into a layered sequential neural network model\ntrained with gradient descent. The result is a sequential neural network that\ninherits the interpretability of diffusion maps.",
            "pdf_url": "http://arxiv.org/pdf/2409.05901v2",
            "published": "2024-09-05 20:45:44+00:00",
            "updated": "2025-01-08 17:36:41+00:00"
        },
        {
            "title": "MedCoDi-M: A Multi-Prompt Foundation Model for Multimodal Medical Data Generation",
            "authors": "Daniele Molino, Francesco Di Feola, Eliodoro Faiella, Deborah Fazzini, Domiziana Santucci, Linlin Shen, Valerio Guarrasi, Paolo Soda",
            "summary": "Artificial Intelligence is revolutionizing medical practice, enhancing\ndiagnostic accuracy and healthcare delivery. However, its adaptation in medical\nsettings still faces significant challenges, related to data availability and\nprivacy constraints. Synthetic data has emerged as a promising solution to\nmitigate these issues, addressing data scarcity while preserving privacy.\nRecently, Latent Diffusion Models have emerged as a powerful tool for\ngenerating high-quality synthetic data. Meanwhile, the integration of different\nmodalities has gained interest, emphasizing the need of models capable of\nhandle multimodal medical data.Existing approaches struggle to integrate\ncomplementary information and lack the ability to generate modalities\nsimultaneously. To address this challenge, we present MedCoDi-M, a\n6.77-billion-parameter model, designed for multimodal medical data generation,\nthat, following Foundation Model paradigm, exploits contrastive learning and\nlarge quantity of data to build a shared latent space which capture the\nrelationships between different data modalities. Further, we introduce the\nMulti-Prompt training technique, which significantly boosts MedCoDi-M's\ngeneration under different settings. We extensively validate MedCoDi-M: first\nwe benchmark it against five competitors on the MIMIC-CXR dataset, a\nstate-of-the-art dataset for Chest X-ray and radiological report generation.\nSecondly, we perform a Visual Turing Test with expert radiologists to assess\nthe realism and clinical relevance of the generated data, ensuring alignment\nwith real-world scenarios. Finally, we assess the utility of MedCoDi-M in\naddressing key challenges in the medical field, such as anonymization, data\nscarcity and imbalance learning. The results are promising, demonstrating the\napplicability of MedCoDi-M in medical contexts. Project page is at\nhttps://cosbidev.github.io/MedCoDi-M/.",
            "pdf_url": "http://arxiv.org/pdf/2501.04614v1",
            "published": "2025-01-08 16:53:56+00:00",
            "updated": "2025-01-08 16:53:56+00:00"
        }
    ]
}