{
    "Physics": [
        {
            "title": "Polarized and unpolarized off-shell $H^\\ast\\to ZZ\\rightarrow 4\\ell$ decay above the $2m_Z$ threshold",
            "authors": "A. I. Hernández-Juárez, R. Gaitán, G. Tavares-Velasco",
            "summary": "An analysis of the off-shell $H^\\ast\\rightarrow ZZ \\rightarrow\n\\overline{\\ell}_1\\ell_1\\overline{\\ell}_2\\ell_2$ decay width is presented for\nboth unpolarized and polarized $Z$ gauge bosons in the scenario with the most\ngeneral $H^*ZZ$ vertex function, which is given in terms of two $CP$-even\n($\\hat b_Z$ and $\\hat c_Z$) and one $CP$-odd ($\\tilde b_Z$) anomalous\ncouplings.\n  The SM contributions to the $H^*ZZ$ coupling up to the one-loop level are\nalso included. Explicit analytic results for the unpolarized and polarized\n$H^\\ast\\rightarrow ZZ \\rightarrow\n\\overline{\\ell}_1\\ell_1\\overline{\\ell}_2\\ell_2$ square amplitudes and the\nfour-body phase space are presented, out of which several observable quantities\ncan be obtained straightforwardly. As far as the numerical analysis is\nconcerned, a cross-check is performed via \\texttt{MadGraph5\\_aMC@NLO}, where\nour model was implemented with the aid of FeynRules. We then consider the most\nstringent bounds on anomalous complex $H^*ZZ$ couplings and analyze the effects\nof the polarizations of the $Z$ gauge bosons through the polarized\n$H^\\ast\\rightarrow ZZ \\rightarrow\n\\overline{\\ell}_1\\ell_1\\overline{\\ell}_2\\ell_2$ decay width as well as\nleft-right and forward-backward asymmetries, which are found to be sensitive to\nnew-physics effects. Particular focus is put on the effects of the absorptive\nparts of the anomalous $H^*ZZ$ couplings, which have been largely overlooked up\nto now in LHC analyses. It is found that the studied observable quantities,\nparticularly the left-right asymmetries, can be helpful to look for effects of\n$CP$-violation in the $H^*ZZ$ coupling and set bounds on the absorptive parts.\nFor completeness, we also analyze the case of unpolarized $Z$ gauge bosons.",
            "pdf_url": "http://arxiv.org/pdf/2402.18497v2",
            "published": "2024-02-28 17:26:36+00:00",
            "updated": "2024-07-08 17:49:57+00:00"
        },
        {
            "title": "Cellular-resolution X-ray microtomography of an entire mouse brain",
            "authors": "Mattia Humbel, Christine Tanner, Marta Girona Alarcón, Georg Schulz, Timm Weitkamp, Mario Scheel, Vartan Kurtcuoglu, Bert Müller, Griffin Rodgers",
            "summary": "Purpose: Histology is the gold standard for sub-cellular visualization of the\nmouse brain. It offers excellent in-plane resolution, but a comparably low\nout-of-plane resolution due to physical sectioning. X-ray microtomography does\nnot require this trade-off. Tomographic imaging of the entire mouse brain with\nisotropic cellular resolution produces datasets of multiple terabytes in size.\nThese data must be processed and made accessible to domain experts who may have\nonly limited image processing knowledge.\n  Approach: Extended-field X-ray microtomography covering an entire mouse brain\nwas performed. The 4,495 projections from 8 $\\times$ 8 offset acquisitions were\nstitched to reconstruct a volume of 15,000$^3$ voxels. The microtomography\nvolume was non-rigidly registered to the Allen Mouse Brain Common Coordinate\nFramework v3 based on a combination of image intensity and landmark pairs.\n  Results: We present a 3.3 teravoxel dataset covering a full mouse brain with\n0.65 $\\mu$m voxel size. The data were blockwise transformed to a common\ncoordinate system, then stored in a public repository with a hierarchical\nformat for navigation and overlay with anatomical annotations in online viewers\nsuch as Neuroglancer or siibra-explorer.\n  Conclusions: This study demonstrates X-ray imaging and data processing for a\nfull mouse brain, augmenting current atlases by improving resolution in the\nthird dimension by an order of magnitude. The data are publicly available and\neasily accessible for domain experts via browser-based viewers.",
            "pdf_url": "http://arxiv.org/pdf/2405.13971v2",
            "published": "2024-05-22 20:12:36+00:00",
            "updated": "2024-07-08 17:43:42+00:00"
        },
        {
            "title": "A Hidden Convexity of Nonlinear Elasticity",
            "authors": "Siddharth Singh, Janusz Ginster, Amit Acharya",
            "summary": "A technique for developing convex dual variational principles for the\ngoverning PDE of nonlinear elastostatics and elastodynamics is presented. This\nallows the definition of notions of a variational dual solution and a dual\nsolution corresponding to the PDEs of nonlinear elasticity, even when the\nlatter arise as formal Euler-Lagrange equations corresponding to\nnon-quasiconvex elastic energy functionals whose energy minimizers do not\nexist. This is demonstrated rigorously in the case of elastostatics for the\nSaint-Venant Kirchhoff material (in all dimensions), where the existence of\nvariational dual solutions is also proven. The existence of a variational dual\nsolution for the incompressible neo-Hookean material in 2-d is also shown.\nStressed and unstressed elastostatic and elastodynamic solutions in 1 space\ndimension corresponding to a non-convex, double-well energy are computed using\nthe dual methodology. In particular, we show the stability of a dual\nelastodynamic equilibrium solution for which there are regions of non-vanishing\nlength with negative elastic stiffness, i.e.~non-hyperbolic regions, for which\nthe corresponding primal problem is ill-posed and demonstrates an explosive\n`Hadamard instability;' this appears to have implications for the modeling of\nphysically observed softening behavior in macroscopic mechanical response.",
            "pdf_url": "http://arxiv.org/pdf/2401.08538v2",
            "published": "2024-01-16 18:00:09+00:00",
            "updated": "2024-07-08 17:33:31+00:00"
        },
        {
            "title": "Accelerating Phase Field Simulations Through a Hybrid Adaptive Fourier Neural Operator with U-Net Backbone",
            "authors": "Christophe Bonneville, Nathan Bieberdorf, Arun Hegde, Mark Asta, Habib N. Najm, Laurent Capolungo, Cosmin Safta",
            "summary": "Prolonged contact between a corrosive liquid and metal alloys can cause\nprogressive dealloying. For such liquid-metal dealloying (LMD) process, phase\nfield models have been developed. However, the governing equations often\ninvolve coupled non-linear partial differential equations (PDE), which are\nchallenging to solve numerically. In particular, stiffness in the PDEs requires\nan extremely small time steps (e.g. $10^{-12}$ or smaller). This computational\nbottleneck is especially problematic when running LMD simulation until a late\ntime horizon is required. This motivates the development of surrogate models\ncapable of leaping forward in time, by skipping several consecutive time steps\nat-once. In this paper, we propose U-Shaped Adaptive Fourier Neural Operators\n(U-AFNO), a machine learning (ML) model inspired by recent advances in neural\noperator learning. U-AFNO employs U-Nets for extracting and reconstructing\nlocal features within the physical fields, and passes the latent space through\na vision transformer (ViT) implemented in the Fourier space (AFNO). We use\nU-AFNOs to learn the dynamics mapping the field at a current time step into a\nlater time step. We also identify global quantities of interest (QoI)\ndescribing the corrosion process (e.g. the deformation of the liquid-metal\ninterface) and show that our proposed U-AFNO model is able to accurately\npredict the field dynamics, in-spite of the chaotic nature of LMD. Our model\nreproduces the key micro-structure statistics and QoIs with a level of accuracy\non-par with the high-fidelity numerical solver. We also investigate the\nopportunity of using hybrid simulations, in which we alternate forward leap in\ntime using the U-AFNO with high-fidelity time stepping. We demonstrate that\nwhile advantageous for some surrogate model design choices, our proposed U-AFNO\nmodel in fully auto-regressive settings consistently outperforms hybrid\nschemes.",
            "pdf_url": "http://arxiv.org/pdf/2406.17119v2",
            "published": "2024-06-24 20:13:23+00:00",
            "updated": "2024-07-08 17:23:22+00:00"
        },
        {
            "title": "Prevalence of a growth mindset among introductory astronomy students",
            "authors": "Moire K. M. Prescott, Laura Madson, Sandra M. Way, Kelly N. Sanderson",
            "summary": "While many previous studies have indicated that encouraging a growth mindset\ncan improve student learning outcomes, this conclusion's applicability to\ncollege-level astronomy classrooms remains poorly understood owing to the\nvariation in students' overall and domain-specific learning attitudes. To\naddress this, we surveyed undergraduate students in an introductory astronomy\nclass about their attitudes towards learning astronomy over the course of five\nsemesters. Overall, students felt an affinity for astronomy, felt moderately\ncompetent, perceived astronomy to be intermediate in terms of difficulty, and\nagreed strongly with standard statements reflecting a \"growth mindset,\" i.e.,\nthe belief that intelligence is malleable rather than fixed from birth. Their\nresponses were stable over the course of the semester and did not appear to\ndepend strongly on student demographics. The unexpected start of the COVID-19\npandemic and the associated shift to all-virtual learning correlated with a\ndrop in their affinity for astronomy, a small decrease in their perceived\ncompetence, and an increase in the perceived difficulty of the topic. Their\noverall learning mindset showed negligible change during this time, emphasizing\nthe stability of their belief in a growth mindset as compared to other measured\nlearning attitudes. However, more nuanced questions about their behaviors and\ninterpretations in the classroom, about how they felt \"in the moment\", and\nabout what factors were most important for their success in the class revealed\nsignificantly lower alignment with a growth mindset. This suggests that while\nintroductory astronomy students may believe that they have a growth mindset,\nthis mindset is not necessarily reflected in their self-reported classroom\nbehaviors or measured responses to actual learning challenges.",
            "pdf_url": "http://arxiv.org/pdf/2407.06147v1",
            "published": "2024-07-08 17:20:11+00:00",
            "updated": "2024-07-08 17:20:11+00:00"
        },
        {
            "title": "Constraining $|V_{cs}|$ and physics beyond the Standard Model from exclusive (semi)leptonic charm decays",
            "authors": "Carolina Bolognani, Méril Reboud, Danny van Dyk, K. Keri Vos",
            "summary": "We study the available data on exclusive leptonic and semileptonic $c\\to\ns\\ell^+\\nu$ decays within the Standard Model and beyond. Our analysis accounts\nfor theory correlations between the relevant hadronic matrix elements through\napplication of dispersive bounds. We find that, within a global analysis, the\ndispersive bounds are generally well respected and only mildly affect the\nextraction of the Cabibbo-Kobayashi-Maskawa (CKM) matrix element $|V_{cs}|$.\nAssuming Standard Model dynamics, we obtain $$\n  |V_{cs}| = 0.957 \\pm 0.003\\,, $$ which is compatible with the HFLAV/PDG\nreference value $|V_{cs}| = 0.975 \\pm 0.006$ at the $2.7\\,\\sigma$ level. Our\nfindings lead to significant deficits in the second-row and second-column\nunitarity relations of the CKM matrix. Allowing for beyond the SM contributions\nin the Weak Effective Theory, we find very strong constraints on potential\n(pseudo)scalar and tensor effects. However, the data still permits sizeable\nCP-violating right-handed currents.",
            "pdf_url": "http://arxiv.org/pdf/2407.06145v1",
            "published": "2024-07-08 17:19:41+00:00",
            "updated": "2024-07-08 17:19:41+00:00"
        },
        {
            "title": "Loewner traces driven by Levy processes",
            "authors": "Eveliina Peltola, Anne Schreuder",
            "summary": "Loewner chains with Levy drivers have been proposed in the physics literature\nas models related to random dendritic growth in off-critical systems (and even\nfor diffusion-limited aggregation), and in mathematics as candidates for\nfinding extremal multifractal spectra (towards Brennan's conjecture and related\nproblems in classical function theory). These processes are not scale-invariant\nin general, but they do enjoy a natural domain Markov property thanks to the\nstationary independent increments of Levy processes. The associated Loewner\nhulls feature remarkably intricate topological properties and possibly\ncomplicated multifractal phenomena, of which very little is known rigorously.\n  We prove that a chordal Loewner chain driven by a Levy process $W$ satisfying\nmild regularity conditions (including stable processes) is a.s. generated by a\ncadlag curve. Specifically, if the diffusivity parameter of the driving process\n$W$ is $\\kappa \\in [0,8)$, then the jump measure of $W$ is required to be\nlocally (upper) Ahlfors regular near the origin, while if $\\kappa > 8$, no\nconstraints are imposed. In particular, we show that the associated Loewner\nhulls are a.s. locally connected and path-connected. We also show that, the\ncomplements of the hulls are a.s. Holder domains when $\\kappa \\neq 4$ (which is\nnot expected to hold when $\\kappa=4$), without any regularity assumptions. The\nproofs of these results mainly rely on careful derivative estimates for both\nthe forward and backward Loewner maps obtained using delicate but robust enough\nsupermartingale domination arguments. As one cannot control the jump\naccumulation of general Levy processes, we must circumvent all reasoning that\nwould use continuity. To prove the local connectedness, we use an extension of\npart of the Hahn-Mazurkiewicz theorem: hulls generated by cadlag curves are\nlocally connected even when jumps would occur at infinite intensity.",
            "pdf_url": "http://arxiv.org/pdf/2407.06144v1",
            "published": "2024-07-08 17:19:23+00:00",
            "updated": "2024-07-08 17:19:23+00:00"
        },
        {
            "title": "Physics-informed machine learning approaches to reactor antineutrino detection",
            "authors": "Sophia Farrell, Marc Bergevin, Adam Bernstein",
            "summary": "Nuclear reactors produce a high flux of MeV-scale antineutrinos that can be\nobserved through inverse beta-decay (IBD) interactions in particle detectors.\nReliable detection of reactor IBD signals depends on suppression of\nbackgrounds, both by physical shielding and vetoing and by pattern recognition\nand rejection in acquired data. A particularly challenging background to\nreactor antineutrino detection is from cosmogenically induced fast neutrons,\nwhich can mimic the characteristics of an IBD signal. In this work, we explore\ntwo methods of machine learning -- a tree-based classifier and a\ngraph-convolutional neural network -- to improve rejection of fast\nneutron-induced background events in a water Cherenkov detector. The tree-based\nclassifier examines classification at the reconstructed feature level, while\nthe graphical network classifies events using only the raw signal data. Both\nmethods improve the sensitivity for a background-dominant search over\ntraditional cut-and-count methods, with the greatest improvement being from the\ntree-based classification method. These performance enhancements are relevant\nfor reactor monitoring applications that make use of deep underground oil-based\nor water-based kiloton-scale detectors with multichannel, PMT-based readouts,\nand they are likely extensible to other similar physics analyses using this\nclass of detector.",
            "pdf_url": "http://arxiv.org/pdf/2407.06139v1",
            "published": "2024-07-08 17:13:37+00:00",
            "updated": "2024-07-08 17:13:37+00:00"
        },
        {
            "title": "Depression Detection and Analysis using Large Language Models on Textual and Audio-Visual Modalities",
            "authors": "Avinash Anand, Chayan Tank, Sarthak Pol, Vinayak Katoch, Shaina Mehta, Rajiv Ratn Shah",
            "summary": "Depression has proven to be a significant public health issue, profoundly\naffecting the psychological well-being of individuals. If it remains\nundiagnosed, depression can lead to severe health issues, which can manifest\nphysically and even lead to suicide. Generally, Diagnosing depression or any\nother mental disorder involves conducting semi-structured interviews alongside\nsupplementary questionnaires, including variants of the Patient Health\nQuestionnaire (PHQ) by Clinicians and mental health professionals. This\napproach places significant reliance on the experience and judgment of trained\nphysicians, making the diagnosis susceptible to personal biases. Given that the\nunderlying mechanisms causing depression are still being actively researched,\nphysicians often face challenges in diagnosing and treating the condition,\nparticularly in its early stages of clinical presentation. Recently,\nsignificant strides have been made in Artificial neural computing to solve\nproblems involving text, image, and speech in various domains. Our analysis has\naimed to leverage these state-of-the-art (SOTA) models in our experiments to\nachieve optimal outcomes leveraging multiple modalities. The experiments were\nperformed on the Extended Distress Analysis Interview Corpus Wizard of Oz\ndataset (E-DAIC) corpus presented in the Audio/Visual Emotion Challenge (AVEC)\n2019 Challenge. The proposed solutions demonstrate better results achieved by\nProprietary and Open-source Large Language Models (LLMs), which achieved a Root\nMean Square Error (RMSE) score of 3.98 on Textual Modality, beating the AVEC\n2019 challenge baseline results and current SOTA regression analysis\narchitectures. Additionally, the proposed solution achieved an accuracy of\n71.43% in the classification task. The paper also includes a novel audio-visual\nmulti-modal network that predicts PHQ-8 scores with an RMSE of 6.51.",
            "pdf_url": "http://arxiv.org/pdf/2407.06125v1",
            "published": "2024-07-08 17:00:51+00:00",
            "updated": "2024-07-08 17:00:51+00:00"
        },
        {
            "title": "Leveraging data-driven weather models for improving numerical weather prediction skill through large-scale spectral nudging",
            "authors": "Syed Zahid Husain, Leo Separovic, Jean-François Caron, Rabah Aider, Mark Buehner, Stéphane Chamberland, Ervig Lapalme, Ron McTaggart-Cowan, Christopher Subich, Paul Vaillancourt, Jing Yang, Ayrton Zadra",
            "summary": "Operational meteorological forecasting has long relied on physics-based\nnumerical weather prediction (NWP) models. Recently, this landscape has been\ndisrupted by the advent of data-driven artificial intelligence (AI)-based\nweather models, which offer tremendous computational performance and\ncompetitive forecasting skill. However, data-driven models for medium-range\nforecasting generally suffer from major limitations, including low effective\nresolution and a narrow range of predicted variables. This study illustrates\nthe relative strengths and weaknesses of these competing paradigms using the\nGEM (Global Environmental Multiscale) and GraphCast models to represent\nphysics-based and AI-based approaches, respectively. By analyzing global\npredictions from these two models against observations and analyses in both\nphysical and spectral spaces, this study demonstrates that GraphCast-predicted\nlarge scales outperform GEM, particularly for longer lead times. Building on\nthis insight, a hybrid NWP-AI system is proposed, wherein GEM-predicted\nlarge-scale state variables are spectrally nudged toward GraphCast predictions,\nwhile allowing GEM to freely generate fine-scale details critical for weather\nextremes. Results indicate that this hybrid approach is capable of leveraging\nthe strengths of GraphCast to enhance the prediction skill of the GEM model.\nImportantly, trajectories of tropical cyclones are predicted with enhanced\naccuracy without significant changes in intensity. Furthermore, this new hybrid\nsystem ensures that meteorologists have access to a complete set of forecast\nvariables, including those relevant for high-impact weather events.",
            "pdf_url": "http://arxiv.org/pdf/2407.06100v1",
            "published": "2024-07-08 16:39:25+00:00",
            "updated": "2024-07-08 16:39:25+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Potential Based Diffusion Motion Planning",
            "authors": "Yunhao Luo, Chen Sun, Joshua B. Tenenbaum, Yilun Du",
            "summary": "Effective motion planning in high dimensional spaces is a long-standing open\nproblem in robotics. One class of traditional motion planning algorithms\ncorresponds to potential-based motion planning. An advantage of potential based\nmotion planning is composability -- different motion constraints can be easily\ncombined by adding corresponding potentials. However, constructing motion paths\nfrom potentials requires solving a global optimization across configuration\nspace potential landscape, which is often prone to local minima. We propose a\nnew approach towards learning potential based motion planning, where we train a\nneural network to capture and learn an easily optimizable potentials over\nmotion planning trajectories. We illustrate the effectiveness of such approach,\nsignificantly outperforming both classical and recent learned motion planning\napproaches and avoiding issues with local minima. We further illustrate its\ninherent composability, enabling us to generalize to a multitude of different\nmotion constraints.",
            "pdf_url": "http://arxiv.org/pdf/2407.06169v1",
            "published": "2024-07-08 17:48:39+00:00",
            "updated": "2024-07-08 17:48:39+00:00"
        },
        {
            "title": "ANOLE: An Open, Autoregressive, Native Large Multimodal Models for Interleaved Image-Text Generation",
            "authors": "Ethan Chern, Jiadi Su, Yan Ma, Pengfei Liu",
            "summary": "Previous open-source large multimodal models (LMMs) have faced several\nlimitations: (1) they often lack native integration, requiring adapters to\nalign visual representations with pre-trained large language models (LLMs); (2)\nmany are restricted to single-modal generation; (3) while some support\nmultimodal generation, they rely on separate diffusion models for visual\nmodeling and generation. To mitigate these limitations, we present Anole, an\nopen, autoregressive, native large multimodal model for interleaved image-text\ngeneration. We build Anole from Meta AI's Chameleon, adopting an innovative\nfine-tuning strategy that is both data-efficient and parameter-efficient. Anole\ndemonstrates high-quality, coherent multimodal generation capabilities. We have\nopen-sourced our model, training framework, and instruction tuning data.",
            "pdf_url": "http://arxiv.org/pdf/2407.06135v1",
            "published": "2024-07-08 17:08:02+00:00",
            "updated": "2024-07-08 17:08:02+00:00"
        },
        {
            "title": "Structured Generations: Using Hierarchical Clusters to guide Diffusion Models",
            "authors": "Jorge da Silva Goncalves, Laura Manduchi, Moritz Vandenhirtz, Julia Vogt",
            "summary": "This paper introduces Diffuse-TreeVAE, a deep generative model that\nintegrates hierarchical clustering into the framework of Denoising Diffusion\nProbabilistic Models (DDPMs). The proposed approach generates new images by\nsampling from a root embedding of a learned latent tree VAE-based structure, it\nthen propagates through hierarchical paths, and utilizes a second-stage DDPM to\nrefine and generate distinct, high-quality images for each data cluster. The\nresult is a model that not only improves image clarity but also ensures that\nthe generated samples are representative of their respective clusters,\naddressing the limitations of previous VAE-based methods and advancing the\nstate of clustering-based generative modeling.",
            "pdf_url": "http://arxiv.org/pdf/2407.06124v1",
            "published": "2024-07-08 17:00:28+00:00",
            "updated": "2024-07-08 17:00:28+00:00"
        },
        {
            "title": "Layered Diffusion Model for One-Shot High Resolution Text-to-Image Synthesis",
            "authors": "Emaad Khwaja, Abdullah Rashwan, Ting Chen, Oliver Wang, Suraj Kothawade, Yeqing Li",
            "summary": "We present a one-shot text-to-image diffusion model that can generate\nhigh-resolution images from natural language descriptions. Our model employs a\nlayered U-Net architecture that simultaneously synthesizes images at multiple\nresolution scales. We show that this method outperforms the baseline of\nsynthesizing images only at the target resolution, while reducing the\ncomputational cost per step. We demonstrate that higher resolution synthesis\ncan be achieved by layering convolutions at additional resolution scales, in\ncontrast to other methods which require additional models for super-resolution\nsynthesis.",
            "pdf_url": "http://arxiv.org/pdf/2407.06079v1",
            "published": "2024-07-08 16:25:34+00:00",
            "updated": "2024-07-08 16:25:34+00:00"
        },
        {
            "title": "EndoUIC: Promptable Diffusion Transformer for Unified Illumination Correction in Capsule Endoscopy",
            "authors": "Long Bai, Tong Chen, Qiaozhi Tan, Wan Jun Nah, Yanheng Li, Zhicheng He, Sishen Yuan, Zhen Chen, Jinlin Wu, Mobarakol Islam, Zhen Li, Hongbin Liu, Hongliang Ren",
            "summary": "Wireless Capsule Endoscopy (WCE) is highly valued for its non-invasive and\npainless approach, though its effectiveness is compromised by uneven\nillumination from hardware constraints and complex internal dynamics, leading\nto overexposed or underexposed images. While researchers have discussed the\nchallenges of low-light enhancement in WCE, the issue of correcting for\ndifferent exposure levels remains underexplored. To tackle this, we introduce\nEndoUIC, a WCE unified illumination correction solution using an end-to-end\npromptable diffusion transformer (DiT) model. In our work, the illumination\nprompt module shall navigate the model to adapt to different exposure levels\nand perform targeted image enhancement, in which the Adaptive Prompt\nIntegration (API) and Global Prompt Scanner (GPS) modules shall further boost\nthe concurrent representation learning between the prompt parameters and\nfeatures. Besides, the U-shaped restoration DiT model shall capture the\nlong-range dependencies and contextual information for unified illumination\nrestoration. Moreover, we present a novel Capsule-endoscopy Exposure Correction\n(CEC) dataset, including ground-truth and corrupted image pairs annotated by\nexpert photographers. Extensive experiments against a variety of\nstate-of-the-art (SOTA) methods on four datasets showcase the effectiveness of\nour proposed method and components in WCE illumination restoration, and the\nadditional downstream experiments further demonstrate its utility for clinical\ndiagnosis and surgical assistance.",
            "pdf_url": "http://arxiv.org/pdf/2406.13705v2",
            "published": "2024-06-19 16:58:28+00:00",
            "updated": "2024-07-08 15:51:29+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Graph Anomaly Detection with Noisy Labels by Reinforcement Learning",
            "authors": "Zhu Wang, Shuang Zhou, Junnan Dong, Chang Yang, Xiao Huang, Shengjie Zhao",
            "summary": "Graph anomaly detection (GAD) has been widely applied in many areas, e.g.,\nfraud detection in finance and robot accounts in social networks. Existing\nmethods are dedicated to identifying the outlier nodes that deviate from normal\nones. While they heavily rely on high-quality annotation, which is hard to\nobtain in real-world scenarios, this could lead to severely degraded\nperformance based on noisy labels. Thus, we are motivated to cut the edges of\nsuspicious nodes to alleviate the impact of noise. However, it remains\ndifficult to precisely identify the nodes with noisy labels. Moreover, it is\nhard to quantitatively evaluate the regret of cutting the edges, which may have\neither positive or negative influences. To this end, we propose a novel\nframework REGAD, i.e., REinforced Graph Anomaly Detector. Specifically, we aim\nto maximize the performance improvement (AUC) of a base detector by cutting\nnoisy edges approximated through the nodes with high-confidence labels. (i) We\ndesign a tailored action and search space to train a policy network to\ncarefully prune edges step by step, where only a few suspicious edges are\nprioritized in each step. (ii) We design a policy-in-the-loop mechanism to\niteratively optimize the policy based on the feedback from base detector. The\noverall performance is evaluated by the cumulative rewards. Extensive\nexperiments are conducted on three datasets under different anomaly ratios. The\nresults indicate the superior performance of our proposed REGAD.",
            "pdf_url": "http://arxiv.org/pdf/2407.05934v1",
            "published": "2024-07-08 13:41:21+00:00",
            "updated": "2024-07-08 13:41:21+00:00"
        }
    ]
}