{
    "Physics": [
        {
            "title": "Emergent Non-Invertible Symmetries Bridging UV and IR Phases -- The Adjoint QCD Example",
            "authors": "Michele Del Zotto, Shani Nadir Meynet, Daniele Migliorati, Kantaro Ohmori",
            "summary": "In this letter, we demonstrate how an emergent non-invertible symmetry along\na renormalization group (RG) flow reveals connections between microscopic and\nmacroscopic physics. We illustrate this using (3+1)-dimensional Adjoint QCD\nwith two flavors of Weyl fermions as an example. For the $\\mathrm{SU}(2)$ case,\nC\\'ordova and Dumitrescu proposed a non-supersymmetric deformation of the\n$\\mathcal{N}=2$ SYM theory leading to dynamical abelianization, followed by\nmonopole condensation, and resulting in a confining infrared (IR) phase\ncharacterized by disjoint copies of the $\\mathbb{CP}^1$ sigma model. In this\nscenario, we point out that the abelianized phase has an emergent\nnon-invertible symmetry, which is matched with the non-invertible symmetry of\nthe IR $\\mathbb{CP}^1$ phase, associated to the Hopf solitons. This result\nillustrate how an emergent non-invertible symmetry can be used to provide a\nbridge connecting the IR solitons and their properties with the ones of\nmicroscopic degrees of freedom in gauge theories with one-form symmetries.\nMoreover, based on this insight we generalize these results to other gauge\ntheories with any number of colors, and propose a candidate for the UV baryon\noperator in all these cases.",
            "pdf_url": "http://arxiv.org/pdf/2408.07123v2",
            "published": "2024-08-13 18:00:01+00:00",
            "updated": "2024-08-15 17:55:41+00:00"
        },
        {
            "title": "A universal neutral-atom quantum computer with individual optical addressing and non-destructive readout",
            "authors": "A. G. Radnaev, W. C. Chung, D. C. Cole, D. Mason, T. G. Ballance, M. J. Bedalov, D. A. Belknap, M. R. Berman, M. Blakely, I. L. Bloomfield, P. D. Buttler, C. Campbell, A. Chopinaud, E. Copenhaver, M. K. Dawes, S. Y. Eubanks, A. J. Friss, D. M. Garcia, J. Gilbert, M. Gillette, P. Goiporia, P. Gokhale, J. Goldwin, D. Goodwin, T. M. Graham, CJ Guttormsson, G. T. Hickman, L. Hurtley, M. Iliev, E. B. Jones, R. A. Jones, K. W. Kuper, T. B. Lewis, M. T. Lichtman, F. Majdeteimouri, J. J. Mason, J. K. McMaster, J. A. Miles, P. T. Mitchell, J. D. Murphree, N. A. Neff-Mallon, T. Oh, V. Omole, C. Parlo Simon, N. Pederson, M. A. Perlin, A. Reiter, R. Rines, P. Romlow, A. M. Scott, D. Stiefvater, J. R. Tanner, A. K. Tucker, I. V. Vinogradov, M. L. Warter, M. Yeo, M. Saffman, T. W. Noel",
            "summary": "Quantum computers must achieve large-scale, fault-tolerant operation to\ndeliver on their promise of transformational processing power [1-4]. This will\nrequire thousands or millions of high-fidelity quantum gates and similar\nnumbers of qubits [5]. Demonstrations using neutral-atom qubits trapped and\nmanipulated by lasers have shown that this modality can provide high two-qubit\ngate (CZ) fidelities and scalable operation [6-10]. However, the gates in these\ndemonstrations are driven by lasers that do not resolve individual qubits, with\nuniversal computation enabled by physical mid-circuit shuttling of the qubits.\nThis relatively slow operation will greatly extend runtimes for useful,\nlarge-scale computation. Here we demonstrate a universal neutral-atom quantum\ncomputer with gate rates limited by optical switching times, rather than\nshuttling, by individually addressing tightly focused laser beams at an array\nof single atoms. We achieve CZ fidelity of 99.35(4)% and local single qubit RZ\ngate fidelity of 99.902(8)%. Moreover, we demonstrate non-destructive readout\nof alkali-atom qubits with sub-percent loss, which boosts operational speed.\nThis technique also enables us to measure 99.73(3)% CZ fidelity with atom-loss\nevents excluded, which is a record among long lived neutral-atom qubits and\nhighlights the path to higher fidelity and error correction. Our results\nrepresent a critical step towards large-scale, fault-tolerant neutral-atom\nquantum computers that can execute computations on practical timescales.",
            "pdf_url": "http://arxiv.org/pdf/2408.08288v1",
            "published": "2024-08-15 17:42:57+00:00",
            "updated": "2024-08-15 17:42:57+00:00"
        },
        {
            "title": "Weak gauge PDEs",
            "authors": "Maxim Grigoriev, Dmitry Rudinsky",
            "summary": "Gauge PDEs generalise AKSZ sigma models to the case of general local gauge\ntheories. Despite being very flexible and invariant these geometrical objects\nare usually infinite-dimensional and are difficult to define explicitly, just\nlike standard infinitely-prolonged PDEs. We propose a notion of a weak gauge\nPDE where the nilpotency of the BRST differential is relaxed in a controllable\nway. In this approach a nontopological local gauge theory can be described in\nterms of a finite-dimensional geometrical object. Moreover, among such objects\none can find a minimal one which is unique in a certain sense. In the case of a\nLagrangian system, the respective weak gauge PDE naturally arise from its weak\npresymplectic formulation. We prove that any weak gauge PDE determines the\nstandard jet-bundle BV formulation of the underlying gauge theory, giving an\nunambiguous physical interpretation of these objects. The formalism is\nillustrated by a few examples including the non-Lagrangian self-dual Yang-Mills\ntheory. We also discuss possible applications of the approach to\ncharacterisation of those infinite-dimensional gauge PDEs which correspond to\nlocal theories.",
            "pdf_url": "http://arxiv.org/pdf/2408.08287v1",
            "published": "2024-08-15 17:41:40+00:00",
            "updated": "2024-08-15 17:41:40+00:00"
        },
        {
            "title": "Global Stellarator Coil Optimization with Quadratic Constraints and Objectives",
            "authors": "Lanke Fu, Elizabeth J. Paul, Alan A. Kaptanoglu, Amitava Bhattacharjee",
            "summary": "Most present stellarator designs are produced by costly two-stage\noptimization: the first for an optimized equilibrium, and the second for a coil\ndesign reproducing its magnetic configuration. Few proxies for coil complexity\nand forces exist at the equilibrium stage. Rapid initial state finding for both\nstages is a topic of active research. Most present convex coil optimization\ncodes use the least square winding surface method by Merkel (NESCOIL), with\nrecent improvement in conditioning, regularization , sparsity and physics\nobjectives. While elegant, the method is limited to modeling the norms of\nlinear functions in coil current. We present QUADCOIL, a fast, global coil\noptimization method that targets combinations of linear and quadratic functions\nof the current. It can directly constrain and/or minimize a wide range of\nphysics objectives unavailable in NESCOIL and REGCOIL, including the Lorentz\nforce, magnetic energy, curvature, field-current alignment, and the maximum\ndensity of a dipole array. QUADCOIL requires no initial guess and runs nearly\n$10^2\\times$ faster than filament optimization. Integrating it in the\nequilibrium optimization stage can potentially exclude equilibria with\ndifficult-to-design coils, without significantly increasing the computation\ntime per iteration. QUADCOIL finds the exact, global minimum in a large\nparameter space when possible, and otherwise finds a well-performing\napproximate global minimum. It supports most regularization techniques\ndeveloped for NESCOIL and REGCOIL. We demonstrate QUADCOIL's effectiveness in\ncoil topology control, minimizing non-convex penalties, and predicting filament\ncoil complexity with three numerical examples.",
            "pdf_url": "http://arxiv.org/pdf/2408.08267v1",
            "published": "2024-08-15 17:09:44+00:00",
            "updated": "2024-08-15 17:09:44+00:00"
        },
        {
            "title": "Bayesian Inference analysis of jet quenching using inclusive jet and hadron suppression measurements",
            "authors": "R. Ehlers, Y. Chen, J. Mulligan, Y. Ji, A. Kumar, S. Mak, P. M. Jacobs, A. Majumder, A. Angerami, R. Arora, S. A. Bass, R. Datta, L. Du, H. Elfner, R. J. Fries, C. Gale, Y. He, B. V. Jacak, S. Jeon, F. Jonas, L. Kasper, M. Kordell II, R. Kunnawalkam-Elayavalli, J. Latessa, Y. -J. Lee, R. Lemmon, M. Luzum, A. Mankolli, C. Martin, H. Mehryar, T. Mengel, C. Nattrass, J. Norman, C. Parker, J. -F. Paquet, J. H. Putschke, H. Roch, G. Roland, B. Schenke, L. Schwiebert, A. Sengupta, C. Shen, M. Singh, C. Sirimanna, D. Soeder, R. A. Soltz, I. Soudi, Y. Tachibana, J. Velkovska, G. Vujanovic, X. -N. Wang, X. Wu, W. Zhao",
            "summary": "The JETSCAPE Collaboration reports a new determination of the jet transport\nparameter $\\hat{q}$ in the Quark-Gluon Plasma (QGP) using Bayesian Inference,\nincorporating all available inclusive hadron and jet yield suppression data\nmeasured in heavy-ion collisions at RHIC and the LHC. This multi-observable\nanalysis extends the previously published JETSCAPE Bayesian Inference\ndetermination of $\\hat{q}$, which was based solely on a selection of inclusive\nhadron suppression data. JETSCAPE is a modular framework incorporating detailed\ndynamical models of QGP formation and evolution, and jet propagation and\ninteraction in the QGP. Virtuality-dependent partonic energy loss in the QGP is\nmodeled as a thermalized weakly-coupled plasma, with parameters determined from\nBayesian calibration using soft-sector observables. This Bayesian calibration\nof $\\hat{q}$ utilizes Active Learning, a machine--learning approach, for\nefficient exploitation of computing resources. The experimental data included\nin this analysis span a broad range in collision energy and centrality, and in\ntransverse momentum. In order to explore the systematic dependence of the\nextracted parameter posterior distributions, several different calibrations are\nreported, based on combined jet and hadron data; on jet or hadron data\nseparately; and on restricted kinematic or centrality ranges of the jet and\nhadron data. Tension is observed in comparison of these variations, providing\nnew insights into the physics of jet transport in the QGP and its theoretical\nformulation.",
            "pdf_url": "http://arxiv.org/pdf/2408.08247v1",
            "published": "2024-08-15 16:33:07+00:00",
            "updated": "2024-08-15 16:33:07+00:00"
        },
        {
            "title": "From Entanglement Purification Scheduling to Fidelity-constrained Entanglement Routing",
            "authors": "Ziyue Jia, Lin Chen",
            "summary": "Recently emerged as a disruptive networking paradigm, quantum networks rely\non the mysterious quantum entanglement to teleport qubits without physically\ntransferring quantum particles. However, the state of quantum systems is\nextremely fragile due to environment noise. A promising technique to combat\nagainst quantum decoherence is entanglement purification. To fully exploit its\nbenefit, two fundamental research questions need to be answered: (1) given an\nentanglement path, what is the optimal entanglement purification schedule? (2)\nhow to compute min-cost end-to-end entanglement paths subject to fidelity\nconstraint? In this paper, we give algorithmic solutions to both questions. For\nthe first question, we develop an optimal entanglement purification scheduling\nalgorithm for the single-hop case and analyze the \\textsc{purify-and-swap}\nstrategy in the multi-hop case by establishing the closed-form condition for\nits optimality. For the second question, we design a polynomial-time algorithm\nconstructing an $\\epsilon$-optimal fidelity-constrained path. The effectiveness\nof our algorithms are also numerically demonstrated by extensive simulations.",
            "pdf_url": "http://arxiv.org/pdf/2408.08243v1",
            "published": "2024-08-15 16:11:14+00:00",
            "updated": "2024-08-15 16:11:14+00:00"
        },
        {
            "title": "The Threats of Embodied Multimodal LLMs: Jailbreaking Robotic Manipulation in the Physical World",
            "authors": "Hangtao Zhang, Chenyu Zhu, Xianlong Wang, Ziqi Zhou, Yichen Wang, Lulu Xue, Minghui Li, Shengshan Hu, Leo Yu Zhang",
            "summary": "Embodied artificial intelligence (AI) represents an artificial intelligence\nsystem that interacts with the physical world through sensors and actuators,\nseamlessly integrating perception and action. This design enables AI to learn\nfrom and operate within complex, real-world environments. Large Language Models\n(LLMs) deeply explore language instructions, playing a crucial role in devising\nplans for complex tasks. Consequently, they have progressively shown immense\npotential in empowering embodied AI, with LLM-based embodied AI emerging as a\nfocal point of research within the community. It is foreseeable that, over the\nnext decade, LLM-based embodied AI robots are expected to proliferate widely,\nbecoming commonplace in homes and industries. However, a critical safety issue\nthat has long been hiding in plain sight is: could LLM-based embodied AI\nperpetrate harmful behaviors? Our research investigates for the first time how\nto induce threatening actions in embodied AI, confirming the severe risks posed\nby these soon-to-be-marketed robots, which starkly contravene Asimov's Three\nLaws of Robotics and threaten human safety. Specifically, we formulate the\nconcept of embodied AI jailbreaking and expose three critical security\nvulnerabilities: first, jailbreaking robotics through compromised LLM; second,\nsafety misalignment between action and language spaces; and third, deceptive\nprompts leading to unaware hazardous behaviors. We also analyze potential\nmitigation measures and advocate for community awareness regarding the safety\nof embodied AI applications in the physical world.",
            "pdf_url": "http://arxiv.org/pdf/2407.20242v2",
            "published": "2024-07-16 13:13:16+00:00",
            "updated": "2024-08-15 16:08:06+00:00"
        },
        {
            "title": "The Dawn of KAN in Image-to-Image (I2I) Translation: Integrating Kolmogorov-Arnold Networks with GANs for Unpaired I2I Translation",
            "authors": "Arpan Mahara, Naphtali D. Rishe, Liangdong Deng",
            "summary": "Image-to-Image translation in Generative Artificial Intelligence (Generative\nAI) has been a central focus of research, with applications spanning\nhealthcare, remote sensing, physics, chemistry, photography, and more. Among\nthe numerous methodologies, Generative Adversarial Networks (GANs) with\ncontrastive learning have been particularly successful. This study aims to\ndemonstrate that the Kolmogorov-Arnold Network (KAN) can effectively replace\nthe Multi-layer Perceptron (MLP) method in generative AI, particularly in the\nsubdomain of image-to-image translation, to achieve better generative quality.\nOur novel approach replaces the two-layer MLP with a two-layer KAN in the\nexisting Contrastive Unpaired Image-to-Image Translation (CUT) model,\ndeveloping the KAN-CUT model. This substitution favors the generation of more\ninformative features in low-dimensional vector representations, which\ncontrastive learning can utilize more effectively to produce high-quality\nimages in the target domain. Extensive experiments, detailed in the results\nsection, demonstrate the applicability of KAN in conjunction with contrastive\nlearning and GANs in Generative AI, particularly for image-to-image\ntranslation. This work suggests that KAN could be a valuable component in the\nbroader generative AI domain.",
            "pdf_url": "http://arxiv.org/pdf/2408.08216v1",
            "published": "2024-08-15 15:26:12+00:00",
            "updated": "2024-08-15 15:26:12+00:00"
        },
        {
            "title": "Scalar-Scaffolded Gluons and the Combinatorial Origins of Yang-Mills Theory",
            "authors": "Nima Arkani-Hamed, Qu Cao, Jin Dong, Carolina Figueiredo, Song He",
            "summary": "We present a new formulation for Yang-Mills scattering amplitudes in any\nnumber of dimensions and at any loop order, based on the same combinatorial and\nbinary-geometric ideas in kinematic space recently used to give an all-order\ndescription of Tr $\\phi^3$ theory. We propose that in a precise sense the\namplitudes for a suitably \"stringy\" form of these two theories are identical,\nup to a simple shift of kinematic variables. This connection is made possible\nby describing the amplitudes for $n$ gluons via a \"scalar scaffolding\", arising\nfrom the scattering of $2n$ colored scalars coming in $n$ distinct pairs of\nflavors fusing to produce the gluons. Fundamental properties of the\n\"$u$-variables\", describing the \"binary geometry\" for surfaces appearing in the\ntopological expansion, magically guarantee that the kinematically shifted Tr\n$\\phi^3$ amplitudes satisfy the physical properties needed to be interpreted as\nscaffolded gluons. These include multilinearity, gauge invariance, and\nfactorization on tree- and loop- level gluon cuts. Our \"stringy\" scaffolded\ngluon amplitudes coincide with amplitudes in the bosonic string for\nextra-dimensional gluon polarizations at tree-level, but differ (and are\nsimpler) at loop-level. We provide many checks on our proposal, including\nmatching non-trivial leading singularities through two loops. The simple\ncounting problem underlying the $u$ variables autonomously \"knows\" about\neverything needed to convert colored scalar to gluon amplitudes, exposing a\nstriking \"discovery\" of Yang-Mills amplitudes from elementary combinatorial\nideas in kinematic space.",
            "pdf_url": "http://arxiv.org/pdf/2401.00041v2",
            "published": "2023-12-29 19:00:00+00:00",
            "updated": "2024-08-15 15:25:53+00:00"
        },
        {
            "title": "Data-driven identification of latent port-Hamiltonian systems",
            "authors": "Johannes Rettberg, Jonas Kneifl, Julius Herb, Patrick Buchfink, Jörg Fehr, Bernard Haasdonk",
            "summary": "Conventional physics-based modeling techniques involve high effort, e.g.,\ntime and expert knowledge, while data-driven methods often lack\ninterpretability, structure, and sometimes reliability. To mitigate this, we\npresent a data-driven system identification framework that derives models in\nthe port-Hamiltonian (pH) formulation. This formulation is suitable for\nmulti-physical systems while guaranteeing the useful system theoretical\nproperties of passivity and stability. Our framework combines linear and\nnonlinear reduction with structured, physics-motivated system identification.\nIn this process, high-dimensional state data obtained from possibly nonlinear\nsystems serves as input for an autoencoder, which then performs two tasks: (i)\nnonlinearly transforming and (ii) reducing this data onto a low-dimensional\nlatent space. In this space, a linear pH system, that satisfies the pH\nproperties per construction, is parameterized by the weights of a neural\nnetwork. The mathematical requirements are met by defining the pH matrices\nthrough Cholesky factorizations. The neural networks that define the coordinate\ntransformation and the pH system are identified in a joint optimization process\nto match the dynamics observed in the data while defining a linear pH system in\nthe latent space. The learned, low-dimensional pH system can describe even\nnonlinear systems and is rapidly computable due to its small size. The method\nis exemplified by a parametric mass-spring-damper and a nonlinear pendulum\nexample, as well as the high-dimensional model of a disc brake with linear\nthermoelastic behavior.",
            "pdf_url": "http://arxiv.org/pdf/2408.08185v1",
            "published": "2024-08-15 14:42:28+00:00",
            "updated": "2024-08-15 14:42:28+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Understanding the Local Geometry of Generative Model Manifolds",
            "authors": "Ahmed Imtiaz Humayun, Ibtihel Amara, Candice Schumann, Golnoosh Farnadi, Negar Rostamzadeh, Mohammad Havaei",
            "summary": "Deep generative models learn continuous representations of complex data\nmanifolds using a finite number of samples during training. For a pre-trained\ngenerative model, the common way to evaluate the quality of the manifold\nrepresentation learned, is by computing global metrics like Fr\\'echet Inception\nDistance using a large number of generated and real samples. However,\ngenerative model performance is not uniform across the learned manifold, e.g.,\nfor \\textit{foundation models} like Stable Diffusion generation performance can\nvary significantly based on the conditioning or initial noise vector being\ndenoised. In this paper we study the relationship between the \\textit{local\ngeometry of the learned manifold} and downstream generation. Based on the\ntheory of continuous piecewise-linear (CPWL) generators, we use three geometric\ndescriptors - scaling ($\\psi$), rank ($\\nu$), and complexity ($\\delta$) - to\ncharacterize a pre-trained generative model manifold locally. We provide\nquantitative and qualitative evidence showing that for a given latent, the\nlocal descriptors are correlated with generation aesthetics, artifacts,\nuncertainty, and even memorization. Finally we demonstrate that training a\n\\textit{reward model} on the local geometry can allow controlling the\nlikelihood of a generated sample under the learned distribution.",
            "pdf_url": "http://arxiv.org/pdf/2408.08307v1",
            "published": "2024-08-15 17:59:06+00:00",
            "updated": "2024-08-15 17:59:06+00:00"
        },
        {
            "title": "Derivative-Free Guidance in Continuous and Discrete Diffusion Models with Soft Value-Based Decoding",
            "authors": "Xiner Li, Yulai Zhao, Chenyu Wang, Gabriele Scalia, Gokcen Eraslan, Surag Nair, Tommaso Biancalani, Aviv Regev, Sergey Levine, Masatoshi Uehara",
            "summary": "Diffusion models excel at capturing the natural design spaces of images,\nmolecules, DNA, RNA, and protein sequences. However, rather than merely\ngenerating designs that are natural, we often aim to optimize downstream reward\nfunctions while preserving the naturalness of these design spaces. Existing\nmethods for achieving this goal often require ``differentiable'' proxy models\n(\\textit{e.g.}, classifier guidance or DPS) or involve computationally\nexpensive fine-tuning of diffusion models (\\textit{e.g.}, classifier-free\nguidance, RL-based fine-tuning). In our work, we propose a new method to\naddress these challenges. Our algorithm is an iterative sampling method that\nintegrates soft value functions, which looks ahead to how intermediate noisy\nstates lead to high rewards in the future, into the standard inference\nprocedure of pre-trained diffusion models. Notably, our approach avoids\nfine-tuning generative models and eliminates the need to construct\ndifferentiable models. This enables us to (1) directly utilize\nnon-differentiable features/reward feedback, commonly used in many scientific\ndomains, and (2) apply our method to recent discrete diffusion models in a\nprincipled way. Finally, we demonstrate the effectiveness of our algorithm\nacross several domains, including image generation, molecule generation, and\nDNA/RNA sequence generation. The code is available at\n\\href{https://github.com/masa-ue/SVDD}{https://github.com/masa-ue/SVDD}.",
            "pdf_url": "http://arxiv.org/pdf/2408.08252v1",
            "published": "2024-08-15 16:47:59+00:00",
            "updated": "2024-08-15 16:47:59+00:00"
        },
        {
            "title": "Not Every Image is Worth a Thousand Words: Quantifying Originality in Stable Diffusion",
            "authors": "Adi Haviv, Shahar Sarfaty, Uri Hacohen, Niva Elkin-Koren, Roi Livni, Amit H Bermano",
            "summary": "This work addresses the challenge of quantifying originality in text-to-image\n(T2I) generative diffusion models, with a focus on copyright originality. We\nbegin by evaluating T2I models' ability to innovate and generalize through\ncontrolled experiments, revealing that stable diffusion models can effectively\nrecreate unseen elements with sufficiently diverse training data. Then, our key\ninsight is that concepts and combinations of image elements the model is\nfamiliar with, and saw more during training, are more concisly represented in\nthe model's latent space. We hence propose a method that leverages textual\ninversion to measure the originality of an image based on the number of tokens\nrequired for its reconstruction by the model. Our approach is inspired by legal\ndefinitions of originality and aims to assess whether a model can produce\noriginal content without relying on specific prompts or having the training\ndata of the model. We demonstrate our method using both a pre-trained stable\ndiffusion model and a synthetic dataset, showing a correlation between the\nnumber of tokens and image originality. This work contributes to the\nunderstanding of originality in generative models and has implications for\ncopyright infringement cases.",
            "pdf_url": "http://arxiv.org/pdf/2408.08184v1",
            "published": "2024-08-15 14:42:02+00:00",
            "updated": "2024-08-15 14:42:02+00:00"
        },
        {
            "title": "Interactive Character Control with Auto-Regressive Motion Diffusion Models",
            "authors": "Yi Shi, Jingbo Wang, Xuekun Jiang, Bingkun Lin, Bo Dai, Xue Bin Peng",
            "summary": "Real-time character control is an essential component for interactive\nexperiences, with a broad range of applications, including physics simulations,\nvideo games, and virtual reality. The success of diffusion models for image\nsynthesis has led to the use of these models for motion synthesis. However, the\nmajority of these motion diffusion models are primarily designed for offline\napplications, where space-time models are used to synthesize an entire sequence\nof frames simultaneously with a pre-specified length. To enable real-time\nmotion synthesis with diffusion model that allows time-varying controls, we\npropose A-MDM (Auto-regressive Motion Diffusion Model). Our conditional\ndiffusion model takes an initial pose as input, and auto-regressively generates\nsuccessive motion frames conditioned on the previous frame. Despite its\nstreamlined network architecture, which uses simple MLPs, our framework is\ncapable of generating diverse, long-horizon, and high-fidelity motion\nsequences. Furthermore, we introduce a suite of techniques for incorporating\ninteractive controls into A-MDM, such as task-oriented sampling, in-painting,\nand hierarchical reinforcement learning. These techniques enable a pre-trained\nA-MDM to be efficiently adapted for a variety of new downstream tasks. We\nconduct a comprehensive suite of experiments to demonstrate the effectiveness\nof A-MDM, and compare its performance against state-of-the-art auto-regressive\nmethods.",
            "pdf_url": "http://arxiv.org/pdf/2306.00416v3",
            "published": "2023-06-01 07:48:34+00:00",
            "updated": "2024-08-15 05:56:32+00:00"
        },
        {
            "title": "Conditional Brownian Bridge Diffusion Model for VHR SAR to Optical Image Translation",
            "authors": "Seon-Hoon Kim, Dae-won Chung",
            "summary": "Synthetic Aperture Radar (SAR) imaging technology provides the unique\nadvantage of being able to collect data regardless of weather conditions and\ntime. However, SAR images exhibit complex backscatter patterns and speckle\nnoise, which necessitate expertise for interpretation. To deal with this\nchallenge, research has been conducted on translating SAR images into\noptical-like representations to aid the interpretation of SAR data.\nNevertheless, existing studies have predominantly utilized low-resolution\nsatellite imagery datasets and have largely been based on Generative\nAdversarial Network (GAN) which are known for their training instability and\nlow fidelity. To overcome these limitations of low-resolution data usage and\nGAN-based approaches, this paper introduces a conditional image-to-image\ntranslation approach based on Brownian Bridge Diffusion Model (BBDM). We\nconducted comprehensive experiments on the MSAW dataset, a paired SAR and\noptical images collection of 0.5m Very-High-Resolution (VHR) images. The\nexperimental results indicate that our method surpasses both the Conditional\nDiffusion Model (CDM) and the GAN-based models in diverse perceptual quality\nmetrics.",
            "pdf_url": "http://arxiv.org/pdf/2408.07947v1",
            "published": "2024-08-15 05:43:46+00:00",
            "updated": "2024-08-15 05:43:46+00:00"
        }
    ]
}