{
    "Physics": [
        {
            "title": "Bayesian analysis of hybrid neutron star EoS constraints within a nonlocal color superconducting quark matter model",
            "authors": "Alexander Ayriyan, David Blaschke, Juan Pablo Carlomagno, Gustavo A. Contrera, Ana Gabriela Grunfeld",
            "summary": "We present a physics-informed Bayesian analysis of equation of state\nconstraints using observational data for masses, radii and tidal deformability\nof pulsars and a generic class of hybrid neutron star equation of state with\ncolor superconducting quark matter on the basis of a recently developed\nnonlocal chiral quark model. The nuclear matter phase is described within a\nrelativistic density functional model of the DD2 class and the phase transition\nis obtained by a Maxwell construction. We find the region in the\ntwo-dimensional parameter space spanned by the vector meson coupling and the\nscalar diquark coupling, where three conditions are fulfilled: 1) the Maxwell\nconstruction can be performed, 2) the maximum mass of the hybrid neutron star\nis not smaller than 2.0 M$_\\odot$ and 3) the onset density of the phase\ntransition is not below the nuclear saturation density $n_0=0.15$ fm$^{-3}$.\nThe result of this study shows that the favorable neutron star equation of\nstate has low onset masses for the occurrence of a color superconducting quark\nmatter core between $0.5-0.7~M_\\odot$ and maximum masses in the range $2.15 -\n2.22~M_\\odot$. In the typical mass range of $1.2 - 2.0~M_\\odot$, the radii of\nthese stars are between 11.9 and 12.4 km, almost independent of the mass. In\nprinciple, hybrid stars would allow for larger maximum masses than provided by\nthe hadronic reference equation of state.",
            "pdf_url": "http://arxiv.org/pdf/2501.00115v2",
            "published": "2024-12-30 19:26:21+00:00",
            "updated": "2025-02-04 18:56:59+00:00"
        },
        {
            "title": "Primordial Sharp Features through the Nonlinear Regime of Structure Formation",
            "authors": "Clément Stahl, Denis Werth, Vivian Poulin",
            "summary": "Sudden violations of the slow-roll regime during inflation, a natural\nprediction of many UV-complete inflationary models, give rise to sharp features\nin the primordial power spectrum. At large scales, these features provide a\nunique window into the physics of inflation, with constraints primarily derived\nfrom Cosmic Microwave Background observations of linearly evolved primordial\nfluctuations. However, on smaller scales, it is less clear whether primordial\nfeatures would survive the late-time nonlinear cosmological evolution, as they\nare expected to be washed out by mode coupling. In this paper, we run dedicated\nN-body simulations to tackle this question. We demonstrate that, while\noscillatory-like patterns are erased over time by nonlinearities, signatures of\nprimordial sharp features can persist through the nonlinear regime of structure\nformation. Those take the form of a localised power enhancement or decrease in\nthe matter power spectrum, whose amplitude and position can in principle be\nused to recover the scale of the primordial feature, and an oscillatory pattern\nin the halo mass function. While these findings highlight the power for\nconstraining inflationary physics at small scales, they also show the\nchallenges posed by potential degeneracies with other physical processes\nrelevant in the nonlinear regime of structure formation such as non-cold dark\nmatter candidates. Our results open new avenues for probing inflationary\nphysics in large scale structures and galactic physics and emphasise the need\nfor refined theoretical tools to robustly constrain primordial features.",
            "pdf_url": "http://arxiv.org/pdf/2502.02571v1",
            "published": "2025-02-04 18:46:34+00:00",
            "updated": "2025-02-04 18:46:34+00:00"
        },
        {
            "title": "Towards a group structure for superluminal velocity boosts",
            "authors": "Matthew J. Lake",
            "summary": "Canonical subluminal Lorentz boosts have a clear geometric interpretation.\nThey can be neatly expressed as hyperbolic rotations, that leave both the\nfamily of $2$-sheet hyperboloids within the light cone, and the family\n$1$-sheet hyperboloids exterior to it, invariant. In this work, we construct a\nmap between the two families of hypersurfaces and interpret the corresponding\noperators as superluminal velocity boosts. Though a physical observer cannot\n`jump' the light speed barrier, to pass from one regime to the other (at least\nnot classically), the existence of superluminal motion does not, by itself,\ngenerate paradoxes. The implications of this construction for recent work on\nthe `quantum principle of relativity', proposed by Dragan and Ekert, are\ndiscussed. The geometric picture reproduces their `superboost' operator in\n$(1+1)$ dimensions but generalises to $(1+3)$ dimensions in a very different\nway. This leaves open an important possibility, which appears to be closed to\nexisting models, namely, the possibility of embedding the superluminal boosts\nwithin a group structure, without generating additional unwanted phenomenology,\nthat contradicts existing experimental results. We prove that the set\ncontaining both subluminal and superluminal boosts forms a group, in\n$(1+1)$-dimensional spacetimes, and outline a program to extend these results\nto higher-dimensional geometries.",
            "pdf_url": "http://arxiv.org/pdf/2409.01773v2",
            "published": "2024-09-03 10:35:47+00:00",
            "updated": "2025-02-04 18:36:54+00:00"
        },
        {
            "title": "Optical manifestations and bounds of topological Euler class",
            "authors": "Wojciech J. Jankowski, Arthur S. Morris, Adrien Bouhon, F. Nur Ünal, Robert-Jan Slager",
            "summary": "We analyze quantum-geometric bounds on optical weights in topological phases\nwith pairs of bands hosting nontrivial Euler class, a multigap invariant\ncharacterizing non-Abelian band topology. We show how the bounds constrain the\ncombined optical weights of the Euler bands at different dopings and further\nrestrict the size of the adjacent band gaps. In this process, we also consider\nthe associated interband contributions to dc conductivities in the flat-band\nlimit. We physically validate these results by recasting the bound in terms of\ntransition rates associated with the optical absorption of light, and\ndemonstrate how the Euler connections and curvatures can be determined through\nthe use of momentum and frequency-resolved optical measurements, allowing for a\ndirect measurement of this multiband invariant. Additionally, we prove that the\nbound holds beyond the degenerate limit of Euler bands, resulting in nodal\ntopology captured by the patch Euler class. In this context, we deduce optical\nmanifestations of Euler topology within $\\vec{k} \\cdot \\vec{p}$ models, which\ninclude quantized optical conductivity, and third-order jerk\nphotoconductivities. We showcase our findings with numerical validation in\nlattice-regularized models that benchmark effective theories for real materials\nand are realizable in metamaterials and optical lattices.",
            "pdf_url": "http://arxiv.org/pdf/2311.07545v3",
            "published": "2023-11-13 18:35:59+00:00",
            "updated": "2025-02-04 18:34:07+00:00"
        },
        {
            "title": "Particle Trajectory Representation Learning with Masked Point Modeling",
            "authors": "Sam Young, Yeon-jae Jwa, Kazuhiro Terao",
            "summary": "Effective self-supervised learning (SSL) techniques have been key to\nunlocking large datasets for representation learning. While many promising\nmethods have been developed using online corpora and captioned photographs,\ntheir application to scientific domains, where data encodes highly specialized\nknowledge, remains in its early stages. We present a self-supervised masked\nmodeling framework for 3D particle trajectory analysis in Time Projection\nChambers (TPCs). These detectors produce globally sparse (<1% occupancy) but\nlocally dense point clouds, capturing meter-scale particle trajectories at\nmillimeter resolution. Starting with PointMAE, this work proposes volumetric\ntokenization to group sparse ionization points into resolution-agnostic\npatches, as well as an auxiliary energy infilling task to improve trajectory\nsemantics. This approach -- which we call Point-based Liquid Argon Masked\nAutoencoder (PoLAr-MAE) -- achieves 99.4% track and 97.7% shower classification\nF-scores, matching that of supervised baselines without any labeled data. While\nthe model learns rich particle trajectory representations, it struggles with\nsub-token phenomena like overlapping or short-lived particle trajectories. To\nsupport further research, we release PILArNet-M -- the largest open LArTPC\ndataset (1M+ events, 5.2B labeled points) -- to advance SSL in high energy\nphysics (HEP). Project site: https://youngsm.com/polarmae/",
            "pdf_url": "http://arxiv.org/pdf/2502.02558v1",
            "published": "2025-02-04 18:31:56+00:00",
            "updated": "2025-02-04 18:31:56+00:00"
        },
        {
            "title": "The (1+3)-dimensional 'quantum principle of relativity' is Einstein's principle of relativity",
            "authors": "Matthew J. Lake",
            "summary": "We show that the $(1+3)$-dimensional `superboost' operators, proposed in\nDragan and Ekert's most recent work on superluminal reference frames\n\\cite{Dragan:2022txt}, are simply the canonical Lorentz boosts, expressed in\nnonstandard notation. Their $(1+3)$-dimensional `superflip', which is claimed\nto interchange time and space dimensions for a superluminal observer,\ntravelling with infinite speed, is equivalent to applying the identity operator\ntogether with an arbitrary relabeling. Physically, it corresponds to staying\nput within the canonical rest frame, then renaming space as `time' and time as\n`space'. We conclude that their extension of the `quantum principle of\nrelativity', proposed in earlier work on $(1+1)$-dimensional spacetimes\n\\cite{Dragan:2019grn}, to ordinary Minkowski space \\cite{Dragan:2022txt}, is\nsimply Einstein's principle of relativity, proposed in 1905.",
            "pdf_url": "http://arxiv.org/pdf/2410.07017v4",
            "published": "2024-10-09 15:59:54+00:00",
            "updated": "2025-02-04 18:13:18+00:00"
        },
        {
            "title": "Stability of the Standard Model Vacuum with Vector-Like Leptons: A Critical Examination",
            "authors": "Kivanc Y. Cingiloglu, Mariana Frank",
            "summary": "The stability of the Standard Model (SM) Higgs vacuum is a long-standing\nissue in particle physics. The SM Higgs quartic coupling parameter is expected\nto become negative at high scales, potentially generating an unstable vacuum\nwell before reaching the Planck scale. We investigate whether the introduction\nof vector-like leptons (VLLs) in six distinct gauge anomaly-independent\nrepresentations can stabilize the SM vacuum without introducing additional\nscalar fields. By analyzing the mass spectrum and mixing angles of these VLLs\nwith the SM leptons, we identify conditions under which the Higgs potential\nremains stable. We demonstrate that there exists a set of allowed but narrowed\nVLL spectra that can indeed stabilize the SM vacuum. We also study the effect\nof these VLLs on electroweak precision observables, particularly the oblique\nparameters S and T to ensure fit within global experimental constraints.\nFinally, we perform a comprehensive analysis of the parameter space allowed by\nelectroweak precision data and the parameter space required for stability,\nhighlighting cases that accommodate both. This study opens up new avenues for\nunderstanding the role of vector-like leptons in extending the validity of the\nStandard Model up to the Planck scale.",
            "pdf_url": "http://arxiv.org/pdf/2408.10898v2",
            "published": "2024-08-20 14:34:00+00:00",
            "updated": "2025-02-04 17:36:55+00:00"
        },
        {
            "title": "Local Reduced-Order Modeling for Electrostatic Plasmas by Physics-Informed Solution Manifold Decomposition",
            "authors": "Ping-Hsuan Tsai, Seung Whan Chung, Debojyoti Ghosh, John Loffeld, Youngsoo Choi, Jonathan L. Belof",
            "summary": "Despite advancements in high-performance computing and modern numerical\nalgorithms, computational cost remains prohibitive for multi-query kinetic\nplasma simulations. In this work, we develop data-driven reduced-order models\n(ROMs) for collisionless electrostatic plasma dynamics, based on the kinetic\nVlasov-Poisson equation. Our ROM approach projects the equation onto a linear\nsubspace defined by the proper orthogonal decomposition (POD) modes. We\nintroduce an efficient tensorial method to update the nonlinear term using a\nprecomputed third-order tensor. We capture multiscale behavior with a minimal\nnumber of POD modes by decomposing the solution manifold into multiple time\nwindows and creating temporally local ROMs. We consider two strategies for\ndecomposition: one based on the physical time and the other based on the\nelectric field energy. Applied to the 1D1V Vlasov-Poisson simulations, that is,\nprescribed E-field, Landau damping, and two-stream instability, we demonstrate\nthat our ROMs accurately capture the total energy of the system both for\nparametric and time extrapolation cases. The temporally local ROMs are more\nefficient and accurate than the single ROM. In addition, in the two-stream\ninstability case, we show that the energy-windowing reduced-order model\n(EW-ROM) is more efficient and accurate than the time-windowing reduced-order\nmodel (TW-ROM). With the tensorial approach, EW-ROM solves the equation\napproximately 90 times faster than Eulerian simulations while maintaining a\nmaximum relative error of 7.5% for the training data and 11% for the testing\ndata.",
            "pdf_url": "http://arxiv.org/pdf/2310.18493v4",
            "published": "2023-10-27 21:14:16+00:00",
            "updated": "2025-02-04 17:33:37+00:00"
        },
        {
            "title": "Accurate Modeling of Directional Couplers with Oxide Cladding: Bridging Simulation and Experiment",
            "authors": "Yuval Warshavsky, Yehonathan Drori, Jonatan Piasetzky, Amit Rotem, Ofer Shapiro, Yaron Oz, Haim Suchowski",
            "summary": "Directional couplers are a fundamental building block in integrated\nphotonics, particularly in quantum applications and optimization-based design\nwhere precision is critical. Accurate functionality is crucial to ensure\nreliable operation within classical and quantum circuits. However,\ndiscrepancies between simulations and measurements are frequently observed.\nThese inaccuracies can compromise the performance and scalability of integrated\nphotonic systems, underscoring the critical need for advanced, precise\nsimulation methods that bridge the gap between design and implementation. In\nthis work, we show that this discrepancy can be mainly attributed to density\nchanges in the oxide cladding. We conduct a systematic study involving\nexperimental optical measurements, numerical simulations, and direct electron\nmicroscopy imaging to investigate this discrepancy in directional couplers. We\nfind that the impact of cladding density variations on performance increases as\nfeature gaps shrink. By incorporating these effects into our simulations using\na novel and physically motivated Effective Trench Medium Model (ETMM), we\nachieve highly accurate reproduction of experimental measurements. We quantify\nthe effects of cladding density variations on the SU(2) symmetry parameters\nthat govern light propagation in directional couplers. This insight is crucial\nfor advancing the precision of compact device fabrication, enabling reliable\nsimulation of photonic integrated devices.",
            "pdf_url": "http://arxiv.org/pdf/2502.02515v1",
            "published": "2025-02-04 17:33:30+00:00",
            "updated": "2025-02-04 17:33:30+00:00"
        },
        {
            "title": "Learning to generate physical ocean states: Towards hybrid climate modeling",
            "authors": "Etienne Meunier, David Kamm, Guillaume Gachon, Redouane Lguensat, Julie Deshayes",
            "summary": "Ocean General Circulation Models require extensive computational resources to\nreach equilibrium states, while deep learning emulators, despite offering fast\npredictions, lack the physical interpretability and long-term stability\nnecessary for climate scientists to understand climate sensitivity (to\ngreenhouse gas emissions) and mechanisms of abrupt % variability such as\ntipping points. We propose to take the best from both worlds by leveraging deep\ngenerative models to produce physically consistent oceanic states that can\nserve as initial conditions for climate projections. We assess the viability of\nthis hybrid approach through both physical metrics and numerical experiments,\nand highlight the benefits of enforcing physical constraints during generation.\nAlthough we train here on ocean variables from idealized numerical simulations,\nwe claim that this hybrid approach, combining the computational efficiency of\ndeep learning with the physical accuracy of numerical models, can effectively\nreduce the computational burden of running climate models to equilibrium, and\nreduce uncertainties in climate projections by minimizing drifts in baseline\nsimulations.",
            "pdf_url": "http://arxiv.org/pdf/2502.02499v1",
            "published": "2025-02-04 17:14:41+00:00",
            "updated": "2025-02-04 17:14:41+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Open Materials Generation with Stochastic Interpolants",
            "authors": "Philipp Hoellmer, Thomas Egg, Maya M. Martirossyan, Eric Fuemmeler, Amit Gupta, Zeren Shui, Pawan Prakash, Adrian Roitberg, Mingjie Liu, George Karypis, Mark Transtrum, Richard G. Hennig, Ellad B. Tadmor, Stefano Martiniani",
            "summary": "The discovery of new materials is essential for enabling technological\nadvancements. Computational approaches for predicting novel materials must\neffectively learn the manifold of stable crystal structures within an infinite\ndesign space. We introduce Open Materials Generation (OMG), a unifying\nframework for the generative design and discovery of inorganic crystalline\nmaterials. OMG employs stochastic interpolants (SI) to bridge an arbitrary base\ndistribution to the target distribution of inorganic crystals via a broad class\nof tunable stochastic processes, encompassing both diffusion models and flow\nmatching as special cases. In this work, we adapt the SI framework by\nintegrating an equivariant graph representation of crystal structures and\nextending it to account for periodic boundary conditions in unit cell\nrepresentations. Additionally, we couple the SI flow over spatial coordinates\nand lattice vectors with discrete flow matching for atomic species. We\nbenchmark OMG's performance on two tasks: Crystal Structure Prediction (CSP)\nfor specified compositions, and 'de novo' generation (DNG) aimed at discovering\nstable, novel, and unique structures. In our ground-up implementation of OMG,\nwe refine and extend both CSP and DNG metrics compared to previous works. OMG\nestablishes a new state-of-the-art in generative modeling for materials\ndiscovery, outperforming purely flow-based and diffusion-based implementations.\nThese results underscore the importance of designing flexible deep learning\nframeworks to accelerate progress in materials science.",
            "pdf_url": "http://arxiv.org/pdf/2502.02582v1",
            "published": "2025-02-04 18:56:47+00:00",
            "updated": "2025-02-04 18:56:47+00:00"
        },
        {
            "title": "UFID: A Unified Framework for Input-level Backdoor Detection on Diffusion Models",
            "authors": "Zihan Guan, Mengxuan Hu, Sheng Li, Anil Vullikanti",
            "summary": "Diffusion models are vulnerable to backdoor attacks, where malicious\nattackers inject backdoors by poisoning certain training samples during the\ntraining stage. This poses a significant threat to real-world applications in\nthe Model-as-a-Service (MaaS) scenario, where users query diffusion models\nthrough APIs or directly download them from the internet. To mitigate the\nthreat of backdoor attacks under MaaS, black-box input-level backdoor detection\nhas drawn recent interest, where defenders aim to build a firewall that filters\nout backdoor samples in the inference stage, with access only to input queries\nand the generated results from diffusion models. Despite some preliminary\nexplorations on the traditional classification tasks, these methods cannot be\ndirectly applied to the generative tasks due to two major challenges: (1) more\ndiverse failures and (2) a multi-modality attack surface. In this paper, we\npropose a black-box input-level backdoor detection framework on diffusion\nmodels, called UFID. Our defense is motivated by an insightful causal analysis:\nBackdoor attacks serve as the confounder, introducing a spurious path from\ninput to target images, which remains consistent even when we perturb the input\nsamples with Gaussian noise. We further validate the intuition with theoretical\nanalysis. Extensive experiments across different datasets on both conditional\nand unconditional diffusion models show that our method achieves superb\nperformance on detection effectiveness and run-time efficiency.",
            "pdf_url": "http://arxiv.org/pdf/2404.01101v2",
            "published": "2024-04-01 13:21:05+00:00",
            "updated": "2025-02-04 18:18:40+00:00"
        },
        {
            "title": "Privacy Attacks on Image AutoRegressive Models",
            "authors": "Antoni Kowalczuk, Jan Dubiński, Franziska Boenisch, Adam Dziedzic",
            "summary": "Image autoregressive (IAR) models have surpassed diffusion models (DMs) in\nboth image quality (FID: 1.48 vs. 1.58) and generation speed. However, their\nprivacy risks remain largely unexplored. To address this, we conduct a\ncomprehensive privacy analysis comparing IARs to DMs. We develop a novel\nmembership inference attack (MIA) that achieves a significantly higher success\nrate in detecting training images (TPR@FPR=1%: 86.38% for IARs vs. 4.91% for\nDMs). Using this MIA, we perform dataset inference (DI) and find that IARs\nrequire as few as six samples to detect dataset membership, compared to 200 for\nDMs, indicating higher information leakage. Additionally, we extract hundreds\nof training images from an IAR (e.g., 698 from VAR-d30). Our findings highlight\na fundamental privacy-utility trade-off: while IARs excel in generation quality\nand speed, they are significantly more vulnerable to privacy attacks. This\nsuggests that incorporating techniques from DMs, such as per-token probability\nmodeling using diffusion, could help mitigate IARs' privacy risks. Our code is\navailable at https://github.com/sprintml/privacy_attacks_against_iars.",
            "pdf_url": "http://arxiv.org/pdf/2502.02514v1",
            "published": "2025-02-04 17:33:08+00:00",
            "updated": "2025-02-04 17:33:08+00:00"
        },
        {
            "title": "Generative Modeling on Lie Groups via Euclidean Generalized Score Matching",
            "authors": "Marco Bertolini, Tuan Le, Djork-Arné Clevert",
            "summary": "We extend Euclidean score-based diffusion processes to generative modeling on\nLie groups. Through the formalism of Generalized Score Matching, our approach\nyields a Langevin dynamics which decomposes as a direct sum of Lie algebra\nrepresentations, enabling generative processes on Lie groups while operating in\nEuclidean space. Unlike equivariant models, which restrict the space of\nlearnable functions by quotienting out group orbits, our method can model any\ntarget distribution on any (non-Abelian) Lie group. Standard score matching\nemerges as a special case of our framework when the Lie group is the\ntranslation group. We prove that our generalized generative processes arise as\nsolutions to a new class of paired stochastic differential equations (SDEs),\nintroduced here for the first time. We validate our approach through\nexperiments on diverse data types, demonstrating its effectiveness in\nreal-world applications such as SO(3)-guided molecular conformer generation and\nmodeling ligand-specific global SE(3) transformations for molecular docking,\nshowing improvement in comparison to Riemannian diffusion on the group itself.\nWe show that an appropriate choice of Lie group enhances learning efficiency by\nreducing the effective dimensionality of the trajectory space and enables the\nmodeling of transitions between complex data distributions. Additionally, we\ndemonstrate the universality of our approach by deriving how it extends to flow\nmatching.",
            "pdf_url": "http://arxiv.org/pdf/2502.02513v1",
            "published": "2025-02-04 17:32:17+00:00",
            "updated": "2025-02-04 17:32:17+00:00"
        },
        {
            "title": "Do Graph Diffusion Models Accurately Capture and Generate Substructure Distributions?",
            "authors": "Xiyuan Wang, Yewei Liu, Lexi Pang, Siwei Chen, Muhan Zhang",
            "summary": "Diffusion models have gained popularity in graph generation tasks; however,\nthe extent of their expressivity concerning the graph distributions they can\nlearn is not fully understood. Unlike models in other domains, popular\nbackbones for graph diffusion models, such as Graph Transformers, do not\npossess universal expressivity to accurately model the distribution scores of\ncomplex graph data. Our work addresses this limitation by focusing on the\nfrequency of specific substructures as a key characteristic of target graph\ndistributions. When evaluating existing models using this metric, we find that\nthey fail to maintain the distribution of substructure counts observed in the\ntraining set when generating new graphs. To address this issue, we establish a\ntheoretical connection between the expressivity of Graph Neural Networks (GNNs)\nand the overall performance of graph diffusion models, demonstrating that more\nexpressive GNN backbones can better capture complex distribution patterns. By\nintegrating advanced GNNs into the backbone architecture, we achieve\nsignificant improvements in substructure generation.",
            "pdf_url": "http://arxiv.org/pdf/2502.02488v1",
            "published": "2025-02-04 17:04:16+00:00",
            "updated": "2025-02-04 17:04:16+00:00"
        }
    ]
}