{
    "Physics": [
        {
            "title": "Seeded Topology Optimization for Commercial Foundry Integrated Photonics",
            "authors": "Jacob M. Hiesener, C. Alex Kaylor, Joshua J. Wong, Prankush Agarwal, Stephen E. Ralph",
            "summary": "We present a seeded topology optimization methodology for integrated photonic\ndevices fabricated on foundry platforms that yields improved performance\ncompared to traditional topology optimization. We employ blurring filters and a\nDRC correction algorithm to more readily meet design rule checks, resulting in\ndevices with fewer artifacts and improved correlation between simulation and\nmeasurements. We apply this process to an ultra-compact TE modal multiplexer, a\nTE mode converter, a polarization rotator, and a high-contrast grating\nreflector. The measured insertion loss of the TE mode converter was reduced\nfrom 1.37 dB to 0.64 dB through this optimization strategy. This approach\nenables a two-step inverse design process, merging of physics-informed design\nstrategies with inverse design, and ensures strict compliance with foundry\nconstraints throughout optimization.",
            "pdf_url": "http://arxiv.org/pdf/2503.00199v3",
            "published": "2025-02-28 21:38:15+00:00",
            "updated": "2025-06-04 17:59:39+00:00"
        },
        {
            "title": "Entanglement renormalization circuits for $2d$ Gaussian Fermion States",
            "authors": "Sing Lam Wong, Andrew C. Potter",
            "summary": "The simulation of entangled ground-states of quantum materials remains\nchallenging for classical computational methods in more than one spatial\ndimension, and is a prime target for quantum computational advantage. To this\nend, an important goal is to identify efficient quantum state preparation\nprotocols that minimize the physical qubit number and circuit depth resources\nrequired to capture higher-dimensional quantum correlations. This work\nintroduces a quantum circuit compression algorithm for Gaussian fermion states\nbased on the multi-scale entanglement renormalization ansatz (MERA), which\nprovides an exponential reduction in the circuit depth required to approximate\nhighly-entangled ground-states relevant for quantum materials simulations. The\nalgorithm, termed two-dimensional Gaussian MERA ($2d$ GMERA), extends MERA\ntechniques to compress higher-dimensional Gaussian states. Through numerical\nsimulations of the Haldane model on a honeycomb lattice, the method is shown to\naccurately capture area-law entangled states including topologically trivial\ninsulators, Chern insulators, and critical Dirac semimetals. While Gaussian\nstates alone are classically simulable, this approach establishes empirical\nupper bounds on quantum resources needed to prepare free fermion states that\nare adiabatically connected to correlated ground states, providing guidance for\nimplementing these protocols on near-term quantum devices and offering a\nfoundation for simulating more complex quantum materials. Finally, we develop a\nnovel fermion-to-qubit encoding scheme, based on an expanding $2d$ topological\norder, that enables implementing fermionic rotations via qubit Pauli rotations\nwith constant Pauli weight independent of system size.",
            "pdf_url": "http://arxiv.org/pdf/2506.04200v1",
            "published": "2025-06-04 17:44:17+00:00",
            "updated": "2025-06-04 17:44:17+00:00"
        },
        {
            "title": "From Hamilton-Jacobi to Bohm: Why the Wave Function Isn't Just Another Action",
            "authors": "Arnaud Amblard, Aurélien Drezet",
            "summary": "This paper examines the physical meaning of the wave function in Bohmian\nmechanics (BM), addressing the debate between causal and nomological\ninterpretations. While BM postulates particles with definite trajectories\nguided by the wave function, the ontological status of the wave function itself\nremains contested. Critics of the causal interpretation argue that the wave\nfunction's high-dimensionality and lack of back-reaction disqualify it as a\nphysical entity. Proponents of the nomological interpretation, drawing\nparallels to the classical Hamiltonian, propose that the wave function is a\n\"law-like\" entity. However, this view faces challenges, including reliance on\nspeculative quantum gravity frameworks (e.g., the Wheeler-DeWitt equation) and\nconceptual ambiguities about the nature of \"nomological entities\". By\nsystematically comparing BM to Hamilton-Jacobi theory, this paper highlights\ndisanalogies between the wave function and the classical action function. These\ndifferences, particularly the wave function's dynamical necessity and\nirreducibility, support a sui generis interpretation, where the wave function\nrepresents a novel ontological category unique to quantum theory. The paper\nconcludes that the wave function's role in BM resists classical analogies,\ndemanding a metaphysical framework that accommodates its non-local,\nhigh-dimensional, and dynamically irreducible nature.",
            "pdf_url": "http://arxiv.org/pdf/2501.16989v2",
            "published": "2025-01-28 14:42:00+00:00",
            "updated": "2025-06-04 17:36:26+00:00"
        },
        {
            "title": "Physics-Constrained Flow Matching: Sampling Generative Models with Hard Constraints",
            "authors": "Utkarsh Utkarsh, Pengfei Cai, Alan Edelman, Rafael Gomez-Bombarelli, Christopher Vincent Rackauckas",
            "summary": "Deep generative models have recently been applied to physical systems\ngoverned by partial differential equations (PDEs), offering scalable simulation\nand uncertainty-aware inference. However, enforcing physical constraints, such\nas conservation laws (linear and nonlinear) and physical consistencies, remains\nchallenging. Existing methods often rely on soft penalties or architectural\nbiases that fail to guarantee hard constraints. In this work, we propose\nPhysics-Constrained Flow Matching (PCFM), a zero-shot inference framework that\nenforces arbitrary nonlinear constraints in pretrained flow-based generative\nmodels. PCFM continuously guides the sampling process through physics-based\ncorrections applied to intermediate solution states, while remaining aligned\nwith the learned flow and satisfying physical constraints. Empirically, PCFM\noutperforms both unconstrained and constrained baselines on a range of PDEs,\nincluding those with shocks, discontinuities, and sharp features, while\nensuring exact constraint satisfaction at the final solution. Our method\nprovides a general framework for enforcing hard constraints in both scientific\nand general-purpose generative models, especially in applications where\nconstraint satisfaction is essential.",
            "pdf_url": "http://arxiv.org/pdf/2506.04171v1",
            "published": "2025-06-04 17:12:37+00:00",
            "updated": "2025-06-04 17:12:37+00:00"
        },
        {
            "title": "Is the end of Insight in Sight ?",
            "authors": "Jean-Michel Tucny, Mihir Durve, Sauro Succi",
            "summary": "The rise of deep learning challenges the longstanding scientific ideal of\ninsight - the human capacity to understand phenomena by uncovering underlying\nmechanisms. In many modern applications, accurate predictions no longer require\ninterpretable models, prompting debate about whether explainability is a\nrealistic or even meaningful goal. From our perspective in physics, we examine\nthis tension through a concrete case study: a physics-informed neural network\n(PINN) trained on a rarefied gas dynamics problem governed by the Boltzmann\nequation. Despite the system's clear structure and well-understood governing\nlaws, the trained network's weights resemble Gaussian-distributed random\nmatrices, with no evident trace of the physical principles involved. This\nsuggests that deep learning and traditional simulation may follow distinct\ncognitive paths to the same outcome - one grounded in mechanistic insight, the\nother in statistical interpolation. Our findings raise critical questions about\nthe limits of explainable AI and whether interpretability can - or\nshould-remain a universal standard in artificial reasoning.",
            "pdf_url": "http://arxiv.org/pdf/2505.04627v2",
            "published": "2025-05-07 19:57:36+00:00",
            "updated": "2025-06-04 16:57:55+00:00"
        },
        {
            "title": "On computing quantum waves exactly from classical action",
            "authors": "Winfried Lohmiller, Jean-Jacques Slotine",
            "summary": "We show that the Schr\\\"odinger equation in quantum mechanics can be solved\nexactly based only on classical least action and its associated classical\ndensity.\n  Most quantum mechanics problems have classical versions which involve\nmultiple least action solutions. These extremal action paths may stem from\nspatial inequality constraints (as in the double slit experiment), from\nsingularities in the Hamiltonian (as in a Coulomb potential), from a closed\nconfiguration manifold (as for a spinning particle), or just from the initial\naction distribution. We show that the exact Schr\\\"odinger wave function $\\Psi$\nof the original quantum problem can be constructed by combining this classical\nmulti-valued action $\\Phi$ with the density $\\rho$ of the classical position\ndynamics, which can be computed from $\\Phi$ along each extremal action path.\nThis construction is general and does not involve any quasi-classical\napproximation.\n  Quantum wave collapse corresponds to transitioning between multi-valued\nclassical action branches at a branch point (e.g., position measurement), or to\nmeasuring the classical eigendensity field (e.g., momentum or energy\nmeasurement). Entanglement corresponds to a sum of classical individual\nparticle actions mapping to a tensor product of spinors.\n  Examples illustrate how the quantum wave functions for the double-slit\nexperiment, the hydrogen atom, or EPR can be computed exactly from their\nclassical least action counterparts.\n  These coordinate-invariant results provide a simpler computing alternative to\nFeynman path integrals, as they use only a discrete set of classical paths and\navoid zig-zag paths and time-slicing altogether. They extend to the\nrelativistic Klein-Gordon and Dirac equation, and suggest a smooth transition\nbetween physics across scales.",
            "pdf_url": "http://arxiv.org/pdf/2405.06328v9",
            "published": "2024-05-10 09:01:08+00:00",
            "updated": "2025-06-04 16:51:43+00:00"
        },
        {
            "title": "Plant Bioelectric Early Warning Systems: A Five-Year Investigation into Human-Plant Electromagnetic Communication",
            "authors": "Peter A. Gloor",
            "summary": "We present a comprehensive investigation into plant bioelectric responses to\nhuman presence and emotional states, building on five years of systematic\nresearch. Using custom-built plant sensors and machine learning classification,\nwe demonstrate that plants generate distinct bioelectric signals correlating\nwith human proximity, emotional states, and physiological conditions. A deep\nlearning model based on ResNet50 architecture achieved 97% accuracy in\nclassifying human emotional states through plant voltage spectrograms, while\ncontrol models with shuffled labels achieved only 30% accuracy. This study\nsynthesizes findings from multiple experiments spanning 2020-2025, including\nindividual recognition (66% accuracy), eurythmic gesture detection, stress\nprediction, and responses to human voice and movement. We propose that these\nphenomena represent evolved anti-herbivory early warning systems, where plants\ndetect approaching animals through bioelectric field changes before physical\ncontact. Our results challenge conventional understanding of plant sensory\ncapabilities and suggest practical applications in agriculture, healthcare, and\nhuman-plant interaction research.",
            "pdf_url": "http://arxiv.org/pdf/2506.04132v1",
            "published": "2025-06-04 16:23:06+00:00",
            "updated": "2025-06-04 16:23:06+00:00"
        },
        {
            "title": "Biological Processes as Exploratory Dynamics",
            "authors": "Jane Kondev, Marc Kirschner, Hernan G. Garcia, Gabriel L. Salmon, Rob Phillips",
            "summary": "Many biological processes can be thought of as the result of an underlying\ndynamics in which the system repeatedly undergoes distinct and abortive\ntrajectories with the dynamical process only ending when some specific process,\npurpose, structure or function is achieved. A classic example is the way in\nwhich microtubules attach to kinetochores as a prerequisite for chromosome\nsegregation and cell division. In this example, the dynamics is characterized\nby apparently futile time histories in which microtubules repeatedly grow and\nshrink without chromosomal attachment. We hypothesize that for biological\nprocesses for which it is not the initial conditions that matter, but rather\nthe final state, this kind of exploratory dynamics is biology's unique and\nnecessary solution to achieving these functions with high fidelity. This kind\nof cause and effect relationship can be contrasted to examples from physics and\nchemistry where the initial conditions determine the outcome. In this paper, we\nexamine the similarities of many biological processes that depend upon random\ntrajectories starting from the initial state and the selection of subsets of\nthese trajectories to achieve some desired functional final state. We begin by\nreviewing the long history of the principles of dynamics, first in the context\nof physics, and then in the context of the study of life. These ideas are then\nstacked against the broad categories of biological phenomenology that exhibit\nexploratory dynamics. We then build on earlier work by making a quantitative\nexamination of a succession of increasingly sophisticated models for\nexploratory dynamics, all of which share the common feature of being a series\nof repeated trials that ultimately end in a \"winning\" trajectory. We also\nexplore the ways in which microscopic parameters can be tuned to alter\nexploratory dynamics as well as the energetic burden of performing such\nprocesses.",
            "pdf_url": "http://arxiv.org/pdf/2506.04104v1",
            "published": "2025-06-04 15:58:23+00:00",
            "updated": "2025-06-04 15:58:23+00:00"
        },
        {
            "title": "Computational Physics in the Advanced Lab: Experiment and Simulation of Thermal Diffusion in Metal Rods",
            "authors": "Yash Mohod, Matthew C. Sullivan",
            "summary": "We present a simple experiment on thermal diffusion in metal rods that can be\nused to integrate computation into the advanced lab. An analytical solution\nexists for the transient heat conduction in an infinite rod with a delta\nfunction heat input, but no analytical solution exists for short rods or for\nlong duration heat inputs. Our apparatus is a copper rod with a heater and\nthermometers attached to the rod. The temperature of the metal rod due to\ntransient heat conduction can be modeled using a simple numerical simulation\nand the finite centered difference method. Using a 22 cm long copper rod with\nthe ends thermally sunk in aluminum blocks, we show poor agreement between the\nexperimental results and the infinite-rod analytical model, but excellent\nagreement between the experimental results and our numerical simulation. This\nexperiment shows the power of a numerical simulation but also the limitations\nof the chosen model, which can be used as motivation for further exploration.",
            "pdf_url": "http://arxiv.org/pdf/2504.17108v2",
            "published": "2025-04-23 21:38:54+00:00",
            "updated": "2025-06-04 15:48:55+00:00"
        },
        {
            "title": "Inverting no-hair theorems: How requiring General Relativity solutions restricts scalar-tensor theories",
            "authors": "Hajime Kobayashi, Shinji Mukohyama, Johannes Noller, Sergi Sirera, Kazufumi Takahashi, Vicharit Yingcharoenrat",
            "summary": "Black hole solutions in general scalar-tensor theories are known to permit\nhair, i.e. non-trivial scalar profiles and/or metric solutions different from\nthe ones of General Relativity (GR). Imposing that some such\nsolutions$\\unicode{x2013}$e.g. Schwarzschild or de Sitter solutions motivated\nin the context of black hole physics or cosmology$\\unicode{x2013}$should exist,\nthe space of scalar-tensor theories is strongly restricted. Here we investigate\nprecisely what these restrictions are within general quadratic/cubic\nhigher-order scalar-tensor theories for stealth solutions, whose metric is\ngiven by that in GR, supporting time-dependent scalar hair with a constant\nkinetic term. We derive, in a fully covariant approach, the conditions under\nwhich the Euler-Lagrange equations admit all (or a specific set of) exact GR\nsolutions, as the first step toward our understanding of a wider class of\ntheories that admit approximately stealth solutions. Focusing on static and\nspherically symmetric black hole spacetimes, we study the dynamics of linear\nodd-parity perturbations and discuss possible deviations from GR. Importantly,\nwe find that requiring the existence of all stealth solutions prevents any\ndeviations from GR in the odd-parity sector. In less restrictive scenarios, in\nparticular for theories only requiring the existence of Schwarzschild(-de\nSitter) black holes, we identify allowed deviations from GR, derive the\nstability conditions for the odd modes, and investigate the generic deviation\nof a non-trivial speed of gravitational waves. All calculations performed in\nthis paper are reproducible via companion $\\texttt {Mathematica}$ notebooks.",
            "pdf_url": "http://arxiv.org/pdf/2503.05651v2",
            "published": "2025-03-07 18:15:05+00:00",
            "updated": "2025-06-04 15:26:41+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Sounding that Object: Interactive Object-Aware Image to Audio Generation",
            "authors": "Tingle Li, Baihe Huang, Xiaobin Zhuang, Dongya Jia, Jiawei Chen, Yuping Wang, Zhuo Chen, Gopala Anumanchipalli, Yuxuan Wang",
            "summary": "Generating accurate sounds for complex audio-visual scenes is challenging,\nespecially in the presence of multiple objects and sound sources. In this\npaper, we propose an {\\em interactive object-aware audio generation} model that\ngrounds sound generation in user-selected visual objects within images. Our\nmethod integrates object-centric learning into a conditional latent diffusion\nmodel, which learns to associate image regions with their corresponding sounds\nthrough multi-modal attention. At test time, our model employs image\nsegmentation to allow users to interactively generate sounds at the {\\em\nobject} level. We theoretically validate that our attention mechanism\nfunctionally approximates test-time segmentation masks, ensuring the generated\naudio aligns with selected objects. Quantitative and qualitative evaluations\nshow that our model outperforms baselines, achieving better alignment between\nobjects and their associated sounds. Project page:\nhttps://tinglok.netlify.app/files/avobject/",
            "pdf_url": "http://arxiv.org/pdf/2506.04214v1",
            "published": "2025-06-04 17:57:26+00:00",
            "updated": "2025-06-04 17:57:26+00:00"
        },
        {
            "title": "A Diffusion-Driven Temporal Super-Resolution and Spatial Consistency Enhancement Framework for 4D MRI imaging",
            "authors": "Xuanru Zhou, Jiarun Liu, Shoujun Yu, Hao Yang, Cheng Li, Tao Tan, Shanshan Wang",
            "summary": "In medical imaging, 4D MRI enables dynamic 3D visualization, yet the\ntrade-off between spatial and temporal resolution requires prolonged scan time\nthat can compromise temporal fidelity--especially during rapid, large-amplitude\nmotion. Traditional approaches typically rely on registration-based\ninterpolation to generate intermediate frames. However, these methods struggle\nwith large deformations, resulting in misregistration, artifacts, and\ndiminished spatial consistency. To address these challenges, we propose\nTSSC-Net, a novel framework that generates intermediate frames while preserving\nspatial consistency. To improve temporal fidelity under fast motion, our\ndiffusion-based temporal super-resolution network generates intermediate frames\nusing the start and end frames as key references, achieving 6x temporal\nsuper-resolution in a single inference step. Additionally, we introduce a novel\ntri-directional Mamba-based module that leverages long-range contextual\ninformation to effectively resolve spatial inconsistencies arising from\ncross-slice misalignment, thereby enhancing volumetric coherence and correcting\ncross-slice errors. Extensive experiments were performed on the public ACDC\ncardiac MRI dataset and a real-world dynamic 4D knee joint dataset. The results\ndemonstrate that TSSC-Net can generate high-resolution dynamic MRI from\nfast-motion data while preserving structural fidelity and spatial consistency.",
            "pdf_url": "http://arxiv.org/pdf/2506.04116v1",
            "published": "2025-06-04 16:09:19+00:00",
            "updated": "2025-06-04 16:09:19+00:00"
        },
        {
            "title": "Solving Inverse Problems via Diffusion-Based Priors: An Approximation-Free Ensemble Sampling Approach",
            "authors": "Haoxuan Chen, Yinuo Ren, Martin Renqiang Min, Lexing Ying, Zachary Izzo",
            "summary": "Diffusion models (DMs) have proven to be effective in modeling\nhigh-dimensional distributions, leading to their widespread adoption for\nrepresenting complex priors in Bayesian inverse problems (BIPs). However,\ncurrent DM-based posterior sampling methods proposed for solving common BIPs\nrely on heuristic approximations to the generative process. To exploit the\ngenerative capability of DMs and avoid the usage of such approximations, we\npropose an ensemble-based algorithm that performs posterior sampling without\nthe use of heuristic approximations. Our algorithm is motivated by existing\nworks that combine DM-based methods with the sequential Monte Carlo (SMC)\nmethod. By examining how the prior evolves through the diffusion process\nencoded by the pre-trained score function, we derive a modified partial\ndifferential equation (PDE) governing the evolution of the corresponding\nposterior distribution. This PDE includes a modified diffusion term and a\nreweighting term, which can be simulated via stochastic weighted particle\nmethods. Theoretically, we prove that the error between the true posterior\ndistribution can be bounded in terms of the training error of the pre-trained\nscore function and the number of particles in the ensemble. Empirically, we\nvalidate our algorithm on several inverse problems in imaging to show that our\nmethod gives more accurate reconstructions compared to existing DM-based\nmethods.",
            "pdf_url": "http://arxiv.org/pdf/2506.03979v1",
            "published": "2025-06-04 14:09:25+00:00",
            "updated": "2025-06-04 14:09:25+00:00"
        },
        {
            "title": "DiffCAP: Diffusion-based Cumulative Adversarial Purification for Vision Language Models",
            "authors": "Jia Fu, Yongtao Wu, Yihang Chen, Kunyu Peng, Xiao Zhang, Volkan Cevher, Sepideh Pashami, Anders Holst",
            "summary": "Vision Language Models (VLMs) have shown remarkable capabilities in\nmultimodal understanding, yet their susceptibility to perturbations poses a\nsignificant threat to their reliability in real-world applications. Despite\noften being imperceptible to humans, these perturbations can drastically alter\nmodel outputs, leading to erroneous interpretations and decisions. This paper\nintroduces DiffCAP, a novel diffusion-based purification strategy that can\neffectively neutralize adversarial corruptions in VLMs. We observe that adding\nminimal noise to an adversarially corrupted image significantly alters its\nlatent embedding with respect to VLMs. Building on this insight, DiffCAP\ncumulatively injects random Gaussian noise into adversarially perturbed input\ndata. This process continues until the embeddings of two consecutive noisy\nimages reach a predefined similarity threshold, indicating a potential approach\nto neutralize the adversarial effect. Subsequently, a pretrained diffusion\nmodel is employed to denoise the stabilized image, recovering a clean\nrepresentation suitable for the VLMs to produce an output. Through extensive\nexperiments across six datasets with three VLMs under varying attack strengths\nin three task scenarios, we show that DiffCAP consistently outperforms existing\ndefense techniques by a substantial margin. Notably, DiffCAP significantly\nreduces both hyperparameter tuning complexity and the required diffusion time,\nthereby accelerating the denoising process. Equipped with strong theoretical\nand empirical support, DiffCAP provides a robust and practical solution for\nsecurely deploying VLMs in adversarial environments.",
            "pdf_url": "http://arxiv.org/pdf/2506.03933v1",
            "published": "2025-06-04 13:26:33+00:00",
            "updated": "2025-06-04 13:26:33+00:00"
        },
        {
            "title": "VCT: Training Consistency Models with Variational Noise Coupling",
            "authors": "Gianluigi Silvestri, Luca Ambrogioni, Chieh-Hsin Lai, Yuhta Takida, Yuki Mitsufuji",
            "summary": "Consistency Training (CT) has recently emerged as a strong alternative to\ndiffusion models for image generation. However, non-distillation CT often\nsuffers from high variance and instability, motivating ongoing research into\nits training dynamics. We propose Variational Consistency Training (VCT), a\nflexible and effective framework compatible with various forward kernels,\nincluding those in flow matching. Its key innovation is a learned noise-data\ncoupling scheme inspired by Variational Autoencoders, where a data-dependent\nencoder models noise emission. This enables VCT to adaptively learn\nnoise-todata pairings, reducing training variance relative to the fixed,\nunsorted pairings in classical CT. Experiments on multiple image datasets\ndemonstrate significant improvements: our method surpasses baselines, achieves\nstate-of-the-art FID among non-distillation CT approaches on CIFAR-10, and\nmatches SoTA performance on ImageNet 64 x 64 with only two sampling steps. Code\nis available at https://github.com/sony/vct.",
            "pdf_url": "http://arxiv.org/pdf/2502.18197v2",
            "published": "2025-02-25 13:38:04+00:00",
            "updated": "2025-06-04 12:31:12+00:00"
        }
    ]
}