{
    "Physics": [
        {
            "title": "Effects of non-commutative geometry on black hole properties",
            "authors": "A. A. Araújo Filho, J. R. Nascimento, A. Yu. Petrov, P. J. Porfírio, Ali Övgün",
            "summary": "In this study, we investigate the signatures of a non-commutative black hole\nsolution. Initially, we calculate the thermodynamic properties of the system,\nincluding entropy, heat capacity, and Hawking radiation. For the latter\nquantity, we employ two distinct methods: surface gravity and the topological\napproach. Additionally, we examine the emission rate and remnant mass within\nthis context. Remarkably, the lifetime of the black hole, after reaching its\nfinal state due to the evaporation process, is expressed analytically up to a\ngrey-body factor. We estimate the lifetime for specific initial and final mass\nconfigurations. Also, we analyze the tensorial quasinormal modes using the\n6th-order WKB method. Finally, we study the deflection angle, i.e.,\ngravitational lensing, in both the weak and strong deflection limits.",
            "pdf_url": "http://arxiv.org/pdf/2406.12015v2",
            "published": "2024-06-17 18:32:52+00:00",
            "updated": "2024-08-28 17:43:00+00:00"
        },
        {
            "title": "More Text, Less Point: Towards 3D Data-Efficient Point-Language Understanding",
            "authors": "Yuan Tang, Xu Han, Xianzhi Li, Qiao Yu, Jinfeng Xu, Yixue Hao, Long Hu, Min Chen",
            "summary": "Enabling Large Language Models (LLMs) to comprehend the 3D physical world\nremains a significant challenge. Due to the lack of large-scale 3D-text pair\ndatasets, the success of LLMs has yet to be replicated in 3D understanding. In\nthis paper, we rethink this issue and propose a new task: 3D Data-Efficient\nPoint-Language Understanding. The goal is to enable LLMs to achieve robust 3D\nobject understanding with minimal 3D point cloud and text data pairs. To\naddress this task, we introduce GreenPLM, which leverages more text data to\ncompensate for the lack of 3D data. First, inspired by using CLIP to align\nimages and text, we utilize a pre-trained point cloud-text encoder to map the\n3D point cloud space to the text space. This mapping leaves us to seamlessly\nconnect the text space with LLMs. Once the point-text-LLM connection is\nestablished, we further enhance text-LLM alignment by expanding the\nintermediate text space, thereby reducing the reliance on 3D point cloud data.\nSpecifically, we generate 6M free-text descriptions of 3D objects, and design a\nthree-stage training strategy to help LLMs better explore the intrinsic\nconnections between different modalities. To achieve efficient modality\nalignment, we design a zero-parameter cross-attention module for token pooling.\nExtensive experimental results show that GreenPLM requires only 12% of the 3D\ntraining data used by existing state-of-the-art models to achieve superior 3D\nunderstanding. Remarkably, GreenPLM also achieves competitive performance using\ntext-only data. The code and weights are available at:\nhttps://github.com/TangYuan96/GreenPLM.",
            "pdf_url": "http://arxiv.org/pdf/2408.15966v1",
            "published": "2024-08-28 17:38:44+00:00",
            "updated": "2024-08-28 17:38:44+00:00"
        },
        {
            "title": "Novel ground states and emergent quantum many-body scars in a two-species Rydberg atom array",
            "authors": "Lei-Yi-Nan Liu, Shun-Yao Yu, Shi-Rong Peng, Jie Sheng, Su Yi, Peng Xu, Shou-Shu Gong, Tao Shi, Jian Cui",
            "summary": "Rydberg atom array has been established as one appealing platform for quantum\nsimulation and quantum computation. Recent experimental development of trapping\nand controlling two-species atoms using optical tweezer arrays has brought more\ncomplex interactions in this game, enabling much versatile novel quantum states\nand phenomena to emerge and thus leading to a growing need for both theoretical\nand numerical investigations in this regard. In this paper we systematically\ncalculate the ground state phase diagram of alternating two-species atom array\nand find some novel quantum states that cannot exist in traditional cold-atom\nplatforms, for instance the period $4$ product state $|1100\\rangle^{\\otimes\nm}$, the period $6$ product state $|111000\\rangle^{\\otimes m}$ and\norder-disorder separation phase. We also confirm the existence of floating\nphase, however, in this system it has to be described by two interacting\nbosonic fields whereas that in the single species Rydberg atom array can be\nunderstood as free bosons. More interestingly, in the quench dynamics we\ndiscover a type of new quantum many-body scar distinct from that previous found\nin single species atoms which is explained by low-energy effective theory of\nthe PXP model. Instead, the underlying physics of the newly found quantum\nmany-body scar can be described by a perturbation theory spanning the whole\nenergy spectrum. Detailed analysis on how to experimentally prepare these\nstates and observe the phenomena is provided. Numerical evidence shows that the\nproposed scheme is robust against typical experimentally relevent imperfections\nand thus it is implementable. Our work opens new avenue for quantum simulating\nnovel quantum many-body states both in and out of equilibrium arising from the\ninterplay of competing interactions of different atom species and quantum\nfluctuations.",
            "pdf_url": "http://arxiv.org/pdf/2408.15965v1",
            "published": "2024-08-28 17:36:10+00:00",
            "updated": "2024-08-28 17:36:10+00:00"
        },
        {
            "title": "A Physics Preserving Neural Network Based Approach for Constitutive Modeling of Isotropic Fibrous Materials",
            "authors": "Nishan Parvez, Jacob S. Merson",
            "summary": "We develop a new neural network architecture that strictly enforces\nconstitutive constraints such as polyconvexity, frame-indifference, and the\nsymmetry of the stress and material stiffness. Additionally, we show that the\naccuracy of the stress and material stiffness predictions is significantly\nimproved for this neural network by using a Sobolev minimization strategy that\nincludes derivative terms. Using our neural network, we model the constitutive\nbehavior of fibrous-type discrete network material. With Sobolev minimization,\nwe obtain a normalized mean square error of 0.15% for the strain energy\ndensity, 0.815% averaged across the components of the stress, and 5.4% averaged\nacross the components of the stiffness tensor. This machine-learned\nconstitutive model was deployed in a finite element simulation of a facet\ncapsular ligament. The displacement fields and stress-strain curves were\ncompared to a multiscale simulation that required running on a GPU-based\nsupercomputer. The new approach maintained upward of 85% accuracy in stress up\nto 70% strain while reducing the computation cost by orders of magnitude.",
            "pdf_url": "http://arxiv.org/pdf/2403.13357v4",
            "published": "2024-03-20 07:36:14+00:00",
            "updated": "2024-08-28 17:35:18+00:00"
        },
        {
            "title": "Probing Lorentz invariance with a high-energy neutrino flare",
            "authors": "Mauricio Bustamante, John Ellis, Rostislav Konoplich, Alexander S. Sakharov",
            "summary": "Time-of-flight measurements of high-energy astrophysical neutrinos can be\nused to probe Lorentz invariance, a pillar of modern physics. If\nLorentz-invariance violation (LIV) occurs, it could cause neutrinos to slow\ndown, with the delay scaling linearly or quadratically with their energy. We\nintroduce non-parametric statistical methods designed to detect LIV-induced\ndistortions in the temporal structure of a high-energy neutrino flare as it\ntravels to Earth from a distant astrophysical source, independently of the\nintrinsic timing properties of the source. Our approach, illustrated using the\n2014/2015 TeV-PeV neutrino flare from the blazar TXS 0506+056 detected by\nIceCube, finds that the LIV energy scale must exceed 10^{14} GeV (linear) or\n10^9 GeV (quadratic). Our methods provide a robust means to investigate LIV by\nfocusing solely on a neutrino flare, without relying on electromagnetic\ncounterparts, and account for realistic energy and directional uncertainties.\nFor completeness, we compare our limits inferred from TXS 0506+056 to the\nsensitivity inferred from multi-messenger detection of tentative coincidences\nbetween neutrinos and electromagnetic emission from active galactic nuclei and\ntidal disruption events.",
            "pdf_url": "http://arxiv.org/pdf/2408.15949v1",
            "published": "2024-08-28 17:08:18+00:00",
            "updated": "2024-08-28 17:08:18+00:00"
        },
        {
            "title": "Search for the non-resonant production of Higgs boson pairs via gluon fusion and vector-boson fusion in the $b\\bar{b}τ^+τ^-$ final state in proton-proton collisions at $\\sqrt{s} = 13$ TeV with the ATLAS detector",
            "authors": "ATLAS Collaboration",
            "summary": "A search for the non-resonant production of Higgs boson pairs in the\n$HH\\rightarrow b\\bar{b}\\tau^+\\tau^-$ channel is performed using 140 fb$^{-1}$\nof proton-proton collisions at a centre-of-mass energy of $13$ TeV recorded by\nthe ATLAS detector at the CERN Large Hadron Collider. The analysis strategy is\noptimised to probe anomalous values of the Higgs boson self-coupling modifier\n$\\kappa_\\lambda$ and of the quartic $HHVV$ ($V = W,Z$) coupling modifier\n$\\kappa_{2V}$. No significant excess above the expected background from\nStandard Model processes is observed. An observed (expected) upper limit\n$\\mu_{HH}<5.9$ $(3.3)$ is set at 95% confidence-level on the Higgs boson pair\nproduction cross-section normalised to its Standard Model prediction. The\ncoupling modifiers are constrained to an observed (expected) 95% confidence\ninterval of $-3.1 < \\kappa_\\lambda < 9.0$ ($-2.5 < \\kappa_\\lambda < 9.3$) and\n$-0.5 < \\kappa_{2V} < 2.7$ ($-0.2 < \\kappa_{2V} < 2.4$), assuming all other\nHiggs boson couplings are fixed to the Standard Model prediction. The results\nare also interpreted in the context of effective field theories via constraints\non anomalous Higgs boson couplings and Higgs boson pair production\ncross-sections assuming different kinematic benchmark scenarios.",
            "pdf_url": "http://arxiv.org/pdf/2404.12660v3",
            "published": "2024-04-19 06:58:58+00:00",
            "updated": "2024-08-28 16:59:51+00:00"
        },
        {
            "title": "Beating the Ramsey limit on sensing with deterministic qubit control",
            "authors": "M. O. Hecht, Kumar Saurav, Evangelos Vlachos, Daniel A. Lidar, Eli M. Levenson-Falk",
            "summary": "Quantum sensors promise revolutionary advances in medical imaging, energy\nproduction, mass detection, geodesy, foundational physics research, and a host\nof other fields. In many sensors, the signal takes the form of a changing qubit\nfrequency, which is detected with an interference measurement. Unfortunately,\nenvironmental noise decoheres the qubit state, reducing signal-to-noise ratio\n(SNR). Here we introduce a protocol for enhancing the sensitivity of a\nmeasurement of a qubit's frequency in the presence of decoherence. We use a\ncontinuous drive to stabilize one component of the qubit's Bloch vector,\nenhancing the effect of a small static frequency shift. We demonstrate our\nprotocol on a superconducting qubit, enhancing SNR per measurement shot by\n1.65$\\times$ and SNR per qubit evolution time by 1.09$\\times$ compared to\nstandard Ramsey interferometry. We explore the protocol theoretically and\nnumerically, finding maximum enhancements of 1.96$\\times$ and 1.18$\\times$,\nrespectively. We also show that the protocol is robust to parameter\nmiscalibrations. Our protocol provides an unconditional enhancement in\nsignal-to-noise ratio compared to standard Ramsey interferometry. It requires\nno feedback and no extra control or measurement resources, and can be\nimmediately applied in a wide variety of quantum computing and quantum sensor\ntechnologies to enhance their sensitivities.",
            "pdf_url": "http://arxiv.org/pdf/2408.15926v1",
            "published": "2024-08-28 16:40:01+00:00",
            "updated": "2024-08-28 16:40:01+00:00"
        },
        {
            "title": "asimulation: Domain formation and impact on observables in resolved cosmological simulations of the (a)symmetron",
            "authors": "Øyvind Christiansen, Farbod Hassani, David F. Mota",
            "summary": "The symmetron is a dark energy and dark matter candidate that forms\ntopological defects in the late-time universe and holds the promise of\nresolving some of the cosmological tensions. We performed high-resolution\nsimulations of the dynamical and non-linear (a)symmetron using the recently\ndeveloped relativistic N-body code asevolution. By extensively testing the\ntemporal and spatial convergence of domain decompositioning and domain wall\nstability, we determined criteria and physical intuition for the convergence.\nWe applied the resolution criteria to run five high-resolution simulations with\n1280^3 grids and a box size of 500 Mpc/h of the (a)symmetron. We considered the\nbehaviour of the scalar field and the domain walls in each scenario. We find\nthe effect on the matter power spectra, the HMFs, and observables computed over\nthe past light cone of an observer, such as the integrated Sachs-Wolfe and\nnon-linear Rees-Sciama effect and the lensing, compared to LCDM. We show local\noscillations of the fifth force strength and the formation of planar structures\nin the density field. The dynamics of the field was visualised in animations\nwith high resolution in time. The simulation code is made publicly available.",
            "pdf_url": "http://arxiv.org/pdf/2401.02410v2",
            "published": "2024-01-04 18:48:39+00:00",
            "updated": "2024-08-28 16:35:20+00:00"
        },
        {
            "title": "Hybrid Type-II and Type-III seesaw model for the muon $g-2$ anomaly",
            "authors": "Lei Cai, Chengcheng Han, Shi-Ping He, Peiwen Wu",
            "summary": "In this work, we investigate the muon anomalous dipole moment $a_\\mu$ in a\nmodel that extends the Standard Model with a scalar triplet and a vector-like\nlepton triplet. Different from previous studies, we find that there is still\nviable parameter space in this model to explain the discrepancy $\\Delta\na_\\mu=a_{\\mu}(\\mathrm{Exp})-a_{\\mu}(\\mathrm{SM})$. While being consistent with\nthe current data of neutrino mass, precision electroweak measurements and the\nperturbativity of couplings, our model can provide new physics contribution\n$a_\\mu^\\textrm{NP}$ to cover the central region of $\\Delta a_\\mu$ with new\nscalar and fermion mass as low as around TeV. This mass scale is allowed by the\ncurrent collider searches for doubly charged scalars and vector-like leptons,\nand they can be tested at future high energy and/or high luminosity colliders.",
            "pdf_url": "http://arxiv.org/pdf/2408.15910v1",
            "published": "2024-08-28 16:24:18+00:00",
            "updated": "2024-08-28 16:24:18+00:00"
        },
        {
            "title": "Differential cross-section measurements of the production of four charged leptons in association with two jets using the ATLAS detector",
            "authors": "ATLAS Collaboration",
            "summary": "Differential cross-sections are measured for the production of four charged\nleptons in association with two jets. These measurements are sensitive to final\nstates in which the jets are produced via the strong interaction as well as to\nthe purely-electroweak vector boson scattering process. The analysis is\nperformed using proton-proton collision data collected by ATLAS at\n$\\sqrt{s}=13$ TeV and with an integrated luminosity of 140 fb$^{-1}$. The data\nare corrected for the effects of detector inefficiency and resolution and are\ncompared to state-of-the-art Monte Carlo event generator predictions. The\ndifferential cross-sections are used to search for anomalous weak-boson\nself-interactions that are induced by dimension-six and dimension-eight\noperators in Standard Model effective field theory.",
            "pdf_url": "http://arxiv.org/pdf/2308.12324v2",
            "published": "2023-08-23 14:10:43+00:00",
            "updated": "2024-08-28 16:07:12+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Airfoil Diffusion: Denoising Diffusion Model For Conditional Airfoil Generation",
            "authors": "Reid Graves, Amir Barati Farimani",
            "summary": "The design of aerodynamic shapes, such as airfoils, has traditionally\nrequired significant computational resources and relied on predefined design\nparameters, which limit the potential for novel shape synthesis. In this work,\nwe introduce a data-driven methodology for airfoil generation using a diffusion\nmodel. Trained on a dataset of preexisting airfoils, our model can generate an\narbitrary number of new airfoils from random vectors, which can be conditioned\non specific aerodynamic performance metrics such as lift and drag, or geometric\ncriteria. Our results demonstrate that the diffusion model effectively produces\nairfoil shapes with realistic aerodynamic properties, offering substantial\nimprovements in efficiency, flexibility, and the potential for discovering\ninnovative airfoil designs. This approach significantly expands the design\nspace, facilitating the synthesis of high-performance aerodynamic shapes that\ntranscend the limitations of traditional methods.",
            "pdf_url": "http://arxiv.org/pdf/2408.15898v1",
            "published": "2024-08-28 16:12:16+00:00",
            "updated": "2024-08-28 16:12:16+00:00"
        },
        {
            "title": "GenDDS: Generating Diverse Driving Video Scenarios with Prompt-to-Video Generative Model",
            "authors": "Yongjie Fu, Yunlong Li, Xuan Di",
            "summary": "Autonomous driving training requires a diverse range of datasets encompassing\nvarious traffic conditions, weather scenarios, and road types. Traditional data\naugmentation methods often struggle to generate datasets that represent rare\noccurrences. To address this challenge, we propose GenDDS, a novel approach for\ngenerating driving scenarios generation by leveraging the capabilities of\nStable Diffusion XL (SDXL), an advanced latent diffusion model. Our methodology\ninvolves the use of descriptive prompts to guide the synthesis process, aimed\nat producing realistic and diverse driving scenarios. With the power of the\nlatest computer vision techniques, such as ControlNet and Hotshot-XL, we have\nbuilt a complete pipeline for video generation together with SDXL. We employ\nthe KITTI dataset, which includes real-world driving videos, to train the\nmodel. Through a series of experiments, we demonstrate that our model can\ngenerate high-quality driving videos that closely replicate the complexity and\nvariability of real-world driving scenarios. This research contributes to the\ndevelopment of sophisticated training data for autonomous driving systems and\nopens new avenues for creating virtual environments for simulation and\nvalidation purposes.",
            "pdf_url": "http://arxiv.org/pdf/2408.15868v1",
            "published": "2024-08-28 15:37:44+00:00",
            "updated": "2024-08-28 15:37:44+00:00"
        },
        {
            "title": "FADE: Towards Fairness-aware Augmentation for Domain Generalization via Classifier-Guided Score-based Diffusion Models",
            "authors": "Yujie Lin, Dong Li, Chen Zhao, Minglai Shao",
            "summary": "Fairness-aware domain generalization (FairDG) has emerged as a critical\nchallenge for deploying trustworthy AI systems, particularly in scenarios\ninvolving distribution shifts. Traditional methods for addressing fairness have\nfailed in domain generalization due to their lack of consideration for\ndistribution shifts. Although disentanglement has been used to tackle FairDG,\nit is limited by its strong assumptions. To overcome these limitations, we\npropose Fairness-aware Classifier-Guided Score-based Diffusion Models (FADE) as\na novel approach to effectively address the FairDG issue. Specifically, we\nfirst pre-train a score-based diffusion model (SDM) and two classifiers to\nequip the model with strong generalization capabilities across different\ndomains. Then, we guide the SDM using these pre-trained classifiers to\neffectively eliminate sensitive information from the generated data. Finally,\nthe generated fair data is used to train downstream classifiers, ensuring\nrobust performance under new data distributions. Extensive experiments on three\nreal-world datasets demonstrate that FADE not only enhances fairness but also\nimproves accuracy in the presence of distribution shifts. Additionally, FADE\noutperforms existing methods in achieving the best accuracy-fairness\ntrade-offs.",
            "pdf_url": "http://arxiv.org/pdf/2406.09495v2",
            "published": "2024-06-13 17:36:05+00:00",
            "updated": "2024-08-28 12:46:28+00:00"
        },
        {
            "title": "Grand canonical generative diffusion model for crystalline phases and grain boundaries",
            "authors": "Bo Lei, Enze Chen, Hyuna Kwon, Tim Hsu, Babak Sadigh, Vincenzo Lordi, Timofey Frolov, Fei Zhou",
            "summary": "The diffusion model has emerged as a powerful tool for generating atomic\nstructures for materials science. This work calls attention to the deficiency\nof current particle-based diffusion models, which represent atoms as a point\ncloud, in generating even the simplest ordered crystalline structures. The\nproblem is attributed to particles being trapped in local minima during the\nscore-driven simulated annealing of the diffusion process, similar to the\nphysical process of force-driven simulated annealing. We develop a solution,\nthe grand canonical diffusion model, which adopts an alternative voxel-based\nrepresentation with continuous rather than fixed number of particles. The\nmethod is applied towards generation of several common crystalline phases as\nwell as the technologically important and challenging problem of grain boundary\nstructures.",
            "pdf_url": "http://arxiv.org/pdf/2408.15601v1",
            "published": "2024-08-28 07:49:29+00:00",
            "updated": "2024-08-28 07:49:29+00:00"
        },
        {
            "title": "MODULI: Unlocking Preference Generalization via Diffusion Models for Offline Multi-Objective Reinforcement Learning",
            "authors": "Yifu Yuan, Zhenrui Zheng, Zibin Dong, Jianye Hao",
            "summary": "Multi-objective Reinforcement Learning (MORL) seeks to develop policies that\nsimultaneously optimize multiple conflicting objectives, but it requires\nextensive online interactions. Offline MORL provides a promising solution by\ntraining on pre-collected datasets to generalize to any preference upon\ndeployment. However, real-world offline datasets are often conservatively and\nnarrowly distributed, failing to comprehensively cover preferences, leading to\nthe emergence of out-of-distribution (OOD) preference areas. Existing offline\nMORL algorithms exhibit poor generalization to OOD preferences, resulting in\npolicies that do not align with preferences. Leveraging the excellent\nexpressive and generalization capabilities of diffusion models, we propose\nMODULI (Multi-objective Diffusion Planner with Sliding Guidance), which employs\na preference-conditioned diffusion model as a planner to generate trajectories\nthat align with various preferences and derive action for decision-making. To\nachieve accurate generation, MODULI introduces two return normalization methods\nunder diverse preferences for refining guidance. To further enhance\ngeneralization to OOD preferences, MODULI proposes a novel sliding guidance\nmechanism, which involves training an additional slider adapter to capture the\ndirection of preference changes. Incorporating the slider, it transitions from\nin-distribution (ID) preferences to generating OOD preferences, patching, and\nextending the incomplete Pareto front. Extensive experiments on the D4MORL\nbenchmark demonstrate that our algorithm outperforms state-of-the-art Offline\nMORL baselines, exhibiting excellent generalization to OOD preferences.",
            "pdf_url": "http://arxiv.org/pdf/2408.15501v1",
            "published": "2024-08-28 03:10:45+00:00",
            "updated": "2024-08-28 03:10:45+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Weak error estimates for rough volatility models",
            "authors": "Peter K. Friz, William Salkeld, Thomas Wagenhofer",
            "summary": "We consider a class of stochastic processes with rough stochastic volatility,\nexamples of which include the rough Bergomi and rough Stein-Stein model, that\nhave gained considerable importance in quantitative finance.\n  A basic question for such (non-Markovian) models concerns efficient numerical\nschemes. While strong rates are well understood (order $H$), we tackle here the\nintricate question of weak rates. Our main result asserts that the weak rate,\nfor a reasonably large class of test function, is essentially of order $\\min \\{\n3H+\\tfrac12, 1 \\}$ where $H \\in (0,1/2]$ is the Hurst parameter of the\nfractional Brownian motion that underlies the rough volatility process.\n  Interestingly, the phase transition at $H=1/6$ is related to the correlation\nbetween the two driving factors, and thus gives additional meaning to a\nquantity already of central importance in stochastic volatility modelling.Our\nresults are complemented by a lower bound which show that the obtained weak\nrate is indeed optimal.",
            "pdf_url": "http://arxiv.org/pdf/2212.01591v2",
            "published": "2022-12-03 10:46:43+00:00",
            "updated": "2024-08-28 13:53:18+00:00"
        }
    ]
}