{
    "Physics": [
        {
            "title": "Conformal prediction for uncertainties in nucleon-nucleon scattering",
            "authors": "Habib Yousefi Dezdarani, Ryan Curry, Alexandros Gezerlis",
            "summary": "Conformal prediction is a distribution-free and model-agnostic\nuncertainty-quantification method that provides finite-sample prediction\nintervals with guaranteed coverage. In this work, for the first time, we apply\nconformal-prediction to generate uncertainty bands for physical observables in\nnuclear physics, such as the total cross section and nucleon-nucleon phase\nshifts. We demonstrate the method's flexibility by considering three scenarios:\n(i) a pointwise model, where expansion coefficients in chiral effective field\ntheory are treated as random variables; (ii) a Gaussian-Process model for the\ncoefficients; and (iii) phase shifts at various energies and partial waves\ncalculated using local interactions from chiral effective field theory. In each\ncase, conformal-prediction intervals are constructed and validated empirically.\nOur results show that conformal prediction provides reliable and adaptive\nuncertainty bands even in the presence of non-Gaussian behavior, such as\nskewness and heavy tails. These findings highlight conformal prediction as a\nrobust and practical framework for quantifying theoretical uncertainties.",
            "pdf_url": "http://arxiv.org/pdf/2507.08085v2",
            "published": "2025-07-10 18:00:10+00:00",
            "updated": "2025-09-16 17:59:50+00:00"
        },
        {
            "title": "How Theory-Informed Priors Affect DESI Evidence for Evolving Dark Energy",
            "authors": "Michael W. Toomey, Gabriele Montefalcone, Evan McDonough, Katherine Freese",
            "summary": "Recent measurements of baryon acoustic oscillations (BAO) from the Dark\nEnergy Spectroscopic Instrument (DESI) have been interpreted to suggest that\ndark energy may be evolving. In this work, we examine how prior choices affect\nsuch conclusions. Specifically, we study the biases introduced by the customary\nuse of uniform priors on the Chevallier-Polarski-Linder (CPL) parameters, $w_0$\nand $w_a$, when assessing evidence for evolving dark energy. To do so, we\nconstruct theory-informed priors on $(w_0, w_a)$ using a normalizing flow (NF),\ntrained on two representative quintessence models, which learns the\ndistribution of these parameters conditional on the underlying $\\Lambda$CDM\nparameters. In the combined $\\textit{Planck}$ CMB + DESI BAO analysis we find\nthat the apparent tension with a cosmological constant in the CPL framework can\nbe reduced from $\\sim 3.1\\sigma$ to $\\sim 1.3\\sigma$ once theory-informed\npriors are applied, rendering the result effectively consistent with\n$\\Lambda$CDM. For completeness, we also analyze combinations that include Type\nIa supernova data, showing similar shifts toward the $\\Lambda$CDM limit. Taken\ntogether, the observed sensitivity to prior choices in these analyses arises\nbecause uniform priors - often mischaracterized as \"uninformative\" - can\nactually bias inferences toward unphysical parameter regions. Consequently, our\nresults underscore the importance of adopting physically motivated priors to\nensure robust cosmological inferences, especially when evaluating new\nhypotheses with only marginal statistical support. Lastly, our NF-based\nframework achieves these results by post-processing existing MCMC chains,\nrequiring $\\approx 1$ hour of additional CPU compute time on top of the base\nanalysis - a dramatic speedup over direct model sampling that highlights the\nscalability of this approach for testing diverse theoretical models.",
            "pdf_url": "http://arxiv.org/pdf/2509.13318v1",
            "published": "2025-09-16 17:59:31+00:00",
            "updated": "2025-09-16 17:59:31+00:00"
        },
        {
            "title": "Configurational Temperature as a Diagnostic for Complex Langevin Dynamics in the 3D XY Model",
            "authors": "Anosh Joseph, Arpith Kumar",
            "summary": "We investigate the applicability of complex Langevin dynamics to the\nthree-dimensional XY model at finite chemical potential. To assess correctness,\nwe introduce a new diagnostic based on the configurational temperature (or\nconfigurational coupling) estimator, recently proposed as a thermodynamic\nconsistency check. We compare this criterion with the established\nNagata-Nishimura-Shimasaki drift-decay test across a range of couplings and\nchemical potentials. Our results show that complex Langevin dynamics yields\nreliable results in the ordered phase (large $\\beta$), but fails in the\ndisordered phase (small $\\beta$), even when the sign problem is mild. The\nconfigurational estimator provides a clear and physics-driven reliability test\nthat complements drift-based diagnostics. These findings establish the\nestimator as a practical tool for identifying incorrect convergence, and\nhighlight its potential for broader applications in lattice field theories with\ncomplex actions.",
            "pdf_url": "http://arxiv.org/pdf/2509.13314v1",
            "published": "2025-09-16 17:57:27+00:00",
            "updated": "2025-09-16 17:57:27+00:00"
        },
        {
            "title": "Mixed Triplet-Singlet Order Parameter in Decoupled Superconducting 1H Monolayers of Transition-Metal Dichalcogenides",
            "authors": "Avior Almoalem, Sajilesh Kunhiparambath, Roni Anna Gofman, Yuval Nitzav, Ilay Mangel, Nitzan Ragoler, Jun Fujii, Ivana Vobornik, Francois Bertran, Amit Kanigel, Jonathan Ruhman, Vidya Madhavan",
            "summary": "Understanding the emergence of unconventional superconductivity, where the\norder parameter deviates from simple isotropic s-wave pairing, is a central\npuzzle in condensed matter physics. Transition-metal dichalcogenides (TMDCs),\nthough generally regarded as conventional superconductors, display signatures\nof this unusual behavior and thus provide a particularly intriguing platform to\nexplore how exotic states arise. Here we investigate the misfit compound\n(SnS)$_{1.15}$(TaS$_2$), a heterostructure composed of alternating SnS and\n1H-TaS$_2$ layers. Using transport, photoemission, and scanning tunneling\nspectroscopy, we demonstrate that the SnS layers effectively decouple the\nTaS$_2$ into electronically isolated 1H sheets. In this limit, the tunneling\ndensity of states reveals a clear two-gap superconducting spectrum with T$_c\n\\sim$ 3.1 K. A theoretical model based on lack of inversion symmetry and\nfinite-range attraction reproduces the observed multi-gap structure as a mixed\nsinglet-triplet state. These results establish misfit compounds as a powerful\nplatform for studying unconventional superconductivity in isolated 1H layers\nand for realizing multiple uncoupled superconductors within a single crystal.",
            "pdf_url": "http://arxiv.org/pdf/2509.13303v1",
            "published": "2025-09-16 17:55:39+00:00",
            "updated": "2025-09-16 17:55:39+00:00"
        },
        {
            "title": "QDFlow: A Python package for physics simulations of quantum dot devices",
            "authors": "Donovan L. Buterakos, Sandesh S. Kalantre, Joshua Ziegler, Jacob M Taylor, Justyna P. Zwolak",
            "summary": "Recent advances in machine learning (ML) have accelerated progress in\ncalibrating and operating quantum dot (QD) devices. However, most ML approaches\nrely on access to large, high-quality labeled datasets for training,\nbenchmarking, and validation, with labels capturing key features in the data.\nObtaining such datasets experimentally is challenging due to limited data\navailability and the labor-intensive nature of labeling. QDFlow is an\nopen-source physics simulator for multi-QD arrays that generates realistic\nsynthetic data with ground-truth labels. QDFlow combines a self-consistent\nThomas-Fermi solver, a dynamic capacitance model, and flexible noise modules to\nproduce charge stability diagrams and ray-based data closely resembling\nexperiments. With extensive tunable parameters and customizable noise models,\nQDFlow supports the creation of large, diverse datasets for ML development,\nbenchmarking, and quantum device research.",
            "pdf_url": "http://arxiv.org/pdf/2509.13298v1",
            "published": "2025-09-16 17:54:25+00:00",
            "updated": "2025-09-16 17:54:25+00:00"
        },
        {
            "title": "Higgs Phases and Boundary Criticality",
            "authors": "Kristian Tyn Kai Chung, Rafael Flores-Calderón, Rafael C. Torres, Pedro Ribeiro, Sergej Moroz, Paul McClarty",
            "summary": "Motivated by recent work connecting Higgs phases to symmetry protected\ntopological (SPT) phases, we investigate the interplay of gauge redundancy and\nglobal symmetry in lattice gauge theories with Higgs fields in the presence of\na boundary. The core conceptual point is that a global symmetry associated to a\nHiggs field, which is pure-gauge in a closed system, acts physically at the\nboundary under boundary conditions which allow electric flux to escape the\nsystem. We demonstrate in both Abelian and non-Abelian models that this\nsymmetry is spontaneously broken in the Higgs regime, implying the presence of\ngapless edge modes. Starting with the U(1) Abelian Higgs model in 4D, we\ndemonstrate a boundary phase transition in the 3D XY universality class\nseparating the bulk Higgs and confining regimes. Varying the boundary coupling\nwhile preserving the symmetries shifts the location of the boundary phase\ntransition. We then consider non-Abelian gauge theories with fundamental and\ngroup-valued Higgs matter, and identify the analogous non-Abelian global\nsymmetry acting on the boundary generated by the total color charge. For\nSU($N$) gauge theory with fundamental Higgs matter we argue for a boundary\nphase transition in the O($2N$) universality class, verified numerically for\n$N=2,3$. For group-valued Higgs matter, the boundary theory is a principal\nchiral model exhibiting chiral symmetry breaking. We further demonstrate this\nmechanism in theories with higher-form Higgs fields. We show how the\nhigher-form matter symmetry acts at the boundary and can spontaneously break,\nexhibiting a boundary confinement-deconfinement transition. We also study the\nelectric-magnetic dual theory, demonstrating a dual magnetic defect\ncondensation transition at the boundary. We discuss some implications and\nextensions of these findings and what they may imply for the relation between\nHiggs and SPT phases.",
            "pdf_url": "http://arxiv.org/pdf/2404.17001v2",
            "published": "2024-04-25 19:46:12+00:00",
            "updated": "2025-09-16 17:47:42+00:00"
        },
        {
            "title": "Flavour and cosmological probes of Diracon models",
            "authors": "Salvador Centelles Chuliá, Tim Herbermann, Antonio Herrero-Brocal, Avelino Vicente",
            "summary": "We present and analyze two minimal extensions of the Standard Model featuring\na spontaneously broken global, chiral, and anomaly-free $U(1)_D$ symmetry. This\nbreaking generates naturally small Dirac neutrino masses via a seesaw mechanism\nand yields a physical massless Goldstone boson, the Diracon. Although both\nmodels share the same particle content and scalar potential, their distinct\nsymmetry breaking pattern leads to remarkably different phenomenological and\ncosmological signatures. In the first model, the Diracon couples weakly to\ncharged leptons but right-handed neutrinos can be efficiently produced in the\nearly Universe, resulting in stringent constraints from the effective number of\nrelativistic species, $\\Delta N_{\\text{eff}}$. Conversely, in the second one,\nright-handed neutrino production is suppressed, and flavour-violating processes\nsuch as $\\mu \\to e \\mathcal{D}$ provide the most promising probes. These simple\nbut elegant models showcase the complementarity between cosmological\nobservations and low-energy flavour experiments in the search for physics\nbeyond the Standard Model.",
            "pdf_url": "http://arxiv.org/pdf/2506.06449v2",
            "published": "2025-06-06 18:12:38+00:00",
            "updated": "2025-09-16 17:39:15+00:00"
        },
        {
            "title": "Emergent structures in open EFTs",
            "authors": "Perseas Christodoulidis",
            "summary": "Open effective field theories (EFTs) provide a systematic framework for\ndescribing systems coupled to an environment, where dissipation, noise, and\nmodified conservation laws naturally arise. Working within the\nSchwinger-Keldysh formalism, we examine open extensions of well-studied\ntheories describing a spontaneous symmetry breaking phase in the higher-form\nsense: the superfluid, Maxwell theory, and Einstein's gravity. We demonstrate\nthat to leading order breaking advanced symmetries while preserving the\nphysical ones leads to (i) deformed conservation laws that hold at the level of\nexpectation values for global symmetries and (ii) deformed noise constraints in\ngauge or gravitational theories.",
            "pdf_url": "http://arxiv.org/pdf/2509.13284v1",
            "published": "2025-09-16 17:38:26+00:00",
            "updated": "2025-09-16 17:38:26+00:00"
        },
        {
            "title": "HARMONIC: A Content-Centric Cognitive Robotic Architecture",
            "authors": "Sanjay Oruganti, Sergei Nirenburg, Marjorie McShane, Jesse English, Michael K. Roberts, Christian Arndt, Carlos Gonzalez, Mingyo Seo, Luis Sentis",
            "summary": "This paper introduces HARMONIC, a cognitive-robotic architecture designed for\nrobots in human-robotic teams. HARMONIC supports semantic perception\ninterpretation, human-like decision-making, and intentional language\ncommunication. It addresses the issues of safety and quality of results; aims\nto solve problems of data scarcity, explainability, and safety; and promotes\ntransparency and trust. Two proof-of-concept HARMONIC-based robotic systems are\ndemonstrated, each implemented in both a high-fidelity simulation environment\nand on physical robotic platforms.",
            "pdf_url": "http://arxiv.org/pdf/2509.13279v1",
            "published": "2025-09-16 17:34:18+00:00",
            "updated": "2025-09-16 17:34:18+00:00"
        },
        {
            "title": "OGF: An Online Gradient Flow Method for Optimizing the Statistical Steady-State Time Averages of Unsteady Turbulent Flows",
            "authors": "Tom Hickling, Jonathan F. MacArt, Justin Sirignano, Den Waidmann",
            "summary": "Turbulent flows are chaotic and unsteady, but their statistical distribution\nconverges to a statistical steady state. Engineering quantities of interest\ntypically take the form of time-average statistics such as $ \\frac{1}{t}\n\\int_0^t f ( u(x,\\tau; \\theta) ) d\\tau \\overset{t \\rightarrow\n\\infty}{\\rightarrow} F(x; \\theta)$, where $u(x,t; \\theta)$ are solutions of the\nNavier--Stokes equations with parameters $\\theta$. Optimizing over $F(x;\n\\theta)$ has many engineering applications including geometric optimization,\nflow control, and closure modeling. However, this remains an open challenge, as\nexisting computational approaches are incapable of scaling to physically\nrepresentative numbers of grid points. The fundamental obstacle is the\nchaoticity of turbulent flows: gradients calculated with the adjoint method\ndiverge exponentially as $t \\rightarrow \\infty$.\n  We develop a new online gradient-flow (OGF) method that is scalable to large\ndegree-of-freedom systems and enables optimizing for the steady-state\nstatistics of chaotic, unsteady, turbulence-resolving simulations. The method\nforward-propagates an online estimate for the gradient of $F(x; \\theta)$ while\nsimultaneously performing online updates of the parameters $\\theta$. A key\nfeature is the fully online nature of the algorithm to facilitate faster\noptimization progress and its combination with a finite-difference estimator to\navoid the divergence of gradients due to chaoticity. The proposed OGF method is\ndemonstrated for optimizations over three chaotic ordinary and partial\ndifferential equations: the Lorenz-63 equation, the Kuramoto--Sivashinsky\nequation, and Navier--Stokes solutions of compressible, forced, homogeneous\nisotropic turbulence. In each case, the OGF method successfully reduces the\nloss based on $F(x; \\theta)$ by several orders of magnitude and accurately\nrecovers the optimal parameters.",
            "pdf_url": "http://arxiv.org/pdf/2507.05149v2",
            "published": "2025-07-07 16:00:15+00:00",
            "updated": "2025-09-16 17:29:17+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Pitfalls of defacing whole-head MRI: re-identification risk with diffusion models and compromised research potential",
            "authors": "Chenyu Gao, Kaiwen Xu, Michael E. Kim, Lianrui Zuo, Zhiyuan Li, Derek B. Archer, Timothy J. Hohman, Ann Zenobia Moore, Luigi Ferrucci, Lori L. Beason-Held, Susan M. Resnick, Christos Davatzikos, Jerry L. Prince, Bennett A. Landman",
            "summary": "Defacing is often applied to head magnetic resonance image (MRI) datasets\nprior to public release to address privacy concerns. The alteration of facial\nand nearby voxels has provoked discussions about the true capability of these\ntechniques to ensure privacy as well as their impact on downstream tasks. With\nadvancements in deep generative models, the extent to which defacing can\nprotect privacy is uncertain. Additionally, while the altered voxels are known\nto contain valuable anatomical information, their potential to support research\nbeyond the anatomical regions directly affected by defacing remains uncertain.\nTo evaluate these considerations, we develop a refacing pipeline that recovers\nfaces in defaced head MRIs using cascaded diffusion probabilistic models\n(DPMs). The DPMs are trained on images from 180 subjects and tested on images\nfrom 484 unseen subjects, 469 of whom are from a different dataset. To assess\nwhether the altered voxels in defacing contain universally useful information,\nwe also predict computed tomography (CT)-derived skeletal muscle radiodensity\nfrom facial voxels in both defaced and original MRIs. The results show that\nDPMs can generate high-fidelity faces that resemble the original faces from\ndefaced images, with surface distances to the original faces significantly\nsmaller than those of a population average face (p < 0.05). This performance\nalso generalizes well to previously unseen datasets. For skeletal muscle\nradiodensity predictions, using defaced images results in significantly weaker\nSpearman's rank correlation coefficients compared to using original images (p <\n10-4). For shin muscle, the correlation is statistically significant (p < 0.05)\nwhen using original images but not statistically significant (p > 0.05) when\nany defacing method is applied, suggesting that defacing might not only fail to\nprotect privacy but also eliminate valuable information.",
            "pdf_url": "http://arxiv.org/pdf/2501.18834v2",
            "published": "2025-01-31 00:58:12+00:00",
            "updated": "2025-09-16 15:33:55+00:00"
        },
        {
            "title": "Discovering Mathematical Equations with Diffusion Language Model",
            "authors": "Xiaoxu Han, Chengzhen Ning, Jinghui Zhong, Fubiao Yang, Yu Wang, Xin Mu",
            "summary": "Discovering valid and meaningful mathematical equations from observed data\nplays a crucial role in scientific discovery. While this task, symbolic\nregression, remains challenging due to the vast search space and the trade-off\nbetween accuracy and complexity. In this paper, we introduce DiffuSR, a\npre-training framework for symbolic regression built upon a continuous-state\ndiffusion language model. DiffuSR employs a trainable embedding layer within\nthe diffusion process to map discrete mathematical symbols into a continuous\nlatent space, modeling equation distributions effectively. Through iterative\ndenoising, DiffuSR converts an initial noisy sequence into a symbolic equation,\nguided by numerical data injected via a cross-attention mechanism. We also\ndesign an effective inference strategy to enhance the accuracy of the\ndiffusion-based equation generator, which injects logit priors into genetic\nprogramming. Experimental results on standard symbolic regression benchmarks\ndemonstrate that DiffuSR achieves competitive performance with state-of-the-art\nautoregressive methods and generates more interpretable and diverse\nmathematical expressions.",
            "pdf_url": "http://arxiv.org/pdf/2509.13136v1",
            "published": "2025-09-16 14:53:44+00:00",
            "updated": "2025-09-16 14:53:44+00:00"
        },
        {
            "title": "Informed Correctors for Discrete Diffusion Models",
            "authors": "Yixiu Zhao, Jiaxin Shi, Feng Chen, Shaul Druckmann, Lester Mackey, Scott Linderman",
            "summary": "Discrete diffusion has emerged as a powerful framework for generative\nmodeling in discrete domains, yet efficiently sampling from these models\nremains challenging. Existing sampling strategies often struggle to balance\ncomputation and sample quality when the number of sampling steps is reduced,\neven when the model has learned the data distribution well. To address these\nlimitations, we propose a predictor-corrector sampling scheme where the\ncorrector is informed by the diffusion model to more reliably counter the\naccumulating approximation errors. To further enhance the effectiveness of our\ninformed corrector, we introduce complementary architectural modifications\nbased on hollow transformers and a simple tailored training objective that\nleverages more training signal. We use a synthetic example to illustrate the\nfailure modes of existing samplers and show how informed correctors alleviate\nthese problems. On the text8 and tokenized ImageNet 256x256 datasets, our\ninformed corrector consistently produces superior samples with fewer errors or\nimproved FID scores for discrete diffusion models. These results underscore the\npotential of informed correctors for fast and high-fidelity generation using\ndiscrete diffusion. Our code is available at\nhttps://github.com/lindermanlab/informed-correctors.",
            "pdf_url": "http://arxiv.org/pdf/2407.21243v4",
            "published": "2024-07-30 23:29:29+00:00",
            "updated": "2025-09-16 14:31:25+00:00"
        },
        {
            "title": "MIA-EPT: Membership Inference Attack via Error Prediction for Tabular Data",
            "authors": "Eyal German, Daniel Samira, Yuval Elovici, Asaf Shabtai",
            "summary": "Synthetic data generation plays an important role in enabling data sharing,\nparticularly in sensitive domains like healthcare and finance. Recent advances\nin diffusion models have made it possible to generate realistic, high-quality\ntabular data, but they may also memorize training records and leak sensitive\ninformation. Membership inference attacks (MIAs) exploit this vulnerability by\ndetermining whether a record was used in training. While MIAs have been studied\nin images and text, their use against tabular diffusion models remains\nunderexplored despite the unique risks of structured attributes and limited\nrecord diversity. In this paper, we introduce MIAEPT, Membership Inference\nAttack via Error Prediction for Tabular Data, a novel black-box attack\nspecifically designed to target tabular diffusion models. MIA-EPT constructs\nerrorbased feature vectors by masking and reconstructing attributes of target\nrecords, disclosing membership signals based on how well these attributes are\npredicted. MIA-EPT operates without access to the internal components of the\ngenerative model, relying only on its synthetic data output, and was shown to\ngeneralize across multiple state-of-the-art diffusion models. We validate\nMIA-EPT on three diffusion-based synthesizers, achieving AUC-ROC scores of up\nto 0.599 and TPR@10% FPR values of 22.0% in our internal tests. Under the MIDST\n2025 competition conditions, MIA-EPT achieved second place in the Black-box\nMulti-Table track (TPR@10% FPR = 20.0%). These results demonstrate that our\nmethod can uncover substantial membership leakage in synthetic tabular data,\nchallenging the assumption that synthetic data is inherently\nprivacy-preserving. Our code is publicly available at\nhttps://github.com/eyalgerman/MIA-EPT.",
            "pdf_url": "http://arxiv.org/pdf/2509.13046v1",
            "published": "2025-09-16 13:03:54+00:00",
            "updated": "2025-09-16 13:03:54+00:00"
        },
        {
            "title": "AC-Refiner: Efficient Arithmetic Circuit Optimization Using Conditional Diffusion Models",
            "authors": "Chenhao Xue, Kezhi Li, Jiaxing Zhang, Yi Ren, Zhengyuan Shi, Chen Zhang, Yibo Lin, Lining Zhang, Qiang Xu, Guangyu Sun",
            "summary": "Arithmetic circuits, such as adders and multipliers, are fundamental\ncomponents of digital systems, directly impacting the performance, power\nefficiency, and area footprint. However, optimizing these circuits remains\nchallenging due to the vast design space and complex physical constraints.\nWhile recent deep learning-based approaches have shown promise, they struggle\nto consistently explore high-potential design variants, limiting their\noptimization efficiency. To address this challenge, we propose AC-Refiner, a\nnovel arithmetic circuit optimization framework leveraging conditional\ndiffusion models. Our key insight is to reframe arithmetic circuit synthesis as\na conditional image generation task. By carefully conditioning the denoising\ndiffusion process on target quality-of-results (QoRs), AC-Refiner consistently\nproduces high-quality circuit designs. Furthermore, the explored designs are\nused to fine-tune the diffusion model, which focuses the exploration near the\nPareto frontier. Experimental results demonstrate that AC-Refiner generates\ndesigns with superior Pareto optimality, outperforming state-of-the-art\nbaselines. The performance gain is further validated by integrating AC-Refiner\ninto practical applications.",
            "pdf_url": "http://arxiv.org/pdf/2507.02598v2",
            "published": "2025-07-03 13:21:33+00:00",
            "updated": "2025-09-16 12:23:53+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "DeltaHedge: A Multi-Agent Framework for Portfolio Options Optimization",
            "authors": "Feliks Bańka, Jarosław A. Chudziak",
            "summary": "In volatile financial markets, balancing risk and return remains a\nsignificant challenge. Traditional approaches often focus solely on equity\nallocation, overlooking the strategic advantages of options trading for dynamic\nrisk hedging. This work presents DeltaHedge, a multi-agent framework that\nintegrates options trading with AI-driven portfolio management. By combining\nadvanced reinforcement learning techniques with an ensembled options-based\nhedging strategy, DeltaHedge enhances risk-adjusted returns and stabilizes\nportfolio performance across varying market conditions. Experimental results\ndemonstrate that DeltaHedge outperforms traditional strategies and standalone\nmodels, underscoring its potential to transform practical portfolio management\nin complex financial environments. Building on these findings, this paper\ncontributes to the fields of quantitative finance and AI-driven portfolio\noptimization by introducing a novel multi-agent system for integrating options\ntrading strategies, addressing a gap in the existing literature.",
            "pdf_url": "http://arxiv.org/pdf/2509.12753v1",
            "published": "2025-09-16 07:14:56+00:00",
            "updated": "2025-09-16 07:14:56+00:00"
        },
        {
            "title": "SCOR: A Framework for Responsible AI Innovation in Digital Ecosystems",
            "authors": "Mohammad Saleh Torkestani, Taha Mansouri",
            "summary": "AI-driven digital ecosystems span diverse stakeholders including technology\nfirms, regulators, accelerators and civil society, yet often lack cohesive\nethical governance. This paper proposes a four-pillar framework (SCOR) to embed\naccountability, fairness, and inclusivity across such multi-actor networks.\nLeveraging a design science approach, we develop a Shared Ethical Charter(S),\nstructured Co-Design and Stakeholder Engagement protocols(C), a system of\nContinuous Oversight and Learning(O), and Adaptive Regulatory Alignment\nstrategies(R). Each component includes practical guidance, from lite modules\nfor resource-constrained start-ups to in-depth auditing systems for larger\nconsortia. Through illustrative vignettes in healthcare, finance, and smart\ncity contexts, we demonstrate how the framework can harmonize organizational\nculture, leadership incentives, and cross-jurisdictional compliance. Our\nmixed-method KPI design further ensures that quantitative targets are\ncomplemented by qualitative assessments of user trust and cultural change. By\nuniting ethical principles with scalable operational structures, this paper\noffers a replicable pathway toward responsible AI innovation in complex digital\necosystems.",
            "pdf_url": "http://arxiv.org/pdf/2509.10653v1",
            "published": "2025-09-12 19:29:51+00:00",
            "updated": "2025-09-12 19:29:51+00:00"
        },
        {
            "title": "pySigLib -- Fast Signature-Based Computations on CPU and GPU",
            "authors": "Daniil Shmelev, Cristopher Salvi",
            "summary": "Signature-based methods have recently gained significant traction in machine\nlearning for sequential data. In particular, signature kernels have emerged as\npowerful discriminators and training losses for generative models on\ntime-series, notably in quantitative finance. However, existing implementations\ndo not scale to the dataset sizes and sequence lengths encountered in practice.\nWe present pySigLib, a high-performance Python library offering optimised\nimplementations of signatures and signature kernels on CPU and GPU, fully\ncompatible with PyTorch's automatic differentiation. Beyond an efficient\nsoftware stack for large-scale signature-based computation, we introduce a\nnovel differentiation scheme for signature kernels that delivers accurate\ngradients at a fraction of the runtime of existing libraries.",
            "pdf_url": "http://arxiv.org/pdf/2509.10613v1",
            "published": "2025-09-12 18:00:14+00:00",
            "updated": "2025-09-12 18:00:14+00:00"
        }
    ]
}