{
    "Physics": [
        {
            "title": "Hierarchical Decision-Making for Autonomous Navigation: Integrating Deep Reinforcement Learning and Fuzzy Logic in Four-Wheel Independent Steering and Driving Systems",
            "authors": "Yizhi Wang, Degang Xu, Yongfang Xie, Shuzhong Tan, Xianan Zhou, Peng Chen",
            "summary": "This paper presents a hierarchical decision-making framework for autonomous\nnavigation in four-wheel independent steering and driving (4WISD) systems. The\nproposed approach integrates deep reinforcement learning (DRL) for high-level\nnavigation with fuzzy logic for low-level control to ensure both task\nperformance and physical feasibility. The DRL agent generates global motion\ncommands, while the fuzzy logic controller enforces kinematic constraints to\nprevent mechanical strain and wheel slippage. Simulation experiments\ndemonstrate that the proposed framework outperforms traditional navigation\nmethods, offering enhanced training efficiency and stability and mitigating\nerratic behaviors compared to purely DRL-based solutions. Real-world\nvalidations further confirm the framework's ability to navigate safely and\neffectively in dynamic industrial settings. Overall, this work provides a\nscalable and reliable solution for deploying 4WISD mobile robots in complex,\nreal-world scenarios.",
            "pdf_url": "http://arxiv.org/pdf/2508.16574v1",
            "published": "2025-08-22 17:57:56+00:00",
            "updated": "2025-08-22 17:57:56+00:00"
        },
        {
            "title": "Nonequilibrium Phase Transitions in Large $N$ Matrix Quantum Mechanics",
            "authors": "Minjae Cho",
            "summary": "It is believed that the theory of quantum gravity describing our universe is\nunitary. Nonetheless, if we only have access to a subsystem, its dynamics is\ndescribed by nonequilibrium physics. Motivated by this, we investigate the\nplanar limit of large $N$ one-matrix quantum mechanics obeying the Lindblad\nmaster equation with dissipative jump terms, focusing on the existence,\nuniqueness, and properties of steady states. After showing that Lindblad\ndissipation is absent in the gauged model at large $N$, we study nonequilibrium\nphase transitions in planar ungauged matrix quantum mechanics. In the first\nclass of examples, where potentials are unbounded from below, we study\nnonequilibrium critical points above which strong dissipation allows for the\nexistence of normalizable steady states that would otherwise not exist. In the\nsecond class of examples, termed matrix quantum optics, we find evidence of\nnonequilibrium phase transitions analogous to those recently reported in the\nquantum optics literature for driven-dissipative Kerr resonators. Preliminary\nresults on two-matrix quantum mechanics are also presented. We implement\nbootstrap methods to obtain concrete and rigorous results for the\nnonequilibrium steady states of matrix quantum mechanics in the planar limit.",
            "pdf_url": "http://arxiv.org/pdf/2508.04764v3",
            "published": "2025-08-06 18:00:00+00:00",
            "updated": "2025-08-22 17:36:40+00:00"
        },
        {
            "title": "Machine Learning Time Propagators for Time-Dependent Density Functional Theory Simulations",
            "authors": "Karan Shah, Attila Cangi",
            "summary": "Time-dependent density functional theory (TDDFT) is a widely used method to\ninvestigate electron dynamics under external time-dependent perturbations such\nas laser fields. In this work, we present a novel approach to accelerate\nelectron dynamics simulations based on real time TDDFT using autoregressive\nneural operators as time-propagators for the electron density. By leveraging\nphysics-informed constraints and featurization, and high-resolution training\ndata, our model achieves superior accuracy and computational speed compared to\ntraditional numerical solvers. We demonstrate the effectiveness of our model on\na class of one-dimensional diatomic molecules under the influence of a range of\nlaser parameters. This method has potential in enabling real-time, on-the-fly\nmodeling of laser-irradiated molecules and materials with varying experimental\nparameters.",
            "pdf_url": "http://arxiv.org/pdf/2508.16554v1",
            "published": "2025-08-22 17:22:24+00:00",
            "updated": "2025-08-22 17:22:24+00:00"
        },
        {
            "title": "Benjamin-Feir Instability of Interfacial Gravity-Capillary Waves in a Two-Layer Fluid. Part I",
            "authors": "Olga Avramenko, Volodymyr Naradovyi",
            "summary": "This study presents a detailed investigation of the modulational stability of\ninterfacial wave packets in a two-layer inviscid incompressible fluid with\nfinite layer thicknesses and interfacial surface tension. The stability\nanalysis is carried out for a broad range of density ratios and geometric\nconfigurations, enabling the construction of stability diagrams in the (\\rho,k)\n-plane, where \\rho is the density ratio and k is the carrier wavenumber. The\nBenjamin-Feir index is used as the stability criterion, and its interplay with\nthe curvature of the dispersion relation is examined to determine the onset of\nmodulational instability. The topology of the stability diagrams reveals\nseveral characteristic structures: a localized loop of stability within an\ninstability zone, a global upper stability domain, an elongated corridor\nbounded by resonance and dispersion curves, and a degenerate cut structure\narising in strongly asymmetric configurations. Each of these structures is\nassociated with a distinct physical mechanism involving the balance between\nfocusing/defocusing nonlinearity and anomalous/normal dispersion. Systematic\nvariation of layer thicknesses allows us to track the formation, deformation,\nand disappearance of these regions, as well as their merging or segmentation\ndue to resonance effects. Limiting cases of semi-infinite layers are analyzed\nto connect the results with known configurations, including the\n`half-space--layer', `layer--half-space', and `half-space--half-space' systems.\nThe influence of symmetry and asymmetry in layer geometry is examined in\ndetail, showing how it governs the arrangement and connectivity of stable and\nunstable regions in parameter space.",
            "pdf_url": "http://arxiv.org/pdf/2508.16551v1",
            "published": "2025-08-22 17:17:49+00:00",
            "updated": "2025-08-22 17:17:49+00:00"
        },
        {
            "title": "Searching for hadronic scale baryonic and dark forces at $(g-2)_μ$'s lattice-vs-dispersion front",
            "authors": "Kaustubh Agashe, Abhishek Banerjee, Minuyan Jiang, Shmuel Nussinov, Kushan Panchal, Srijit Paul, Gilad Perez, Yotam Soreq",
            "summary": "The anomalous magnetic moment of the muon ($\\,a_{\\mu}\\,$) provides a\nstringent test of the quantum nature of the Standard Model (SM) and its\nextensions. To probe beyond the SM physics, one needs to be able to subtract\nthe SM contributions, which consists of a non-perturbative part, namely, the\nhadronic vacuum polarization (HVP) of the photon. The state of the art is to\npredominantly use two different methods to extract this HVP: lattice\ncomputation, and dispersion relation-based, data-driven method. Thus one can\nconstruct different forms of the ``$a_{\\mu}$ test\" which compares the precise\nmeasurement of $a_{\\mu}$ to its theory prediction. Additionally, this opens the\npossibility for another subtle test, where these two ``theory\" predictions\nthemselves are compared against each other, which is denoted as the\n``HVP-test\". This test is particularly sensitive to hadronic scale new physics.\nTherefore, in this work, we consider a SM extension consisting of a generic,\nlight $\\sim(100~{\\rm MeV}-1~{\\rm GeV})$ vector boson and study its impact on\nboth tests. We develop a comprehensive formalism for this purpose. We find that\nin the case of data-driven HVP being used in the $a_{\\mu}$ test, the new\nphysics contributions effectively cancels for a flavor-universal vector boson.\nAs an illustration of these general results, we consider two benchmark models:\ni)~the dark photon ($\\,A'\\,$) and ii)~a gauge boson coupled to baryon-number\n($\\,B\\,$). Using a combination of these tests, we are able to constrain the\nparameter space of $B$ and $A'$, complementarily to the existing limits. As a\nspin-off, our preliminary analysis of the spectrum of invariant mass of $3\\pi$\nin events with ISR at the $B-$ factories (BaBar, Belle) manifests the value of\nsuch a study in searching for $B\\to 3\\pi$ decay, thus motivating a dedicated\nsearch by experimental collaborations.",
            "pdf_url": "http://arxiv.org/pdf/2412.12266v2",
            "published": "2024-12-16 19:00:04+00:00",
            "updated": "2025-08-22 16:58:58+00:00"
        },
        {
            "title": "Guiding Diffusion Models with Reinforcement Learning for Stable Molecule Generation",
            "authors": "Zhijian Zhou, Junyi An, Zongkai Liu, Yunfei Shi, Xuan Zhang, Fenglei Cao, Chao Qu, Yuan Qi",
            "summary": "Generating physically realistic 3D molecular structures remains a core\nchallenge in molecular generative modeling. While diffusion models equipped\nwith equivariant neural networks have made progress in capturing molecular\ngeometries, they often struggle to produce equilibrium structures that adhere\nto physical principles such as force field consistency. To bridge this gap, we\npropose Reinforcement Learning with Physical Feedback (RLPF), a novel framework\nthat extends Denoising Diffusion Policy Optimization to 3D molecular\ngeneration. RLPF formulates the task as a Markov decision process and applies\nproximal policy optimization to fine-tune equivariant diffusion models.\nCrucially, RLPF introduces reward functions derived from force-field\nevaluations, providing direct physical feedback to guide the generation toward\nenergetically stable and physically meaningful structures. Experiments on the\nQM9 and GEOM-drug datasets demonstrate that RLPF significantly improves\nmolecular stability compared to existing methods. These results highlight the\nvalue of incorporating physics-based feedback into generative modeling. The\ncode is available at: https://github.com/ZhijianZhou/RLPF/tree/verl_diffusion.",
            "pdf_url": "http://arxiv.org/pdf/2508.16521v1",
            "published": "2025-08-22 16:44:55+00:00",
            "updated": "2025-08-22 16:44:55+00:00"
        },
        {
            "title": "Uncertainty Quantification and Propagation for ACORN, a geometric deep learning tracking pipeline for HEP experiments",
            "authors": "Lukas Péron, Paolo Calafiura, Xiangyang Ju, Jay Chan",
            "summary": "We have developed an Uncertainty Quantification process for multistep\npipelines and applied it to the ACORN particle tracking pipeline. All our\nexperiments are made using the TrackML open dataset. Using the Monte Carlo\nDropout method, we measure the data and model uncertainties of the pipeline\nsteps, study how they propagate down the pipeline, and how they are impacted by\nthe training dataset's size, the input data's geometry and physical properties.\nWe will show that for our case study, as the training dataset grows, the\noverall uncertainty becomes dominated by aleatoric uncertainty, indicating that\nwe had sufficient data to train the ACORN model we chose to its full potential.\nWe show that the ACORN pipeline yields high confidence in the track\nreconstruction and does not suffer from the miscalibration of the GNN model.",
            "pdf_url": "http://arxiv.org/pdf/2508.16518v1",
            "published": "2025-08-22 16:40:42+00:00",
            "updated": "2025-08-22 16:40:42+00:00"
        },
        {
            "title": "The twisted geometry of 6d F-theory vacua with discrete gauge symmetries",
            "authors": "David Jaramillo Duque, Amir-Kian Kashani-Poor, Thorsten Schimannek",
            "summary": "We study the fate of discrete gauge groups and discrete charges of\ngravitational theories under twisted circle compactification. We then apply our\nresults to six-dimensional F-theory vacua with discrete gauge symmetries and\nrelate them to the geometry of the genus one fibered Calabi-Yau threefolds that\nunderlie the dual M-theory compactifications. This leads us to introduce a\nclass of geometries, which we call almost generic elliptic/genus one fibered\nCalabi-Yau threefolds, and to make detailed conjectures about their properties.\nA second twisted circle compactification relates these M-theory vacua to Type\nIIA compactifications with flat but topologically non-trivial B-fields along\nthe internal geometry. The A-model topological string partition function on\nsuch configurations is intimately tied to the twisted-twined elliptic genera of\nthe six-dimensional non-critical strings of the associated F-theory vacuum. The\nmodular properties of the twisted-twined elliptic genera imply new twisted\nderived equivalences. We thus recover and significantly extend earlier results\nfrom both the physical and the mathematical literature. An important outcome of\nour study is that if the discrete gauge symmetry is not cyclic, then no smooth\ngenus one fibration exists that represents the associated axio-dilaton profile.",
            "pdf_url": "http://arxiv.org/pdf/2508.16500v1",
            "published": "2025-08-22 16:26:23+00:00",
            "updated": "2025-08-22 16:26:23+00:00"
        },
        {
            "title": "Skyrmions based on optical anisotropy for topological encoding",
            "authors": "Yunqi Zhang, An Aloysius Wang, Zimo Zhao, Yifei Ma, Ruofu Liu, Runchen Zhang, Zhi-Kai Pong, Yuxi Cai, Chao He",
            "summary": "The observation of skyrmions across diverse physical domains suggests that\nthey are universal features of S$^{2}$-valued fields, reflecting the ubiquity\nof topology in the study of the natural world. In this paper, we develop an\nabstract technique of parameter space dimensionality reduction that extends the\nskyrmion framework to fields taking values in manifolds of dimension greater\nthan 2, thereby broadening the range of systems that can support skyrmions. To\nprove that this is more than just a mathematical abstraction, we apply our\ntechnique to light-matter interactions, directly encoding skyrmionic structures\ninto the optical anisotropy of spatially varying structured matter by selecting\na distinguished axis, which is fundamentally different from the more commonly\nknown skyrmions formed by director fields in liquid crystals. We experimentally\nrealize such skyrmions using a liquid-crystal-based tunable elliptical retarder\narray as a proof-of-concept platform and demonstrate complex, reconfigurable\nskyrmionic states exhibiting topological robustness under artificially\nintroduced stochastic perturbations. Exploiting this robustness, we demonstrate\na promising application of skyrmions in topologically protected information\nstorage and show, both theoretically and experimentally, that the physically\nrealized S$^{2}$-valued field can differ from the designed field everywhere by\na large margin of error (up to 60{\\deg}) without affecting the underlying\ntopological charge.",
            "pdf_url": "http://arxiv.org/pdf/2508.16483v1",
            "published": "2025-08-22 15:56:47+00:00",
            "updated": "2025-08-22 15:56:47+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "MV-RAG: Retrieval Augmented Multiview Diffusion",
            "authors": "Yosef Dayani, Omer Benishu, Sagie Benaim",
            "summary": "Text-to-3D generation approaches have advanced significantly by leveraging\npretrained 2D diffusion priors, producing high-quality and 3D-consistent\noutputs. However, they often fail to produce out-of-domain (OOD) or rare\nconcepts, yielding inconsistent or inaccurate results. To this end, we propose\nMV-RAG, a novel text-to-3D pipeline that first retrieves relevant 2D images\nfrom a large in-the-wild 2D database and then conditions a multiview diffusion\nmodel on these images to synthesize consistent and accurate multiview outputs.\nTraining such a retrieval-conditioned model is achieved via a novel hybrid\nstrategy bridging structured multiview data and diverse 2D image collections.\nThis involves training on multiview data using augmented conditioning views\nthat simulate retrieval variance for view-specific reconstruction, alongside\ntraining on sets of retrieved real-world 2D images using a distinctive held-out\nview prediction objective: the model predicts the held-out view from the other\nviews to infer 3D consistency from 2D data. To facilitate a rigorous OOD\nevaluation, we introduce a new collection of challenging OOD prompts.\nExperiments against state-of-the-art text-to-3D, image-to-3D, and\npersonalization baselines show that our approach significantly improves 3D\nconsistency, photorealism, and text adherence for OOD/rare concepts, while\nmaintaining competitive performance on standard benchmarks.",
            "pdf_url": "http://arxiv.org/pdf/2508.16577v1",
            "published": "2025-08-22 17:59:40+00:00",
            "updated": "2025-08-22 17:59:40+00:00"
        },
        {
            "title": "Time-Aware One Step Diffusion Network for Real-World Image Super-Resolution",
            "authors": "Tainyi Zhang, Zheng-Peng Duan, Peng-Tao Jiang, Bo Li, Ming-Ming Cheng, Chun-Le Guo, Chongyi Li",
            "summary": "Diffusion-based real-world image super-resolution (Real-ISR) methods have\ndemonstrated impressive performance. To achieve efficient Real-ISR, many works\nemploy Variational Score Distillation (VSD) to distill pre-trained\nstable-diffusion (SD) model for one-step SR with a fixed timestep. However, due\nto the different noise injection timesteps, the SD will perform different\ngenerative priors. Therefore, a fixed timestep is difficult for these methods\nto fully leverage the generative priors in SD, leading to suboptimal\nperformance. To address this, we propose a Time-Aware one-step Diffusion\nNetwork for Real-ISR (TADSR). We first introduce a Time-Aware VAE Encoder,\nwhich projects the same image into different latent features based on\ntimesteps. Through joint dynamic variation of timesteps and latent features,\nthe student model can better align with the input pattern distribution of the\npre-trained SD, thereby enabling more effective utilization of SD's generative\ncapabilities. To better activate the generative prior of SD at different\ntimesteps, we propose a Time-Aware VSD loss that bridges the timesteps of the\nstudent model and those of the teacher model, thereby producing more consistent\ngenerative prior guidance conditioned on timesteps. Additionally, though\nutilizing the generative prior in SD at different timesteps, our method can\nnaturally achieve controllable trade-offs between fidelity and realism by\nchanging the timestep condition. Experimental results demonstrate that our\nmethod achieves both state-of-the-art performance and controllable SR results\nwith only a single step.",
            "pdf_url": "http://arxiv.org/pdf/2508.16557v1",
            "published": "2025-08-22 17:23:49+00:00",
            "updated": "2025-08-22 17:23:49+00:00"
        },
        {
            "title": "Constraints-Guided Diffusion Reasoner for Neuro-Symbolic Learning",
            "authors": "Xuan Zhang, Zhijian Zhou, Weidi Xu, Yanting Miao, Chao Qu, Yuan Qi",
            "summary": "Enabling neural networks to learn complex logical constraints and fulfill\nsymbolic reasoning is a critical challenge. Bridging this gap often requires\nguiding the neural network's output distribution to move closer to the symbolic\nconstraints. While diffusion models have shown remarkable generative capability\nacross various domains, we employ the powerful architecture to perform\nneuro-symbolic learning and solve logical puzzles. Our diffusion-based pipeline\nadopts a two-stage training strategy: the first stage focuses on cultivating\nbasic reasoning abilities, while the second emphasizes systematic learning of\nlogical constraints. To impose hard constraints on neural outputs in the second\nstage, we formulate the diffusion reasoner as a Markov decision process and\ninnovatively fine-tune it with an improved proximal policy optimization\nalgorithm. We utilize a rule-based reward signal derived from the logical\nconsistency of neural outputs and adopt a flexible strategy to optimize the\ndiffusion reasoner's policy. We evaluate our methodology on some classical\nsymbolic reasoning benchmarks, including Sudoku, Maze, pathfinding and\npreference learning. Experimental results demonstrate that our approach\nachieves outstanding accuracy and logical consistency among neural networks.",
            "pdf_url": "http://arxiv.org/pdf/2508.16524v1",
            "published": "2025-08-22 16:47:08+00:00",
            "updated": "2025-08-22 16:47:08+00:00"
        },
        {
            "title": "Underdamped Langevin MCMC with third order convergence",
            "authors": "Maximilian Scott, Dáire O'Kane, Andraž Jelinčič, James Foster",
            "summary": "In this paper, we propose a new numerical method for the underdamped Langevin\ndiffusion (ULD) and present a non-asymptotic analysis of its sampling error in\nthe 2-Wasserstein distance when the $d$-dimensional target distribution\n$p(x)\\propto e^{-f(x)}$ is strongly log-concave and has varying degrees of\nsmoothness. Precisely, under the assumptions that the gradient and Hessian of\n$f$ are Lipschitz continuous, our algorithm achieves a 2-Wasserstein error of\n$\\varepsilon$ in $\\mathcal{O}(\\sqrt{d}/\\varepsilon)$ and\n$\\mathcal{O}(\\sqrt{d}/\\sqrt{\\varepsilon})$ steps respectively. Therefore, our\nalgorithm has a similar complexity as other popular Langevin MCMC algorithms\nunder matching assumptions. However, if we additionally assume that the third\nderivative of $f$ is Lipschitz continuous, then our algorithm achieves a\n2-Wasserstein error of $\\varepsilon$ in\n$\\mathcal{O}(\\sqrt{d}/\\varepsilon^{\\frac{1}{3}})$ steps. To the best of our\nknowledge, this is the first gradient-only method for ULD with third order\nconvergence. To support our theory, we perform Bayesian logistic regression\nacross a range of real-world datasets, where our algorithm achieves competitive\nperformance compared to an existing underdamped Langevin MCMC algorithm and the\npopular No U-Turn Sampler (NUTS).",
            "pdf_url": "http://arxiv.org/pdf/2508.16485v1",
            "published": "2025-08-22 16:00:01+00:00",
            "updated": "2025-08-22 16:00:01+00:00"
        },
        {
            "title": "Generative diffusion posterior sampling for informative likelihoods",
            "authors": "Zheng Zhao",
            "summary": "Sequential Monte Carlo (SMC) methods have recently shown successful results\nfor conditional sampling of generative diffusion models. In this paper we\npropose a new diffusion posterior SMC sampler achieving improved statistical\nefficiencies, particularly under outlier conditions or highly informative\nlikelihoods. The key idea is to construct an observation path that correlates\nwith the diffusion model and to design the sampler to leverage this correlation\nfor more efficient sampling. Empirical results conclude the efficiency.",
            "pdf_url": "http://arxiv.org/pdf/2506.01083v2",
            "published": "2025-06-01 17:01:14+00:00",
            "updated": "2025-08-22 12:36:13+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "DAIQ: Auditing Demographic Attribute Inference from Question in LLMs",
            "authors": "Srikant Panda, Hitesh Laxmichand Patel, Shahad Al-Khalifa, Amit Agarwal, Hend Al-Khalifa, Sharefah Al-Ghamdi",
            "summary": "Large Language Models (LLMs) are known to reflect social biases when\ndemographic attributes, such as gender or race, are explicitly present in the\ninput. But even in their absence, these models still infer user identities\nbased solely on question phrasing. This subtle behavior has received far less\nattention, yet poses serious risks: it violates expectations of neutrality,\ninfers unintended demographic information, and encodes stereotypes that\nundermine fairness in various domains including healthcare, finance and\neducation.\n  We introduce Demographic Attribute Inference from Questions (DAIQ), a task\nand framework for auditing an overlooked failure mode in language models:\ninferring user demographic attributes from questions that lack explicit\ndemographic cues. Our approach leverages curated neutral queries, systematic\nprompting, and both quantitative and qualitative analysis to uncover how models\ninfer demographic information. We show that both open and closed source LLMs do\nassign demographic labels based solely on question phrasing.\n  Prevalence and consistency of demographic inferences across diverse models\nreveal a systemic and underacknowledged risk: LLMs can fabricate demographic\nidentities, reinforce societal stereotypes, and propagate harms that erode\nprivacy, fairness, and trust posing a broader threat to social equity and\nresponsible AI deployment. To mitigate this, we develop a prompt-based\nguardrail that substantially reduces identity inference and helps align model\nbehavior with fairness and privacy objectives.",
            "pdf_url": "http://arxiv.org/pdf/2508.15830v1",
            "published": "2025-08-18 19:26:17+00:00",
            "updated": "2025-08-18 19:26:17+00:00"
        }
    ]
}