{
    "Physics": [
        {
            "title": "Scalable and fault-tolerant preparation of encoded k-uniform states",
            "authors": "Shayan Majidy, Dominik Hangleiter, Michael J. Gullans",
            "summary": "$k$-uniform states are valuable resources in quantum information, enabling\ntasks such as teleportation, error correction, and accelerated quantum\nsimulations. The practical realization of $k$-uniform states, at scale, faces\nmajor obstacles: verifying $k$-uniformity is as difficult as measuring code\ndistances, and devising fault-tolerant preparation protocols further adds to\nthe complexity. To address these challenges, we present a scalable,\nfault-tolerant method for preparing encoded $k$-uniform states, and we\nillustrate our approach using surface and color codes. We first present a\ntechnique to determine $k$-uniformity of stabilizer states directly from their\nstabilizer tableau. We then identify a family of Clifford circuits that ensures\nboth fault tolerance and scalability in preparing these states. Building on the\nencoded $k$-uniform states, we introduce a hybrid physical-logical strategy\nthat retains some of the error-protection benefits of logical qubits while\nlowering the overhead for implementing arbitrary gates compared to fully\nlogical algorithms. We show that this hybrid approach can outperform fully\nphysical implementations for resource-state preparation, as demonstrated by\nexplicit constructions of $k$-uniform states.",
            "pdf_url": "http://arxiv.org/pdf/2503.14506v1",
            "published": "2025-03-18 17:59:59+00:00",
            "updated": "2025-03-18 17:59:59+00:00"
        },
        {
            "title": "Cosmos-Transfer1: Conditional World Generation with Adaptive Multimodal Control",
            "authors": "NVIDIA, :, Hassan Abu Alhaija, Jose Alvarez, Maciej Bala, Tiffany Cai, Tianshi Cao, Liz Cha, Joshua Chen, Mike Chen, Francesco Ferroni, Sanja Fidler, Dieter Fox, Yunhao Ge, Jinwei Gu, Ali Hassani, Michael Isaev, Pooya Jannaty, Shiyi Lan, Tobias Lasser, Huan Ling, Ming-Yu Liu, Xian Liu, Yifan Lu, Alice Luo, Qianli Ma, Hanzi Mao, Fabio Ramos, Xuanchi Ren, Tianchang Shen, Shitao Tang, Ting-Chun Wang, Jay Wu, Jiashu Xu, Stella Xu, Kevin Xie, Yuchong Ye, Xiaodong Yang, Xiaohui Zeng, Yu Zeng",
            "summary": "We introduce Cosmos-Transfer, a conditional world generation model that can\ngenerate world simulations based on multiple spatial control inputs of various\nmodalities such as segmentation, depth, and edge. In the design, the spatial\nconditional scheme is adaptive and customizable. It allows weighting different\nconditional inputs differently at different spatial locations. This enables\nhighly controllable world generation and finds use in various world-to-world\ntransfer use cases, including Sim2Real. We conduct extensive evaluations to\nanalyze the proposed model and demonstrate its applications for Physical AI,\nincluding robotics Sim2Real and autonomous vehicle data enrichment. We further\ndemonstrate an inference scaling strategy to achieve real-time world generation\nwith an NVIDIA GB200 NVL72 rack. To help accelerate research development in the\nfield, we open-source our models and code at\nhttps://github.com/nvidia-cosmos/cosmos-transfer1.",
            "pdf_url": "http://arxiv.org/pdf/2503.14492v1",
            "published": "2025-03-18 17:57:54+00:00",
            "updated": "2025-03-18 17:57:54+00:00"
        },
        {
            "title": "A Comprehensive Framework for Electroweak Phase Transitions: Thermal History and Dynamics from Bubble Nucleation to Percolation",
            "authors": "Haibin Chen, Yun Jiang",
            "summary": "The electroweak phase transition (EWPT) is crucial for cosmology and particle\nphysics, with a profound impact on electroweak baryogenesis, symmetry breaking,\nand gravitational wave (GW) signals. However, many studies overlook key aspects\nof EWPT dynamics, leading to misidentified patterns and overestimated GW\nsignals. To address these gaps, we present a comprehensive framework for\nanalyzing EWPTs, focusing on the vacuum's thermal history and dynamics from\nbubble nucleation to percolation. Using the $\\mathbb{Z}_2$-odd real scalar\nsinglet model, we demonstrate the occurrence of spontaneous $\\mathbb{Z}_2$\nsymmetry breaking in the high-temperature vacuum, leading to diverse EWPT\nprocesses, including multi-step transitions and inverse symmetry breaking. We\nidentify four distinct EWPT patterns, each characterized by unique\nsymmetry-breaking mechanisms and associated with bubbles exhibiting distinct\nfield configurations, which can be analyzed using a formalism based on energy\ndensity distributions developed here. A key finding is that bubble nucleation\nfails in extremely strong phase transitions (PTs) with low nucleation rates, or\nin ultra-fast PTs involving inverse $s$-bubbles that collapse instantly upon\nformation, both of which lead to false vacuum trapping and the absence of\nobservable GW signals. In first-order PTs where nucleation succeeds, stronger\ntransitions occur later in the universe's evolution, while weaker transitions\nproceed more rapidly. Multi-step transitions involving (inverse) $\\mathbb{Z}_2$\nsymmetry breaking give rise to complex transition sequences and exotic bubble\ndynamics, such as sequential nucleation or the coexistence of bubbles from\ndifferent vacua -- phenomena with significant implications for GW spectra, dark\nmatter, and baryogenesis. This work advances our understanding of EWPT dynamics\nand lays the groundwork for future studies of EWPTs in BSM physics.",
            "pdf_url": "http://arxiv.org/pdf/2503.00421v2",
            "published": "2025-03-01 09:54:27+00:00",
            "updated": "2025-03-18 17:54:41+00:00"
        },
        {
            "title": "EnQode: Fast Amplitude Embedding for Quantum Machine Learning Using Classical Data",
            "authors": "Jason Han, Nicholas S. DiBrita, Younghyun Cho, Hengrui Luo, Tirthak Patel",
            "summary": "Amplitude embedding (AE) is essential in quantum machine learning (QML) for\nencoding classical data onto quantum circuits. However, conventional AE methods\nsuffer from deep, variable-length circuits that introduce high output error due\nto extensive gate usage and variable error rates across samples, resulting in\nnoise-driven inconsistencies that degrade model accuracy. We introduce EnQode,\na fast AE technique based on symbolic representation that addresses these\nlimitations by clustering dataset samples and solving for cluster mean states\nthrough a low-depth, machine-specific ansatz. Optimized to reduce physical\ngates and SWAP operations, EnQode ensures all samples face consistent, low\nnoise levels by standardizing circuit depth and composition. With over 90%\nfidelity in data mapping, EnQode enables robust, high-performance QML on noisy\nintermediate-scale quantum (NISQ) devices. Our open-source solution provides a\nscalable and efficient alternative for integrating classical data with quantum\nmodels.",
            "pdf_url": "http://arxiv.org/pdf/2503.14473v1",
            "published": "2025-03-18 17:48:03+00:00",
            "updated": "2025-03-18 17:48:03+00:00"
        },
        {
            "title": "Demonstration of High-Fidelity Entangled Logical Qubits using Transmons",
            "authors": "Arian Vezvaee, Vinay Tripathi, Mario Morford-Oberst, Friederike Butt, Victor Kasatkin, Daniel A. Lidar",
            "summary": "Quantum error correction (QEC) codes are necessary to fault-tolerantly\noperate quantum computers. However, every such code is inherently limited by\nits inability to detect logical errors. Here, we propose and implement a method\nthat leverages dynamical decoupling (DD) to drastically suppress logical\nerrors. The key to achieving this is to use the logical operators of the QEC\ncode as DD pulses, which we refer to as logical dynamical decoupling (LDD). The\nresulting hybrid QEC-LDD strategy is in principle capable of handling arbitrary\nweight errors. We test QEC-LDD using IBM transmon devices and the [[4,2,2]]\ncode, demonstrating performance that significantly exceeds the capabilities of\nusing either this code or DD in isolation. We present a method that allows for\nthe detection of logical errors affecting logically encoded Bell states, which,\nin this case, arise primarily from crosstalk among physical qubits. Building on\nthis, we experimentally demonstrate high-fidelity entangled logical qubits.",
            "pdf_url": "http://arxiv.org/pdf/2503.14472v1",
            "published": "2025-03-18 17:47:08+00:00",
            "updated": "2025-03-18 17:47:08+00:00"
        },
        {
            "title": "Rods in flows: the PDE theory of immersed elastic filaments",
            "authors": "Dallas Albritton, Laurel Ohm",
            "summary": "We investigate a family of curve evolution equations approximating the motion\nof a Kirchhoff rod immersed in a low Reynolds number fluid. The rod is modeled\nas a framed curve whose energy consists of the bending energy of the curve and\nthe twisting energy of the frame. The equations we consider may be realized as\ngradient flows of the rod energy under a certain anisotropic metric coming from\nresistive force theory. Ultimately, our goal is to provide a comprehensive\ntreatment of the PDE theory of immersed rod dynamics. We begin by analyzing the\nproblem without the frame, in which case the evolution is globally well-posed\nand solutions asymptotically converge to Euler elasticae. Next, in the planar\nsetting, we demonstrate the existence of large time-periodic solutions forced\nby intrinsic curvature relevant to undulatory swimming. Finally, the majority\nof the paper is devoted to the evolution of an immersed Kirchhoff rod in 3D,\nwhich involves a strong coupling between the curve and frame. Under a\nphysically reasonable assumption on the curvature, solutions exist\nglobally-in-time and asymptotically converge to rod equilibria.",
            "pdf_url": "http://arxiv.org/pdf/2503.14440v1",
            "published": "2025-03-18 17:16:53+00:00",
            "updated": "2025-03-18 17:16:53+00:00"
        },
        {
            "title": "Discovery of a Glueball-like particle X(2370) at BESIII",
            "authors": "Yanping Huang",
            "summary": "Radiative decays of the $J/\\psi$ particle are of gluon-rich environment,\nproviding an ideal place for hunting glueballs. The $X(2370)$ particle was\nfirst discovered in $J/\\psi\\to \\gamma \\pi^+\\pi^-\\eta^{\\prime}$ process in 2011\nwith the BESIII experiment at BEPCII Collider, and later it was confirmed in\n$J/\\psi\\to\\gamma K\\bar{K}\\eta^{\\prime}$ decays. In 2024, with a sample of 10\nbillion $J/\\psi$ events collected at the BESIII detector, the spin-parity of\nthe $X(2370)$ was determined to be $0^{-+}$ for the first time in the partial\nwave analysis of $J/\\psi\\to \\gamma K^{0}_{S}K^{0}_{S} \\eta^{\\prime}$ process.\nRecently, new decay modes of $X(2370)\\to K^{0}_{S}K^{0}_{S}\\pi^0$,\n$\\pi^0\\pi^0\\eta$ and $a^0\\pi^0$ were observed. The mass, spin-parity quantum\nnumbers, production and decay properties of the $X(2370)$ particle are\nconsistent with the features of the lightest pseudoscalar glueball.",
            "pdf_url": "http://arxiv.org/pdf/2503.13286v2",
            "published": "2025-03-17 15:37:43+00:00",
            "updated": "2025-03-18 17:15:03+00:00"
        },
        {
            "title": "Functional classification of metabolic networks",
            "authors": "Jorge Reyes, Jörn Dunkel",
            "summary": "Chemical reaction networks underpin biological and physical phenomena across\nscales, from microbial interactions to planetary atmosphere dynamics. Bacterial\ncommunities exhibit complex competitive interactions for resources, human\norgans and tissues demonstrate specialized biochemical functions, and planetary\natmospheres are capable of displaying diverse organic and inorganic chemical\nprocesses. Despite their complexities, comparing these networks methodically\nremains a challenge due to the vast underlying degrees of freedom. In\nbiological systems, comparative genomics has been pivotal in tracing\nevolutionary trajectories and classifying organisms via DNA sequences. However,\npurely genomic classifications often fail to capture functional roles within\necological systems. Metabolic changes driven by nutrient availability highlight\nthe need for classification schemes that integrate metabolic information. Here\nwe introduce and apply a computational framework for a classification scheme of\norganisms that compares matrix representations of chemical reaction networks\nusing the Grassmann distance, corresponding to measuring distances between the\nfundamental subspaces of stoichiometric matrices. Applying this framework to\nhuman gut microbiome data confirms that metabolic distances are distinct from\nphylogenetic distances, underscoring the limitations of genetic information in\nmetabolic classification. Importantly, our analysis of metabolic distances\nreveals functional groups of organisms enriched or depleted in specific\nmetabolic processes and shows robustness to metabolically silent genetic\nperturbations. The generalizability of metabolic Grassmann distances is\nillustrated by application to chemical reaction networks in human tissue and\nplanetary atmospheres, highlighting its potential for advancing functional\ncomparisons across diverse chemical reaction systems.",
            "pdf_url": "http://arxiv.org/pdf/2503.14437v1",
            "published": "2025-03-18 17:13:58+00:00",
            "updated": "2025-03-18 17:13:58+00:00"
        },
        {
            "title": "Magnetotransport of tomographic electrons in a channel",
            "authors": "Nitay Ben-Shachar, Johannes Hofmann",
            "summary": "Hydrodynamics is a new paradigm of electron transport in high-mobility\ndevices, where frequent electron collisions give rise to a collective electron\nflow profile. However, conventional descriptions of these flows, which are\nbased on the fluid equations for a classical gas extended to include impurity\nscattering, do not account for the distinct collisional relaxation in\nquantum-mechanical systems. In particular, by dint of Pauli blocking even modes\nof the distribution function relax over significantly shorter length scales\nthan odd modes (dubbed the ``tomographic'' effect). We establish an analytical\ndescription of tomographic electron flow in a channel, and find four new\ndistinguishing features: (i) Non-equilibrium effects from the boundaries\npenetrate significantly deeper into the flow domain; (ii) an additional\nvelocity slip condition leads to a significant increase in the channel\nconductance; (iii) bulk rarefaction corrections decrease the curvature of the\nvelocity profile in the channel center; and (iv) all these anomalous transport\neffects are rapidly suppressed with magnetic fields. The latter effect leads to\na non-monotonic magneto-conductance, which can be used to measure both the\neven- and odd-mode mean free paths. Our asymptotic results unveil the\nunderlying physics of tomographic flows and provide an alternative to numerical\nsolutions of the Fermi-liquid equations.",
            "pdf_url": "http://arxiv.org/pdf/2503.14431v1",
            "published": "2025-03-18 17:09:26+00:00",
            "updated": "2025-03-18 17:09:26+00:00"
        },
        {
            "title": "Cosmos World Foundation Model Platform for Physical AI",
            "authors": "NVIDIA, :, Niket Agarwal, Arslan Ali, Maciej Bala, Yogesh Balaji, Erik Barker, Tiffany Cai, Prithvijit Chattopadhyay, Yongxin Chen, Yin Cui, Yifan Ding, Daniel Dworakowski, Jiaojiao Fan, Michele Fenzi, Francesco Ferroni, Sanja Fidler, Dieter Fox, Songwei Ge, Yunhao Ge, Jinwei Gu, Siddharth Gururani, Ethan He, Jiahui Huang, Jacob Huffman, Pooya Jannaty, Jingyi Jin, Seung Wook Kim, Gergely Klár, Grace Lam, Shiyi Lan, Laura Leal-Taixe, Anqi Li, Zhaoshuo Li, Chen-Hsuan Lin, Tsung-Yi Lin, Huan Ling, Ming-Yu Liu, Xian Liu, Alice Luo, Qianli Ma, Hanzi Mao, Kaichun Mo, Arsalan Mousavian, Seungjun Nah, Sriharsha Niverty, David Page, Despoina Paschalidou, Zeeshan Patel, Lindsey Pavao, Morteza Ramezanali, Fitsum Reda, Xiaowei Ren, Vasanth Rao Naik Sabavat, Ed Schmerling, Stella Shi, Bartosz Stefaniak, Shitao Tang, Lyne Tchapmi, Przemek Tredak, Wei-Cheng Tseng, Jibin Varghese, Hao Wang, Haoxiang Wang, Heng Wang, Ting-Chun Wang, Fangyin Wei, Xinyue Wei, Jay Zhangjie Wu, Jiashu Xu, Wei Yang, Lin Yen-Chen, Xiaohui Zeng, Yu Zeng, Jing Zhang, Qinsheng Zhang, Yuxuan Zhang, Qingqing Zhao, Artur Zolkowski",
            "summary": "Physical AI needs to be trained digitally first. It needs a digital twin of\nitself, the policy model, and a digital twin of the world, the world model. In\nthis paper, we present the Cosmos World Foundation Model Platform to help\ndevelopers build customized world models for their Physical AI setups. We\nposition a world foundation model as a general-purpose world model that can be\nfine-tuned into customized world models for downstream applications. Our\nplatform covers a video curation pipeline, pre-trained world foundation models,\nexamples of post-training of pre-trained world foundation models, and video\ntokenizers. To help Physical AI builders solve the most critical problems of\nour society, we make Cosmos open-source and our models open-weight with\npermissive licenses available via\nhttps://github.com/nvidia-cosmos/cosmos-predict1.",
            "pdf_url": "http://arxiv.org/pdf/2501.03575v2",
            "published": "2025-01-07 06:55:50+00:00",
            "updated": "2025-03-18 16:59:07+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "MusicInfuser: Making Video Diffusion Listen and Dance",
            "authors": "Susung Hong, Ira Kemelmacher-Shlizerman, Brian Curless, Steven M. Seitz",
            "summary": "We introduce MusicInfuser, an approach for generating high-quality dance\nvideos that are synchronized to a specified music track. Rather than attempting\nto design and train a new multimodal audio-video model, we show how existing\nvideo diffusion models can be adapted to align with musical inputs by\nintroducing lightweight music-video cross-attention and a low-rank adapter.\nUnlike prior work requiring motion capture data, our approach fine-tunes only\non dance videos. MusicInfuser achieves high-quality music-driven video\ngeneration while preserving the flexibility and generative capabilities of the\nunderlying models. We introduce an evaluation framework using Video-LLMs to\nassess multiple dimensions of dance generation quality. The project page and\ncode are available at https://susunghong.github.io/MusicInfuser.",
            "pdf_url": "http://arxiv.org/pdf/2503.14505v1",
            "published": "2025-03-18 17:59:58+00:00",
            "updated": "2025-03-18 17:59:58+00:00"
        },
        {
            "title": "The Power of Context: How Multimodality Improves Image Super-Resolution",
            "authors": "Kangfu Mei, Hossein Talebi, Mojtaba Ardakani, Vishal M. Patel, Peyman Milanfar, Mauricio Delbracio",
            "summary": "Single-image super-resolution (SISR) remains challenging due to the inherent\ndifficulty of recovering fine-grained details and preserving perceptual quality\nfrom low-resolution inputs. Existing methods often rely on limited image\npriors, leading to suboptimal results. We propose a novel approach that\nleverages the rich contextual information available in multiple modalities --\nincluding depth, segmentation, edges, and text prompts -- to learn a powerful\ngenerative prior for SISR within a diffusion model framework. We introduce a\nflexible network architecture that effectively fuses multimodal information,\naccommodating an arbitrary number of input modalities without requiring\nsignificant modifications to the diffusion process. Crucially, we mitigate\nhallucinations, often introduced by text prompts, by using spatial information\nfrom other modalities to guide regional text-based conditioning. Each\nmodality's guidance strength can also be controlled independently, allowing\nsteering outputs toward different directions, such as increasing bokeh through\ndepth or adjusting object prominence via segmentation. Extensive experiments\ndemonstrate that our model surpasses state-of-the-art generative SISR methods,\nachieving superior visual quality and fidelity. See project page at\nhttps://mmsr.kfmei.com/.",
            "pdf_url": "http://arxiv.org/pdf/2503.14503v1",
            "published": "2025-03-18 17:59:54+00:00",
            "updated": "2025-03-18 17:59:54+00:00"
        },
        {
            "title": "DiffMoE: Dynamic Token Selection for Scalable Diffusion Transformers",
            "authors": "Minglei Shi, Ziyang Yuan, Haotian Yang, Xintao Wang, Mingwu Zheng, Xin Tao, Wenliang Zhao, Wenzhao Zheng, Jie Zhou, Jiwen Lu, Pengfei Wan, Di Zhang, Kun Gai",
            "summary": "Diffusion models have demonstrated remarkable success in various image\ngeneration tasks, but their performance is often limited by the uniform\nprocessing of inputs across varying conditions and noise levels. To address\nthis limitation, we propose a novel approach that leverages the inherent\nheterogeneity of the diffusion process. Our method, DiffMoE, introduces a\nbatch-level global token pool that enables experts to access global token\ndistributions during training, promoting specialized expert behavior. To\nunleash the full potential of the diffusion process, DiffMoE incorporates a\ncapacity predictor that dynamically allocates computational resources based on\nnoise levels and sample complexity. Through comprehensive evaluation, DiffMoE\nachieves state-of-the-art performance among diffusion models on ImageNet\nbenchmark, substantially outperforming both dense architectures with 3x\nactivated parameters and existing MoE approaches while maintaining 1x activated\nparameters. The effectiveness of our approach extends beyond class-conditional\ngeneration to more challenging tasks such as text-to-image generation,\ndemonstrating its broad applicability across different diffusion model\napplications. Project Page: https://shiml20.github.io/DiffMoE/",
            "pdf_url": "http://arxiv.org/pdf/2503.14487v1",
            "published": "2025-03-18 17:57:07+00:00",
            "updated": "2025-03-18 17:57:07+00:00"
        },
        {
            "title": "Text-to-3D Generation using Jensen-Shannon Score Distillation",
            "authors": "Khoi Do, Binh-Son Hua",
            "summary": "Score distillation sampling is an effective technique to generate 3D models\nfrom text prompts, utilizing pre-trained large-scale text-to-image diffusion\nmodels as guidance. However, the produced 3D assets tend to be over-saturating,\nover-smoothing, with limited diversity. These issues are results from a reverse\nKullback-Leibler (KL) divergence objective, which makes the optimization\nunstable and results in mode-seeking behavior. In this paper, we derive a\nbounded score distillation objective based on Jensen-Shannon divergence (JSD),\nwhich stabilizes the optimization process and produces high-quality 3D\ngeneration. JSD can match well generated and target distribution, therefore\nmitigating mode seeking. We provide a practical implementation of JSD by\nutilizing the theory of generative adversarial networks to define an\napproximate objective function for the generator, assuming the discriminator is\nwell trained. By assuming the discriminator following a log-odds classifier, we\npropose a minority sampling algorithm to estimate the gradients of our proposed\nobjective, providing a practical implementation for JSD. We conduct both\ntheoretical and empirical studies to validate our method. Experimental results\non T3Bench demonstrate that our method can produce high-quality and diversified\n3D assets.",
            "pdf_url": "http://arxiv.org/pdf/2503.10660v2",
            "published": "2025-03-08 13:27:18+00:00",
            "updated": "2025-03-18 17:15:23+00:00"
        },
        {
            "title": "MagicComp: Training-free Dual-Phase Refinement for Compositional Video Generation",
            "authors": "Hongyu Zhang, Yufan Deng, Shenghai Yuan, Peng Jin, Zesen Cheng, Yian Zhao, Chang Liu, Jie Chen",
            "summary": "Text-to-video (T2V) generation has made significant strides with diffusion\nmodels. However, existing methods still struggle with accurately binding\nattributes, determining spatial relationships, and capturing complex action\ninteractions between multiple subjects. To address these limitations, we\npropose MagicComp, a training-free method that enhances compositional T2V\ngeneration through dual-phase refinement. Specifically, (1) During the\nConditioning Stage: We introduce the Semantic Anchor Disambiguation to\nreinforces subject-specific semantics and resolve inter-subject ambiguity by\nprogressively injecting the directional vectors of semantic anchors into\noriginal text embedding; (2) During the Denoising Stage: We propose Dynamic\nLayout Fusion Attention, which integrates grounding priors and model-adaptive\nspatial perception to flexibly bind subjects to their spatiotemporal regions\nthrough masked attention modulation. Furthermore, MagicComp is a model-agnostic\nand versatile approach, which can be seamlessly integrated into existing T2V\narchitectures. Extensive experiments on T2V-CompBench and VBench demonstrate\nthat MagicComp outperforms state-of-the-art methods, highlighting its potential\nfor applications such as complex prompt-based and trajectory-controllable video\ngeneration. Project page: https://hong-yu-zhang.github.io/MagicComp-Page/.",
            "pdf_url": "http://arxiv.org/pdf/2503.14428v1",
            "published": "2025-03-18 17:02:14+00:00",
            "updated": "2025-03-18 17:02:14+00:00"
        }
    ]
}