{
    "Physics": [
        {
            "title": "Potential failures of physics-informed machine learning in traffic flow modeling: theoretical and experimental analysis",
            "authors": "Yuan-Zheng Lei, Yaobang Gong, Dianwei Chen, Yao Cheng, Xianfeng Terry Yang",
            "summary": "This study critically examines the performance of physics-informed machine\nlearning (PIML) approaches for traffic flow modeling, defining the failure of a\nPIML model as the scenario where it underperforms both its purely data-driven\nand purely physics-based counterparts. We analyze the loss landscape by\nperturbing trained models along the principal eigenvectors of the Hessian\nmatrix and evaluating corresponding loss values. Our results suggest that\nphysics residuals in PIML do not inherently hinder optimization, contrary to a\ncommonly assumed failure cause. Instead, successful parameter updates require\nboth ML and physics gradients to form acute angles with the quasi-true gradient\nand lie within a conical region. Given inaccuracies in both the physics models\nand the training data, satisfying this condition is often difficult.\nExperiments reveal that physical residuals can degrade the performance of LWR-\nand ARZ-based PIML models, especially under highly physics-driven settings.\nMoreover, sparse sampling and the use of temporally averaged traffic data can\nproduce misleadingly small physics residuals that fail to capture actual\nphysical dynamics, contributing to model failure. We also identify the\nCourant-Friedrichs-Lewy (CFL) condition as a key indicator of dataset\nsuitability for PIML, where successful applications consistently adhere to this\ncriterion. Lastly, we observe that higher-order models like ARZ tend to have\nlarger error lower bounds than lower-order models like LWR, which is consistent\nwith the experimental findings of existing studies.",
            "pdf_url": "http://arxiv.org/pdf/2505.11491v1",
            "published": "2025-05-16 17:55:06+00:00",
            "updated": "2025-05-16 17:55:06+00:00"
        },
        {
            "title": "Tube Category, Tensor Renormalization and Topological Holography",
            "authors": "Tian Lan",
            "summary": "Ocneanu's tube algebra provides a finite algorithm to compute the Drinfeld\ncenter of a fusion category. In this work we reveal the universal property\nunderlying the tube algebra. Take a base category $\\mathcal V$ which is\nstrongly concrete, bicomplete, and closed symmetric monoidal. For physical\napplications one takes $\\mathcal V=\\mathbf{Vect}$ the category of vector\nspaces. Given a $\\mathcal V$-enriched rigid monoidal category $\\mathcal C$ (not\nnecessarily finite or semisimple) we define the tube category $\\mathbb X\n\\mathcal C$ using coends valued in $\\mathcal V$. Our main theorem established\nthe relation between (the category of representations of) the tube category\n$\\mathbb X \\mathcal C$ and the Drinfeld center $Z(\\mathcal C)$: $Z(\\mathcal\nC)\\hookrightarrow \\mathrm{Fun}(\\mathbb X \\mathcal C^{\\mathrm{op}},\\mathcal\nV)\\cong Z(\\mathcal C\\hookrightarrow\\mathrm{Fun}(\\mathcal\nC^{\\mathrm{op}},\\mathcal V))\\hookrightarrow Z(\\mathrm{Fun}(\\mathcal\nC^{\\mathrm{op}},\\mathcal V))$. Physically, besides viewing the tube category as\na version of TFT with domain being the tube, we emphasize the \"Wick-rotated\"\nperspective, that the morphisms in $\\mathbb X \\mathcal C$ are the local tensors\nof fixed-point matrix product operators which preserves the symmetry $\\mathcal\nC$ in one spatial dimension. We provide a first-principle flavored\nconstruction, from microscopic quantum degrees of freedom and operators\npreserving the symmetry, to the macroscopic universal properties of the\nsymmetry which form the Drinfeld center. Our work is thus a proof to the 1+1D\ntopological holography in a very general setting.",
            "pdf_url": "http://arxiv.org/pdf/2412.07198v2",
            "published": "2024-12-10 05:25:04+00:00",
            "updated": "2025-05-16 17:15:07+00:00"
        },
        {
            "title": "Variational cohomology and topological solitons in Yang-Mills-Chern-Simons theories",
            "authors": "Ekkehart Winterroth",
            "summary": "In cohomological formulations of the calculus of variations obstructions to\nthe existence of (global) solutions of the Euler-Lagrange equations can arise\nin principle. It seems, however, quite common to assume that such obstructions\nalways vanish, at least in the cases of interest in theoretical physics. This\nis not so: for Yang-Mills-Chern-Simons theories on compact manifolds in odd\ndimensions $\\geq 5$ we find a non trivial obstruction which leads to a quite\nstrong non existence theorem for topological solitons/instantons. The\nconsequences of this result for the Yang-Mills-Chern-Simons theories of\nholographic QCD (on $I\\!\\!R^{5}$) are discussed.",
            "pdf_url": "http://arxiv.org/pdf/2103.03037v6",
            "published": "2021-03-04 13:53:11+00:00",
            "updated": "2025-05-16 17:10:07+00:00"
        },
        {
            "title": "Reconstructing neutrinoless double beta decay event kinematics in a xenon gas detector with vertex tagging",
            "authors": "NEXT Collaboration, M. Martínez-Vara, K. Mistry, F. Pompa, B. J. P. Jones, J. Martín-Albo, M. Sorel, C. Adams, H. Almazán, V. Álvarez, B. Aparicio, A. I. Aranburu, L. Arazi, I. J. Arnquist, F. Auria-Luna, S. Ayet, C. D. R. Azevedo, K. Bailey, F. Ballester, M. del Barrio-Torregrosa, A. Bayo, J. M. Benlloch-Rodríguez, F. I. G. M. Borges, A. Brodolin, N. Byrnes, S. Cárcel, A. Castillo, E. Church, L. Cid, C. A. N. Conde, T. Contreras, F. P. Cossío, R. Coupe, E. Dey, G. Díaz, C. Echevarria, M. Elorza, J. Escada, R. Esteve, R. Felkai, L. M. P. Fernandes, P. Ferrario, A. L. Ferreira, F. W. Foss, Z. Freixa, J. García-Barrena, J. J. Gómez-Cadenas, J. W. R. Grocott, R. Guenette, J. Hauptman, C. A. O. Henriques, J. A. Hernando Morata, P. Herrero-Gómez, V. Herrero, C. Hervés Carrete, Y. Ifergan, F. Kellerer, L. Larizgoitia, A. Larumbe, P. Lebrun, F. Lopez, N. López-March, R. Madigan, R. D. P. Mano, A. P. Marques, G. Martínez-Lema, R. L. Miller, J. Molina-Canteras, F. Monrabal, C. M. B. Monteiro, F. J. Mora, K. E. Navarro, P. Novella, A. Nuñez, D. R. Nygren, E. Oblak, J. Palacio, B. Palmeiro, A. Para, I. Parmaksiz, A. Pazos, J. Pelegrin, M. Pérez Maneiro, M. Querol, J. Renner, I. Rivilla, C. Rogero, L. Rogers, B. Romeo, C. Romo-Luque, V. San Nacienciano, F. P. Santos, J. M. F. dos Santos, M. Seemann, I. Shomroni, P. A. O. C. Silva, A. Simón, S. R. Soleti, J. Soto-Oton, J. M. R. Teixeira, S. Teruel-Pardo, J. F. Toledo, C. Tonnelé, S. Torelli, J. Torrent, A. Trettin, A. Usón, P. R. G. Valle, J. F. C. A. Veloso, J. Waiton, A. Yubero-Navarro",
            "summary": "If neutrinoless double beta decay is discovered, the next natural step would\nbe understanding the lepton number violating physics responsible for it.\nSeveral alternatives exist beyond the exchange of light neutrinos. Some of\nthese mechanisms can be distinguished by measuring phase-space observables,\nnamely the opening angle $\\cos\\theta$ among the two decay electrons, and the\nelectron energy spectra, $T_1$ and $T_2$. In this work, we study the\nstatistical accuracy and precision in measuring these kinematic observables in\na future xenon gas detector with the added capability to precisely locate the\ndecay vertex. For realistic detector conditions (a gas pressure of 10 bar and\nspatial resolution of 4 mm), we find that the average $\\overline{\\cos\\theta}$\nand $\\overline{T_1}$ values can be reconstructed with a precision of 0.19 and\n110 keV, respectively, assuming that only 10 neutrinoless double beta decay\nevents are detected.",
            "pdf_url": "http://arxiv.org/pdf/2502.10198v2",
            "published": "2025-02-14 14:45:04+00:00",
            "updated": "2025-05-16 17:07:53+00:00"
        },
        {
            "title": "Reconfigurable Integrated Photonic Chips as Dual-Purpose Neuromorphic Accelerators and Physical Unclonable Functions",
            "authors": "George Sarantoglou, Francesco Da Ros, Kostas Sozos, Adonis Bogris, Charis Mesaritakis",
            "summary": "In this work, we experimentally validate the dual use of a reconfigurable\nphotonic integrated mesh as a neuromorphic accelerator, targeting signal\nequalization, and as a physical unclonable function offering authentication at\nthe hardware level. The processing node is an optical spectrum slicing\nself-coherent transceiver targeting the mitigation of dispersion impairments of\nan intensity detected QPSK signal, after 25 km of transmission at 32 Gbaud.\nUnavoidable fabrication related imperfections of the nodes, such as waveguide\nroughness, can act as fingerprints of the device, and, during neuromorphic\nprocessing, result in unique weights at the digital back-end during signal\nequalization. Extracted security metrics offer low false positive/negative\nprobability for the generated responses, confirming un-clonability, whereas\nbit-error-ratio for the QPSK equalization task was always below the hardware\nforward error correction limit. The experimental results substantiate the\ncapability of the proposed scheme to simultaneously act as an accelerator and\nas a security token.",
            "pdf_url": "http://arxiv.org/pdf/2505.11448v1",
            "published": "2025-05-16 17:05:15+00:00",
            "updated": "2025-05-16 17:05:15+00:00"
        },
        {
            "title": "Non-Perturbative Random Matrix Model of ${\\cal N}=2$ JT Supergravity",
            "authors": "Clifford V. Johnson",
            "summary": "It is shown how to non-perturbatively define a random matrix model that\ncaptures key physics of ${\\cal N}{=}2$ Jackiw-Teitelboim (JT) supergravity,\ngoing well beyond the perturbative topological expansion defined recently by\nTuriaci and Witten. A decomposition into an infinite family of certain\nmulticritical models is derived, leading to the definition of a non-linear\ndifferential equation from which the physics may be computed. BPS states are\nnaturally described by the model. The non-perturbative completions of the\nspectral densities for non-BPS multiplets are readily extracted.",
            "pdf_url": "http://arxiv.org/pdf/2306.10139v4",
            "published": "2023-06-16 18:50:38+00:00",
            "updated": "2025-05-16 17:04:31+00:00"
        },
        {
            "title": "VideoHallu: Evaluating and Mitigating Multi-modal Hallucinations on Synthetic Video Understanding",
            "authors": "Zongxia Li, Xiyang Wu, Guangyao Shi, Yubin Qin, Hongyang Du, Tianyi Zhou, Dinesh Manocha, Jordan Lee Boyd-Graber",
            "summary": "Synthetic video generation has gained significant attention for its realism\nand broad applications, but remains prone to violations of common sense and\nphysical laws. This highlights the need for reliable abnormality detectors that\nunderstand such principles and are robust to hallucinations. To address this,\nwe introduce VideoHallu, a benchmark of over 3,000 video QA pairs built from\nsynthetic videos generated by models like Veo2, Sora, and Kling, paired with\nexpert-crafted counterintuitive QA to evaluate the critical thinking abilities\nof Multi-modal Large Language Models (MLLMs) on abnormalities that are\nperceptually obvious to humans but often hallucinated due to language priors.\nVideoHallu evaluates MLLMs' abnormality detection abilities with examples\nacross alignment, consistency, commonsense, and physics. We benchmark SOTA\nMLLMs, including GPT-4o, Gemini-2.5-Pro, Qwen2.5-VL, Video-R1, and\nVideoChat-R1. We observe that these models perform well on many real-world\nbenchmarks like MVBench and MovieChat, but still struggle with basic\nphysics-based and commonsense reasoning in synthetic videos. We further show\nthat post-training with Group Relative Policy Optimization (GRPO), using\ncurriculum learning on datasets combining video QA with counterintuitive\ncommonsense and physics reasoning over real and synthetic videos, improves\nMLLMs' abnormality detection and critical thinking, demonstrating the value of\ntargeted training for improving their understanding of commonsense and physical\nlaws.",
            "pdf_url": "http://arxiv.org/pdf/2505.01481v2",
            "published": "2025-05-02 15:58:38+00:00",
            "updated": "2025-05-16 16:58:10+00:00"
        },
        {
            "title": "Inferring correlated distributions: boosted top jets",
            "authors": "Ezequiel Alvarez, Manuel Szewc, Alejandro Szynkman, Santiago Tanco, Tatiana Tarutina",
            "summary": "Improving the understanding of signal and background distributions in\nsignal-region is a valuable key to enhance any analysis in collider physics.\nThis is usually a difficult task because -- among others -- signal and\nbackgrounds are hard to discriminate in signal-region, simulations may reach a\nlimit of reliability if they need to model non-perturbative QCD, and\ndistributions are multi-dimensional and many times may be correlated within\neach class. Bayesian density estimation is a technique that leverages prior\nknowledge and data correlations to effectively extract information from data in\nsignal-region. In this work we extend previous works on data-driven mixture\nmodels for meaningful unsupervised signal extraction in collider physics to\nincorporate correlations between features. Using a standard dataset of top and\nQCD jets, we show how simulators, despite having an expected bias, can be used\nto inject sufficient inductive nuance into an inference model in terms of\npriors to then be corrected by data and estimate the true correlated\ndistributions between features within each class. We compare the model with and\nwithout correlations to show how the signal extraction is sensitive to their\ninclusion and we quantify the improvement due to the inclusion of correlations\nusing both supervised and unsupervised metrics.",
            "pdf_url": "http://arxiv.org/pdf/2505.11438v1",
            "published": "2025-05-16 16:57:42+00:00",
            "updated": "2025-05-16 16:57:42+00:00"
        },
        {
            "title": "GODBench: A Benchmark for Multimodal Large Language Models in Video Comment Art",
            "authors": "Chenkai Zhang, Yiming Lei, Zeming Liu, Haitao Leng, Shaoguo Liu, Tingting Gao, Qingjie Liu, Yunhong Wang",
            "summary": "Video Comment Art enhances user engagement by providing creative content that\nconveys humor, satire, or emotional resonance, requiring a nuanced and\ncomprehensive grasp of cultural and contextual subtleties. Although Multimodal\nLarge Language Models (MLLMs) and Chain-of-Thought (CoT) have demonstrated\nstrong reasoning abilities in STEM tasks (e.g. mathematics and coding), they\nstill struggle to generate creative expressions such as resonant jokes and\ninsightful satire. Moreover, existing benchmarks are constrained by their\nlimited modalities and insufficient categories, hindering the exploration of\ncomprehensive creativity in video-based Comment Art creation. To address these\nlimitations, we introduce GODBench, a novel benchmark that integrates video and\ntext modalities to systematically evaluate MLLMs' abilities to compose Comment\nArt. Furthermore, inspired by the propagation patterns of waves in physics, we\npropose Ripple of Thought (RoT), a multi-step reasoning framework designed to\nenhance the creativity of MLLMs. Extensive experiments reveal that existing\nMLLMs and CoT methods still face significant challenges in understanding and\ngenerating creative video comments. In contrast, RoT provides an effective\napproach to improve creative composing, highlighting its potential to drive\nmeaningful advancements in MLLM-based creativity. GODBench is publicly\navailable at https://github.com/stan-lei/GODBench-ACL2025.",
            "pdf_url": "http://arxiv.org/pdf/2505.11436v1",
            "published": "2025-05-16 16:56:40+00:00",
            "updated": "2025-05-16 16:56:40+00:00"
        },
        {
            "title": "Unified Quantum Dynamics: The Emergence of the Born Rule",
            "authors": "Martin Weidner",
            "summary": "While the Born rule is traditionally introduced as a separate postulate of\nquantum mechanics, we show it emerges naturally from a modified Schr\\\"odinger\nequation that includes \"small-signal truncation\". This parallels the way\nquantum decoherence gives rise to the branches of the multiverse in the\n\"Many-Worlds Interpretation\", eliminating the need for a separate measurement\npostulate. Our approach thus offers a unified framework in which both the\nemergence of multiple branches of the multiverse and their statistical\nproperties follow from a single fundamental law of motion. We model\n\"small-signal truncation\" in a somewhat stylized manner, but we argue that the\nprecise details of its underlying physical mechanism do not affect the\nemergence of the Born rule.",
            "pdf_url": "http://arxiv.org/pdf/2504.06495v2",
            "published": "2025-04-08 23:43:16+00:00",
            "updated": "2025-05-16 16:47:40+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Fast and Robust Visuomotor Riemannian Flow Matching Policy",
            "authors": "Haoran Ding, Noémie Jaquier, Jan Peters, Leonel Rozo",
            "summary": "Diffusion-based visuomotor policies excel at learning complex robotic tasks\nby effectively combining visual data with high-dimensional, multi-modal action\ndistributions. However, diffusion models often suffer from slow inference due\nto costly denoising processes or require complex sequential training arising\nfrom recent distilling approaches. This paper introduces Riemannian Flow\nMatching Policy (RFMP), a model that inherits the easy training and fast\ninference capabilities of flow matching (FM). Moreover, RFMP inherently\nincorporates geometric constraints commonly found in realistic robotic\napplications, as the robot state resides on a Riemannian manifold. To enhance\nthe robustness of RFMP, we propose Stable RFMP (SRFMP), which leverages\nLaSalle's invariance principle to equip the dynamics of FM with stability to\nthe support of a target Riemannian distribution. Rigorous evaluation on eight\nsimulated and real-world tasks show that RFMP successfully learns and\nsynthesizes complex sensorimotor policies on Euclidean and Riemannian spaces\nwith efficient training and inference phases, outperforming Diffusion Policies\nand Consistency Policies.",
            "pdf_url": "http://arxiv.org/pdf/2412.10855v2",
            "published": "2024-12-14 15:03:33+00:00",
            "updated": "2025-05-16 17:41:41+00:00"
        },
        {
            "title": "Exploratory Diffusion Model for Unsupervised Reinforcement Learning",
            "authors": "Chengyang Ying, Huayu Chen, Xinning Zhou, Zhongkai Hao, Hang Su, Jun Zhu",
            "summary": "Unsupervised reinforcement learning (URL) aims to pre-train agents by\nexploring diverse states or skills in reward-free environments, facilitating\nefficient adaptation to downstream tasks. As the agent cannot access extrinsic\nrewards during unsupervised exploration, existing methods design intrinsic\nrewards to model the explored data and encourage further exploration. However,\nthe explored data are always heterogeneous, posing the requirements of powerful\nrepresentation abilities for both intrinsic reward models and pre-trained\npolicies. In this work, we propose the Exploratory Diffusion Model (ExDM),\nwhich leverages the strong expressive ability of diffusion models to fit the\nexplored data, simultaneously boosting exploration and providing an efficient\ninitialization for downstream tasks. Specifically, ExDM can accurately estimate\nthe distribution of collected data in the replay buffer with the diffusion\nmodel and introduces the score-based intrinsic reward, encouraging the agent to\nexplore less-visited states. After obtaining the pre-trained policies, ExDM\nenables rapid adaptation to downstream tasks. In detail, we provide theoretical\nanalyses and practical algorithms for fine-tuning diffusion policies,\naddressing key challenges such as training instability and computational\ncomplexity caused by multi-step sampling. Extensive experiments demonstrate\nthat ExDM outperforms existing SOTA baselines in efficient unsupervised\nexploration and fast fine-tuning downstream tasks, especially in structurally\ncomplicated environments.",
            "pdf_url": "http://arxiv.org/pdf/2502.07279v2",
            "published": "2025-02-11 05:48:51+00:00",
            "updated": "2025-05-16 17:18:02+00:00"
        },
        {
            "title": "A Generative Framework for Causal Estimation via Importance-Weighted Diffusion Distillation",
            "authors": "Xinran Song, Tianyu Chen, Mingyuan Zhou",
            "summary": "Estimating individualized treatment effects from observational data is a\ncentral challenge in causal inference, largely due to covariate imbalance and\nconfounding bias from non-randomized treatment assignment. While inverse\nprobability weighting (IPW) is a well-established solution to this problem, its\nintegration into modern deep learning frameworks remains limited. In this work,\nwe propose Importance-Weighted Diffusion Distillation (IWDD), a novel\ngenerative framework that combines the pretraining of diffusion models with\nimportance-weighted score distillation to enable accurate and fast causal\nestimation-including potential outcome prediction and treatment effect\nestimation. We demonstrate how IPW can be naturally incorporated into the\ndistillation of pretrained diffusion models, and further introduce a\nrandomization-based adjustment that eliminates the need to compute IPW\nexplicitly-thereby simplifying computation and, more importantly, provably\nreducing the variance of gradient estimates. Empirical results show that IWDD\nachieves state-of-the-art out-of-sample prediction performance, with the\nhighest win rates compared to other baselines, significantly improving causal\nestimation and supporting the development of individualized treatment\nstrategies. We will release our PyTorch code for reproducibility and future\nresearch.",
            "pdf_url": "http://arxiv.org/pdf/2505.11444v1",
            "published": "2025-05-16 17:00:52+00:00",
            "updated": "2025-05-16 17:00:52+00:00"
        },
        {
            "title": "Diffusion Learning with Partial Agent Participation and Local Updates",
            "authors": "Elsa Rizk, Kun Yuan, Ali H. Sayed",
            "summary": "Diffusion learning is a framework that endows edge devices with advanced\nintelligence. By processing and analyzing data locally and allowing each agent\nto communicate with its immediate neighbors, diffusion effectively protects the\nprivacy of edge devices, enables real-time response, and reduces reliance on\ncentral servers. However, traditional diffusion learning relies on\ncommunication at every iteration, leading to communication overhead, especially\nwith large learning models. Furthermore, the inherent volatility of edge\ndevices, stemming from power outages or signal loss, poses challenges to\nreliable communication between neighboring agents. To mitigate these issues,\nthis paper investigates an enhanced diffusion learning approach incorporating\nlocal updates and partial agent participation. Local updates will curtail\ncommunication frequency, while partial agent participation will allow for the\ninclusion of agents based on their availability. We prove that the resulting\nalgorithm is stable in the mean-square error sense and provide a tight analysis\nof its Mean-Square-Deviation (MSD) performance. Various numerical experiments\nare conducted to illustrate our theoretical findings.",
            "pdf_url": "http://arxiv.org/pdf/2505.11307v1",
            "published": "2025-05-16 14:33:49+00:00",
            "updated": "2025-05-16 14:33:49+00:00"
        },
        {
            "title": "Effective Probabilistic Time Series Forecasting with Fourier Adaptive Noise-Separated Diffusion",
            "authors": "Xinyan Wang, Rui Dai, Kaikui Liu, Xiangxiang Chu",
            "summary": "We propose the Fourier Adaptive Lite Diffusion Architecture (FALDA), a novel\nprobabilistic framework for time series forecasting. First, we introduce the\nDiffusion Model for Residual Regression (DMRR) framework, which unifies\ndiffusion-based probabilistic regression methods. Within this framework, FALDA\nleverages Fourier-based decomposition to incorporate a component-specific\narchitecture, enabling tailored modeling of individual temporal components. A\nconditional diffusion model is utilized to estimate the future noise term,\nwhile our proposed lightweight denoiser, DEMA (Decomposition MLP with AdaLN),\nconditions on the historical noise term to enhance denoising performance.\nThrough mathematical analysis and empirical validation, we demonstrate that\nFALDA effectively reduces epistemic uncertainty, allowing probabilistic\nlearning to primarily focus on aleatoric uncertainty. Experiments on six\nreal-world benchmarks demonstrate that FALDA consistently outperforms existing\nprobabilistic forecasting approaches across most datasets for long-term time\nseries forecasting while achieving enhanced computational efficiency without\ncompromising accuracy. Notably, FALDA also achieves superior overall\nperformance compared to state-of-the-art (SOTA) point forecasting approaches,\nwith improvements of up to 9%.",
            "pdf_url": "http://arxiv.org/pdf/2505.11306v1",
            "published": "2025-05-16 14:32:34+00:00",
            "updated": "2025-05-16 14:32:34+00:00"
        }
    ]
}