{
    "Physics": [
        {
            "title": "When Geometry Radiates Review: Gravitational Waves in Theory, Cosmology, and Observation",
            "authors": "Azadeh Maleknejad",
            "summary": "Gravitational waves provide a unique window into gravity, cosmology, and high-energy physics, enabling the exploration of fundamental phenomena across a wide range of scales. This review presents a coherent and pedagogical framework that bridges foundational theory with observational frontiers. We begin by developing the theory of gravitational radiation within linearized general relativity, deriving gravitational waves as solutions to the linearized Einstein equations and clarifying their physical interpretation, polarization states, and key properties. We then deepen the discussion through a geometric perspective, tracing the connection between gravitational radiation and the algebraic structure of the Weyl tensor and its role in defining energy and angular momentum in asymptotically flat spacetimes. Extending beyond flat backgrounds, we examine gravitational waves in an expanding universe, following their evolution across cosmological epochs and their generation during inflation. Within this setting, we discuss adiabatic modes and consistency relations that reveal universal properties of long-wavelength perturbations, and derive the inflationary spectrum of vacuum gravitational waves together with their contribution to the integrated Sachs-Wolfe effect. We also survey the main observational strategies for detecting gravitational waves across a broad frequency range, including cosmic microwave background polarization, pulsar timing arrays, ground- and space-based laser interferometers, and resonant cavity detectors. We then discuss the astrophysical and cosmological mechanisms responsible for generating gravitational radiation. We conclude by summarizing the current status of the field and outlining promising directions for future theoretical and observational developments.",
            "pdf_url": "https://arxiv.org/pdf/2512.21328v1",
            "published": "2025-12-24 18:57:18+00:00",
            "updated": "2025-12-24 18:57:18+00:00"
        },
        {
            "title": "Variationally correct operator learning: Reduced basis neural operator with a posteriori error estimation",
            "authors": "Yuan Qiu, Wolfgang Dahmen, Peng Chen",
            "summary": "Minimizing PDE-residual losses is a common strategy to promote physical consistency in neural operators. However, standard formulations often lack variational correctness, meaning that small residuals do not guarantee small solution errors due to the use of non-compliant norms or ad hoc penalty terms for boundary conditions. This work develops a variationally correct operator learning framework by constructing first-order system least-squares (FOSLS) objectives whose values are provably equivalent to the solution error in PDE-induced norms. We demonstrate this framework on stationary diffusion and linear elasticity, incorporating mixed Dirichlet-Neumann boundary conditions via variational lifts to preserve norm equivalence without inconsistent penalties. To ensure the function space conformity required by the FOSLS loss, we propose a Reduced Basis Neural Operator (RBNO). The RBNO predicts coefficients for a pre-computed, conforming reduced basis, thereby ensuring variational stability by design while enabling efficient training. We provide a rigorous convergence analysis that bounds the total error by the sum of finite element discretization bias, reduced basis truncation error, neural network approximation error, and statistical estimation errors arising from finite sampling and optimization. Numerical benchmarks validate these theoretical bounds and demonstrate that the proposed approach achieves superior accuracy in PDE-compliant norms compared to standard baselines, while the residual loss serves as a reliable, computable a posteriori error estimator.",
            "pdf_url": "https://arxiv.org/pdf/2512.21319v1",
            "published": "2025-12-24 18:37:59+00:00",
            "updated": "2025-12-24 18:37:59+00:00"
        },
        {
            "title": "On the interaction of dilatancy and friction in the behavior of fluid-saturated sheared granular materials: a coupled Computational Fluid Dynamics--Discrete Element Method study",
            "authors": "Bimal Chhushyabaga, Behrooz Ferdowsi",
            "summary": "Frictional instabilities in fluid saturated granular materials underlie natural hazards, including submarine landslides and earthquake initiation. Experiments show distinct failure behaviors under subaerial and subaqueous conditions due to coupled deformation, interparticle friction, and particle fluid interactions. We use three-dimensional coupled computational fluid dynamics, discrete element method (CFD - DEM) to investigate collapse and runout of dense and loose granular assemblies in both environments. Parametric analyses show that pore pressure evolution controls failure mode in saturated settings (fast vs slow sliding), consistent with prior laboratory experiments and lattice Boltzmann discrete element simulations: dense assemblies stabilize via dilation, whereas loose assemblies compact rapidly and transiently fluidize. At mesoscale, we coarse grain particle contact statistics and Eulerian fluid fields to define apparent friction and normalized pore pressure, and organize inertial and viscous responses using log10(In/Iv). Spatiotemporal analyses of these coarse grained fields reveal strain rate dependent behavior governed by evolving porosity and effective stress. In both environments, friction in failure shear zone is rate-strengthening with respect to inertial number (In, for dry) and viscous number (Iv, for fluid-saturated). We further utilize mesoscale stress framework to compare evolution of pore pressure in CFD - DEM of subaqueous slope collapse with an analytical solution for development of failure front, using inputs derived from numerical triaxial DEM tests on same assemblies. The analytical model reproduces steady-state excess pore pressures and captures fluid-particle coupling, but mismatch near failure onset suggests transient frictional effects. These results support physics-based hazard models and improve mechanistic understanding of saturated granular failure.",
            "pdf_url": "https://arxiv.org/pdf/2508.00786v2",
            "published": "2025-08-01 17:10:31+00:00",
            "updated": "2025-12-24 18:18:09+00:00"
        },
        {
            "title": "Transcriptome-Conditioned Personalized De Novo Drug Generation for AML Using Metaheuristic Assembly and Target-Driven Filtering",
            "authors": "Abdullah G. Elafifi, Basma Mamdouh, Mariam Hanafy, Muhammed Alaa Eldin, Yosef Khaled, Nesma Mohamed El-Gelany, Tarek H. M. Abou-El-Enien",
            "summary": "Acute Myeloid Leukemia (AML) remains a clinical challenge due to its extreme molecular heterogeneity and high relapse rates. While precision medicine has introduced mutation-specific therapies, many patients still lack effective, personalized options. This paper presents a novel, end-to-end computational framework that bridges the gap between patient-specific transcriptomics and de novo drug discovery. By analyzing bulk RNA sequencing data from the TCGA-LAML cohort, the study utilized Weighted Gene Co-expression Network Analysis (WGCNA) to prioritize 20 high-value biomarkers, including metabolic transporters like HK3 and immune-modulatory receptors such as SIGLEC9. The physical structures of these targets were modeled using AlphaFold3, and druggable hotspots were quantitatively mapped via the DOGSiteScorer engine. Then developed a novel, reaction-first evolutionary metaheuristic algorithm as well as multi-objective optimization programming that assembles novel ligands from fragment libraries, guided by spatial alignment to these identified hotspots. The generative model produced structurally unique chemical entities with a strong bias toward drug-like space, as evidenced by QED scores peaking between 0.5 and 0.7. Validation through ADMET profiling and SwissDock molecular docking identified high-confidence candidates, such as Ligand L1, which achieved a binding free energy of -6.571 kcal/mol against the A08A96 biomarker. These results demonstrate that integrating systems biology with metaheuristic molecular assembly can produce pharmacologically viable, patient tailored leads, offering a scalable blueprint for precision oncology in AML and beyond",
            "pdf_url": "https://arxiv.org/pdf/2512.21301v1",
            "published": "2025-12-24 17:39:37+00:00",
            "updated": "2025-12-24 17:39:37+00:00"
        },
        {
            "title": "T-Duality Effects in Electrodynamics: The (2+1)-dimensional Case",
            "authors": "Patricio Gaete, Piero Nicolini",
            "summary": "We investigate the interplay between T-duality and (2+1)- dimensional electrodynamics, revealing a relationship between short and large length scales of the gauge potential. Our findings demonstrate that the electrostatic potential energy between static charges is no longer divergent at short distances in the presence of T-duality effects. It remains logarithmic at large distances, suggesting the possibility of a regulatory role for the T-duality scale \\( l_0 \\) in the space where the radial coordinate goes into its inverse. We also discuss the potential of T-duality to elucidate fractalization effects in physical systems, paving the way for future research on the implications for superconductors and condensed matter systems in general.",
            "pdf_url": "https://arxiv.org/pdf/2512.21291v1",
            "published": "2025-12-24 17:15:46+00:00",
            "updated": "2025-12-24 17:15:46+00:00"
        },
        {
            "title": "Evidence of Coherent Elastic Neutrino-Nucleus Scattering with COHERENT's Germanium Array",
            "authors": "S. Adamski, M. Ahn, P. S. Barbeau, V. Belov, I. Bernardi, C. Bock, A. Bolozdynya, R. Bouabid, J. Browning, B. Cabrera-Palmer, N. Cedarblade-Jones, A. I. Colón Rivera, E. Conley, V. da Silva, J. Daughhetee, J. Detwiler, K. Ding, M. R. Durand, Y. Efremenko, S. R. Elliott, A. Erlandson, L. Fabris, A. Galindo-Uribarri, M. P. Green, J. Hakenmüller, M. R. Heath, S. Hedges, H. Jeong, B. A. Johnson, T. Johnson, H. Jones, A. Khromov, D. Kim, A. Konovalov, E. Kozlova, A. Kumpan, O. Kyzylova, Y. Lee, G. Li, L. Li, J. M. Link, J. Liu, M. Luxnat, A. Major, K. Mann, D. M. Markoff, J. Mattingly, J. Moye, P. E. Mueller, J. Newby, N. Ogoi, J. O'Reilly, D. S. Parno, D. Pérez-Loureiro, D. Pershey, C. G. Prior, J. Queen, R. Rapp, H. Ray, O. Razuvaeva, D. Reyna, G. C. Rich, D. Rudik, J. Runge, D. J. Salvat, J. Sander, K. Scholberg, A. Shakirov, G. Simakov, W. M. Snow, V. Sosnovtsev, M. Stringer, T. Subedi, B. Suh, B. Sur, R. Tayloe, K. Tellez-Giron-Flores, Y. -T. Tsai, E. E. van Nieuwenhuizen, C. J. Virtue, G. Visser, K. Walkup, E. M. Ward, T. Wongjirad, Y. Yang, J. Yoo, C. -H. Yu, A. Zaalishvili",
            "summary": "We report the first detection of coherent elastic neutrino-nucleus scattering (CEvNS) on natural germanium, measured at the Spallation Neutron Source at Oak Ridge National Laboratory. The Ge-Mini detector of the COHERENT collaboration employs large-mass, low-noise, high-purity germanium spectrometers, enabling excellent energy resolution, and an analysis threshold of 1.5 keV electron-equivalent ionization energy. We observe a on-beam excess of 20.6 +7.1 -6.3 counts with a total exposure of 10.22 GWhkg and we reject the no-CEvNS hypothesis with 3.9 sigma significance. The result agrees with the predicted standard model of particle physics signal rate within 2 sigma.",
            "pdf_url": "https://arxiv.org/pdf/2406.13806v2",
            "published": "2024-06-19 20:14:13+00:00",
            "updated": "2025-12-24 17:15:02+00:00"
        },
        {
            "title": "Impurity peaking of SPARC H-modes: a sensitivity study on physics and engineering assumptions",
            "authors": "Marco Muraca, Pablo Rodriguez-Fernandez, Joe Hall, Nathaniel T. Howard, Daniel Fajardo, Giovanni Tardini, Benedikt Zimmermann, Thomas Body",
            "summary": "In this paper, an overview of the impurity transport for three H-mode plasmas in the upcoming SPARC tokamak has been provided. The simulations have been performed within the ASTRA+STRAHL framework, using FACIT and TGLF-SAT2 to predict, respectively, neoclassical and turbulent core transport, while a neural network trained on EPED simulations has been employed to calculate the pedestal height and width self-consistently. A benchmark with previous simulations at constant impurity fraction has been provided for three H-modes, spanning different plasma current and magnetic field values. For a scenario, additional simulations have been performed to account for uncertainties in the modeling assumptions. The predictions are nearly insensitive to changes in the top of pedestal W concentrations. Varying the Ar pedestal concentration has shown a small effect on the impurity peaking and nearly constant fusion gain values, due to multiple effects on pedestal pressure, main ion dilution and density peaking. The inclusion of rotation in ASTRA simulations has shown minimal impact on confinement and impurity transport predictions. An exploratory study has been provided with a first set of simulations treating D and T separately, experiencing a maximum fusion power at 55-45% DT fuel composition, and an asymmetric distribution with respect to the D concentration. All the results, including sensitivity scans of toroidal velocity and ion temperature and density gradients, highlighted that turbulent impurity transport prevails on the neoclassical component, aligning with previous ITER predictions, and suggesting that next generation devices like SPARC, operating at low collisionality, will experience low W accumulation.",
            "pdf_url": "https://arxiv.org/pdf/2512.21286v1",
            "published": "2025-12-24 17:08:46+00:00",
            "updated": "2025-12-24 17:08:46+00:00"
        },
        {
            "title": "Fault-tolerant dynamically-decoupled hyper-Ramsey spectroscopy of ultra-narrow clock transitions",
            "authors": "T. Zanon-Willette, B. Ilikj, D. Wilkowski, B. Darquié, N. V. Vitanov",
            "summary": "Hyper-Ramsey protocols effectively reduce AC-Stark shifts in probing ultra-narrow optical clock transitions but they remain sensitive to laser intensity noise, decoherence, frequency drifts, and low-frequency perturbations. We address these limitations by incorporating dynamical decoupling, using sequences of rotary Hahn-echo pulses that toggle the probe frequency detuning and phase between opposite signs. Implementing time-optimized Eulerian cycling circuits of multiple refocusing pulses, we generate high-contrast hyper-Ramsey interferences that are completely free from AC-Stark shifts and robust against environmental noise and laser probe parameters imperfections. We demonstrate the robustness of our dynamically-decoupled hyper-Ramsey interrogation scheme by implementing it directly at the pulse level on a superconducting quantum processing unit. Fault tolerant dynamically-decoupled SU(2) hyper-clocks are a significant step toward universal, noise resilient quantum sensors, enabling fault-tolerant metrology for searches about new physics beyond the Standard Model.",
            "pdf_url": "https://arxiv.org/pdf/2506.23091v4",
            "published": "2025-06-29 05:12:04+00:00",
            "updated": "2025-12-24 17:07:33+00:00"
        },
        {
            "title": "Multivariate scaling of proton and ion energies, divergence, and charge states in Target Normal Sheath Acceleration",
            "authors": "Vasiliki E. Alexopoulou",
            "summary": "The interaction of an intense laser pulse with a solid target produces energetic proton and ion beams through the Target Normal Sheath Acceleration (TNSA) mechanism. Such beams are under active investigation for applications in proton beam therapy, materials modification, and nuclear and high-energy-density physics. Despite extensive experimental and theoretical effort, predictive correlations between laser and target parameters and the resulting ion-beam properties remain an open research question, owing to the intrinsically multiphysics and strongly coupled nature of laser-plasma interactions. Here, we employ our unified multiphysics model that reproduces laser-solid interaction dynamics with accuracy exceeding 95% over a broad range of short- and ultrashort-pulse conditions. Using this model, we derive statistically validated scaling laws and probability maps that correlate proton, carbon, and oxygen ion cutoff energies, beam divergences, and ionization states to a wide set of laser and target parameters, including pulse duration, laser power, laser beam spot, target thickness, prepulse-main pulse interval, contrast, laser wavelength, and polarization. Continuous beam properties (cutoff energies and beam divergences) are described using multivariate regression with cross-validation, while discrete ionization states are analyzed using classification and regression tree (CART) methods, enabling nonlinear and threshold-dependent behavior to be captured. The resulting scaling relations, contour maps, and box plots elucidate the coupled roles of laser pulse, and target geometry in governing TNSA ion acceleration and charge-state formation. These results provide a predictive and physically interpretable framework for understanding and optimizing laser-driven ion sources across a wide parameter space.",
            "pdf_url": "https://arxiv.org/pdf/2512.21279v1",
            "published": "2025-12-24 16:58:25+00:00",
            "updated": "2025-12-24 16:58:25+00:00"
        },
        {
            "title": "Agnostic Process Tomography",
            "authors": "Chirag Wadhwa, Laura Lewis, Elham Kashefi, Mina Doosti",
            "summary": "Characterizing a quantum system by learning its state or evolution is a fundamental problem in quantum physics and learning theory with a myriad of applications. Recently, as a new approach to this problem, the task of agnostic state tomography was defined, in which one aims to approximate an arbitrary quantum state by a simpler one in a given class. Generalizing this notion to quantum processes, we initiate the study of agnostic process tomography: given query access to an unknown quantum channel $Φ$ and a known concept class $\\mathcal{C}$ of channels, output a quantum channel that approximates $Φ$ as well as any channel in the concept class $\\mathcal{C}$, up to some error. In this work, we propose several natural applications for this new task in quantum machine learning, quantum metrology, classical simulation, and error mitigation. In addition, we give efficient agnostic process tomography algorithms for a wide variety of concept classes, including Pauli strings, Pauli channels, quantum junta channels, low-degree channels, and a class of channels produced by $\\mathsf{QAC}^0$ circuits. The main technical tool we use is Pauli spectrum analysis of operators and superoperators. We also prove that, using ancilla qubits, any agnostic state tomography algorithm can be extended to one solving agnostic process tomography for a compatible concept class of unitaries, immediately giving us efficient agnostic learning algorithms for Clifford circuits, Clifford circuits with few T gates, and circuits consisting of a tensor product of single-qubit gates. Together, our results provide insight into the conditions and new algorithms necessary to extend the learnability of a concept class from the standard tomographic setting to the agnostic one.",
            "pdf_url": "https://arxiv.org/pdf/2410.11957v2",
            "published": "2024-10-15 18:00:13+00:00",
            "updated": "2025-12-24 16:49:53+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Optimizing Decoding Paths in Masked Diffusion Models by Quantifying Uncertainty",
            "authors": "Ziyu Chen, Xinbei Jiang, Peng Sun, Tao Lin",
            "summary": "Masked Diffusion Models (MDMs) offer flexible, non-autoregressive generation, but this freedom introduces a challenge: final output quality is highly sensitive to the decoding order. We are the first to formalize this issue, attributing the variability in output quality to the cumulative predictive uncertainty along a generative path. To quantify this uncertainty, we introduce Denoising Entropy, a computable metric that serves as an internal signal for evaluating generative process. Leveraging this metric, we propose two algorithms designed to optimize the decoding path: a post-hoc selection method and a real-time guidance strategy. Experiments demonstrate that our entropy-guided methods significantly improve generation quality, consistently boosting accuracy on challenging reasoning, planning, and code benchmarks. Our work establishes Denoising Entropy as a principled tool for understanding and controlling generation, effectively turning the uncertainty in MDMs from a liability into a key advantage for discovering high-quality solutions.",
            "pdf_url": "https://arxiv.org/pdf/2512.21336v1",
            "published": "2025-12-24 18:59:51+00:00",
            "updated": "2025-12-24 18:59:51+00:00"
        },
        {
            "title": "DiTSinger: Scaling Singing Voice Synthesis with Diffusion Transformer and Implicit Alignment",
            "authors": "Zongcai Du, Guilin Deng, Xiaofeng Guo, Xin Gao, Linke Li, Kaichang Cheng, Fubo Han, Siyu Yang, Peng Liu, Pan Zhong, Qiang Fu",
            "summary": "Recent progress in diffusion-based Singing Voice Synthesis (SVS) demonstrates strong expressiveness but remains limited by data scarcity and model scalability. We introduce a two-stage pipeline: a compact seed set of human-sung recordings is constructed by pairing fixed melodies with diverse LLM-generated lyrics, and melody-specific models are trained to synthesize over 500 hours of high-quality Chinese singing data. Building on this corpus, we propose DiTSinger, a Diffusion Transformer with RoPE and qk-norm, systematically scaled in depth, width, and resolution for enhanced fidelity. Furthermore, we design an implicit alignment mechanism that obviates phoneme-level duration labels by constraining phoneme-to-acoustic attention within character-level spans, thereby improving robustness under noisy or uncertain alignments. Extensive experiments validate that our approach enables scalable, alignment-free, and high-fidelity SVS.",
            "pdf_url": "https://arxiv.org/pdf/2510.09016v2",
            "published": "2025-10-10 05:39:45+00:00",
            "updated": "2025-12-24 17:16:37+00:00"
        },
        {
            "title": "Data-regularized Reinforcement Learning for Diffusion Models at Scale",
            "authors": "Haotian Ye, Kaiwen Zheng, Jiashu Xu, Puheng Li, Huayu Chen, Jiaqi Han, Sheng Liu, Qinsheng Zhang, Hanzi Mao, Zekun Hao, Prithvijit Chattopadhyay, Dinghao Yang, Liang Feng, Maosheng Liao, Junjie Bai, Ming-Yu Liu, James Zou, Stefano Ermon",
            "summary": "Aligning generative diffusion models with human preferences via reinforcement learning (RL) is critical yet challenging. Most existing algorithms are often vulnerable to reward hacking, such as quality degradation, over-stylization, or reduced diversity. Our analysis demonstrates that this can be attributed to the inherent limitations of their regularization, which provides unreliable penalties. We introduce Data-regularized Diffusion Reinforcement Learning (DDRL), a novel framework that uses the forward KL divergence to anchor the policy to an off-policy data distribution. Theoretically, DDRL enables robust, unbiased integration of RL with standard diffusion training. Empirically, this translates into a simple yet effective algorithm that combines reward maximization with diffusion loss minimization. With over a million GPU hours of experiments and ten thousand double-blind human evaluations, we demonstrate on high-resolution video generation tasks that DDRL significantly improves rewards while alleviating the reward hacking seen in baselines, achieving the highest human preference and establishing a robust and scalable paradigm for diffusion post-training.",
            "pdf_url": "https://arxiv.org/pdf/2512.04332v3",
            "published": "2025-12-03 23:45:07+00:00",
            "updated": "2025-12-24 13:37:40+00:00"
        },
        {
            "title": "STLDM: Spatio-Temporal Latent Diffusion Model for Precipitation Nowcasting",
            "authors": "Shi Quan Foo, Chi-Ho Wong, Zhihan Gao, Dit-Yan Yeung, Ka-Hing Wong, Wai-Kin Wong",
            "summary": "Precipitation nowcasting is a critical spatio-temporal prediction task for society to prevent severe damage owing to extreme weather events. Despite the advances in this field, the complex and stochastic nature of this task still poses challenges to existing approaches. Specifically, deterministic models tend to produce blurry predictions while generative models often struggle with poor accuracy. In this paper, we present a simple yet effective model architecture termed STLDM, a diffusion-based model that learns the latent representation from end to end alongside both the Variational Autoencoder and the conditioning network. STLDM decomposes this task into two stages: a deterministic forecasting stage handled by the conditioning network, and an enhancement stage performed by the latent diffusion model. Experimental results on multiple radar datasets demonstrate that STLDM achieves superior performance compared to the state of the art, while also improving inference efficiency. The code is available in https://github.com/sqfoo/stldm_official.",
            "pdf_url": "https://arxiv.org/pdf/2512.21118v1",
            "published": "2025-12-24 11:34:44+00:00",
            "updated": "2025-12-24 11:34:44+00:00"
        },
        {
            "title": "On the Design of One-step Diffusion via Shortcutting Flow Paths",
            "authors": "Haitao Lin, Peiyan Hu, Minsi Ren, Zhifeng Gao, Zhi-Ming Ma, Guolin ke, Tailin Wu, Stan Z. Li",
            "summary": "Recent advances in few-step diffusion models have demonstrated their efficiency and effectiveness by shortcutting the probabilistic paths of diffusion models, especially in training one-step diffusion models from scratch (\\emph{a.k.a.} shortcut models). However, their theoretical derivation and practical implementation are often closely coupled, which obscures the design space. To address this, we propose a common design framework for representative shortcut models. This framework provides theoretical justification for their validity and disentangles concrete component-level choices, thereby enabling systematic identification of improvements. With our proposed improvements, the resulting one-step model achieves a new state-of-the-art FID50k of 2.85 on ImageNet-256x256 under the classifier-free guidance setting with one step generation, and further reaches FID50k of 2.53 with 2x training steps. Remarkably, the model requires no pre-training, distillation, or curriculum learning. We believe our work lowers the barrier to component-level innovation in shortcut models and facilitates principled exploration of their design space.",
            "pdf_url": "https://arxiv.org/pdf/2512.11831v3",
            "published": "2025-12-03 09:28:29+00:00",
            "updated": "2025-12-24 10:53:25+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "When Experts Speak:Sequential LLM-Bayesian Learning for Startup Success Prediction",
            "authors": "Yidong Chai, Yanguang Liu, Xuan Tian, Jiaheng Xie, Yonghang Zhou",
            "summary": "Evaluating startups is inherently challenging in entrepreneurial finance, where investors confront severe information asymmetry and limited quantitative data. Leveraging a novel expert network call data, we develop an LLM-Bayesian model that analyzes these conversations at the question-answer turn level, extracting semantic and evaluative signals via large language models (LLMs) and aggregating them in a sequential Bayesian architecture. The model dynamically updates beliefs as additional expert calls occur and attenuates contradictory assessments, which are absent from existing text-based screening tools. Empirically, our model outperforms state-of-the-art benchmarks by 6.691% in F1-score and increases portfolio-level Return on Investment by 15.255%. Attention and ablation analyses reveal that conversational cues are particularly informative for technologically complex startups, young firms, diverse founding teams, and firms with low public visibility. By converting expert dialogue into continually updated probabilities, our model advances research in entrepreneurial finance and information systems and offers policy implications for improving funding outcomes for informationally disadvantaged startups.",
            "pdf_url": "https://arxiv.org/pdf/2512.20900v1",
            "published": "2025-12-24 02:49:13+00:00",
            "updated": "2025-12-24 02:49:13+00:00"
        },
        {
            "title": "Quantitative Financial Modeling for Sri Lankan Markets: Approach Combining NLP, Clustering and Time-Series Forecasting",
            "authors": "Linuk Perera",
            "summary": "This research introduces a novel quantitative methodology tailored for quantitative finance applications, enabling banks, stockbrokers, and investors to predict economic regimes and market signals in emerging markets, specifically Sri Lankan stock indices (S&P SL20 and ASPI) by integrating Environmental, Social, and Governance (ESG) sentiment analysis with macroeconomic indicators and advanced time-series forecasting. Designed to leverage quantitative techniques for enhanced risk assessment, portfolio optimization, and trading strategies in volatile environments, the architecture employs FinBERT, a transformer-based NLP model, to extract sentiment from ESG texts, followed by unsupervised clustering (UMAP/HDBSCAN) to identify 5 latent ESG regimes, validated via PCA. These regimes are mapped to economic conditions using a dense neural network and gradient boosting classifier, achieving 84.04% training and 82.0% validation accuracy. Concurrently, time-series models (SRNN, MLP, LSTM, GRU) forecast daily closing prices, with GRU attaining an R-squared of 0.801 and LSTM delivering 52.78% directional accuracy on intraday data. A strong correlation between S&P SL20 and S&P 500, observed through moving average and volatility trend plots, further bolsters forecasting precision. A rule-based fusion logic merges ESG and time-series outputs for final market signals. By addressing literature gaps that overlook emerging markets and holistic integration, this quant-driven framework combines global correlations and local sentiment analysis to offer scalable, accurate tools for quantitative finance professionals navigating complex markets like Sri Lanka.",
            "pdf_url": "https://arxiv.org/pdf/2512.20216v1",
            "published": "2025-12-23 10:16:00+00:00",
            "updated": "2025-12-23 10:16:00+00:00"
        }
    ]
}