{
    "Physics": [
        {
            "title": "Learning Precise, Contact-Rich Manipulation through Uncalibrated Tactile Skins",
            "authors": "Venkatesh Pattabiraman, Yifeng Cao, Siddhant Haldar, Lerrel Pinto, Raunaq Bhirangi",
            "summary": "While visuomotor policy learning has advanced robotic manipulation, precisely\nexecuting contact-rich tasks remains challenging due to the limitations of\nvision in reasoning about physical interactions. To address this, recent work\nhas sought to integrate tactile sensing into policy learning. However, many\nexisting approaches rely on optical tactile sensors that are either restricted\nto recognition tasks or require complex dimensionality reduction steps for\npolicy learning. In this work, we explore learning policies with magnetic skin\nsensors, which are inherently low-dimensional, highly sensitive, and\ninexpensive to integrate with robotic platforms. To leverage these sensors\neffectively, we present the Visuo-Skin (ViSk) framework, a simple approach that\nuses a transformer-based policy and treats skin sensor data as additional\ntokens alongside visual information. Evaluated on four complex real-world tasks\ninvolving credit card swiping, plug insertion, USB insertion, and bookshelf\nretrieval, ViSk significantly outperforms both vision-only and optical tactile\nsensing based policies. Further analysis reveals that combining tactile and\nvisual modalities enhances policy performance and spatial generalization,\nachieving an average improvement of 27.5% across tasks.\nhttps://visuoskin.github.io/",
            "pdf_url": "http://arxiv.org/pdf/2410.17246v1",
            "published": "2024-10-22 17:59:49+00:00",
            "updated": "2024-10-22 17:59:49+00:00"
        },
        {
            "title": "Floquetifying stabiliser codes with distance-preserving rewrites",
            "authors": "Benjamin Rodatz, Boldizsár Poór, Aleks Kissinger",
            "summary": "The ZX calculus is a graphical language for representing and rewriting\nquantum circuits. While its graphical rewrite rules preserve semantics, they\nmay not preserve other features. For example, applying rewrites to a circuit\nthat implements an error-correcting code can change its distance. Here, we\ndefine the notion of distance-preserving rewrites that enables the\ntransformation of error-correcting codes without changing their distance. Using\nthese rewrites, we propose an algorithm that transforms a high-weight Pauli\nmeasurement into an equivalent quantum circuit with only single- and two-qubit\noperations. Since we only use distance-preserving rewrites, we guarantee that\nerrors in the low-weight implementation do not propagate to create multiple\ndata errors. Going further, we generalise the Floquetification procedure of\n[arXiv:2308.15489] to arbitrary stabiliser codes. Given a stabiliser code, we\nsynthesise a new quantum error-correcting code which encodes the same number of\nqubits with at least the same distance. The number of additional qubits this\nmethod requires is linearly dependent on the weight or the largest Pauli\nmeasurement. This creates a tradeoff between easily implementable low-weight\nPauli measurements at the cost of additional physical qubits.",
            "pdf_url": "http://arxiv.org/pdf/2410.17240v1",
            "published": "2024-10-22 17:56:26+00:00",
            "updated": "2024-10-22 17:56:26+00:00"
        },
        {
            "title": "Direct Measurements of Synchrotron-Emitting Electrons at Near-Sun Shocks",
            "authors": "I. C. Jebaraj, O. V. Agapitov, M. Gedalin, L. Vuorinen, M. Miceli, R. Vainio, C. M. S. Cohen, A. Voshchepynets, A. Kouloumvakos, N. Dresing, A. Marmyleva, V. Krasnoselskikh, M. Balikhin, J. G. Mitchell, A. W. Labrador, N. Wijsen, E. Palmerio, L. Colomban, J. Pomoell, E. K. J. Kilpua, M. Pulupa, F. S. Mozer, N. E. Raouafi, D. J. McComas, S. D. Bale",
            "summary": "In this study, we present the first-ever direct measurements of\nsynchrotron-emitting heliospheric traveling shocks, intercepted by the Parker\nSolar Probe (PSP) during its close encounters. Given that much of our\nunderstanding of powerful astrophysical shocks is derived from synchrotron\nradiation, these observations by PSP provide an unprecedented opportunity to\nexplore how shocks accelerate relativistic electrons and the conditions under\nwhich they emit radiation. The probe's unparalleled capabilities to measure\nboth electromagnetic fields and energetic particles with high precision in the\nnear-Sun environment has allowed us to directly correlate the distribution of\nrelativistic electrons with the resulting photon emissions. Our findings reveal\nthat strong quasi-parallel shocks emit radiation at significantly higher\nintensities than quasi-perpendicular shocks due to the efficient acceleration\nof ultra-relativistic electrons. These experimental results are consistent with\ntheory and recent observations of supernova remnant shocks and advance our\nunderstanding of shock physics across diverse space environments.",
            "pdf_url": "http://arxiv.org/pdf/2410.15933v2",
            "published": "2024-10-21 12:03:16+00:00",
            "updated": "2024-10-22 17:29:17+00:00"
        },
        {
            "title": "Non-Stationary Long-Term Dynamics via Selected Incomplete Dual Bases",
            "authors": "Hsiao-Han Chuang, Abhijit Pendse",
            "summary": "Simulating the dynamics of non-stationary, long-term many-body quantum\nsystems poses significant challenges due to the large size of the state space.\nWe are examining how traditional basis sets struggle to accurately represent\nlong-term dynamics when using incomplete sets. To address this issue, we\npropose using an SU(2) coherent state basis and deriving equations of motion\nfor both time-independent and time-dependent Hamiltonian. This methodology\ninvolves a sampling approach, where a subset of relevant configurations is\nchosen based on energy criteria, and a projection method is used to enhance the\naccuracy of wavefunction propagation while reducing computational cost. We\nevaluate this method through numerical simulations of a seven-qubit system,\ncalculating key physical observables such as state probabilities and\ndomain-wall densities. Our results indicate that while complete basis sets\noffer accurate dynamics, selected incomplete sets can recover essential\nfeatures, especially with the assistance of a projector. Our conclusion\nsuggests that the selected incomplete dual basis method can efficiently capture\nboth short-term and long-term dynamics.",
            "pdf_url": "http://arxiv.org/pdf/2306.07407v2",
            "published": "2023-06-12 20:21:29+00:00",
            "updated": "2024-10-22 17:00:36+00:00"
        },
        {
            "title": "Achievable Entanglement-Assisted Communication Rate using Phase-Modulated Two-Mode Squeezed Vacuum",
            "authors": "Shang-Jen Su, Shi-Yuan Wang, Matthieu R. Bloch, Zheshen Zhang",
            "summary": "We derive a closed-form achievable rate for entanglement-assisted classical\ncommunication over a lossy thermal-noise bosonic channel, where the\nentanglement is in the form of a Two-Mode Squeezed Vacuum (TMSV) modulation\nrestricted to Phase Shift Keying (PSK). The achievable rate is non-asymptotic\nin terms of the mean signal photon number, mean noise photon number, and\ntransmissivity defining the communication channel, which provides insights into\nthe interplay of these physical parameters and bridges recent experimental\ndemonstrations of entanglement-assisted communications with the coding theorems\nused in information-theoretic proofs. The key challenge we address is deriving\nan analytical bound for the von Neumann entropy of the non-Gaussian mixed state\nresulting from the phase modulation of one arm of a TMSV. Our approach hinges\non two key observations: 1) as the size of the PSK modulation increases, the\nresulting mixed state converges in trace distance to a diagonal state in the\nFock basis; 2) the Fock-basis representation of the diagonal state involves\nhypergeometric functions that can be appropriately bounded to offer a tractable\nlower bound for the Holevo information.",
            "pdf_url": "http://arxiv.org/pdf/2410.17181v1",
            "published": "2024-10-22 16:58:39+00:00",
            "updated": "2024-10-22 16:58:39+00:00"
        },
        {
            "title": "Evidence for a Lattice Supersolid of Subradiant Dipolar Excitons",
            "authors": "Camille Lagoin, Corentin Morin, Kirk Baldwin, Loren Pfeiffer, Francois Dubin",
            "summary": "In condensed-matter physics, supersolids refer to many-body quantum states\nbreaking translational symmetry while exhibiting off-diagonal long-range order.\nThis combination is debated for commensurate crystals, however it is accessible\nin lattice potentials fractionally filled by bosons with extended interactions.\nHere, we report such lattice supersolid with dipolar excitons confined in a\nsub-wavelength period potential. Excitons implement the Dicke-Hubbard\nHamiltonian controlled by spatially extended dipolar and Dicke correlations. At\nhalf lattice-filling, these induce both a condensation in a single sub-radiant\nstate and a dipolar quantum order spontaneously breaking the lattice symmetry.\nThis combination signals a lattice supersolid dissipatively prepared across 8x8\nsites. Our study underlines that nanoscopic exciton arrays open a route to\nexplore new frontiers of quantum matter, e.g. many-body entanglement, at the\ninterface with quantum nano-photonics.",
            "pdf_url": "http://arxiv.org/pdf/2410.17162v1",
            "published": "2024-10-22 16:36:46+00:00",
            "updated": "2024-10-22 16:36:46+00:00"
        },
        {
            "title": "Dynamical interiors of Black-Bounce spacetimes",
            "authors": "Kunal Pal, Kuntal Pal, Tapobrata Sarkar",
            "summary": "Using the Israel-Darmois junction conditions, we obtain a class of regular\ndynamical interiors to the recently proposed black-bounce spacetimes which\nregularises the Schwarzschild singularity by introducing a regularisation\nparameter. We show that a regularised Friedmann-Lemaitre-Robertson-Walker like\ninterior geometry can not be matched smoothly with the exterior black-bounce\nspacetime through a timelike hypersurface, as there always exists a thin shell\nof non-zero energy-momentum tensor at the matching hypersurface. We obtain the\nexpressions for the energy density and pressure of the thin shell\nenergy-momentum tensor in terms of the regularisation parameter and derive an\nevolution equation for the scale factor of the interior geometry by imposing\nphysical conditions on these components of the surface energy-momentum tensor.\nWe also discuss the formation of the event horizon inside the interior in the\ncase when the initial conditions are such that the situation describes a\ncollapsing matter cloud. We elaborate upon the physical implications of these\nresults.",
            "pdf_url": "http://arxiv.org/pdf/2410.17150v1",
            "published": "2024-10-22 16:28:46+00:00",
            "updated": "2024-10-22 16:28:46+00:00"
        },
        {
            "title": "The XLZD Design Book: Towards the Next-Generation Liquid Xenon Observatory for Dark Matter and Neutrino Physics",
            "authors": "XLZD Collaboration, J. Aalbers, K. Abe, M. Adrover, S. Ahmed Maouloud, D. S. Akerib, A. K. Al Musalhi, F. Alder, L. Althueser, D. W. P. Amaral, C. S. Amarasinghe, A. Ames, B. Andrieu, N. Angelides, E. Angelino, B. Antunovic, E. Aprile, H. M. Araújo, J. E. Armstrong, M. Arthurs, M. Babicz, D. Bajpai, A. Baker, M. Balzer, J. Bang, E. Barberio, J. W. Bargemann, E. Barillier, A. Basharina-Freshville, L. Baudis, D. Bauer, M. Bazyk, K. Beattie, N. Beaupere, N. F. Bell, L. Bellagamba, T. Benson, A. Bhatti, T. P. Biesiadzinski, R. Biondi, Y. Biondi, H. J. Birch, E. Bishop, A. Bismark, C. Boehm, K. Boese, A. Bolotnikov, P. Brás, R. Braun, A. Breskin, C. A. J. Brew, S. Brommer, A. Brown, G. Bruni, R. Budnik, S. Burdin, C. Cai, C. Capelli, G. Carini, M. C. Carmona-Benitez, M. Carter, A. Chauvin, A. Chawla, H. Chen, J. J. Cherwinka, Y. T. Chin, N. I. Chott, A. P. Cimental Chavez, K. Clark, A. P. Colijn, D. J. Colling, J. Conrad, M. V. Converse, R. Coronel, D. Costanzo, A. Cottle, G. Cox, J. J. Cuenca-García, D. Curran, D. Cussans, V. D'Andrea, L. C. Daniel Garcia, I. Darlington, S. Dave, A. David, G. J. Davies, M. P. Decowski, A. Deisting, J. Delgaudio, S. Dey, C. Di Donato, L. Di Felice, P. Di Gangi, S. Diglio, C. Ding, J. E. Y. Dobson, M. Doerenkamp, G. Drexlin, E. Druszkiewicz, C. L. Dunbar, K. Eitel, A. Elykov, R. Engel, S. R. Eriksen, S. Fayer, N. M. Fearon, A. D. Ferella, C. Ferrari, N. Fieldhouse, H. Fischer, H. Flaecher, T. Flehmke, M. Flierman, E. D. Fraser, T. M. A. Fruth, K. Fujikawa, W. Fulgione, C. Fuselli, P. Gaemers, R. Gaior, R. J. Gaitskell, N. Gallice, M. Galloway, F. Gao, N. Garroum, A. Geffre, J. Genovesi, C. Ghag, S. Ghosh, R. Giacomobono, R. Gibbons, F. Girard, R. Glade-Beucke, F. Glück, S. Gokhale, L. Grandi, J. Green, J. Grigat, M. G. D. van der Grinten, R. Größle, H. Guan, M. Guida, P. Gyorgy, J. J. Haiston, C. R. Hall, T. Hall, R. Hammann, V. Hannen, S. Hansmann-Menzemer, N. Hargittai, E. Hartigan-O'Connor, S. J. Haselschwardt, M. Hernandez, S. A. Hertel, A. Higuera, C. Hils, K. Hiraoka, L. Hoetzsch, M. Hoferichter, G. J. Homenides, N. F. Hood, M. Horn, D. Q. Huang, S. Hughes, D. Hunt, M. Iacovacci, Y. Itow, E. Jacquet, J. Jakob, R. S. James, F. Joerg, S. Jones, A. C. Kaboth, F. Kahlert, A. C. Kamaha, Y. Kaminaga, M. Kara, P. Kavrigin, S. Kazama, M. Keller, P. Kemp-Russell, D. Khaitan, P. Kharbanda, B. Kilminster, J. Kim, R. Kirk, M. Kleifges, M. Klute, M. Kobayashi, D. Kodroff, D. Koke, A. Kopec, E. V. Korolkova, H. Kraus, S. Kravitz, L. Kreczko, B. von Krosigk, V. A. Kudryavtsev, F. Kuger, N. Kurita, H. Landsman, R. F. Lang, C. Lawes, J. Lee, B. Lehnert, D. S. Leonard, K. T. Lesko, L. Levinson, A. Li, I. Li, S. Li, S. Liang, Z. Liang, J. Lin, Y. -T. Lin, S. Lindemann, S. Linden, M. Lindner, A. Lindote, W. H. Lippincott, K. Liu, J. Loizeau, F. Lombardi, J. A. M. Lopes, M. I. Lopes, W. Lorenzon, M. Loutit, C. Lu, G. M. Lucchetti, T. Luce, S. Luitz, Y. Ma, C. Macolino, J. Mahlstedt, B. Maier, P. A. Majewski, A. Manalaysay, A. Mancuso, L. Manenti, R. L. Mannino, F. Marignetti, T. Marley, T. Marrodán Undagoitia, K. Martens, J. Masbou, E. Masson, S. Mastroianni, C. Maupin, C. McCabe, M. E. McCarthy, D. N. McKinsey, J. B. McLaughlin, A. Melchiorre, J. Menéndez, M. Messina, E. H. Miller, B. Milosovic, S. Milutinovic, K. Miuchi, R. Miyata, E. Mizrachi, A. Molinario, C. M. B. Monteiro, M. E. Monzani, K. Morå, S. Moriyama, E. Morrison, E. Morteau, Y. Mosbacher, B. J. Mount, J. Müller, M. Murdy, A. St. J. Murphy, M. Murra, A. Naylor, H. N. Nelson, F. Neves, J. L. Newstead, A. Nguyen, K. Ni, C. O'Hare, U. Oberlack, M. Obradovic, I. Olcina, K. C. Oliver-Mallory, G. D. Orebi Gann, J. Orpwood, I. Ostrowskiy, S. Ouahada, K. Oyulmaz, B. Paetsch, K. J. Palladino, J. Palmer, Y. Pan, M. Pandurovic, N. J. Pannifer, S. Paramesvaran, S. J. Patton, Q. Pellegrini, B. Penning, G. Pereira, R. Peres, E. Perry, T. Pershing, F. Piastra, J. Pienaar, A. Piepke, M. Pierre, G. Plante, T. R. Pollmann, L. Principe, J. Qi, K. Qiao, Y. Qie, J. Qin, S. Radeka, V. Radeka, M. Rajado, D. Ramírez García, A. Ravindran, A. Razeto, J. Reichenbacher, C. A. Rhyne, A. Richards, G. R. C. Rischbieter, H. S. Riyat, R. Rosero, A. Roy, T. Rushton, D. Rynders, R. Saakyan, L. Sanchez, P. Sanchez-Lucas, D. Santone, J. M. F. dos Santos, G. Sartorelli, A. B. M. R. Sazzad, A. Scaffidi, R. W. Schnee, J. Schreiner, P. Schulte, H. Schulze, Eißing, M. Schumann, A. Schwenck, A. Schwenk, L. Scotto Lavina, M. Selvi, F. Semeria, P. Shagin, S. Sharma, S. Shaw, W. Shen, L. Sherman, S. Shi, S. Y. Shi, T. Shimada, T. Shutt, J. J. Silk, C. Silva, H. Simgen, G. Sinev, R. Singh, J. Siniscalco, M. Solmaz, V. N. Solovov, Z. Song, P. Sorensen, J. Soria, O. Stanley, M. Steidl, T. Stenhouse, A. Stevens, K. Stifter, T. J. Sumner, A. Takeda, P. -L. Tan, D. J. Taylor, W. C. Taylor, D. Thers, T. Thümmler, D. R. Tiedt, F. Tönnies, Z. Tong, F. Toschi, D. R. Tovey, J. Tranter, M. Trask, G. Trinchero, M. Tripathi, D. R. Tronstad, R. Trotta, C. D. Tunnell, P. Urquijo, A. Usón, M. Utoyama, A. C. Vaitkus, O. Valentino, K. Valerius, S. Vecchi, V. Velan, S. Vetter, L. de Viveiros, G. Volta, D. Vorkapic, A. Wang, J. J. Wang, W. Wang, Y. Wang, D. Waters, K. M. Weerman, C. Weinheimer, M. Weiss, D. Wenz, T. J. Whitis, K. Wild, M. Williams, M. Wilson, S. T. Wilson, C. Wittweg, J. Wolf, F. L. H. Wolfs, S. Woodford, D. Woodward, M. Worcester, C. J. Wright, V. H. S. Wu, S. W üstling, M. Wurm, Q. Xia, Y. Xing, D. Xu, J. Xu, Y. Xu, Z. Xu, M. Yamashita, L. Yang, J. Ye, M. Yeh, B. Yu, G. Zavattini, W. Zha, M. Zhong, K. Zuber",
            "summary": "This report describes the experimental strategy and technologies for a\nnext-generation xenon observatory sensitive to dark matter and neutrino\nphysics. The detector will have an active liquid xenon target mass of 60-80\ntonnes and is proposed by the XENON-LUX-ZEPLIN-DARWIN (XLZD) collaboration. The\ndesign is based on the mature liquid xenon time projection chamber technology\nof the current-generation experiments, LZ and XENONnT. A baseline design and\nopportunities for further optimization of the individual detector components\nare discussed. The experiment envisaged here has the capability to explore\nparameter space for Weakly Interacting Massive Particle (WIMP) dark matter down\nto the neutrino fog, with a 3$\\sigma$ evidence potential for the\nspin-independent WIMP-nucleon cross sections as low as $3\\times10^{-49}\\rm\ncm^2$ (at 40 GeV/c$^2$ WIMP mass). The observatory is also projected to have a\n3$\\sigma$ observation potential of neutrinoless double-beta decay of $^{136}$Xe\nat a half-life of up to $5.7\\times 10^{27}$ years. Additionally, it is\nsensitive to astrophysical neutrinos from the atmosphere, sun, and galactic\nsupernovae.",
            "pdf_url": "http://arxiv.org/pdf/2410.17137v1",
            "published": "2024-10-22 16:09:13+00:00",
            "updated": "2024-10-22 16:09:13+00:00"
        },
        {
            "title": "Learning Load Balancing with GNN in MPTCP-Enabled Heterogeneous Networks",
            "authors": "Han Ji, Xiping Wu, Zhihong Zeng, Chen Chen",
            "summary": "Hybrid light fidelity (LiFi) and wireless fidelity (WiFi) networks are a\npromising paradigm of heterogeneous network (HetNet), attributed to the\ncomplementary physical properties of optical spectra and radio frequency.\nHowever, the current development of such HetNets is mostly bottlenecked by the\nexisting transmission control protocol (TCP), which restricts the user\nequipment (UE) to connecting one access point (AP) at a time. While the ongoing\ninvestigation on multipath TCP (MPTCP) can bring significant benefits, it\ncomplicates the network topology of HetNets, making the existing load balancing\n(LB) learning models less effective. Driven by this, we propose a graph neural\nnetwork (GNN)-based model to tackle the LB problem for MPTCP-enabled HetNets,\nwhich results in a partial mesh topology. Such a topology can be modeled as a\ngraph, with the channel state information and data rate requirement embedded as\nnode features, while the LB solutions are deemed as edge labels. Compared to\nthe conventional deep neural network (DNN), the proposed GNN-based model\nexhibits two key strengths: i) it can better interpret a complex network\ntopology; and ii) it can handle various numbers of APs and UEs with a single\ntrained model. Simulation results show that against the traditional\noptimisation method, the proposed learning model can achieve near-optimal\nthroughput within a gap of 11.5%, while reducing the inference time by 4 orders\nof magnitude. In contrast to the DNN model, the new method can improve the\nnetwork throughput by up to 21.7%, at a similar inference time level.",
            "pdf_url": "http://arxiv.org/pdf/2410.17118v1",
            "published": "2024-10-22 15:49:53+00:00",
            "updated": "2024-10-22 15:49:53+00:00"
        },
        {
            "title": "PhysORD: A Neuro-Symbolic Approach for Physics-infused Motion Prediction in Off-road Driving",
            "authors": "Zhipeng Zhao, Bowen Li, Yi Du, Taimeng Fu, Chen Wang",
            "summary": "Motion prediction is critical for autonomous off-road driving, however, it\npresents significantly more challenges than on-road driving because of the\ncomplex interaction between the vehicle and the terrain. Traditional\nphysics-based approaches encounter difficulties in accurately modeling dynamic\nsystems and external disturbance. In contrast, data-driven neural networks\nrequire extensive datasets and struggle with explicitly capturing the\nfundamental physical laws, which can easily lead to poor generalization. By\nmerging the advantages of both methods, neuro-symbolic approaches present a\npromising direction. These methods embed physical laws into neural models,\npotentially significantly improving generalization capabilities. However, no\nprior works were evaluated in real-world settings for off-road driving. To\nbridge this gap, we present PhysORD, a neural-symbolic approach integrating the\nconservation law, i.e., the Euler-Lagrange equation, into data-driven neural\nmodels for motion prediction in off-road driving. Our experiments showed that\nPhysORD can accurately predict vehicle motion and tolerate external disturbance\nby modeling uncertainties. The learned dynamics model achieves 46.7% higher\naccuracy using only 3.1% of the parameters compared to data-driven methods,\ndemonstrating the data efficiency and superior generalization ability of our\nneural-symbolic method.",
            "pdf_url": "http://arxiv.org/pdf/2404.01596v3",
            "published": "2024-04-02 02:36:31+00:00",
            "updated": "2024-10-22 15:47:12+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Reinforcement learning on structure-conditioned categorical diffusion for protein inverse folding",
            "authors": "Yasha Ektefaie, Olivia Viessmann, Siddharth Narayanan, Drew Dresser, J. Mark Kim, Armen Mkrtchyan",
            "summary": "Protein inverse folding-that is, predicting an amino acid sequence that will\nfold into the desired 3D structure-is an important problem for structure-based\nprotein design. Machine learning based methods for inverse folding typically\nuse recovery of the original sequence as the optimization objective. However,\ninverse folding is a one-to-many problem where several sequences can fold to\nthe same structure. Moreover, for many practical applications, it is often\ndesirable to have multiple, diverse sequences that fold into the target\nstructure since it allows for more candidate sequences for downstream\noptimizations. Here, we demonstrate that although recent inverse folding\nmethods show increased sequence recovery, their \"foldable diversity\"-i.e. their\nability to generate multiple non-similar sequences that fold into the\nstructures consistent with the target-does not increase. To address this, we\npresent RL-DIF, a categorical diffusion model for inverse folding that is\npre-trained on sequence recovery and tuned via reinforcement learning on\nstructural consistency. We find that RL-DIF achieves comparable sequence\nrecovery and structural consistency to benchmark models but shows greater\nfoldable diversity: experiments show RL-DIF can achieve an foldable diversity\nof 29% on CATH 4.2, compared to 23% from models trained on the same dataset.\nThe PyTorch model weights and sampling code are available on GitHub.",
            "pdf_url": "http://arxiv.org/pdf/2410.17173v1",
            "published": "2024-10-22 16:50:34+00:00",
            "updated": "2024-10-22 16:50:34+00:00"
        },
        {
            "title": "RectifID: Personalizing Rectified Flow with Anchored Classifier Guidance",
            "authors": "Zhicheng Sun, Zhenhao Yang, Yang Jin, Haozhe Chi, Kun Xu, Kun Xu, Liwei Chen, Hao Jiang, Yang Song, Kun Gai, Yadong Mu",
            "summary": "Customizing diffusion models to generate identity-preserving images from\nuser-provided reference images is an intriguing new problem. The prevalent\napproaches typically require training on extensive domain-specific images to\nachieve identity preservation, which lacks flexibility across different use\ncases. To address this issue, we exploit classifier guidance, a training-free\ntechnique that steers diffusion models using an existing classifier, for\npersonalized image generation. Our study shows that based on a recent rectified\nflow framework, the major limitation of vanilla classifier guidance in\nrequiring a special classifier can be resolved with a simple fixed-point\nsolution, allowing flexible personalization with off-the-shelf image\ndiscriminators. Moreover, its solving procedure proves to be stable when\nanchored to a reference flow trajectory, with a convergence guarantee. The\nderived method is implemented on rectified flow with different off-the-shelf\nimage discriminators, delivering advantageous personalization results for human\nfaces, live subjects, and certain objects. Code is available at\nhttps://github.com/feifeiobama/RectifID.",
            "pdf_url": "http://arxiv.org/pdf/2405.14677v2",
            "published": "2024-05-23 15:12:15+00:00",
            "updated": "2024-10-22 14:21:19+00:00"
        },
        {
            "title": "Towards Understanding the Working Mechanism of Text-to-Image Diffusion Model",
            "authors": "Mingyang Yi, Aoxue Li, Yi Xin, Zhenguo Li",
            "summary": "Recently, the strong latent Diffusion Probabilistic Model (DPM) has been\napplied to high-quality Text-to-Image (T2I) generation (e.g., Stable\nDiffusion), by injecting the encoded target text prompt into the gradually\ndenoised diffusion image generator. Despite the success of DPM in practice, the\nmechanism behind it remains to be explored. To fill this blank, we begin by\nexamining the intermediate statuses during the gradual denoising generation\nprocess in DPM. The empirical observations indicate, the shape of image is\nreconstructed after the first few denoising steps, and then the image is filled\nwith details (e.g., texture). The phenomenon is because the low-frequency\nsignal (shape relevant) of the noisy image is not corrupted until the final\nstage in the forward process (initial stage of generation) of adding noise in\nDPM. Inspired by the observations, we proceed to explore the influence of each\ntoken in the text prompt during the two stages. After a series of experiments\nof T2I generations conditioned on a set of text prompts. We conclude that in\nthe earlier generation stage, the image is mostly decided by the special token\n[\\texttt{EOS}] in the text prompt, and the information in the text prompt is\nalready conveyed in this stage. After that, the diffusion model completes the\ndetails of generated images by information from themselves. Finally, we propose\nto apply this observation to accelerate the process of T2I generation by\nproperly removing text guidance, which finally accelerates the sampling up to\n25\\%+.",
            "pdf_url": "http://arxiv.org/pdf/2405.15330v2",
            "published": "2024-05-24 08:12:41+00:00",
            "updated": "2024-10-22 12:01:45+00:00"
        },
        {
            "title": "MBD: Multi b-value Denoising of Diffusion Magnetic Resonance Images",
            "authors": "Jakub Jurek, Andrzej Materka, Kamil Ludwisiak, Agata Majos, Filip Szczepankiewicz",
            "summary": "We propose a novel approach to denoising diffusion magnetic resonance images\n(dMRI) using convolutional neural networks, that exploits the benefits of data\nacquired at multiple b-values to offset the need for many redundant\nobservations. Denoising is especially relevant in dMRI since noise can have a\ndeleterious impact on both quantification accuracy and image preprocessing. The\nmost successful methods proposed to date, like Marchenko-Pastur Principal\nComponent Analysis (MPPCA) denoising, are tailored to diffusion-weighting\nrepeated for many encoding directions. They exploit high redundancy of the\ndataset that oversamples the diffusion-encoding direction space, since many\ndirections have collinear components.\n  However, there are many dMRI techniques that do not entail a large number of\nencoding directions or repetitions, and are therefore less suited to this\napproach. For example, clinical dMRI exams may include as few as three encoding\ndirections, with low or negligible data redundancy across directions. Moreover,\npromising new dMRI approaches, like spherical b-tensor encoding (STE), benefit\nfrom high b-values while sensitizing the signal to diffusion along all\ndirections in just a single shot.\n  We introduce a convolutional neural network approach that we call\nmulti-b-value-based denoising (MBD). MBD exploits the similarity in\ndiffusion-weighted images (DWI) across different b-values but along the same\ndiffusion encoding direction. It allows denoising of diffusion images with high\nnoise variance while avoiding blurring, and using just a small number input\nimages.",
            "pdf_url": "http://arxiv.org/pdf/2410.16898v1",
            "published": "2024-10-22 11:03:06+00:00",
            "updated": "2024-10-22 11:03:06+00:00"
        },
        {
            "title": "Test-time Adversarial Defense with Opposite Adversarial Path and High Attack Time Cost",
            "authors": "Cheng-Han Yeh, Kuanchun Yu, Chun-Shien Lu",
            "summary": "Deep learning models are known to be vulnerable to adversarial attacks by\ninjecting sophisticated designed perturbations to input data. Training-time\ndefenses still exhibit a significant performance gap between natural accuracy\nand robust accuracy. In this paper, we investigate a new test-time adversarial\ndefense method via diffusion-based recovery along opposite adversarial paths\n(OAPs). We present a purifier that can be plugged into a pre-trained model to\nresist adversarial attacks. Different from prior arts, the key idea is\nexcessive denoising or purification by integrating the opposite adversarial\ndirection with reverse diffusion to push the input image further toward the\nopposite adversarial direction. For the first time, we also exemplify the\npitfall of conducting AutoAttack (Rand) for diffusion-based defense methods.\nThrough the lens of time complexity, we examine the trade-off between the\neffectiveness of adaptive attack and its computation complexity against our\ndefense. Experimental evaluation along with time cost analysis verifies the\neffectiveness of the proposed method.",
            "pdf_url": "http://arxiv.org/pdf/2410.16805v1",
            "published": "2024-10-22 08:32:17+00:00",
            "updated": "2024-10-22 08:32:17+00:00"
        }
    ]
}