{
    "Physics": [
        {
            "title": "IMAGINE-E: Image Generation Intelligence Evaluation of State-of-the-art Text-to-Image Models",
            "authors": "Jiayi Lei, Renrui Zhang, Xiangfei Hu, Weifeng Lin, Zhen Li, Wenjian Sun, Ruoyi Du, Le Zhuo, Zhongyu Li, Xinyue Li, Shitian Zhao, Ziyu Guo, Yiting Lu, Peng Gao, Hongsheng Li",
            "summary": "With the rapid development of diffusion models, text-to-image(T2I) models\nhave made significant progress, showcasing impressive abilities in prompt\nfollowing and image generation. Recently launched models such as FLUX.1 and\nIdeogram2.0, along with others like Dall-E3 and Stable Diffusion 3, have\ndemonstrated exceptional performance across various complex tasks, raising\nquestions about whether T2I models are moving towards general-purpose\napplicability. Beyond traditional image generation, these models exhibit\ncapabilities across a range of fields, including controllable generation, image\nediting, video, audio, 3D, and motion generation, as well as computer vision\ntasks like semantic segmentation and depth estimation. However, current\nevaluation frameworks are insufficient to comprehensively assess these models'\nperformance across expanding domains. To thoroughly evaluate these models, we\ndeveloped the IMAGINE-E and tested six prominent models: FLUX.1, Ideogram2.0,\nMidjourney, Dall-E3, Stable Diffusion 3, and Jimeng. Our evaluation is divided\ninto five key domains: structured output generation, realism, and physical\nconsistency, specific domain generation, challenging scenario generation, and\nmulti-style creation tasks. This comprehensive assessment highlights each\nmodel's strengths and limitations, particularly the outstanding performance of\nFLUX.1 and Ideogram2.0 in structured and specific domain tasks, underscoring\nthe expanding applications and potential of T2I models as foundational AI\ntools. This study provides valuable insights into the current state and future\ntrajectory of T2I models as they evolve towards general-purpose usability.\nEvaluation scripts will be released at https://github.com/jylei16/Imagine-e.",
            "pdf_url": "http://arxiv.org/pdf/2501.13920v1",
            "published": "2025-01-23 18:58:33+00:00",
            "updated": "2025-01-23 18:58:33+00:00"
        },
        {
            "title": "The simplest 2D quantum walk detects chaoticity",
            "authors": "C. Alonso-Lobo, Gabriel G. Carlo, F. Borondo",
            "summary": "Quantum walks have been actively studied from many perspectives, mainly from\nthe statistical physics and quantum information points of view. We here\ndetermine the influence of basic chaotic features on the walker behavior. We\nconsider an extremely simple model consisting of alternate one-dimensional\nwalks along the two spatial coordinates of bidimensional closed domains (hard\nwall billiards). The chaotic or regular behavior that the shape of the boundary\ninduces in the deterministic classical equations of motion and that translates\ninto chaotic signatures for the quantized problem also results in sharp\ndifferences for the spectral statistics and morphology of the eigenfunctions of\nthe quantum walker. Unexpectedly, two different quantum mechanical problems\nshare the same kind of features related to the corresponding classical dynamics\nof one of them.",
            "pdf_url": "http://arxiv.org/pdf/2501.13900v1",
            "published": "2025-01-23 18:23:11+00:00",
            "updated": "2025-01-23 18:23:11+00:00"
        },
        {
            "title": "Scalar field source Teleparallel Robertson-Walker F(T)-gravity solutions",
            "authors": "Alexandre Landry",
            "summary": "This paper investigates the teleparallel Robertson--Walker (TRW) $F(T)$\ngravity solutions for a scalar field source. We use the TRW $F(T)$ gravity\nfield equations (FEs) for each $k$-parameter value case added by a scalar field\nto find new teleparallel $F(T)$ solutions. For $k=0$, we find an\neasy-to-compute $F(T)$ solution formula applicable for any scalar field source.\nThen, we obtain, for $k=-1$ and $+1$ situations, some new analytical $F(T)$\nsolutions, only for specific $n$-parameter values and well-determined scalar\nfield cases. We can find by those computations a large number of analytical\nteleparallel $F(T)$ solutions independent of any scalar potential $V(\\phi)$\nexpression. The $V(\\phi)$ independence makes the FE solving and computations\neasier. The new solutions will be relevant for future cosmological applications\nin dark matter, dark energy (DE) quintessence, phantom energy and quintom\nmodels of physical processes.",
            "pdf_url": "http://arxiv.org/pdf/2501.13895v1",
            "published": "2025-01-23 18:13:13+00:00",
            "updated": "2025-01-23 18:13:13+00:00"
        },
        {
            "title": "Multimodal Sensor Dataset for Monitoring Older Adults Post Lower-Limb Fractures in Community Settings",
            "authors": "Ali Abedi, Charlene H. Chu, Shehroz S. Khan",
            "summary": "Lower-Limb Fractures (LLF) are a major health concern for older adults, often\nleading to reduced mobility and prolonged recovery, potentially impairing daily\nactivities and independence. During recovery, older adults frequently face\nsocial isolation and functional decline, complicating rehabilitation and\nadversely affecting physical and mental health. Multi-modal sensor platforms\nthat continuously collect data and analyze it using machine-learning algorithms\ncan remotely monitor this population and infer health outcomes. They can also\nalert clinicians to individuals at risk of isolation and decline. This paper\npresents a new publicly available multi-modal sensor dataset, MAISON-LLF,\ncollected from older adults recovering from LLF in community settings. The\ndataset includes data from smartphone and smartwatch sensors, motion detectors,\nsleep-tracking mattresses, and clinical questionnaires on isolation and\ndecline. The dataset was collected from ten older adults living alone at home\nfor eight weeks each, totaling 560 days of 24-hour sensor data. For technical\nvalidation, supervised machine-learning and deep-learning models were developed\nusing the sensor and clinical questionnaire data, providing a foundational\ncomparison for the research community.",
            "pdf_url": "http://arxiv.org/pdf/2501.13888v1",
            "published": "2025-01-23 18:01:01+00:00",
            "updated": "2025-01-23 18:01:01+00:00"
        },
        {
            "title": "Quantum model reduction for continuous-time quantum filters",
            "authors": "Tommaso Grigoletto, Clément Pellegrini, Francesco Ticozzi",
            "summary": "The use of quantum stochastic models is widespread in dynamical reduction,\nsimulation of open systems, feedback control and adaptive estimation. In many\napplications only part of the information contained in the filter's state is\nactually needed to reconstruct the target observable quantities; thus, filters\nof smaller dimensions could be in principle implemented to perform the same\ntask.In this work, we propose a systematic method to find, when possible,\nreduced-order quantum filters that are capable of exactly reproducing the\nevolution of expectation values of interest. In contrast with existing\nreduction techniques, the reduced model we obtain is exact and in the form of a\nBelavkin filtering equation, ensuring physical interpretability.This is\nattained by leveraging tools from the theory of both minimal realization and\nnon-commutative conditional expectations. The proposed procedure is tested on\nprototypical examples, laying the groundwork for applications in quantum\ntrajectory simulation and quantum feedback control.",
            "pdf_url": "http://arxiv.org/pdf/2501.13885v1",
            "published": "2025-01-23 17:57:52+00:00",
            "updated": "2025-01-23 17:57:52+00:00"
        },
        {
            "title": "Can effective descriptions of bosonic systems be considered complete?",
            "authors": "Francesco Arzani, Robert I. Booth, Ulysse Chabaud",
            "summary": "Bosonic statistics give rise to remarkable phenomena, from the Hong-Ou-Mandel\neffect to Bose-Einstein condensation, with applications spanning fundamental\nscience to quantum technologies. Modeling bosonic systems relies heavily on\neffective descriptions: typical examples include truncating their\ninfinite-dimensional state space and restricting their dynamics to a simple\nclass of Hamiltonians, such as polynomials of canonical operators, which are\nused to define quantum computing over bosonic modes. However, many natural\nbosonic Hamiltonians do not belong to this simple class, and some quantum\neffects harnessed by bosonic computers inherently require infinite-dimensional\nspaces, questioning the validity of such effective descriptions of bosonic\nsystems. How can we trust results obtained with such simplifying assumptions to\ncapture real effects?\n  Driven by the increasing importance of bosonic systems for quantum\ntechnologies, we solve this outstanding problem by showing that these effective\ndescriptions do in fact capture the relevant physics of bosonic systems. Our\ntechnical contribution is twofold: firstly, we prove that any physical, bosonic\nunitary evolution can be strongly approximated by a finite-dimensional unitary\nevolution; secondly, we show that any finite-dimensional unitary evolution can\nbe generated exactly by a bosonic Hamiltonian that is a polynomial of canonical\noperators. Beyond their fundamental significance, our results have implications\nfor classical and quantum simulations of bosonic systems, they provide\nuniversal methods for engineering bosonic quantum states and Hamiltonians, they\nshow that polynomial Hamiltonians do generate universal gate sets for quantum\ncomputing over bosonic modes, and they lead to an infinite-dimensional\nSolovay--Kitaev theorem.",
            "pdf_url": "http://arxiv.org/pdf/2501.13857v1",
            "published": "2025-01-23 17:27:54+00:00",
            "updated": "2025-01-23 17:27:54+00:00"
        },
        {
            "title": "Dark Photon Polarimetry",
            "authors": "Fiesta Ting Yan Leung, Tao Liu, Sida Lu, Jing Ren, Cheuk Kan Kelvin Yue, Kaifeng Zheng",
            "summary": "We propose detecting dark photon (DP), a major candidate for wave dark\nmatter, through polarimetry. The DP can modify Maxwell's equations, due to its\nkinetic mixing with regular photon, inducing an oscillating component in the\nelectromagnetic field. This may leave an imprint in polarimetric light signals,\ncharacterised by a distinctive wave pattern in spacetime. As a demonstration,\nwe apply this methodology to investigate ultralight DP produced through the\nsuperradiance of supermassive black holes. Then using the polarimetric\nmeasurements of the radiation from M87$^\\ast$ at the Event Horizon Telescope,\nwe show that all Stokes parameters can serve as a probe in conducting this\ntask. Especially, the absence of significant temporal variation in the\nlinear-polarisation position angle of the M87$^\\ast$ images allows us to set\nnovel limits on the photon-DP mixing parameter over the rarely-explored DP mass\nrange of $10^{-22}$--$10^{-20}$eV, with the best reach of $\\sim 10^{-8}$\nachieved at $\\sim 10^{-20.2}$eV. Given the universality of its underlying\nphysics, we expect the DP polarimetry to be broadly applied for the DP\ndetection in laboratory experiments and astronomical observations.",
            "pdf_url": "http://arxiv.org/pdf/2501.13849v1",
            "published": "2025-01-23 17:16:15+00:00",
            "updated": "2025-01-23 17:16:15+00:00"
        },
        {
            "title": "A search for the fine-structure constant evolution from fast radio bursts and type Ia supernovae data",
            "authors": "Thais Lemos, Rodrigo Gonçalves, Joel Carvalho, Jailson Alcaniz",
            "summary": "The search for a space-time variation of the fundamental constants has been\nexplored over the years to test our physical theories. In this paper, we use\nthe dispersion measure ($DM$) of fast radio bursts (FRB) combined with type Ia\nsupernovae (SNe) data to investigate a possible redshift evolution of the\nfine-structure constant ($\\alpha$), considering the runaway dilaton scenario,\nwhich predicts $\\frac{\\Delta \\alpha}{\\alpha} = - \\gamma\\ln{(1+z)}$, where\n$\\gamma$ is a constant proportional to the current value of the coupling\nbetween the dilaton field and hadronic matter. We derive all the relevant\nexpressions for the $DM$ dependence concerning the fine-structure constant and\nconstrain the parameter $\\gamma$ from measurements of 17 well-localized FRBs\nand 1048 SNe data from the Pantheon compilation. We also use Monte Carlo\nsimulations to forecast the constraining power of larger samples of FRB\nmeasurements for data sets with $N = 500$ and $N = 1000$ points. We found that\nthe uncertainty on $\\gamma$ can be improved by one order of magnitude and that\nlimits on $\\frac{\\Delta \\alpha}{\\alpha}$ beyond $\\sigma \\sim 10^{-2}$ will\ndepend crucially on better control of statistical and systematic uncertainties\nof upcoming FRB data.",
            "pdf_url": "http://arxiv.org/pdf/2406.11691v2",
            "published": "2024-06-17 16:09:22+00:00",
            "updated": "2025-01-23 17:03:20+00:00"
        },
        {
            "title": "The Lense-Thirring effect at work in M87$^\\ast$",
            "authors": "Lorenzo Iorio",
            "summary": "Recently, the temporal evolution of the angles characterizing the spatial\nconfiguration of the jet in the supermassive black hole M87$^\\ast$ was measured\nexhibiting a precessional pattern around the hole's spin axis. It would be due\nto the dragging induced by the fact that the hole's external spacetime is\ndescribed by the Kerr metric. Here, it is shown that the Lense-Thirring orbital\nprecessions of a test particle moving about a rotating massive object,\ncalculated perturbatively to the first post-Newtonian order, are able to fully\nreproduce all the measured features of the jet axis of M87$^\\ast$. In\nparticular, by assuming that the latter is aligned with the angular momentum of\nthe accretion disk, modelled as an effective particle moving along a circular\norbit, the condition that the absolute value of the predicted Lense-Thirring\nprecessional frequency of the disk agrees with the measured value of $0.56\\pm\n0.02$ radians per year of the jet's one is satisfied for a range of physically\nmeaningful values of the hole's spin parameter, close to unity, and of the\neffective disk radius, of the order of just over a dozen gravitational radii.\nRelying upon such assumptions and results, it is possible to predict that the\nangle between the hole's spin axis and the jet's one stays constant over the\nyears amounting to $1.16^\\circ$, in agreement with its measured value of\n$1.25^\\circ\\pm 0.18^\\circ$. Furthermore, also the temporal pattern and the\namplitudes of the time series of the jet's angles are reproduced by the\naforementioned Lense-Thirring precessional model.",
            "pdf_url": "http://arxiv.org/pdf/2411.08686v4",
            "published": "2024-11-13 15:22:05+00:00",
            "updated": "2025-01-23 16:15:04+00:00"
        },
        {
            "title": "Free-Streaming Neutrinos and Their Phase Shift in Current and Future CMB Power Spectra",
            "authors": "Gabriele Montefalcone, Benjamin Wallisch, Katherine Freese",
            "summary": "The cosmic neutrino background and other light relics leave distinct imprints\nin the cosmic microwave background anisotropies through their gravitational\ninfluence. Since neutrinos decoupled from the primordial plasma about one\nsecond after the big bang, they have been free-streaming through the universe.\nThis induced a characteristic phase shift in the acoustic peaks as a unique\nsignature. In this work, we constrain the free-streaming nature of these\nrelativistic species and other light relics beyond the Standard Model of\nparticle physics by establishing two complementary template-based approaches to\nrobustly infer the size of this phase shift from the temperature and\npolarization power spectra. One template shifts the multipoles in these\nspectra, while the other novel template more fundamentally isolates the phase\nshift at the level of the underlying photon-baryon perturbations. Applying\nthese methods to Planck data, we detect the neutrino-induced phase shift at\nabout $10\\sigma$ significance, which rises to roughly $14\\sigma$ with\nadditional data from the Atacama Cosmology Telescope and the South Pole\nTelescope. We also infer that the data is consistent with the Standard Model\nprediction of three free-streaming neutrinos. In addition, we forecast the\ncapabilities of future experiments which will enable significantly more precise\nphase-shift measurements, with the Simons Observatory and CMB-S4 reducing the\n$1\\sigma$ uncertainties to roughly 4.3% and 2.5%, respectively. More generally,\nwe establish a new analysis pipeline for the phase shift induced by neutrinos\nand other free-streaming dark radiation which additionally offers new avenues\nfor exploring physics beyond the Standard Model in a signature-driven and\nmodel-agnostic way.",
            "pdf_url": "http://arxiv.org/pdf/2501.13788v1",
            "published": "2025-01-23 16:04:51+00:00",
            "updated": "2025-01-23 16:04:51+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Can We Generate Images with CoT? Let's Verify and Reinforce Image Generation Step by Step",
            "authors": "Ziyu Guo, Renrui Zhang, Chengzhuo Tong, Zhizheng Zhao, Peng Gao, Hongsheng Li, Pheng-Ann Heng",
            "summary": "Chain-of-Thought (CoT) reasoning has been extensively explored in large\nmodels to tackle complex understanding tasks. However, it still remains an open\nquestion whether such strategies can be applied to verifying and reinforcing\nimage generation scenarios. In this paper, we provide the first comprehensive\ninvestigation of the potential of CoT reasoning to enhance autoregressive image\ngeneration. We focus on three techniques: scaling test-time computation for\nverification, aligning model preferences with Direct Preference Optimization\n(DPO), and integrating these techniques for complementary effects. Our results\ndemonstrate that these approaches can be effectively adapted and combined to\nsignificantly improve image generation performance. Furthermore, given the\npivotal role of reward models in our findings, we propose the Potential\nAssessment Reward Model (PARM) and PARM++, specialized for autoregressive image\ngeneration. PARM adaptively assesses each generation step through a potential\nassessment approach, merging the strengths of existing reward models, and\nPARM++ further introduces a reflection mechanism to self-correct the generated\nunsatisfactory image. Using our investigated reasoning strategies, we enhance a\nbaseline model, Show-o, to achieve superior results, with a significant +24%\nimprovement on the GenEval benchmark, surpassing Stable Diffusion 3 by +15%. We\nhope our study provides unique insights and paves a new path for integrating\nCoT reasoning with autoregressive image generation. Code and models are\nreleased at https://github.com/ZiyuGuo99/Image-Generation-CoT",
            "pdf_url": "http://arxiv.org/pdf/2501.13926v1",
            "published": "2025-01-23 18:59:43+00:00",
            "updated": "2025-01-23 18:59:43+00:00"
        },
        {
            "title": "Truncated Consistency Models",
            "authors": "Sangyun Lee, Yilun Xu, Tomas Geffner, Giulia Fanti, Karsten Kreis, Arash Vahdat, Weili Nie",
            "summary": "Consistency models have recently been introduced to accelerate sampling from\ndiffusion models by directly predicting the solution (i.e., data) of the\nprobability flow ODE (PF ODE) from initial noise. However, the training of\nconsistency models requires learning to map all intermediate points along PF\nODE trajectories to their corresponding endpoints. This task is much more\nchallenging than the ultimate objective of one-step generation, which only\nconcerns the PF ODE's noise-to-data mapping. We empirically find that this\ntraining paradigm limits the one-step generation performance of consistency\nmodels. To address this issue, we generalize consistency training to the\ntruncated time range, which allows the model to ignore denoising tasks at\nearlier time steps and focus its capacity on generation. We propose a new\nparameterization of the consistency function and a two-stage training procedure\nthat prevents the truncated-time training from collapsing to a trivial\nsolution. Experiments on CIFAR-10 and ImageNet $64\\times64$ datasets show that\nour method achieves better one-step and two-step FIDs than the state-of-the-art\nconsistency models such as iCT-deep, using more than 2$\\times$ smaller\nnetworks. Project page: https://truncated-cm.github.io/",
            "pdf_url": "http://arxiv.org/pdf/2410.14895v2",
            "published": "2024-10-18 22:38:08+00:00",
            "updated": "2025-01-23 18:56:32+00:00"
        },
        {
            "title": "Improving Video Generation with Human Feedback",
            "authors": "Jie Liu, Gongye Liu, Jiajun Liang, Ziyang Yuan, Xiaokun Liu, Mingwu Zheng, Xiele Wu, Qiulin Wang, Wenyu Qin, Menghan Xia, Xintao Wang, Xiaohong Liu, Fei Yang, Pengfei Wan, Di Zhang, Kun Gai, Yujiu Yang, Wanli Ouyang",
            "summary": "Video generation has achieved significant advances through rectified flow\ntechniques, but issues like unsmooth motion and misalignment between videos and\nprompts persist. In this work, we develop a systematic pipeline that harnesses\nhuman feedback to mitigate these problems and refine the video generation\nmodel. Specifically, we begin by constructing a large-scale human preference\ndataset focused on modern video generation models, incorporating pairwise\nannotations across multi-dimensions. We then introduce VideoReward, a\nmulti-dimensional video reward model, and examine how annotations and various\ndesign choices impact its rewarding efficacy. From a unified reinforcement\nlearning perspective aimed at maximizing reward with KL regularization, we\nintroduce three alignment algorithms for flow-based models by extending those\nfrom diffusion models. These include two training-time strategies: direct\npreference optimization for flow (Flow-DPO) and reward weighted regression for\nflow (Flow-RWR), and an inference-time technique, Flow-NRG, which applies\nreward guidance directly to noisy videos. Experimental results indicate that\nVideoReward significantly outperforms existing reward models, and Flow-DPO\ndemonstrates superior performance compared to both Flow-RWR and standard\nsupervised fine-tuning methods. Additionally, Flow-NRG lets users assign custom\nweights to multiple objectives during inference, meeting personalized video\nquality needs. Project page: https://gongyeliu.github.io/videoalign.",
            "pdf_url": "http://arxiv.org/pdf/2501.13918v1",
            "published": "2025-01-23 18:55:41+00:00",
            "updated": "2025-01-23 18:55:41+00:00"
        },
        {
            "title": "Unveiling the Power of Noise Priors: Enhancing Diffusion Models for Mobile Traffic Prediction",
            "authors": "Zhi Sheng, Yuan Yuan, Jingtao Ding, Yong Li",
            "summary": "Accurate prediction of mobile traffic, \\textit{i.e.,} network traffic from\ncellular base stations, is crucial for optimizing network performance and\nsupporting urban development. However, the non-stationary nature of mobile\ntraffic, driven by human activity and environmental changes, leads to both\nregular patterns and abrupt variations. Diffusion models excel in capturing\nsuch complex temporal dynamics due to their ability to capture the inherent\nuncertainties. Most existing approaches prioritize designing novel denoising\nnetworks but often neglect the critical role of noise itself, potentially\nleading to sub-optimal performance. In this paper, we introduce a novel\nperspective by emphasizing the role of noise in the denoising process. Our\nanalysis reveals that noise fundamentally shapes mobile traffic predictions,\nexhibiting distinct and consistent patterns. We propose NPDiff, a framework\nthat decomposes noise into \\textit{prior} and \\textit{residual} components,\nwith the \\textit{prior} derived from data dynamics, enhancing the model's\nability to capture both regular and abrupt variations. NPDiff can seamlessly\nintegrate with various diffusion-based prediction models, delivering\npredictions that are effective, efficient, and robust. Extensive experiments\ndemonstrate that it achieves superior performance with an improvement over\n30\\%, offering a new perspective on leveraging diffusion models in this domain.",
            "pdf_url": "http://arxiv.org/pdf/2501.13794v1",
            "published": "2025-01-23 16:13:08+00:00",
            "updated": "2025-01-23 16:13:08+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Time Series Embedding Methods for Classification Tasks: A Review",
            "authors": "Yasamin Ghahremani, Vangelis Metsis",
            "summary": "Time series analysis has become crucial in various fields, from engineering\nand finance to healthcare and social sciences. In this paper, we present a\ncomprehensive review and evaluation of time series embedding methods for\neffective representations in machine learning and deep learning models. We\nintroduce a taxonomy of embedding techniques, categorizing them based on their\ntheoretical foundations and application contexts. Unlike previous surveys, our\nwork provides a quantitative evaluation of representative methods from each\ncategory by assessing their performance on downstream classification tasks\nacross diverse real-world datasets. Our experimental results demonstrate that\nthe performance of embedding methods varies significantly depending on the\ndataset and classification algorithm used, highlighting the importance of\ncareful model selection and extensive experimentation for specific\napplications, including engineering systems. To facilitate further research and\npractical applications, we provide an open-source code repository implementing\nthese embedding methods. This study contributes to the field by offering a\nsystematic comparison of time series embedding techniques, guiding\npractitioners in selecting appropriate methods for their specific applications,\nand providing a foundation for future advancements in time series analysis.",
            "pdf_url": "http://arxiv.org/pdf/2501.13392v1",
            "published": "2025-01-23 05:24:45+00:00",
            "updated": "2025-01-23 05:24:45+00:00"
        }
    ]
}