{
    "Physics": [
        {
            "title": "Learning Selection Cuts With Gradients",
            "authors": "Mike Hance, Juan Robles",
            "summary": "Many analyses in high-energy physics rely on selection thresholds (cuts)\napplied to detector, particle, or event properties. Initial cut values can\noften be guessed from physical intuition, but cut optimization, especially for\nmultiple features, is commonly performed by hand, or skipped entirely in favor\nof multivariate algorithms like BDTs or classification networks. We revisit\nthis problem, and develop a cut optimization approach based on gradient\ndescent. Cut thresholds are learned as parameters of a network with a simple\narchitecture, and can be tuned to achieve a target signal efficiency through\nthe use of custom loss functions. Contractive terms in the loss can be used to\nensure a smooth evolution of cuts as functions of efficiency, particle\nkinematics, or event features. The method is used to classify events in a\nsearch for Supersymmetry, and the performance is compared with traditional\nclassification networks. An implementation of this approach is available in a\npublic code repository and python package.",
            "pdf_url": "http://arxiv.org/pdf/2502.08615v1",
            "published": "2025-02-12 18:09:52+00:00",
            "updated": "2025-02-12 18:09:52+00:00"
        },
        {
            "title": "Attractive and repulsive terms in multi-object dispersion interactions",
            "authors": "Subhojit Pal, Barry W. Ninham, John F. Dobson, Mathias Boström",
            "summary": "Filamentary objects such as nano-wires, nanotubes and DNA are of current\ninterest in physics, nanoscience, chemistry, biology and medicine. They can\ninteract via exceptionally long-ranged many-object van der Waals (vdW,\ndispersion) forces, causing them to cluster into multi-object bundles. We\nanalyse their vdW interactions quantitatively, predicting $N$-object vdW energy\ncontributions that alternate in sign with increasing $N$. We also provide novel\ninsights permitting these tendencies to be understood simply in terms of\nelectronic screening and anti-screening. Relevant systems include\npolyelectrolyte double layers, Nafion exclusion zone, endothelial surface layer\nof cells, microemulsion interfaces and hexagonal phases, salt fingers in Gibbs\nMarangoni effects, myosin fibres in muscle, multiple nanotubes in the interior\nof neuronal axons, and carbon fibre materials.",
            "pdf_url": "http://arxiv.org/pdf/2409.00419v2",
            "published": "2024-08-31 11:16:52+00:00",
            "updated": "2025-02-12 18:03:21+00:00"
        },
        {
            "title": "Scalable Thermodynamic Second-order Optimization",
            "authors": "Kaelan Donatella, Samuel Duffield, Denis Melanson, Maxwell Aifer, Phoebe Klett, Rajath Salegame, Zach Belateche, Gavin Crooks, Antonio J. Martinez, Patrick J. Coles",
            "summary": "Many hardware proposals have aimed to accelerate inference in AI workloads.\nLess attention has been paid to hardware acceleration of training, despite the\nenormous societal impact of rapid training of AI models. Physics-based\ncomputers, such as thermodynamic computers, offer an efficient means to solve\nkey primitives in AI training algorithms. Optimizers that normally would be\ncomputationally out-of-reach (e.g., due to expensive matrix inversions) on\ndigital hardware could be unlocked with physics-based hardware. In this work,\nwe propose a scalable algorithm for employing thermodynamic computers to\naccelerate a popular second-order optimizer called Kronecker-factored\napproximate curvature (K-FAC). Our asymptotic complexity analysis predicts\nincreasing advantage with our algorithm as $n$, the number of neurons per\nlayer, increases. Numerical experiments show that even under significant\nquantization noise, the benefits of second-order optimization can be preserved.\nFinally, we predict substantial speedups for large-scale vision and graph\nproblems based on realistic hardware characteristics.",
            "pdf_url": "http://arxiv.org/pdf/2502.08603v1",
            "published": "2025-02-12 17:44:40+00:00",
            "updated": "2025-02-12 17:44:40+00:00"
        },
        {
            "title": "Gravitational waves in massive gravity: Waveforms generated by a particle plunging into a black hole and the excitation of quasinormal modes and quasibound states",
            "authors": "Mohamed Ould El Hadj",
            "summary": "With the aim of testing massive gravity in the context of black hole physics,\nwe investigate the gravitational radiation emitted by a massive particle\nplunging into a Schwarzschild black hole from slightly below the innermost\nstable circular orbit. To do so, we first construct the quasinormal and\nquasibound resonance spectra of the spin-2 massive field for odd and even\nparity. Then, we compute the waveforms produced by the plunging particle and\nstudy their spectral content. This allows us to highlight and interpret\nimportant phenomena in the plunge regime, including (i) the excitation of\nquasibound states, with particular emphasis on the amplification and slow decay\nof the post-ringdown phase of the even-parity dipolar mode due to harmonic\nresonance; (ii) during the adiabatic phase, the waveform emitted by the\nplunging particle is very well described by the waveform emitted by the\nparticle living on the innermost stable circular orbit, and (iii) the\nregularized waveforms and their unregularized counterparts constructed from the\nquasinormal mode spectrum are in excellent agreement. Finally, we construct,\nfor arbitrary directions of observation and, in particular, outside the orbital\nplane of the plunging particle, the regularized multipolar waveforms, i.e., the\nwaveforms constructed by summing over partial waveforms.",
            "pdf_url": "http://arxiv.org/pdf/2411.16538v2",
            "published": "2024-11-25 16:21:41+00:00",
            "updated": "2025-02-12 17:11:52+00:00"
        },
        {
            "title": "Higgs Boson Studies at Future Particle Colliders",
            "authors": "J. de Blas, M. Cepeda, J. D'Hondt, R. K. Ellis, C. Grojean, B. Heinemann, F. Maltoni, A. Nisati, E. Petit, R. Rattazzi, W. Verkerke",
            "summary": "This document aims to provide an assessment of the potential of future\ncolliding beam facilities to perform Higgs boson studies. The analysis builds\non the submissions made by the proponents of future colliders to the European\nStrategy Update process, and takes as its point of departure the results\nexpected at the completion of the HL-LHC program. This report presents\nquantitative results on many aspects of Higgs physics for future collider\nprojects of sufficient maturity using uniform methodologies.",
            "pdf_url": "http://arxiv.org/pdf/1905.03764v3",
            "published": "2019-05-09 17:34:52+00:00",
            "updated": "2025-02-12 17:00:44+00:00"
        },
        {
            "title": "Scaling Law for Discharges in Z pinch Devices",
            "authors": "Miguel Cárdenas, Alejandro Nettle, Leandro Núñez",
            "summary": "We consider the snowplow model for studying discharges in Z pinch devices. In\nthis context, to obtain a complete picture on the physics of those discharges,\nwe replenish the term disregarded in the original formulation of the snowplow\nequations. This is, we now consider not only the magnetic force inward on the\ncurrent sheath but we take into account also a force outward on it. Such a\nforce results from the kinetic pressure of the gas occluded by the current\nsheath.\n  The internal energy gained by the gas towards the end of the discharge\ndepends on the full history of the dynamical variables of the system. In other\nterms, the internal energy is a functional of the dynamical variables of the\nsystem. We write down the expression for evaluating that internal energy and we\npresent also the formula for computing the temperature of the gas.\n  On this basis, we derive a scaling law that relates the temperature the gas\nin a Z pinch experiment would attain with the energetic and spatial wingspan of\nthe corresponding experimental setup.",
            "pdf_url": "http://arxiv.org/pdf/2502.08570v1",
            "published": "2025-02-12 16:59:14+00:00",
            "updated": "2025-02-12 16:59:14+00:00"
        },
        {
            "title": "The Role of Conceptual Problem Solving in Learning Physics: A Study in a General Relativity University Course",
            "authors": "Matteo Tuveri, Andrea Pierfrancesco Sanna, Mariano Cadoni",
            "summary": "Effective physics learning, especially in complex topics, requires balancing\nmathematical formalism with conceptual understanding. Conceptual\nproblem-solving involves connecting math to physical reality, and using an\nepistemological framework like problem framing helps students justify their\nmathematical decisions. This approach deepens students' understanding by\nlinking theory to practice and enhancing their reasoning skills. This study\nexplores the effectiveness of conceptual problem-solving in learning complex\ntopics like general relativity (GR) through a pedagogical framework that\nemphasizes the integration of qualitative and quantitative reasoning. Our\ninvestigation, conducted at the University of Cagliari, assessed how students\nstructure their problem framing and its impact on their conceptual learning of\nGR. Results indicate that students who blend conceptual understanding with\nmathematical formalism show a deeper grasp of physical principles and improved\nproblem-solving skills. The research highlights the importance of symbol sense\nand the cyclical nature of problem framing, suggesting that a more integrated\napproach, incorporating visual, symbolic, and natural language elements, could\nenhance students' conceptual understanding. Additionally, the methodology\nprovides instructors with insights into students' thought processes, enabling\nmore effective, targeted feedback.",
            "pdf_url": "http://arxiv.org/pdf/2502.08564v1",
            "published": "2025-02-12 16:52:38+00:00",
            "updated": "2025-02-12 16:52:38+00:00"
        },
        {
            "title": "Machine learning with sub-diffraction resolution in the photon-counting regime",
            "authors": "Giuseppe Buonaiuto, Cosmo Lupo",
            "summary": "The resolution of optical imaging is classically limited by the width of the\npoint-spread function, which in turn is determined by the Rayleigh length.\nRecently, spatial-mode demultiplexing (SPADE) has been proposed as a method to\nachieve sub-Rayleigh estimation and discrimination of natural, incoherent\nsources. Here we show that SPADE yields sub-diffraction resolution in the\nbroader context of image classification. To achieve this goal, we outline a\nhybrid machine learning algorithm for image classification that includes a\nphysical part and a computational part. The physical part implements a physical\npre-processing of the optical field that cannot be simulated without\nessentially reducing the signal-to-noise ratio. In detail, a spatial-mode\ndemultiplexer is used to sort the transverse field, followed by mode-wise\nphoton detection. In the computational part, the collected data are fed into an\nartificial neural network for training and classification. As a case study, we\nclassify images from the MNIST dataset after severe blurring due to\ndiffraction. Our numerical experiments demonstrate the ability to classify\nhighly blurred images that would be otherwise indistinguishable by direct\nimaging without the physical pre-processing of the optical field.",
            "pdf_url": "http://arxiv.org/pdf/2406.03179v2",
            "published": "2024-06-05 12:08:58+00:00",
            "updated": "2025-02-12 16:45:53+00:00"
        },
        {
            "title": "The Born rule -- 100 years ago and today",
            "authors": "Arnold Neumaier",
            "summary": "Details of the contents, and formulations of the Born rule changed\nconsiderably from its inception by Born in 1926 to the present day. Based to a\nlarge extent on little known results from the recent books 'Coherent Quantum\nPhysics' by Neumaier and 'Algebraic Quantum Physics', Vol. 1 by Neumaier and\nWestra, this paper traces the early history 100 years ago, its generalization\n(essential for today's quantum optics and quantum information theory) to POVMs\n50 year ago, and a modern derivation from an intuitive definition of the notion\nof a quantum detector. Also discussed is the extent to which the various forms\nof the Born rule have, like any other statement in physics, a restricted domain\nof validity, which leads to problems when applied outside this domain.",
            "pdf_url": "http://arxiv.org/pdf/2502.08545v1",
            "published": "2025-02-12 16:28:49+00:00",
            "updated": "2025-02-12 16:28:49+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Enhancing Diffusion Models Efficiency by Disentangling Total-Variance and Signal-to-Noise Ratio",
            "authors": "Khaled Kahouli, Winfried Ripken, Stefan Gugler, Oliver T. Unke, Klaus-Robert Müller, Shinichi Nakajima",
            "summary": "The long sampling time of diffusion models remains a significant bottleneck,\nwhich can be mitigated by reducing the number of diffusion time steps. However,\nthe quality of samples with fewer steps is highly dependent on the noise\nschedule, i.e., the specific manner in which noise is introduced and the signal\nis reduced at each step. Although prior work has improved upon the original\nvariance-preserving and variance-exploding schedules, these approaches\n$\\textit{passively}$ adjust the total variance, without direct control over it.\nIn this work, we propose a novel total-variance/signal-to-noise-ratio\ndisentangled (TV/SNR) framework, where TV and SNR can be controlled\nindependently. Our approach reveals that different existing schedules, where\nthe TV explodes exponentially, can be $\\textit{improved}$ by setting a constant\nTV schedule while preserving the same SNR schedule. Furthermore, generalizing\nthe SNR schedule of the optimal transport flow matching significantly improves\nthe performance in molecular structure generation, achieving few step\ngeneration of stable molecules. A similar tendency is observed in image\ngeneration, where our approach with a uniform diffusion time grid performs\ncomparably to the highly tailored EDM sampler.",
            "pdf_url": "http://arxiv.org/pdf/2502.08598v1",
            "published": "2025-02-12 17:35:43+00:00",
            "updated": "2025-02-12 17:35:43+00:00"
        },
        {
            "title": "Mapping the Landscape of Generative AI in Network Monitoring and Management",
            "authors": "Giampaolo Bovenzi, Francesco Cerasuolo, Domenico Ciuonzo, Davide Di Monda, Idio Guarino, Antonio Montieri, Valerio Persico, Antonio Pescapè",
            "summary": "Generative Artificial Intelligence (GenAI) models such as LLMs, GPTs, and\nDiffusion Models have recently gained widespread attention from both the\nresearch and the industrial communities. This survey explores their application\nin network monitoring and management, focusing on prominent use cases, as well\nas challenges and opportunities. We discuss how network traffic generation and\nclassification, network intrusion detection, networked system log analysis, and\nnetwork digital assistance can benefit from the use of GenAI models.\nAdditionally, we provide an overview of the available GenAI models, datasets\nfor large-scale training phases, and platforms for the development of such\nmodels. Finally, we discuss research directions that potentially mitigate the\nroadblocks to the adoption of GenAI for network monitoring and management. Our\ninvestigation aims to map the current landscape and pave the way for future\nresearch in leveraging GenAI for network monitoring and management.",
            "pdf_url": "http://arxiv.org/pdf/2502.08576v1",
            "published": "2025-02-12 17:10:34+00:00",
            "updated": "2025-02-12 17:10:34+00:00"
        },
        {
            "title": "Brain Latent Progression: Individual-based Spatiotemporal Disease Progression on 3D Brain MRIs via Latent Diffusion",
            "authors": "Lemuel Puglisi, Daniel C. Alexander, Daniele Ravì",
            "summary": "The growing availability of longitudinal Magnetic Resonance Imaging (MRI)\ndatasets has facilitated Artificial Intelligence (AI)-driven modeling of\ndisease progression, making it possible to predict future medical scans for\nindividual patients. However, despite significant advancements in AI, current\nmethods continue to face challenges including achieving patient-specific\nindividualization, ensuring spatiotemporal consistency, efficiently utilizing\nlongitudinal data, and managing the substantial memory demands of 3D scans. To\naddress these challenges, we propose Brain Latent Progression (BrLP), a novel\nspatiotemporal model designed to predict individual-level disease progression\nin 3D brain MRIs. The key contributions in BrLP are fourfold: (i) it operates\nin a small latent space, mitigating the computational challenges posed by\nhigh-dimensional imaging data; (ii) it explicitly integrates subject metadata\nto enhance the individualization of predictions; (iii) it incorporates prior\nknowledge of disease dynamics through an auxiliary model, facilitating the\nintegration of longitudinal data; and (iv) it introduces the Latent Average\nStabilization (LAS) algorithm, which (a) enforces spatiotemporal consistency in\nthe predicted progression at inference time and (b) allows us to derive a\nmeasure of the uncertainty for the prediction. We train and evaluate BrLP on\n11,730 T1-weighted (T1w) brain MRIs from 2,805 subjects and validate its\ngeneralizability on an external test set comprising 2,257 MRIs from 962\nsubjects. Our experiments compare BrLP-generated MRI scans with real follow-up\nMRIs, demonstrating state-of-the-art accuracy compared to existing methods. The\ncode is publicly available at: https://github.com/LemuelPuglisi/BrLP.",
            "pdf_url": "http://arxiv.org/pdf/2502.08560v1",
            "published": "2025-02-12 16:47:41+00:00",
            "updated": "2025-02-12 16:47:41+00:00"
        },
        {
            "title": "One-Shot Federated Learning with Classifier-Free Diffusion Models",
            "authors": "Obaidullah Zaland, Shutong Jin, Florian T. Pokorny, Monowar Bhuyan",
            "summary": "Federated learning (FL) enables collaborative learning without data\ncentralization but introduces significant communication costs due to multiple\ncommunication rounds between clients and the server. One-shot federated\nlearning (OSFL) addresses this by forming a global model with a single\ncommunication round, often relying on the server's model distillation or\nauxiliary dataset generation - often through pre-trained diffusion models\n(DMs). Existing DM-assisted OSFL methods, however, typically employ\nclassifier-guided DMs, which require training auxiliary classifier models at\neach client, introducing additional computation overhead. This work introduces\nOSCAR (One-Shot Federated Learning with Classifier-Free Diffusion Models), a\nnovel OSFL approach that eliminates the need for auxiliary models. OSCAR uses\nfoundation models to devise category-specific data representations at each\nclient, seamlessly integrated into a classifier-free diffusion model pipeline\nfor server-side data generation. OSCAR is a simple yet cost-effective OSFL\napproach that outperforms the state-of-the-art on four benchmarking datasets\nwhile reducing the communication load by at least 99%.",
            "pdf_url": "http://arxiv.org/pdf/2502.08488v1",
            "published": "2025-02-12 15:23:29+00:00",
            "updated": "2025-02-12 15:23:29+00:00"
        },
        {
            "title": "Poincaré Inequality for Local Log-Polyak-Lojasiewicz Measures : Non-asymptotic Analysis in Low-temperature Regime",
            "authors": "Yun Gong, Zebang Shen, Niao He",
            "summary": "Potential functions in highly pertinent applications, such as deep learning\nin over-parameterized regime, are empirically observed to admit non-isolated\nminima. To understand the convergence behavior of stochastic dynamics in such\nlandscapes, we propose to study the class of \\logPLmeasure\\ measures\n$\\mu_\\epsilon \\propto \\exp(-V/\\epsilon)$, where the potential $V$ satisfies a\nlocal Polyak-{\\L}ojasiewicz (P\\L) inequality, and its set of local minima is\nprovably \\emph{connected}. Notably, potentials in this class can exhibit local\nmaxima and we characterize its optimal set S to be a compact $\\mathcal{C}^2$\n\\emph{embedding submanifold} of $\\mathbb{R}^d$ without boundary. The\n\\emph{non-contractibility} of S distinguishes our function class from the\nclassical convex setting topologically. Moreover, the embedding structure\ninduces a naturally defined Laplacian-Beltrami operator on S, and we show that\nits first non-trivial eigenvalue provides an \\emph{$\\epsilon$-independent}\nlower bound for the \\Poincare\\ constant in the \\Poincare\\ inequality of\n$\\mu_\\epsilon$. As a direct consequence, Langevin dynamics with such non-convex\npotential $V$ and diffusion coefficient $\\epsilon$ converges to its equilibrium\n$\\mu_\\epsilon$ at a rate of $\\tilde{\\mathcal{O}}(1/\\epsilon)$, provided\n$\\epsilon$ is sufficiently small. Here $\\tilde{\\mathcal{O}}$ hides logarithmic\nterms.",
            "pdf_url": "http://arxiv.org/pdf/2502.06862v2",
            "published": "2025-02-08 00:43:57+00:00",
            "updated": "2025-02-12 13:21:32+00:00"
        }
    ]
}