{
    "Physics": [
        {
            "title": "Optimal Cell Shape for Accurate Chemical Gradient Sensing in Eukaryote Chemotaxis",
            "authors": "Daiqiu Mou, Yuansheng Cao",
            "summary": "Accurate gradient sensing is crucial for efficient chemotaxis in noisy\nenvironments, but the relationship between cell shape deformations and sensing\naccuracy is not well understood. Using a theoretical framework based on maximum\nlikelihood estimation, we show that the receptor dispersion, quantified by cell\nshape convex hull, fundamentally limits gradient sensing accuracy. Cells with a\nconcave shape and isotropic error space achieve optimal performance in gradient\ndetection. This concave shape, resulting from active protrusions or\ncontractions, can significantly improve gradient sensing accuracy at the cost\nof increased energy expenditure. By balancing sensing accuracy and deformation\ncost, we predict that a concave, three-branched shape as optimal for cells in\nshallow gradients. To achieve efficient chemotaxis, our theory suggests that a\ncell should adopt a repeating \"run-and-expansion\" cycle. Our theoretical\npredictions align well with experimental observations, implying that the fast\namoeboid cell motion is optimized near the physical limit for chemotaxis. This\nstudy highlights the crucial role of active cell shape deformation in\nfacilitating accurate chemotaxis.",
            "pdf_url": "http://arxiv.org/pdf/2503.04716v1",
            "published": "2025-03-06 18:58:39+00:00",
            "updated": "2025-03-06 18:58:39+00:00"
        },
        {
            "title": "DEFT: Differentiable Branched Discrete Elastic Rods for Modeling Furcated DLOs in Real-Time",
            "authors": "Yizhou Chen, Xiaoyue Wu, Yeheng Zong, Anran Li, Yuzhen Chen, Julie Wu, Bohao Zhang, Ram Vasudevan",
            "summary": "Autonomous wire harness assembly requires robots to manipulate complex\nbranched cables with high precision and reliability. A key challenge in\nautomating this process is predicting how these flexible and branched\nstructures behave under manipulation. Without accurate predictions, it is\ndifficult for robots to reliably plan or execute assembly operations. While\nexisting research has made progress in modeling single-threaded Deformable\nLinear Objects (DLOs), extending these approaches to Branched Deformable Linear\nObjects (BDLOs) presents fundamental challenges. The junction points in BDLOs\ncreate complex force interactions and strain propagation patterns that cannot\nbe adequately captured by simply connecting multiple single-DLO models. To\naddress these challenges, this paper presents Differentiable discrete branched\nElastic rods for modeling Furcated DLOs in real-Time (DEFT), a novel framework\nthat combines a differentiable physics-based model with a learning framework\nto: 1) accurately model BDLO dynamics, including dynamic propagation at\njunction points and grasping in the middle of a BDLO, 2) achieve efficient\ncomputation for real-time inference, and 3) enable planning to demonstrate\ndexterous BDLO manipulation. A comprehensive series of real-world experiments\ndemonstrates DEFT's efficacy in terms of accuracy, computational speed, and\ngeneralizability compared to state-of-the-art alternatives. Project\npage:https://roahmlab.github.io/DEFT/.",
            "pdf_url": "http://arxiv.org/pdf/2502.15037v4",
            "published": "2025-02-20 20:46:09+00:00",
            "updated": "2025-03-06 18:50:30+00:00"
        },
        {
            "title": "Characterizing $S=3/2$ AKLT Hamiltonian with Scanning Tunneling Spectroscopy",
            "authors": "M. Ferri-Cortés, J. C. G. Henriques, J. Fernández-Rossier",
            "summary": "The AKLT Hamiltonian is a particular instance of a general class of model\nHamiltonians defined in lattices with coordination $z$ where each site hosts a\nspins $S=z/2$, interacting both with linear and non-linear exchange couplings.\nIn two dimensions, the AKLT model features a gap in the spectrum, and its\nground state is a valence bond solid state; that is an universal resource for\nmeasurement based quantum computing, motivating the quest of physical systems\nthat realize this Hamiltonian. Given a finite-size system described with a\nspecific instance of this general class of models, we address the question of\nhow to asses if such system is a realization of the AKLT model using inelastic\ntunnel spectroscopy implemented with scanning tunnel microscopy (IETS-STM). We\npropose two approaches. First, in the case of a dimer, we show how to leverage\nnon-equilibrium IETS-STM to obtain the energies of all excited states, and\ndetermine thereby the magnitude of both linear and non-linear exchange\ninteractions. Second, we explore how IETS can probe the in-gap excitations\nassociated to edge spins. In the AKLT limit, spins $S=3/2$ at the edge of the\nlattice have coordination 2, giving rise to $S=1/2$ dangling spins that can be\nprobed with IETS. We propose a $S=1/2$ effective Hamiltonian to describe the\ninteractions between these dangling spins in the neighborhood of the AKLT\npoint, where their degeneracy lifted.",
            "pdf_url": "http://arxiv.org/pdf/2503.04676v1",
            "published": "2025-03-06 18:12:53+00:00",
            "updated": "2025-03-06 18:12:53+00:00"
        },
        {
            "title": "Abundance and properties of dark radiation from the cosmic microwave background",
            "authors": "Murali M. Saravanan, Thejs Brinckmann, Marilena Loverde, Zachary J. Weiner",
            "summary": "We study the cosmological signatures of new light relics that are\ncollisionless like standard neutrinos or are strongly interacting. We provide a\nsimple and succinct rephrasing of their physical effects in the cosmic\nmicrowave background, as well as the resulting parameter degeneracies with\nother cosmological parameters, in terms of the total radiation abundance and\nthe fraction thereof that freely streams. In these more general terms,\ninteracting and noninteracting light relics are differentiated by their\nrespective decrease and increase of the free-streaming fraction, and, moreover,\nthe scale-dependent interplay thereof with a common, correlated reduction of\nthe fraction of matter in baryons. We then derive updated constraints on\nvarious dark-radiation scenarios with the latest cosmological observations,\nemploying this language to identify the physical origin of the impact of each\ndataset. The \"PR4\" reanalyses of Planck CMB data prefer a larger primordial\nhelium yield and therefore also slightly more radiation than the 2018 analysis,\nwhose origin we identify in a number of poorly fit polarization measurements.\nSmaller free-streaming fractions are disfavored by the excess lensing of the\nCMB measured in lensing reconstruction data from Planck and the Atacama\nCosmology Telescope. On the other hand, baryon acoustic oscillation\nmeasurements from the Dark Energy Spectroscopic Instrument drive marginal\ndetections of new, strongly interacting light relics due to that data's\npreference for lower matter fractions. Finally, we forecast measurements from\nthe CMB-S4 experiment.",
            "pdf_url": "http://arxiv.org/pdf/2503.04671v1",
            "published": "2025-03-06 18:03:46+00:00",
            "updated": "2025-03-06 18:03:46+00:00"
        },
        {
            "title": "Euclideanization without Complexification of the Spacetime",
            "authors": "Nicole Drew, Venkatraman Gopalan, Martin Bojowald",
            "summary": "Minkowski spacetime can be mapped by a series of projections in a\nhigher-dimensional spacetime to a Euclidean space, constituting a process of\nEuclideanization shown here in detail for two dimensions. The result allows\nregularizations and computations of integrals that appear in quantum field\ntheory (QFT) without performing the standard Wick rotation of time to imaginary\nvalues. However, there is no physical spacetime transformation that produces a\nWick rotation. In avoiding this complexification process, the new\nEuclidenization procedure has important advantages in the transformations of\nthe action principles, including fermionic fields and theories at constant\nchemical potential. In all cases, complex-valued amplitudes of the form\n$\\exp(iS/\\hbar)$ are mapped to real statistical weights $\\exp(-S_{\\rm\nE}/\\hbar)$ with a Euclidean action $S_{\\rm E}$. The procedure is also amenable\nto fields on curved background spacetimes as well as gravitational\ninteractions.",
            "pdf_url": "http://arxiv.org/pdf/2503.04654v1",
            "published": "2025-03-06 17:45:51+00:00",
            "updated": "2025-03-06 17:45:51+00:00"
        },
        {
            "title": "Characterization and Mitigation of Crosstalk in Quantum Error Correction",
            "authors": "Zeyuan Zhou, Andrew Ji, Yongshan Ding",
            "summary": "The design and performance analysis of quantum error correction (QEC) codes\nare often based on incoherent and independent noise models since it is easy to\nsimulate. However, these models fail to capture realistic hardware noise\nsources, such as correlated errors (crosstalk), which can significantly impact\nQEC code performance, especially when they occur between data and ancillary\nqubits. In this paper, we systematically study various types of crosstalk noise\nand quantify their effects on surface codes through memory and stability\nexperiments. Based on our findings, we introduce crosstalk-robust\nimplementations of QEC via redundant stabilizer checks and flag qubit designs.\nIn addition, we analyze logical crosstalk in an $[[n,k>1,d]]$ code block and\nestablish analytical conditions under which physical crosstalk does not lead to\nlogical crosstalk. Together, our analytical and numerical results shed light on\ndesigning QEC codes that are robust against hardware-realistic noise, paving\nthe way for reliable experimental realization of fault-tolerant quantum\ncomputing.",
            "pdf_url": "http://arxiv.org/pdf/2503.04642v1",
            "published": "2025-03-06 17:32:01+00:00",
            "updated": "2025-03-06 17:32:01+00:00"
        },
        {
            "title": "Simulating the Real World: A Unified Survey of Multimodal Generative Models",
            "authors": "Yuqi Hu, Longguang Wang, Xian Liu, Ling-Hao Chen, Yuwei Guo, Yukai Shi, Ce Liu, Anyi Rao, Zeyu Wang, Hui Xiong",
            "summary": "Understanding and replicating the real world is a critical challenge in\nArtificial General Intelligence (AGI) research. To achieve this, many existing\napproaches, such as world models, aim to capture the fundamental principles\ngoverning the physical world, enabling more accurate simulations and meaningful\ninteractions. However, current methods often treat different modalities,\nincluding 2D (images), videos, 3D, and 4D representations, as independent\ndomains, overlooking their interdependencies. Additionally, these methods\ntypically focus on isolated dimensions of reality without systematically\nintegrating their connections. In this survey, we present a unified survey for\nmultimodal generative models that investigate the progression of data\ndimensionality in real-world simulation. Specifically, this survey starts from\n2D generation (appearance), then moves to video (appearance+dynamics) and 3D\ngeneration (appearance+geometry), and finally culminates in 4D generation that\nintegrate all dimensions. To the best of our knowledge, this is the first\nattempt to systematically unify the study of 2D, video, 3D and 4D generation\nwithin a single framework. To guide future research, we provide a comprehensive\nreview of datasets, evaluation metrics and future directions, and fostering\ninsights for newcomers. This survey serves as a bridge to advance the study of\nmultimodal generative models and real-world simulation within a unified\nframework.",
            "pdf_url": "http://arxiv.org/pdf/2503.04641v1",
            "published": "2025-03-06 17:31:43+00:00",
            "updated": "2025-03-06 17:31:43+00:00"
        },
        {
            "title": "Meshless Super-Resolution of Scattered Data via constrained RBFs and KNN-Driven Densification",
            "authors": "Iacopo Tirelli, Miguel Alfonso Mendez, Andrea Ianiro, Stefano Discetti",
            "summary": "We propose a novel meshless method to achieve super-resolution from scattered\ndata obtained from sparse, randomly-positioned sensors such as the particle\ntracers of particle tracking velocimetry. The method combines K-Nearest\nNeighbor Particle Tracking Velocimetry (KNN-PTV, Tirelli et al. 2023) with\nmeshless Proper Orthogonal Decomposition (meshless POD, Tirelli et al. 2025)\nand constrained Radial Basis Function regression (c-RBFs, Sperotto et al.\n2022). The main idea is to use KNN-PTV to enhance the spatial resolution of\nflow fields by blending data from \\textit{locally similar} flow regions\navailable in the time series. This \\textit{similarity} is assessed in terms of\nstatistical coherency with leading features, identified by meshless POD\ndirectly on the scattered data without the need to first interpolate onto a\ngrid, but instead relying on RBFs to compute all the relevant inner products.\nLastly, the proposed approach uses the c-RBF on the denser scattered\ndistributions to derive an analytical representation of the flow fields that\nincorporates physical constraints. This combination is meshless because it does\nnot require the definition of a grid at any step of the calculation, thus\nproviding flexibility in handling complex geometries. The algorithm is\nvalidated on 3D measurements of a jet flow in air. The assessment covers three\nkey aspects: statistics, spectra, and modal analysis. The proposed method is\nevaluated against standard Particle Image Velocimetry, KNN-PTV, and c-RBFs. The\nresults demonstrate improved accuracy, with an average error on the order of\n11%, compared to 13-14% for the other methods. Additionally, the proposed\nmethod achieves an increase in the cutoff frequency of approximately 3-4/D,\ncompared to the values observed in the competing approaches. Furthermore, it\nshows nearly half the errors in low-order reconstructions.",
            "pdf_url": "http://arxiv.org/pdf/2503.04630v1",
            "published": "2025-03-06 17:16:43+00:00",
            "updated": "2025-03-06 17:16:43+00:00"
        },
        {
            "title": "Physical, Empirical, and Conditional Inductive Possibility",
            "authors": "Balazs Gyenis",
            "summary": "I argue that John Norton's notions of empirical, hypothetical, and\ncounterfactual possibility can be successfully used to analyze counterintuitive\nexamples of physical possibility and align better with modal intuitions of\npracticing physicists. First, I clarify the relationship between Norton's\npossibility notions and the received view of logical and physical possibility.\nIn particular, I argue that Norton's empirical, hypothetical, and\ncounterfactual possibility cannot coincide with the received view of physical\npossibility; instead, the received view of physical possibility is a special\ncase of Norton's logical possibility. I illustrate my claims using examples\nfrom Classical Mechanics, General Relativity, and Quantum Mechanics. I then\narrive at my conclusions by subsuming Norton's empirical, hypothetical, and\ncounterfactual possibilities under a single concept of conditional inductive\npossibility and by analyzing the types and degrees of strengths that can be\nassociated with it.",
            "pdf_url": "http://arxiv.org/pdf/2503.04601v1",
            "published": "2025-03-06 16:43:09+00:00",
            "updated": "2025-03-06 16:43:09+00:00"
        },
        {
            "title": "Impact of chaos on the excited-state quantum phase transition of the Kerr parametric oscillator",
            "authors": "Ignacio García-Mata, Miguel A. Prado Reynoso, Rodrigo G. Cortiñas, Jorge Chávez-Carlos, Victor S. Batista, Lea F. Santos, Diego A. Wisniacki",
            "summary": "The driven Kerr parametric oscillator, of interest to fundamental physics and\nquantum technologies, exhibits an excited state quantum phase transition\n(ESQPT) originating in an unstable classical periodic orbit. The main signature\nof this type of ESQPT is a singularity in the level density in the vicinity of\nthe energy of the classical separatrix that divides the phase space into two\ndistinct regions. The quantum states with energies below the separatrix are\nuseful for quantum technologies, because they show a cat-like structure that\nprotects them against local decoherence processes. In this work, we show how\nchaos arising from the interplay between the external drive and the\nnonlinearities of the system destroys the ESQPT and eventually eliminates the\ncat states. Our results demonstrate the importance of the analysis of\ntheoretical models for the design of new parametric oscillators with ever\nlarger nonlinearities.",
            "pdf_url": "http://arxiv.org/pdf/2408.00934v3",
            "published": "2024-08-01 21:56:00+00:00",
            "updated": "2025-03-06 16:39:49+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Coarse graining and reduced order models for plume ejection dynamics",
            "authors": "Ike Griss Salas, Megan R. Ebers, Jake Stevens-Haas, J. Nathan Kutz",
            "summary": "Monitoring the atmospheric dispersion of pollutants is increasingly critical\nfor environmental impact assessments. High-fidelity computational models are\noften employed to simulate plume dynamics, guiding decision-making and\nprioritizing resource deployment. However, such models can be prohibitively\nexpensive to simulate, as they require resolving turbulent flows at fine\nspatial and temporal resolutions. Moreover, there are at least two distinct\ndynamical regimes of interest in the plume: (i) the initial ejection of the\nplume where turbulent mixing is generated by the shear-driven Kelvin-Helmholtz\ninstability, and (ii) the ensuing turbulent diffusion and advection which is\noften modeled by the Gaussian plume model. We address the challenge of modeling\nthe initial plume generation. Specifically, we propose a data-driven framework\nthat identifies a reduced-order analytical model for plume dynamics -- directly\nfrom video data. We extract a time series of plume center and edge points from\nvideo snapshots and evaluate different regressions based to their extrapolation\nperformance to generate a time series of coefficients that characterize the\nplume's overall direction and spread. We regress to a sinusoidal model inspired\nby the Kelvin-Helmholtz instability for the edge points in order to identify\nthe plume's dispersion and vorticity. Overall, this reduced-order modeling\nframework provides a data-driven and lightweight approach to capture the\ndominant features of the initial nonlinear point-source plume dynamics,\nagnostic to plume type and starting only from video. The resulting model is a\npre-cursor to standard models such as the Gaussian plume model and has the\npotential to enable rapid assessment and evaluation of critical environmental\nhazards, such as methane leaks, chemical spills, and pollutant dispersal from\nsmokestacks.",
            "pdf_url": "http://arxiv.org/pdf/2503.04690v1",
            "published": "2025-03-06 18:32:35+00:00",
            "updated": "2025-03-06 18:32:35+00:00"
        },
        {
            "title": "Compositional World Knowledge leads to High Utility Synthetic data",
            "authors": "Sachit Gaudi, Gautam Sreekumar, Vishnu Boddeti",
            "summary": "Machine learning systems struggle with robustness, under subpopulation\nshifts. This problem becomes especially pronounced in scenarios where only a\nsubset of attribute combinations is observed during training -a severe form of\nsubpopulation shift, referred as compositional shift. To address this problem,\nwe ask the following question: Can we improve the robustness by training on\nsynthetic data, spanning all possible attribute combinations? We first show\nthat training of conditional diffusion models on limited data lead to incorrect\nunderlying distribution. Therefore, synthetic data sampled from such models\nwill result in unfaithful samples and does not lead to improve performance of\ndownstream machine learning systems. To address this problem, we propose CoInD\nto reflect the compositional nature of the world by enforcing conditional\nindependence through minimizing Fisher's divergence between joint and marginal\ndistributions. We demonstrate that synthetic data generated by CoInD is\nfaithful and this translates to state-of-the-art worst-group accuracy on\ncompositional shift tasks on CelebA.",
            "pdf_url": "http://arxiv.org/pdf/2503.04687v1",
            "published": "2025-03-06 18:29:45+00:00",
            "updated": "2025-03-06 18:29:45+00:00"
        },
        {
            "title": "A Simple and Effective Reinforcement Learning Method for Text-to-Image Diffusion Fine-tuning",
            "authors": "Shashank Gupta, Chaitanya Ahuja, Tsung-Yu Lin, Sreya Dutta Roy, Harrie Oosterhuis, Maarten de Rijke, Satya Narayan Shukla",
            "summary": "Reinforcement learning (RL)-based fine-tuning has emerged as a powerful\napproach for aligning diffusion models with black-box objectives. Proximal\npolicy optimization (PPO) is the most popular choice of method for policy\noptimization. While effective in terms of performance, PPO is highly sensitive\nto hyper-parameters and involves substantial computational overhead. REINFORCE,\non the other hand, mitigates some computational complexities such as high\nmemory overhead and sensitive hyper-parameter tuning, but has suboptimal\nperformance due to high-variance and sample inefficiency. While the variance of\nthe REINFORCE can be reduced by sampling multiple actions per input prompt and\nusing a baseline correction term, it still suffers from sample inefficiency. To\naddress these challenges, we systematically analyze the\nefficiency-effectiveness trade-off between REINFORCE and PPO, and propose\nleave-one-out PPO (LOOP), a novel RL for diffusion fine-tuning method. LOOP\ncombines variance reduction techniques from REINFORCE, such as sampling\nmultiple actions per input prompt and a baseline correction term, with the\nrobustness and sample efficiency of PPO via clipping and importance sampling.\nOur results demonstrate that LOOP effectively improves diffusion models on\nvarious black-box objectives, and achieves a better balance between\ncomputational efficiency and performance.",
            "pdf_url": "http://arxiv.org/pdf/2503.00897v3",
            "published": "2025-03-02 13:43:53+00:00",
            "updated": "2025-03-06 17:19:22+00:00"
        },
        {
            "title": "The Best of Both Worlds: Integrating Language Models and Diffusion Models for Video Generation",
            "authors": "Aoxiong Yin, Kai Shen, Yichong Leng, Xu Tan, Xinyu Zhou, Juncheng Li, Siliang Tang",
            "summary": "Recent advancements in text-to-video (T2V) generation have been driven by two\ncompeting paradigms: autoregressive language models and diffusion models.\nHowever, each paradigm has intrinsic limitations: language models struggle with\nvisual quality and error accumulation, while diffusion models lack semantic\nunderstanding and causal modeling. In this work, we propose LanDiff, a hybrid\nframework that synergizes the strengths of both paradigms through\ncoarse-to-fine generation. Our architecture introduces three key innovations:\n(1) a semantic tokenizer that compresses 3D visual features into compact 1D\ndiscrete representations through efficient semantic compression, achieving a\n$\\sim$14,000$\\times$ compression ratio; (2) a language model that generates\nsemantic tokens with high-level semantic relationships; (3) a streaming\ndiffusion model that refines coarse semantics into high-fidelity videos.\nExperiments show that LanDiff, a 5B model, achieves a score of 85.43 on the\nVBench T2V benchmark, surpassing the state-of-the-art open-source models\nHunyuan Video (13B) and other commercial models such as Sora, Keling, and\nHailuo. Furthermore, our model also achieves state-of-the-art performance in\nlong video generation, surpassing other open-source models in this field. Our\ndemo can be viewed at https://landiff.github.io/.",
            "pdf_url": "http://arxiv.org/pdf/2503.04606v1",
            "published": "2025-03-06 16:53:14+00:00",
            "updated": "2025-03-06 16:53:14+00:00"
        }
    ]
}