{
    "Physics": [
        {
            "title": "Cubic Dirac Semimetals: General Theory and Application to Rare-Earth Magnets",
            "authors": "Shouvik Sur, Chandan Setty",
            "summary": "Rare-earth magnets with parent cubic symmetry exhibit unique topological\nproperties. However, the origin of these behaviors remains presently unclear.\nHere, we develop minimal models for Dirac semimetals (DSMs) with accidental\nband crossings and higher-order topology in cubic systems, incorporating\ncandidate magnetic order to analyze bulk, surface, and hinge state\ncharacteristics. In certain cubic-symmetric DSMs, we identify an effective Z2\nchiral symmetry which significantly impacts surface and hinge-localized states.\nOur results highlight distinct features in surface state dispersions, Fermi\narcs, polarization dependence, and band splitting that correlate with photoe-\nmission data in rare-earth monopnictides. We also suggest candidate materials\nand experimental tests for further validation. These findings advance our\nunderstanding of surface states in rare-earth magnets with parent cubic\nsymmetries and illuminate the role of DSM physics in these systems.",
            "pdf_url": "http://arxiv.org/pdf/2411.09699v1",
            "published": "2024-11-14 18:59:31+00:00",
            "updated": "2024-11-14 18:59:31+00:00"
        },
        {
            "title": "A Universal Circuit Set Using the $S_3$ Quantum Double",
            "authors": "Liyuan Chen, Yuanjie Ren, Ruihua Fan, Arthur Jaffe",
            "summary": "One potential route toward fault-tolerant universal quantum computation is to\nuse non-Abelian topological codes. In this work, we investigate how to achieve\nthis goal with the quantum double model $\\mathcal{D}(S_3)$ -- a specific\nnon-Abelian topological code. By embedding each on-site Hilbert space into a\nqubit-qutrit pair, we give an explicit construction of the circuits for\ncreating, moving, and locally measuring all non-trivial anyons. We also design\na specialized anyon interferometer to measure the total charge remotely for\nwell-separated anyons; this avoids fusing them together. These protocols enable\nthe implementation of a universal gate set proposed by Cui et al. and active\nquantum error correction of the circuit-level noise during the computation\nprocess. To further reduce the error rate and facilitate error correction, we\nencode each physical degree of freedom of $\\mathcal{D}(S_3)$ into a novel,\nquantum, error-correcting code, enabling fault-tolerant realization, at the\nlogical level, of all gates in the anyon manipulation circuits. Our proposal\noffers a promising path to realize universal topological quantum computation in\nthe NISQ era.",
            "pdf_url": "http://arxiv.org/pdf/2411.09697v1",
            "published": "2024-11-14 18:58:41+00:00",
            "updated": "2024-11-14 18:58:41+00:00"
        },
        {
            "title": "A physical basis for cosmological correlators from cuts",
            "authors": "Shounak De, Andrzej Pokraka",
            "summary": "Significant progress has been made in our understanding of the analytic\nstructure of FRW wavefunction coefficients, facilitated by the development of\nefficient algorithms to derive the differential equations they satisfy.\nMoreover, recent findings indicate that the twisted cohomology of the\nassociated hyperplane arrangement defining FRW integrals overestimates the\nnumber of integrals required to define differential equations for the\nwavefunction coefficient. We demonstrate that the associated dual cohomology is\nautomatically organized in a way that is ideal for understanding and exploiting\nthe cut/residue structure of FRW integrals. Utilizing this understanding, we\ndevelop a systematic approach to organize compatible sequential residues, which\ndictates the physical subspace of FRW integrals for any $n$-site, $\\ell$-loop\ngraph. In particular, the physical subspace of tree-level FRW wavefunction\ncoefficients is populated by differential forms associated to cuts/residues\nthat factorize the integrand of the wavefunction coefficient into only flat\nspace amplitudes. After demonstrating the validity of our construction using\nintersection theory, we develop simple graphical rules for cut tubings that\nenumerate the space of physical cuts and, consequently, differential forms\nwithout any calculation.",
            "pdf_url": "http://arxiv.org/pdf/2411.09695v1",
            "published": "2024-11-14 18:58:34+00:00",
            "updated": "2024-11-14 18:58:34+00:00"
        },
        {
            "title": "NeuralDEM - Real-time Simulation of Industrial Particulate Flows",
            "authors": "Benedikt Alkin, Tobias Kronlachner, Samuele Papa, Stefan Pirker, Thomas Lichtenegger, Johannes Brandstetter",
            "summary": "Advancements in computing power have made it possible to numerically simulate\nlarge-scale fluid-mechanical and/or particulate systems, many of which are\nintegral to core industrial processes. Among the different numerical methods\navailable, the discrete element method (DEM) provides one of the most accurate\nrepresentations of a wide range of physical systems involving granular and\ndiscontinuous materials. Consequently, DEM has become a widely accepted\napproach for tackling engineering problems connected to granular flows and\npowder mechanics. Additionally, DEM can be integrated with grid-based\ncomputational fluid dynamics (CFD) methods, enabling the simulation of chemical\nprocesses taking place, e.g., in fluidized beds. However, DEM is\ncomputationally intensive because of the intrinsic multiscale nature of\nparticulate systems, restricting simulation duration or number of particles.\nTowards this end, NeuralDEM presents an end-to-end approach to replace slow\nnumerical DEM routines with fast, adaptable deep learning surrogates. NeuralDEM\nis capable of picturing long-term transport processes across different regimes\nusing macroscopic observables without any reference to microscopic model\nparameters. First, NeuralDEM treats the Lagrangian discretization of DEM as an\nunderlying continuous field, while simultaneously modeling macroscopic behavior\ndirectly as additional auxiliary fields. Second, NeuralDEM introduces\nmulti-branch neural operators scalable to real-time modeling of\nindustrially-sized scenarios - from slow and pseudo-steady to fast and\ntransient. Such scenarios have previously posed insurmountable challenges for\ndeep learning models. Notably, NeuralDEM faithfully models coupled CFD-DEM\nfluidized bed reactors of 160k CFD cells and 500k DEM particles for\ntrajectories of 28s. NeuralDEM will open many new doors to advanced engineering\nand much faster process cycles.",
            "pdf_url": "http://arxiv.org/pdf/2411.09678v1",
            "published": "2024-11-14 18:44:31+00:00",
            "updated": "2024-11-14 18:44:31+00:00"
        },
        {
            "title": "Commentary on Peierls's \"In defence of measurement\" in Physics World, January 1991",
            "authors": "Tuck C Choy",
            "summary": "This paper is a commentary on Rudolph Peierls's \"In defence of measurement\"\nPhysics World 19-20, January 1991 to accompany the reprint of this paper for\nthe special volume dedicated to the celebration of the centenary of the\ndiscovery of quantum mechanics by Werner Heisenberg, to be published by World\nScientific in July 2025.",
            "pdf_url": "http://arxiv.org/pdf/2411.07359v2",
            "published": "2024-11-11 20:48:36+00:00",
            "updated": "2024-11-14 18:38:16+00:00"
        },
        {
            "title": "Inclusive top cross sections in ATLAS",
            "authors": "Charlie Chen",
            "summary": "The ATLAS collaboration at the LHC has published inclusive cross-section\nmeasurements for the single-top and $t\\bar{t}$ production modes at\ncenter-of-mass energies of $\\sqrt{s} = 5.02, 8.16$, $13, 13.6$ TeV. Single-top\nmeasurements are conducted in the $t$-channel and $tW$ channel. In addition to\nthe nominal cross-section measurements, various measurements of other\ninteresting observables such as $|f_{\\text{LV}}V_{\\text{tb}}|$, $R_\\text{t}$,\n$R_{t\\bar{t}/Z}$, and $R_{\\text{pA}}$ are also reported. These results are\ncompared to their corresponding SM predictions, calculated at (N)NLO in QCD.\nAll results are in good agreement with SM predictions.",
            "pdf_url": "http://arxiv.org/pdf/2411.09663v1",
            "published": "2024-11-14 18:33:00+00:00",
            "updated": "2024-11-14 18:33:00+00:00"
        },
        {
            "title": "Differentiable Land Model Reveals Global Environmental Controls on Ecological Parameters",
            "authors": "Jianing Fang, Kevin Bowman, Wenli Zhao, Xu Lian, Pierre Gentine",
            "summary": "Accurate modeling of terrestrial carbon and water exchange requires robust\necological parameters that capture vegetation responses and adaptations to the\nlocal environment. The current generation of land models use Plant Functional\nTypes (PFTs) to discretize vegetation functional diversity, but these coarse\ncategorizations often overlook fine-scale variations shaped by local climate,\nsoil, and forest age factors. The lack of governing equations for plant\nadaptation demands a paradigm shift in how we integrate diverse Earth\nobservations to uncover ecological functional dependence on changing\nenvironments. To address this challenge, we developed DifferLand, a\ndifferentiable, hybrid physics and machine learning model that infers the\nspatial distributions of ecological parameters and their relationships with\nenvironmental factors constrained by satellite and in-situ observations. Our\nmodel unifies top-down and bottom-up observational constraints with\nprocess-based knowledge to generate a global analysis of ecological functions\nand their adaptation to environmental gradients. We found PFTs account for less\nthan half of the explainable spatial parameter variations controlling carbon\nfluxes and vegetation states. The remaining parameter variability is largely\ndriven by local climate and forest demography factors, and the learned\nenvironment-parameter relationships lead to enhanced spatial generalization at\nunseen locations. DifferLand identified growing season length, leaf economics,\nand agricultural intensity as the three orthogonal spatial gradients underlying\nparameter variations. Our novel framework can lead to new insights on global\ncarbon cycling by learning directly from data and expanding our understanding\nof local responses of ecosystems to environmental drivers.",
            "pdf_url": "http://arxiv.org/pdf/2411.09654v1",
            "published": "2024-11-14 18:21:10+00:00",
            "updated": "2024-11-14 18:21:10+00:00"
        },
        {
            "title": "Unitarization of electron scattering with an external potential at NLO in QED",
            "authors": "J. A. Oller, Marcela Peláez",
            "summary": "We have calculated the one-loop scattering amplitude of an electron by an\nexternal Coulomb potential in QED free of infrared divergences. This feature is\nachieved by applying the Faddeev-Kulish formalism, which implies a redefinition\nof both the asymptotic electronic states and of the $S$ matrix. Additionally,\nwe have also derived the infrared-finite one-loop partial-wave amplitudes for\nthis process by applying a recent method in the literature. Next, these\npartial-wave amplitudes are unitarized based on analyticity and unitarity by\nemploying three different methods of unitarization: the algebraic $N/D$ method,\nthe Inverse Amplitude Method and the first iterated $N/D$ method. Then, we have\nstudied several partial waves both for physical momentum and for complex ones\nto look for bound-state poles. The binding momentum for the fundamental bound\nstate in $S$ wave is discussed with special detail. This is a wide-ranging\nmethod for calculating nonperturbative partial-wave amplitudes for\ninfinite-range interactions that could be applied to many other systems.",
            "pdf_url": "http://arxiv.org/pdf/2407.15382v2",
            "published": "2024-07-22 05:11:16+00:00",
            "updated": "2024-11-14 18:12:59+00:00"
        },
        {
            "title": "The lowest-radiation environments in the Solar System: new opportunities for underground rare-event searches",
            "authors": "Xilin Zhang, Jason Detwiler, Clint Wiseman",
            "summary": "We study neutrino, muon, and gamma-ray fluxes in extraterrestrial\nenvironments in our Solar System via semi-analytical estimates and Monte Carlo\nsimulations. In sites with negligible atmosphere, we find a strong reduction in\nthe cosmic-ray-induced neutrino and muon fluxes relative to their intensities\non Earth. Neutrinos with energies between 50 MeV and 100 TeV show particularly\nstrong suppression, by as much as 10$^3$, even at shallow depths. The solar\nneutrino suppression increases as the square of the site's distance from the\nSun. Natural radiation due to nuclear decay is also expected to be lower in\nmany of these locations and may be reduced to effectively negligible levels in\nthe liquid water environments. The sites satisfying these characteristics\nrepresent an opportunity for greatly extending the physics reach of underground\nsearches in fundamental physics, such as searches for WIMP Dark Matter,\nneutrinoless double-beta decay, the diffuse supernova neutrinos, and neutrinos\nfrom nearby supernova. As a potential near-term target, we propose a\nmeasurement of muon and gamma-ray fluxes in an accessible underground lunar\nsite such as the Mare Tranquillitatis Pit to perform a first measurement of the\nprompt component in cosmic-ray-induced particle production, and to constrain\nlunar evolution models.",
            "pdf_url": "http://arxiv.org/pdf/2411.09634v1",
            "published": "2024-11-14 18:00:36+00:00",
            "updated": "2024-11-14 18:00:36+00:00"
        },
        {
            "title": "Study of large extra dimension and neutrino decay at P2SO experiment",
            "authors": "Papia Panda, Priya Mishra, Samiran Roy, Monojit Ghosh, Rukmani Mohanta",
            "summary": "In this study, we examine two important new physics scenarios, \\textit{i.e},\nthe theory of Large Extra Dimension (LED) and the theory of neutrino decay. We\nstudy LED in the context of P2SO, DUNE, and T2HK with emphasis on P2SO, whereas\ndecay has been studied solely in the context of P2SO. For LED, in our study we\nfind that the combination of P2SO, DUNE, and T2HK can provide a better bound\nthan the current one only if all the oscillation parameters are measured with\nabsolute certainty. However, for decay, one can obtain a better bound with P2SO\nas compared to ESSnuSB and MOMENT, but the bound obtained by P2SO is weak as\ncompared to DUNE and T2HK. Regarding sensitivities to the current unknowns, if\nLED exists in nature, its impact on mass ordering, octant, and CP violation is\nvery mild; however, decay can alter the sensitivities related to CP violation\nand octant in a non-trivial way.",
            "pdf_url": "http://arxiv.org/pdf/2411.09628v1",
            "published": "2024-11-14 17:55:20+00:00",
            "updated": "2024-11-14 17:55:20+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "MICCAI-CDMRI 2023 QuantConn Challenge Findings on Achieving Robust Quantitative Connectivity through Harmonized Preprocessing of Diffusion MRI",
            "authors": "Nancy R. Newlin, Kurt Schilling, Serge Koudoro, Bramsh Qamar Chandio, Praitayini Kanakaraj, Daniel Moyer, Claire E. Kelly, Sila Genc, Jian Chen, Joseph Yuan-Mou Yang, Ye Wu, Yifei He, Jiawei Zhang, Qingrun Zeng, Fan Zhang, Nagesh Adluru, Vishwesh Nath, Sudhir Pathak, Walter Schneider, Anurag Gade, Yogesh Rathi, Tom Hendriks, Anna Vilanova, Maxime Chamberland, Tomasz Pieciak, Dominika Ciupek, Antonio Tristán Vega, Santiago Aja-Fernández, Maciej Malawski, Gani Ouedraogo, Julia Machnio, Christian Ewert, Paul M. Thompson, Neda Jahanshad, Eleftherios Garyfallidis, Bennett A. Landman",
            "summary": "White matter alterations are increasingly implicated in neurological diseases\nand their progression. International-scale studies use diffusion-weighted\nmagnetic resonance imaging (DW-MRI) to qualitatively identify changes in white\nmatter microstructure and connectivity. Yet, quantitative analysis of DW-MRI\ndata is hindered by inconsistencies stemming from varying acquisition\nprotocols. There is a pressing need to harmonize the preprocessing of DW-MRI\ndatasets to ensure the derivation of robust quantitative diffusion metrics\nacross acquisitions. In the MICCAI-CDMRI 2023 QuantConn challenge, participants\nwere provided raw data from the same individuals collected on the same scanner\nbut with two different acquisitions and tasked with preprocessing the DW-MRI to\nminimize acquisition differences while retaining biological variation.\nSubmissions are evaluated on the reproducibility and comparability of\ncross-acquisition bundle-wise microstructure measures, bundle shape features,\nand connectomics. The key innovations of the QuantConn challenge are that (1)\nwe assess bundles and tractography in the context of harmonization for the\nfirst time, (2) we assess connectomics in the context of harmonization for the\nfirst time, and (3) we have 10x additional subjects over prior harmonization\nchallenge, MUSHAC and 100x over SuperMUDI. We find that bundle surface area,\nfractional anisotropy, connectome assortativity, betweenness centrality, edge\ncount, modularity, nodal strength, and participation coefficient measures are\nmost biased by acquisition and that machine learning voxel-wise correction,\nRISH mapping, and NeSH methods effectively reduce these biases. In addition,\nmicrostructure measures AD, MD, RD, bundle length, connectome density,\nefficiency, and path length are least biased by these acquisition differences.",
            "pdf_url": "http://arxiv.org/pdf/2411.09618v1",
            "published": "2024-11-14 17:37:19+00:00",
            "updated": "2024-11-14 17:37:19+00:00"
        },
        {
            "title": "Diffusion Sampling Correction via Approximately 10 Parameters",
            "authors": "Guangyi Wang, Wei Peng, Lijiang Li, Wenyu Chen, Yuren Cai, Songzhi Su",
            "summary": "Diffusion Probabilistic Models (DPMs) have demonstrated exceptional\nperformance in generative tasks, but this comes at the expense of sampling\nefficiency. To enhance sampling speed without sacrificing quality, various\ndistillation-based accelerated sampling algorithms have been recently proposed.\nHowever, they typically require significant additional training costs and model\nparameter storage, which limit their practical application. In this work, we\npropose PCA-based Adaptive Search (PAS), which optimizes existing solvers for\nDPMs with minimal learnable parameters and training costs. Specifically, we\nfirst employ PCA to obtain a few orthogonal unit basis vectors to span the\nhigh-dimensional sampling space, which enables us to learn just a set of\ncoordinates to correct the sampling direction; furthermore, based on the\nobservation that the cumulative truncation error exhibits an ``S''-shape, we\ndesign an adaptive search strategy that further enhances the sampling\nefficiency and reduces the number of stored parameters to approximately 10.\nExtensive experiments demonstrate that PAS can significantly enhance existing\nfast solvers in a plug-and-play manner with negligible costs. For instance, on\nCIFAR10, PAS requires only 12 parameters and less than 1 minute of training on\na single NVIDIA A100 GPU to optimize the DDIM from 15.69 FID (NFE=10) to 4.37.",
            "pdf_url": "http://arxiv.org/pdf/2411.06503v2",
            "published": "2024-11-10 15:57:53+00:00",
            "updated": "2024-11-14 16:15:20+00:00"
        },
        {
            "title": "Golden Noise for Diffusion Models: A Learning Framework",
            "authors": "Zikai Zhou, Shitong Shao, Lichen Bai, Zhiqiang Xu, Bo Han, Zeke Xie",
            "summary": "Text-to-image diffusion model is a popular paradigm that synthesizes\npersonalized images by providing a text prompt and a random Gaussian noise.\nWhile people observe that some noises are ``golden noises'' that can achieve\nbetter text-image alignment and higher human preference than others, we still\nlack a machine learning framework to obtain those golden noises. To learn\ngolden noises for diffusion sampling, we mainly make three contributions in\nthis paper. First, we identify a new concept termed the \\textit{noise prompt},\nwhich aims at turning a random Gaussian noise into a golden noise by adding a\nsmall desirable perturbation derived from the text prompt. Following the\nconcept, we first formulate the \\textit{noise prompt learning} framework that\nsystematically learns ``prompted'' golden noise associated with a text prompt\nfor diffusion models. Second, we design a noise prompt data collection pipeline\nand collect a large-scale \\textit{noise prompt dataset}~(NPD) that contains\n100k pairs of random noises and golden noises with the associated text prompts.\nWith the prepared NPD as the training dataset, we trained a small \\textit{noise\nprompt network}~(NPNet) that can directly learn to transform a random noise\ninto a golden noise. The learned golden noise perturbation can be considered as\na kind of prompt for noise, as it is rich in semantic information and tailored\nto the given text prompt. Third, our extensive experiments demonstrate the\nimpressive effectiveness and generalization of NPNet on improving the quality\nof synthesized images across various diffusion models, including SDXL,\nDreamShaper-xl-v2-turbo, and Hunyuan-DiT. Moreover, NPNet is a small and\nefficient controller that acts as a plug-and-play module with very limited\nadditional inference and computational costs, as it just provides a golden\nnoise instead of a random noise without accessing the original pipeline.",
            "pdf_url": "http://arxiv.org/pdf/2411.09502v1",
            "published": "2024-11-14 15:13:13+00:00",
            "updated": "2024-11-14 15:13:13+00:00"
        }
    ]
}