{
    "Physics": [
        {
            "title": "Hybrid summary statistics: neural weak lensing inference beyond the power spectrum",
            "authors": "T. Lucas Makinen, Tom Charnock, Natalia Porqueres, Axel Lapel, Alan Heavens, Benjamin D. Wandelt",
            "summary": "In inference problems, we often have domain knowledge which allows us to\ndefine summary statistics that capture most of the information content in a\ndataset. In this paper, we present a hybrid approach, where such physics-based\nsummaries are augmented by a set of compressed neural summary statistics that\nare optimised to extract the extra information that is not captured by the\npredefined summaries. The resulting statistics are very powerful inputs to\nsimulation-based or implicit inference of model parameters. We apply this\ngeneralisation of Information Maximising Neural Networks (IMNNs) to parameter\nconstraints from tomographic weak gravitational lensing convergence maps to\nfind summary statistics that are explicitly optimised to complement angular\npower spectrum estimates. We study several dark matter simulation resolutions\nin low- and high-noise regimes. We show that i) the information-update\nformalism extracts at least $3\\times$ and up to $8\\times$ as much information\nas the angular power spectrum in all noise regimes, ii) the network summaries\nare highly complementary to existing 2-point summaries, and iii) our formalism\nallows for networks with smaller, physically-informed architectures to match\nmuch larger regression networks with far fewer simulations needed to obtain\nasymptotically optimal inference.",
            "pdf_url": "http://arxiv.org/pdf/2407.18909v1",
            "published": "2024-07-26 17:59:26+00:00",
            "updated": "2024-07-26 17:59:26+00:00"
        },
        {
            "title": "Lessons from Learning to Spin \"Pens\"",
            "authors": "Jun Wang, Ying Yuan, Haichuan Che, Haozhi Qi, Yi Ma, Jitendra Malik, Xiaolong Wang",
            "summary": "In-hand manipulation of pen-like objects is an important skill in our daily\nlives, as many tools such as hammers and screwdrivers are similarly shaped.\nHowever, current learning-based methods struggle with this task due to a lack\nof high-quality demonstrations and the significant gap between simulation and\nthe real world. In this work, we push the boundaries of learning-based in-hand\nmanipulation systems by demonstrating the capability to spin pen-like objects.\nWe first use reinforcement learning to train an oracle policy with privileged\ninformation and generate a high-fidelity trajectory dataset in simulation. This\nserves two purposes: 1) pre-training a sensorimotor policy in simulation; 2)\nconducting open-loop trajectory replay in the real world. We then fine-tune the\nsensorimotor policy using these real-world trajectories to adapt it to the real\nworld dynamics. With less than 50 trajectories, our policy learns to rotate\nmore than ten pen-like objects with different physical properties for multiple\nrevolutions. We present a comprehensive analysis of our design choices and\nshare the lessons learned during development.",
            "pdf_url": "http://arxiv.org/pdf/2407.18902v1",
            "published": "2024-07-26 17:56:01+00:00",
            "updated": "2024-07-26 17:56:01+00:00"
        },
        {
            "title": "Physics-Guided Actor-Critic Reinforcement Learning for Swimming in Turbulence",
            "authors": "Christopher Koh, Laurent Pagnier, Michael Chertkov",
            "summary": "Turbulent diffusion causes particles placed in proximity to separate. We\ninvestigate the required swimming efforts to maintain a particle close to its\npassively advected counterpart. We explore optimally balancing these efforts\nwith the intended goal by developing and comparing a novel Physics-Informed\nReinforcement Learning (PIRL) strategy with prescribed control (PC) and\nstandard physics-agnostic Reinforcement Learning strategies. Our PIRL scheme,\ncoined the Actor-Physicist, is an adaptation of the Actor-Critic algorithm in\nwhich the Neural Network parameterized Critic is replaced with an analytically\nderived physical heuristic function (the physicist). This strategy is then\ncompared with an analytically computed optimal PC policy derived from a\nstochastic optimal control formulation and standard physics-agnostic\nActor-Critic type algorithms.",
            "pdf_url": "http://arxiv.org/pdf/2406.10242v2",
            "published": "2024-06-05 18:06:57+00:00",
            "updated": "2024-07-26 17:54:59+00:00"
        },
        {
            "title": "The sPHENIX Micromegas Outer Tracker",
            "authors": "S. Aune, B. Azmoun, A. Bonenfant, S. Boose, M. Bregant, D. Cacace, R. W. da Silva, R. Feder, A. Francisco, C. Goblin, A. Grabas, J. S. Haggerty, R. A. Hernandez, H. D. H. Herrera, J. Huang, J. Kelsey, I. Kotov, J. Kuczewski, I. Mandjavidze, T. A. Martins, J. Mead, J. Mills, A. Oskarsson, H. Pereira Da Costa, C. Pinkenburg, R. Pisani, T. Protzman, M. L. Purschke, E. Renner, R. Ruggiero, T. Sakaguchi, B. C. S. Sanches, B. Sayki, D. Silvermyr, W. Sondheim, M. Vandenbroucke, W. A. M. Van Noije, J. Vasquez, C. Vidal, A. Wils",
            "summary": "The sPHENIX Time Projection Chamber Outer Tracker (TPOT) is a Micromegas\nbased detector. It is a part of the sPHENIX experiment that aims to facilitate\nthe calibration of the Time Projection Chamber, in particular the correction of\nthe time-averaged and beam-induced distortions of the electron drift. This\npaper describes the detector mission, setup, construction, installation,\ncommissioning and performance during the first year of sPHENIX data taking.",
            "pdf_url": "http://arxiv.org/pdf/2403.13789v3",
            "published": "2024-03-20 17:53:13+00:00",
            "updated": "2024-07-26 17:42:16+00:00"
        },
        {
            "title": "Adaptive Parameter Selection in Nudging Based Data Assimilation",
            "authors": "Aytekin Çıbık, Rui Fang, William Layton, Farjana Siddiqua",
            "summary": "Data assimilation combines (imperfect) knowledge of a flow's physical laws\nwith (noisy, time-lagged, and otherwise imperfect) observations to produce a\nmore accurate prediction of flow statistics. Assimilation by nudging (from\n1964), while non-optimal, is easy to implement and its analysis is clear and\nwell-established. Nudging's uniform in time accuracy has even been established\nunder conditions on the nudging parameter $\\chi$ and the density of\nobservational locations, $H$, Larios, Rebholz, and Zerfas\n\\cite{larios2019global}. One remaining issue is that nudging requires the user\nto select a key parameter. The conditions required for this parameter, derived\nthrough $\\acute{a}$ priori (worst case) analysis are severe (Section\n\\ref{aprior-analysis} herein) and far beyond those found to be effective in\ncomputational experience. One resolution, developed herein, is self-adaptive\nparameter selection. This report develops, analyzes, tests, and compares two\nmethods of self-adaptation of nudging parameters. One combines analysis and\nresponse to local flow behavior. The other is based only on response to flow\nbehavior. The comparison finds both are easily implemented and yield effective\nvalues of the nudging parameter much smaller than those of $\\acute{a}$ priori\nanalysis.",
            "pdf_url": "http://arxiv.org/pdf/2407.18886v1",
            "published": "2024-07-26 17:36:25+00:00",
            "updated": "2024-07-26 17:36:25+00:00"
        },
        {
            "title": "Effective Modeling of Open Quantum Systems by Low-rank Discretization of Structured Environments",
            "authors": "Hideaki Takahashi, Raffaele Borrelli",
            "summary": "The accurate description of the interaction of a quantum system with a its\nenvironment is a challenging problem ubiquitous across all areas of physics,\nand lies at the foundation of quantum mechanics theory. Here we pioneer a new\nstrategy to create discrete low-rank models of the system-environment\ninteraction, by exploiting the frequency and time domain information encoded in\nthe fluctuation-dissipation relation connecting the system-bath correlation\nfunction and the spectral density. We demonstrate the effectiveness of our\nmethodology by combining it with tensor-network methodologies and simulating\nthe quantum dynamics of a complex excitonic systems in a highly structured\nbosonic environment. The new modeling framework sets the basis for a leap in\nthe analysis of open quantum systems providing controlled accuracy at\nsignificantly reduced computational costs, with benefits in all connected\nresearch areas.",
            "pdf_url": "http://arxiv.org/pdf/2407.18880v1",
            "published": "2024-07-26 17:27:09+00:00",
            "updated": "2024-07-26 17:27:09+00:00"
        },
        {
            "title": "Fast optical control of a coherent hole spin in a microcavity",
            "authors": "Mark Hogg, Nadia Antoniadis, Malwina Marczak, Giang Nguyen, Timon Baltisberger, Alisa Javadi, Ruediger Schott, Sascha Valentin, Andreas Wieck, Arne Ludwig, Richard Warburton",
            "summary": "A spin-photon interface is one of the key components of a quantum network.\nPhysical platforms under investigation span the range of modern experimental\nphysics, from ultra-cold atoms and ions to a variety of solid-state systems.\nEach system has its strengths and weaknesses, typically with a trade-off\nbetween spin properties and photonic properties. Currently, the best\ndeterministic single-photon sources use a semiconductor quantum dot embedded in\nan optical microcavity. However, coherent spin control has not yet been\nintegrated with a state-of-the-art single-photon source, and the magnetic noise\nfrom host nuclear spins in the semiconductor environment has placed strong\nlimitations on the spin coherence. Here, we combine high-fidelity all-optical\nspin control with a quantum dot in an open microcavity, currently the most\nefficient single-photon source platform available. By imprinting a microwave\nsignal onto a red-detuned optical field, a Raman process, we demonstrate\ncoherent rotations of a hole spin around an arbitrary axis of the Bloch sphere,\nachieving a maximum {\\pi}-pulse fidelity of 98.6%. The cavity enhances the\nRaman process, enabling ultra-fast Rabi frequencies above 1 GHz. We use our\nflexible spin control to perform optical cooling of the nuclear spins in the\nhost material via the central hole spin, extending the hole-spin coherence time\nT2* from 28 ns to 535 ns. Hahn echo preserves the spin coherence on a timescale\nof 20 {\\mu}s, and dynamical decoupling extends the coherence close to the\nrelaxation limit. Both the spin T2* and spin rotation time are much larger than\nthe Purcell-enhanced radiative recombination time, 50 ps, enabling many\nspin-photon pairs to be created before the spin loses its coherence.",
            "pdf_url": "http://arxiv.org/pdf/2407.18876v1",
            "published": "2024-07-26 17:13:09+00:00",
            "updated": "2024-07-26 17:13:09+00:00"
        },
        {
            "title": "Surpassing the Standard Quantum Limit using an Optical Spring",
            "authors": "Torrey Cullen, Scott Aronson, Ron Pagano, Jonathan Cripe, Safura Sharifi, Michelle Lollie, Henry Cain, Paula Heu, David Follman, Garrett D Cole, Nancy Aggarwal, Thomas Corbitt",
            "summary": "Quantum mechanics places noise limits and sensitivity restrictions on\nphysical measurements. The balance between unwanted backaction and the\nprecision of optical measurements impose a standard quantum limit (SQL) on\ninterferometric systems. In order to realize a sensitivity below the SQL, it is\nnecessary to leverage a back-action evading measurement technique, or else\nexploit cancellations of any excess noise contributions at the detector. %Many\nproof of principle experiments have been performed, but only recently has an\nexperiment achieved sensitivity below the SQL. In this work, we extend that\ninitial demonstration and realize sub-SQL measurement sensitivity nearly two\ntimes better than previous measurements, and with architecture applicable to\ninterferometric gravitational wave detectors. In fact, this technique is\ndirectly applicable to Advanced LIGO, which could observe similar effects with\na detuned signal recycling cavity. By exploiting quantum correlations created\nby an optical spring, we measure a total sensitivity below the SQL by\n$\\textbf{2.8}$ dB, corresponding to a reduction in the noise power by\n$\\textbf{72}\\pm\\textbf{5.1}$ \\% below the quantum limit. Through the use of a\ndetuned optical spring, this noise reduction is tunable, allowing us to choose\nthe desired range of frequencies that fall below the SQL. This result\ndemonstrates access to sensitivities well below the SQL at frequencies ranges\napplicable to LIGO, with the potential to extend the reach of gravitational\nwave detectors further into the universe.",
            "pdf_url": "http://arxiv.org/pdf/2210.12222v2",
            "published": "2022-10-21 20:00:29+00:00",
            "updated": "2024-07-26 17:09:40+00:00"
        },
        {
            "title": "Gravitational waves from a curvature-induced phase transition of a Higgs-portal dark matter sector",
            "authors": "Andreas Mantziris, Orfeu Bertolami",
            "summary": "The study of interactions between dark matter and the Higgs field opens an\nexciting connection between cosmology and particle physics, since such\nscenarios can impact the features of dark matter as well as interfering with\nthe spontaneous breaking of the electroweak symmetry. Furthermore, such\nHiggs-portal models of dark matter should be suitably harmonised with the\nvarious epochs of the universe and the phenomenological constraints imposed by\ncollider experiments. At the same time, the prospect of a stochastic\ngravitational wave background offers a promising new window into the primordial\nuniverse, which can complement the insights gained from accelerators. In this\nstudy, we examined whether gravitational waves can be generated from a\ncurvature-induced phase transition of a non-minimally coupled dark scalar field\nwith a portal coupling to the Higgs field. The main requirement is that the\nphase transition is of first order, which can be achieved through the\nintroduction of a cubic term on the scalar potential and the sign change of the\ncurvature scalar. This mechanism was investigated in the context of a dynamical\nspacetime during the transition from inflation to kination, while also\nconsidering the possibility for inducing electroweak symmetry breaking in this\nmanner for a sufficiently low reheating temperature when the Higgs-portal\ncoupling is extremely weak. We considered a large range of inflationary scales\nand both cases of positive and negative values for the non-minimal coupling,\nwhile taking into account the bound imposed by Big Bang Nucleosythesis. The\nresulting gravitational wave amplitudes are boosted by kination and thus\nconstrain the parameter space of the couplings significantly. Even though the\nspectra lie at high frequencies for the standard high inflationary scales,\nthere are combinations of parameter space where they could be probed with\nfuture experiments.",
            "pdf_url": "http://arxiv.org/pdf/2407.18845v1",
            "published": "2024-07-26 16:11:45+00:00",
            "updated": "2024-07-26 16:11:45+00:00"
        },
        {
            "title": "Using stochastic resonance of two-level systems to increase qubit decoherence times",
            "authors": "Yujun Choi, S. N. Coppersmith, Robert Joynt",
            "summary": "Two-level systems (TLS) are the major source of dephasing of spin qubits in\nnumerous quantum computing platforms. In spite of much effort, it has been\ndifficult to substantially mitigate the effects of this noise or, in many\ncases, to fully understand its physical origin. We propose a method to make\nprogress on both of these issues. When an oscillating field is applied to a\nTLS, stochastic resonance can occur and the noise spectrum is moved to higher\nfrequencies. This shift in the TLS noise spectrum will increase the dephasing\ntimes of the qubits that they influence. Furthermore, the details of this\neffect depend on the physical properties of the noise sources. Thus one can use\nqubit spectroscopy to investigate their physical properties, specifically the\nextent to which the TLS themselves possess quantum coherence. We find that it\nshould be possible to determine the dephasing rate and the energy level\nseparation of the TLS themselves in this way.",
            "pdf_url": "http://arxiv.org/pdf/2407.18829v1",
            "published": "2024-07-26 15:49:01+00:00",
            "updated": "2024-07-26 15:49:01+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Unifying Visual and Semantic Feature Spaces with Diffusion Models for Enhanced Cross-Modal Alignment",
            "authors": "Yuze Zheng, Zixuan Li, Xiangxian Li, Jinxing Liu, Yuqing Wang, Xiangxu Meng, Lei Meng",
            "summary": "Image classification models often demonstrate unstable performance in\nreal-world applications due to variations in image information, driven by\ndiffering visual perspectives of subject objects and lighting discrepancies. To\nmitigate these challenges, existing studies commonly incorporate additional\nmodal information matching the visual data to regularize the model's learning\nprocess, enabling the extraction of high-quality visual features from complex\nimage regions. Specifically, in the realm of multimodal learning, cross-modal\nalignment is recognized as an effective strategy, harmonizing different modal\ninformation by learning a domain-consistent latent feature space for visual and\nsemantic features. However, this approach may face limitations due to the\nheterogeneity between multimodal information, such as differences in feature\ndistribution and structure. To address this issue, we introduce a Multimodal\nAlignment and Reconstruction Network (MARNet), designed to enhance the model's\nresistance to visual noise. Importantly, MARNet includes a cross-modal\ndiffusion reconstruction module for smoothly and stably blending information\nacross different domains. Experiments conducted on two benchmark datasets,\nVireo-Food172 and Ingredient-101, demonstrate that MARNet effectively improves\nthe quality of image information extracted by the model. It is a plug-and-play\nframework that can be rapidly integrated into various image classification\nframeworks, boosting model performance.",
            "pdf_url": "http://arxiv.org/pdf/2407.18854v1",
            "published": "2024-07-26 16:30:18+00:00",
            "updated": "2024-07-26 16:30:18+00:00"
        },
        {
            "title": "Weyl Calculus and Exactly Solvable Schrödinger Bridges with Quadratic State Cost",
            "authors": "Alexis M. H. Teter, Wenqing Wang, Abhishek Halder",
            "summary": "Schr\\\"{o}dinger bridge--a stochastic dynamical generalization of optimal mass\ntransport--exhibits a learning-control duality. Viewed as a stochastic control\nproblem, the Schr\\\"{o}dinger bridge finds an optimal control policy that steers\na given joint state statistics to another while minimizing the total control\neffort subject to controlled diffusion and deadline constraints. Viewed as a\nstochastic learning problem, the Schr\\\"{o}dinger bridge finds the most-likely\ndistribution-valued trajectory connecting endpoint distributional observations,\ni.e., solves the two point boundary-constrained maximum likelihood problem over\nthe manifold of probability distributions. Recent works have shown that solving\nthe Schr\\\"{o}dinger bridge problem with state cost requires finding the Markov\nkernel associated with a reaction-diffusion PDE where the state cost appears as\na state-dependent reaction rate. We explain how ideas from Weyl calculus in\nquantum mechanics, specifically the Weyl operator and the Weyl symbol, can help\ndetermine such Markov kernels. We illustrate these ideas by explicitly finding\nthe Markov kernel for the case of quadratic state cost via Weyl calculus,\nrecovering our earlier results but avoiding tedious computation with Hermite\npolynomials.",
            "pdf_url": "http://arxiv.org/pdf/2407.15245v2",
            "published": "2024-07-21 19:05:30+00:00",
            "updated": "2024-07-26 15:48:23+00:00"
        },
        {
            "title": "Diffusion MRI with Machine Learning",
            "authors": "Davood Karimi",
            "summary": "Diffusion-weighted magnetic resonance imaging (dMRI) offers unique\ncapabilities including noninvasive probing of brain's tissue microstructure and\nstructural connectivity. It is widely used for clinical assessment of brain\npathologies and for neuroscience research. Analyzing the dMRI data to extract\nuseful information for medical and scientific purposes can be challenging. The\ndMRI measurements often suffer from strong noise and artifacts, there is\nusually high inter-session and inter-scanner variability in the data, and\nconsiderable inter-subject heterogeneity in brain structure. Moreover, the\nrelationship between measurements and the phenomena of interest can be highly\ncomplex. Recent years have witnessed increasing use of machine learning methods\nfor dMRI analysis. This manuscript aims to assess these efforts, with a focus\non methods that have addressed data preprocessing and harmonization,\nmicrostructure mapping, tractography, and white matter tract analysis. We study\nthe main findings, strengths, and weaknesses of the existing methods and\nsuggest topics for future research. We find that machine learning may be\nexceptionally suited to tackle some of the difficult tasks in dMRI analysis.\nHowever, for this to happen, several shortcomings of existing methods and\ncritical unresolved issues need to be addressed. These include deficient\nevaluation practices, lack of rich training datasets and validation benchmarks,\nas well as model generalizability, reliability, and explainability concerns.",
            "pdf_url": "http://arxiv.org/pdf/2402.00019v2",
            "published": "2024-01-01 13:03:35+00:00",
            "updated": "2024-07-26 15:39:03+00:00"
        },
        {
            "title": "Log-Concave Coupling for Sampling Neural Net Posteriors",
            "authors": "Curtis McDonald, Andrew R Barron",
            "summary": "In this work, we present a sampling algorithm for single hidden layer neural\nnetworks. This algorithm is built upon a recursive series of Bayesian\nposteriors using a method we call Greedy Bayes. Sampling of the Bayesian\nposterior for neuron weight vectors $w$ of dimension $d$ is challenging because\nof its multimodality. Our algorithm to tackle this problem is based on a\ncoupling of the posterior density for $w$ with an auxiliary random variable\n$\\xi$.\n  The resulting reverse conditional $w|\\xi$ of neuron weights given auxiliary\nrandom variable is shown to be log concave. In the construction of the\nposterior distributions we provide some freedom in the choice of the prior. In\nparticular, for Gaussian priors on $w$ with suitably small variance, the\nresulting marginal density of the auxiliary variable $\\xi$ is proven to be\nstrictly log concave for all dimensions $d$. For a uniform prior on the unit\n$\\ell_1$ ball, evidence is given that the density of $\\xi$ is again strictly\nlog concave for sufficiently large $d$.\n  The score of the marginal density of the auxiliary random variable $\\xi$ is\ndetermined by an expectation over $w|\\xi$ and thus can be computed by various\nrapidly mixing Markov Chain Monte Carlo methods. Moreover, the computation of\nthe score of $\\xi$ permits methods of sampling $\\xi$ by a stochastic diffusion\n(Langevin dynamics) with drift function built from this score. With such\ndynamics, information-theoretic methods pioneered by Bakry and Emery show that\naccurate sampling of $\\xi$ is obtained rapidly when its density is indeed\nstrictly log-concave. After which, one more draw from $w|\\xi$, produces neuron\nweights $w$ whose marginal distribution is from the desired posterior.",
            "pdf_url": "http://arxiv.org/pdf/2407.18802v1",
            "published": "2024-07-26 15:05:41+00:00",
            "updated": "2024-07-26 15:05:41+00:00"
        },
        {
            "title": "Viewpoint Textual Inversion: Discovering Scene Representations and 3D View Control in 2D Diffusion Models",
            "authors": "James Burgess, Kuan-Chieh Wang, Serena Yeung-Levy",
            "summary": "Text-to-image diffusion models generate impressive and realistic images, but\ndo they learn to represent the 3D world from only 2D supervision? We\ndemonstrate that yes, certain 3D scene representations are encoded in the text\nembedding space of models like Stable Diffusion. Our approach, Viewpoint Neural\nTextual Inversion (ViewNeTI), is to discover 3D view tokens; these tokens\ncontrol the 3D viewpoint - the rendering pose in a scene - of generated images.\nSpecifically, we train a small neural mapper to take continuous camera\nviewpoint parameters and predict a view token (a word embedding). This token\nconditions diffusion generation via cross-attention to produce images with the\ndesired camera viewpoint. Using ViewNeTI as an evaluation tool, we report two\nfindings: first, the text latent space has a continuous view-control manifold\nfor particular 3D scenes; second, we find evidence for a generalized\nview-control manifold for all scenes. We conclude that since the view token\ncontrols the 3D `rendering' viewpoint, there is likely a scene representation\nembedded in frozen 2D diffusion models. Finally, we exploit the 3D scene\nrepresentations for 3D vision tasks, namely, view-controlled text-to-image\ngeneration, and novel view synthesis from a single image, where our approach\nsets state-of-the-art for LPIPS. Code available at\nhttps://github.com/jmhb0/view_neti",
            "pdf_url": "http://arxiv.org/pdf/2309.07986v2",
            "published": "2023-09-14 18:52:16+00:00",
            "updated": "2024-07-26 11:14:21+00:00"
        }
    ]
}