{
    "Physics": [
        {
            "title": "Causal Climate Emulation with Bayesian Filtering",
            "authors": "Sebastian Hickman, Ilija Trajkovic, Julia Kaltenborn, Francis Pelletier, Alex Archibald, Yaniv Gurwicz, Peer Nowack, David Rolnick, Julien Boussard",
            "summary": "Traditional models of climate change use complex systems of coupled equations\nto simulate physical processes across the Earth system. These simulations are\nhighly computationally expensive, limiting our predictions of climate change\nand analyses of its causes and effects. Machine learning has the potential to\nquickly emulate data from climate models, but current approaches are not able\nto incorporate physically-based causal relationships. Here, we develop an\ninterpretable climate model emulator based on causal representation learning.\nWe derive a novel approach including a Bayesian filter for stable long-term\nautoregressive emulation. We demonstrate that our emulator learns accurate\nclimate dynamics, and we show the importance of each one of its components on a\nrealistic synthetic dataset and data from two widely deployed climate models.",
            "pdf_url": "http://arxiv.org/pdf/2506.09891v2",
            "published": "2025-06-11 16:00:55+00:00",
            "updated": "2025-10-24 17:57:09+00:00"
        },
        {
            "title": "A Knowledge-Graph Translation Layer for Mission-Aware Multi-Agent Path Planning in Spatiotemporal Dynamics",
            "authors": "Edward Holmberg, Elias Ioup, Mahdi Abdelguerfi",
            "summary": "The coordination of autonomous agents in dynamic environments is hampered by\nthe semantic gap between high-level mission objectives and low-level planner\ninputs. To address this, we introduce a framework centered on a Knowledge Graph\n(KG) that functions as an intelligent translation layer. The KG's two-plane\narchitecture compiles declarative facts into per-agent, mission-aware\n``worldviews\" and physics-aware traversal rules, decoupling mission semantics\nfrom a domain-agnostic planner. This allows complex, coordinated paths to be\nmodified simply by changing facts in the KG. A case study involving Autonomous\nUnderwater Vehicles (AUVs) in the Gulf of Mexico visually demonstrates the\nend-to-end process and quantitatively proves that different declarative\npolicies produce distinct, high-performing outcomes. This work establishes the\nKG not merely as a data repository, but as a powerful, stateful orchestrator\nfor creating adaptive and explainable autonomous systems.",
            "pdf_url": "http://arxiv.org/pdf/2510.21695v1",
            "published": "2025-10-24 17:55:55+00:00",
            "updated": "2025-10-24 17:55:55+00:00"
        },
        {
            "title": "On Uncertainty Calibration for Equivariant Functions",
            "authors": "Edward Berman, Jacob Ginesin, Marco Pacini, Robin Walters",
            "summary": "Data-sparse settings such as robotic manipulation, molecular physics, and\ngalaxy morphology classification are some of the hardest domains for deep\nlearning. For these problems, equivariant networks can help improve modeling\nacross undersampled parts of the input space, and uncertainty estimation can\nguard against overconfidence. However, until now, the relationships between\nequivariance and model confidence, and more generally equivariance and model\ncalibration, has yet to be studied. Since traditional classification and\nregression error terms show up in the definitions of calibration error, it is\nnatural to suspect that previous work can be used to help understand the\nrelationship between equivariance and calibration error. In this work, we\npresent a theory relating equivariance to uncertainty estimation. By proving\nlower and upper bounds on uncertainty calibration errors (ECE and ENCE) under\nvarious equivariance conditions, we elucidate the generalization limits of\nequivariant models and illustrate how symmetry mismatch can result in\nmiscalibration in both classification and regression. We complement our\ntheoretical framework with numerical experiments that clarify the relationship\nbetween equivariance and uncertainty using a variety of real and simulated\ndatasets, and we comment on trends with symmetry mismatch, group size, and\naleatoric and epistemic uncertainties.",
            "pdf_url": "http://arxiv.org/pdf/2510.21691v1",
            "published": "2025-10-24 17:50:41+00:00",
            "updated": "2025-10-24 17:50:41+00:00"
        },
        {
            "title": "DynamicPAE: Generating Scene-Aware Physical Adversarial Examples in Real-Time",
            "authors": "Jin Hu, Xianglong Liu, Jiakai Wang, Junkai Zhang, Xianqi Yang, Haotong Qin, Yuqing Ma, Ke Xu",
            "summary": "Physical adversarial examples (PAEs) are regarded as whistle-blowers of\nreal-world risks in deep-learning applications, thus worth further\ninvestigation. However, current PAE generation studies show limited adaptive\nattacking ability to diverse and varying scenes, revealing the urgent\nrequirement of dynamic PAEs that are generated in real time and conditioned on\nthe observation from the attacker. The key challenge in generating dynamic PAEs\nis learning the sparse relation between PAEs and the observation of attackers\nunder the noisy feedback of attack training. To address the challenge, we\npresent DynamicPAE, the first generative framework that enables scene-aware\nreal-time physical attacks. Specifically, to address the noisy feedback problem\nthat obfuscates the exploration of scene-related PAEs, we introduce the\nresidual-guided adversarial pattern exploration technique. Residual-guided\ntraining, which relaxes the attack training with a reconstruction task, is\nproposed to enrich the feedback information, thereby achieving a more\ncomprehensive exploration of PAEs. To address the alignment problem between the\ntrained generator and the real-world scenario, we introduce the\ndistribution-matched attack scenario alignment, consisting of the\nconditional-uncertainty-aligned data module and the skewness-aligned objective\nre-weighting module. The former aligns the training environment with the\nincomplete observation of the real-world attacker. The latter facilitates\nconsistent stealth control across different attack targets with the skewness\ncontroller. Extensive digital and physical evaluations demonstrate the superior\nattack performance of DynamicPAE, attaining a 2.07 $\\times$ boost (58.8%\naverage AP drop under attack) on representative object detectors (e.g., DETR)\nover state-of-the-art static PAE generating methods. Overall, our work opens\nthe door to end-to-end modeling of dynamic PAEs.",
            "pdf_url": "http://arxiv.org/pdf/2412.08053v3",
            "published": "2024-12-11 03:00:15+00:00",
            "updated": "2025-10-24 17:42:08+00:00"
        },
        {
            "title": "Foundations of Carrollian Geometry",
            "authors": "Luca Ciambelli, Puttarak Jai-akson",
            "summary": "Carrollian physics provides the natural framework for describing null\nhypersurfaces. This review explores the geometry of Carrollian manifolds --\nspaces endowed with a degenerate metric. We begin with an algebraic overview of\nthe Carroll group, its conformal extension, and its relation to the BMS group.\nThen, in the core of the review, we follow the standard pseudo-Riemannian\nnarrative: metric $\\to$ connection $\\to$ curvature. We first introduce the\nmodern, general definition of a Carrollian structure, the analogue of the\nmetric on such manifolds, reviewing the historical developments, symmetries,\nand link with the algebraic groups. The second part concerns connections. We\nshow the breakdown of the Levi-Civita theorem in the Carrollian setting and\nconstruct the most general intrinsic Carrollian connection. A preferred\nconnection is then identified intrinsically and later shown to coincide with\nthe one induced by embedding a null hypersurface in an ambient spacetime. The\nthird part develops the associated curvature tensors. We include novel results\npresented here for the first time.\n  Two advanced topics highlight the broader scope of this framework. The first\ntreats null hypersurfaces via the rigging technique, deriving the induced\ngeometry from the ambient space. This provides a unified language for\nspacelike, timelike, and null hypersurfaces, and shows that the induced rigged\nconnection exactly reproduces the intrinsic Carrollian one. From this, the\nGauss and Codazzi-Mainardi equations follow, and the Einstein equations emerge\nas conservation laws for the null Brown-York stress tensor. The second topic\nextends the Carrollian setup to generic, non-null hypersurfaces, enabling a\nsmooth null limit and completing the unified geometric description of\nhypersurfaces of all causal characters.",
            "pdf_url": "http://arxiv.org/pdf/2510.21651v1",
            "published": "2025-10-24 17:10:10+00:00",
            "updated": "2025-10-24 17:10:10+00:00"
        },
        {
            "title": "Search for dijet resonances with data scouting in proton-proton collisions at $\\sqrt{s}$ = 13 TeV",
            "authors": "CMS Collaboration",
            "summary": "A search is presented for narrow resonances, with a mass between 0.6 and 1.8\nTeV, decaying to pairs of jets, in proton-proton collisions at $\\sqrt{s}$ = 13\nTeV. The search is performed using dijets that are reconstructed, selected, and\nrecorded in a compact form by the high-level trigger in a technique referred to\nas \"data scouting\", from data collected in 2016$-$2018 corresponding to an\nintegrated luminosity of 177 fb$^{-1}$. The dijet mass spectra are well\ndescribed by a smooth parameterization, and no significant evidence for the\nproduction of new particles is observed. Model-independent upper limits are\npresented on the product of the cross section, branching fraction, and\nacceptance for the individual cases of narrow quark-quark, quark-gluon, and\ngluon-gluon resonances, and are compared to the predictions from a variety of\nmodels of narrow dijet resonance production. The upper limit on the coupling of\na dark matter mediator to quarks is presented as a function of the mediator\nmass. The sensitivity of this search goes beyond what is expected from\nstatistical scaling with the integrated luminosity alone, as a consequence of\nthe use of fewer parameters in the background function within a more robust\nstatistical procedure.",
            "pdf_url": "http://arxiv.org/pdf/2510.21641v1",
            "published": "2025-10-24 16:54:45+00:00",
            "updated": "2025-10-24 16:54:45+00:00"
        },
        {
            "title": "Analytical determination of multi-time correlation functions in quantum chaotic systems",
            "authors": "Yoana R. Chorbadzhiyska, Peter A. Ivanov, Charlie Nation",
            "summary": "The time-dependence of multi-point observable correlation functions are\nessential quantities in analysis and simulation of quantum dynamics. Open\nquantum systems approaches utilize two-point correlations to describe the\ninfluence of an environment on a system of interest, and in studies of chaotic\nquantum system, the out-of-time-ordered correlator (OTOC) is used to probe\nchaoticity of dynamics. In this work we analytically derive the time dependence\nof multi-point observable correlation functions in quantum systems from a\nrandom matrix theoretic approach, with the highest order function of interest\nbeing the OTOC. We find in each case that dynamical contributions are related\nto a simple function, related to the Fourier transform of coarse-grained\nwave-functions. We compare the predicted dynamics to exact numerical\nexperiments in a spin chain for various physical observables. We comment on\nimplications towards the emergence of Markovianity and quantum regression in\nclosed quantum systems, as well as relate our results to known bounds on\nchaotic dynamics.",
            "pdf_url": "http://arxiv.org/pdf/2510.21637v1",
            "published": "2025-10-24 16:49:11+00:00",
            "updated": "2025-10-24 16:49:11+00:00"
        },
        {
            "title": "RydIQule Version 2: Enhancing graph-based modeling of Rydberg atoms",
            "authors": "Benjamin N. Miller, David H. Meyer, Carter A. Montag, Omar Nagib, Teemu Virtanen, Peter K. Elgee, Kevin C. Cox",
            "summary": "Rydberg atomic radio-frequency (rf) sensors are an emerging technology\nplatform that relies on vaporous atoms, interrogated with laser beams and\nnearly ionized, to receive rf signals. Rydberg rf sensors have a number of\ninteresting fundamental distinctions from traditional receiver technologies,\nsuch as those based on metallic antennas, since they are governed by the\nquantum physics of atom-light interactions. As Rydberg sensors quickly advance\nfrom laboratory experiments into fieldable devices, there is a need for a\ngeneral software modeling tool that fully encompasses the internal physics of\nthe sensor. The Rydberg Interactive Quantum Module (RydIQule) is a Python\npackage designed to fill this need. The initial public release of RydIQule in\nlate 2023 built the core functionality described above. Here we outline\nRydIQule's version 2 release which expands on its capabilities to more\naccurately model real-world atoms.",
            "pdf_url": "http://arxiv.org/pdf/2510.21628v1",
            "published": "2025-10-24 16:33:33+00:00",
            "updated": "2025-10-24 16:33:33+00:00"
        },
        {
            "title": "DESI constraints on two-field quintessence with exponential potentials",
            "authors": "George Alestas, Marienza Caldarola, Indira Ocampo, Savvas Nesseris, Shinji Tsujikawa",
            "summary": "We investigate a quintessence model involving two scalar fields with\ndouble-exponential potentials. This configuration allows the system as a whole\nto emulate the dynamics of a single field with a shallower potential, enabling\nscalar fields that individually cannot drive cosmic acceleration to\ncollectively achieve and sustain it. We assess the viability of this model by\nperforming a fully Bayesian analysis and confronting its predictions with\nobservational data, including the Planck 2018 Cosmic Microwave Background (CMB)\nshift parameters, the newly released Dark Energy Spectroscopic Instrument\n(DESI) DR2 Baryon Acoustic Oscillation (BAO) measurements, and the Dark Energy\nSurvey Year 5 (DESY5) Type Ia supernova (SnIa) sample. Our analysis shows that\nthe two-field quintessence model yields a log Bayes factor relative to the flat\n$\\Lambda$CDM model of $\\Delta \\ln B \\sim 4$, indicating moderate evidence\nagainst the latter. We also find that the central values of the two slopes of\nthe exponential potentials are both close to 1, whereas the slope of an\neffective single-field system is constrained to be less than order unity. This\nproperty is theoretically desirable from the perspective of higher-dimensional\ntheories. Thus, the two-field quintessence model with exponential potentials\nprovides a physically motivated and compelling mechanism that is consistent\nwith both observational and theoretical requirements.",
            "pdf_url": "http://arxiv.org/pdf/2510.21627v1",
            "published": "2025-10-24 16:32:10+00:00",
            "updated": "2025-10-24 16:32:10+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Visual Diffusion Models are Geometric Solvers",
            "authors": "Nir Goren, Shai Yehezkel, Omer Dahary, Andrey Voynov, Or Patashnik, Daniel Cohen-Or",
            "summary": "In this paper we show that visual diffusion models can serve as effective\ngeometric solvers: they can directly reason about geometric problems by working\nin pixel space. We first demonstrate this on the Inscribed Square Problem, a\nlong-standing problem in geometry that asks whether every Jordan curve contains\nfour points forming a square. We then extend the approach to two other\nwell-known hard geometric problems: the Steiner Tree Problem and the Simple\nPolygon Problem.\n  Our method treats each problem instance as an image and trains a standard\nvisual diffusion model that transforms Gaussian noise into an image\nrepresenting a valid approximate solution that closely matches the exact one.\nThe model learns to transform noisy geometric structures into correct\nconfigurations, effectively recasting geometric reasoning as image generation.\n  Unlike prior work that necessitates specialized architectures and\ndomain-specific adaptations when applying diffusion to parametric geometric\nrepresentations, we employ a standard visual diffusion model that operates on\nthe visual representation of the problem. This simplicity highlights a\nsurprising bridge between generative modeling and geometric problem solving.\nBeyond the specific problems studied here, our results point toward a broader\nparadigm: operating in image space provides a general and practical framework\nfor approximating notoriously hard problems, and opens the door to tackling a\nfar wider class of challenging geometric tasks.",
            "pdf_url": "http://arxiv.org/pdf/2510.21697v1",
            "published": "2025-10-24 17:57:31+00:00",
            "updated": "2025-10-24 17:57:31+00:00"
        },
        {
            "title": "System-Embedded Diffusion Bridge Models",
            "authors": "Bartlomiej Sobieski, Matthew Tivnan, Yuang Wang, Siyeop Yoon, Pengfei Jin, Dufan Wu, Quanzheng Li, Przemyslaw Biecek",
            "summary": "Solving inverse problems -- recovering signals from incomplete or noisy\nmeasurements -- is fundamental in science and engineering. Score-based\ngenerative models (SGMs) have recently emerged as a powerful framework for this\ntask. Two main paradigms have formed: unsupervised approaches that adapt\npretrained generative models to inverse problems, and supervised bridge methods\nthat train stochastic processes conditioned on paired clean and corrupted data.\nWhile the former typically assume knowledge of the measurement model, the\nlatter have largely overlooked this structural information. We introduce System\nembedded Diffusion Bridge Models (SDBs), a new class of supervised bridge\nmethods that explicitly embed the known linear measurement system into the\ncoefficients of a matrix-valued SDE. This principled integration yields\nconsistent improvements across diverse linear inverse problems and demonstrates\nrobust generalization under system misspecification between training and\ndeployment, offering a promising solution to real-world applications.",
            "pdf_url": "http://arxiv.org/pdf/2506.23726v2",
            "published": "2025-06-30 10:58:49+00:00",
            "updated": "2025-10-24 17:47:21+00:00"
        },
        {
            "title": "Generalised Flow Maps for Few-Step Generative Modelling on Riemannian Manifolds",
            "authors": "Oscar Davis, Michael S. Albergo, Nicholas M. Boffi, Michael M. Bronstein, Avishek Joey Bose",
            "summary": "Geometric data and purpose-built generative models on them have become\nubiquitous in high-impact deep learning application domains, ranging from\nprotein backbone generation and computational chemistry to geospatial data.\nCurrent geometric generative models remain computationally expensive at\ninference -- requiring many steps of complex numerical simulation -- as they\nare derived from dynamical measure transport frameworks such as diffusion and\nflow-matching on Riemannian manifolds. In this paper, we propose Generalised\nFlow Maps (GFM), a new class of few-step generative models that generalises the\nFlow Map framework in Euclidean spaces to arbitrary Riemannian manifolds. We\ninstantiate GFMs with three self-distillation-based training methods:\nGeneralised Lagrangian Flow Maps, Generalised Eulerian Flow Maps, and\nGeneralised Progressive Flow Maps. We theoretically show that GFMs, under\nspecific design decisions, unify and elevate existing Euclidean few-step\ngenerative models, such as consistency models, shortcut models, and meanflows,\nto the Riemannian setting. We benchmark GFMs against other geometric generative\nmodels on a suite of geometric datasets, including geospatial data, RNA torsion\nangles, and hyperbolic manifolds, and achieve state-of-the-art sample quality\nfor single- and few-step evaluations, and superior or competitive\nlog-likelihoods using the implicit probability flow.",
            "pdf_url": "http://arxiv.org/pdf/2510.21608v1",
            "published": "2025-10-24 16:14:31+00:00",
            "updated": "2025-10-24 16:14:31+00:00"
        },
        {
            "title": "HollowFlow: Efficient Sample Likelihood Evaluation using Hollow Message Passing",
            "authors": "Johann Flemming Gloy, Simon Olsson",
            "summary": "Flow and diffusion-based models have emerged as powerful tools for scientific\napplications, particularly for sampling non-normalized probability\ndistributions, as exemplified by Boltzmann Generators (BGs). A critical\nchallenge in deploying these models is their reliance on sample likelihood\ncomputations, which scale prohibitively with system size $n$, often rendering\nthem infeasible for large-scale problems. To address this, we introduce\n$\\textit{HollowFlow}$, a flow-based generative model leveraging a novel\nnon-backtracking graph neural network (NoBGNN). By enforcing a block-diagonal\nJacobian structure, HollowFlow likelihoods are evaluated with a constant number\nof backward passes in $n$, yielding speed-ups of up to $\\mathcal{O}(n^2)$: a\nsignificant step towards scaling BGs to larger systems. Crucially, our\nframework generalizes: $\\textbf{any equivariant GNN or attention-based\narchitecture}$ can be adapted into a NoBGNN. We validate HollowFlow by training\nBGs on two different systems of increasing size. For both systems, the sampling\nand likelihood evaluation time decreases dramatically, following our\ntheoretical scaling laws. For the larger system we obtain a $10^2\\times$\nspeed-up, clearly illustrating the potential of HollowFlow-based approaches for\nhigh-dimensional scientific problems previously hindered by computational\nbottlenecks.",
            "pdf_url": "http://arxiv.org/pdf/2510.21542v1",
            "published": "2025-10-24 15:04:24+00:00",
            "updated": "2025-10-24 15:04:24+00:00"
        }
    ]
}