{
    "Physics": [
        {
            "title": "Beyond Euclid: An Illustrated Guide to Modern Machine Learning with Geometric, Topological, and Algebraic Structures",
            "authors": "Sophia Sanborn, Johan Mathe, Mathilde Papillon, Domas Buracas, Hansen J Lillemark, Christian Shewmake, Abby Bertics, Xavier Pennec, Nina Miolane",
            "summary": "The enduring legacy of Euclidean geometry underpins classical machine\nlearning, which, for decades, has been primarily developed for data lying in\nEuclidean space. Yet, modern machine learning increasingly encounters richly\nstructured data that is inherently nonEuclidean. This data can exhibit\nintricate geometric, topological and algebraic structure: from the geometry of\nthe curvature of space-time, to topologically complex interactions between\nneurons in the brain, to the algebraic transformations describing symmetries of\nphysical systems. Extracting knowledge from such non-Euclidean data\nnecessitates a broader mathematical perspective. Echoing the 19th-century\nrevolutions that gave rise to non-Euclidean geometry, an emerging line of\nresearch is redefining modern machine learning with non-Euclidean structures.\nIts goal: generalizing classical methods to unconventional data types with\ngeometry, topology, and algebra. In this review, we provide an accessible\ngateway to this fast-growing field and propose a graphical taxonomy that\nintegrates recent advances into an intuitive unified framework. We subsequently\nextract insights into current challenges and highlight exciting opportunities\nfor future development in this field.",
            "pdf_url": "http://arxiv.org/pdf/2407.09468v1",
            "published": "2024-07-12 17:48:36+00:00",
            "updated": "2024-07-12 17:48:36+00:00"
        },
        {
            "title": "Spin-filter tunneling detection of antiferromagnetic resonance with electrically-tunable damping",
            "authors": "Thow Min Jerald Cham, Daniel G. Chica, Kenji Watanabe, Takashi Taniguchi, Xavier Roy, Yunqiu Kelly Luo, Daniel C. Ralph",
            "summary": "Antiferromagnetic spintronics offers the potential for higher-frequency\noperations compared to ferromagnetic spintronics and improved insensitivity to\nmagnetic fields. However, previous electrical techniques to detect\nantiferromagnetic dynamics have required millimeter-scale samples to achieve\nmeasurable signals. Here we demonstrate direct electrical detection of\nantiferromagnetic resonance in devices 1000 times smaller using spin-filter\ntunneling in micron-scale PtTe$_2$/bilayer CrSBr/graphite junctions in which\nthe tunnel barrier is the van der Waals antiferromaget CrSBr. This sample\ngeometry allows not only efficient detection, but also electrical control of\nthe antiferromagnetic resonance through spin-orbit torque from the PtTe$_2$\nelectrode. The ability to efficiently detect and control antiferromagnetic\nresonance provides the means to make detailed studies of the physics governing\nthese high-frequency dynamics and to pursue applications including radiation\nsources, modulators, and detectors.",
            "pdf_url": "http://arxiv.org/pdf/2407.09462v1",
            "published": "2024-07-12 17:44:42+00:00",
            "updated": "2024-07-12 17:44:42+00:00"
        },
        {
            "title": "Beyond the instanton gas approach: dominant thimbles approximation for the Hubbard model",
            "authors": "Maksim Ulybyshev, Fakher F. Assaad",
            "summary": "To each complex saddle point of an action, one can attach a Lefschetz thimble\non which the imaginary part of the action is constant. Cauchy theorem states\nthat summation over a set of thimbles produces the exact result. This\nreorganization of the path integral, is an appealing starting point for various\napproximations: In the realm of auxiliary quantum Monte Carlo methods it\nprovides a framework to alleviate the negative sign problem. Here, we suggest\nto constrain the integration to the \\textit{dominant} thimbles: the thimbles\nattached to the saddle points with the largest statistical weight. For the\nHubbard model, in a formulation where the the Hubbard Stratonovitch field\ncouples to the charge, this provides a \\textit{symmetry} consistent\napproximation to the physics of the Hubbard model: constraining the integration\ndomain does not explicitly break a symmetry. We can test this approach for the\nHubbard model at half-filling on a bipartite lattice. The paper builds on the\npreviously developed instanton gas approach, where an exhaustive saddle point\napproximation was constructed. We present results, showing that the dominant\nthimbles approximation provides results that are in remarkable agreement with\nthe exact results for various fermionic observables including spin and charge\norder parameters and single electron spectral functions. We discuss\nimplications of our results for simulations away of half filling.",
            "pdf_url": "http://arxiv.org/pdf/2407.09452v1",
            "published": "2024-07-12 17:37:28+00:00",
            "updated": "2024-07-12 17:37:28+00:00"
        },
        {
            "title": "Neuroevolution of Decentralized Decision-Making in N-Bead Swimmers Leads to Scalable and Robust Collective Locomotion",
            "authors": "Benedikt Hartl, Michael Levin, Andreas Zöttl",
            "summary": "Many microorganisms are capable of swimming through viscous fluids such as\nwater in order to search for nutrients, swim toward oxygen or light, or to\nescape from predators. To navigate their environment they often perform large\nnonreciprocal periodic deformations of their shape, by waving appendages such\nas cilia or flagella, or by deforming their entire body. Even unicellular\norganisms are fundamentally made of parts, which need to be cooperatively\nutilized to allow these creatures to navigate their environment, without using\na centralized control mechanism. Here, we investigate the physical implications\nof decentralized decision-making of the actuators of a generalized N-bead\nNajafi Golestanian microswimmer, self-propelling via coordinated non-reciprocal\nswimming strokes. We treat each bead as an artificial neural network-based\nagent that perceives information about its neighbors and whose actions induce\nstrokes of its adjacent arms. With neuroevolution techniques, we evolve optimal\npolicies for the single-bead decision centers such that the N-bead collective\nefficiently self-propels as an individual, allowing us to investigate optimal\nlocomotion policies for increasingly large microswimmer bodies. We demonstrate\nthat such decentralized policies are robust and tolerant concerning\nmorphological changes or defects and facilitate cargo transport or drug\ndelivery applications \"out of the box\", without further optimization. Our\napproach allows us to train large swimmers ($N=100$ and more), and we show that\nlong-wavelength solutions lead to surprisingly efficient swimming gaits. Our\nwork is of relevance to understand robust locomotion of biological\nmicroswimmers, to develop robust artificial microswimmer navigation strategies,\nand, in a broader conceptional context, for Artificial Life< and in general\nemergent levels of individuality.",
            "pdf_url": "http://arxiv.org/pdf/2407.09438v1",
            "published": "2024-07-12 17:14:59+00:00",
            "updated": "2024-07-12 17:14:59+00:00"
        },
        {
            "title": "Sunbeam: Near-Sun Statites as Beam Platforms for Beam-Driven Rockets",
            "authors": "Jeffrey K. Greason, Gerrit Bruhaug",
            "summary": "We outline a method of beamed power for propulsion that utilizes relativistic\nelectron beams. The physics of charged particle beam propagation in the space\nplasma environment is discussed and the long-range (>100 A.U.) advantage of\nrelativistic electron beams is emphasized. A preliminary statite based beam\nemitter for powering probes to ~0.1c is proposed and the challenges in\nbeam-power uses are explored.",
            "pdf_url": "http://arxiv.org/pdf/2407.09414v1",
            "published": "2024-07-12 16:38:08+00:00",
            "updated": "2024-07-12 16:38:08+00:00"
        },
        {
            "title": "A Cordial Introduction to Double Scaled SYK",
            "authors": "Micha Berkooz, Ohad Mamroud",
            "summary": "We review recent progress regarding the double scaled Sachdev-Ye-Kitaev model\nand other $p$-local quantum mechanical random Hamiltonians. These models\nexhibit an expansion using chord diagrams, which can be solved by combinatorial\nmethods. We describe exact results in these models, including their spectrum,\ncorrelation functions, and Lyapunov exponent. In a certain limit, these\ntechniques manifest the relation to the Schwarzian quantum mechanics, a theory\nof quantum gravity in $AdS_2$. More generally, the theory is controlled by a\nrigid algebraic structure of a quantum group, suggesting a theory of quantum\ngravity on non-commutative $q$-deformed $AdS_2$. We conclude with discussion of\nrelated universality classes, and survey some of the current research\ndirections.",
            "pdf_url": "http://arxiv.org/pdf/2407.09396v1",
            "published": "2024-07-12 16:18:36+00:00",
            "updated": "2024-07-12 16:18:36+00:00"
        },
        {
            "title": "Diffusion of brightened dark excitons in a high-angle incommensurate Moiré homobilayer",
            "authors": "Arnab Barman Ray, Trevor Ollis, Sethuraj K. R., Anthony Nickolas Vamivakas",
            "summary": "The last few years have witnessed a surge in interest and research efforts in\nthe field of twistronics, especially in low-angle twisted bilayers of\ntransition metal dichalocogenides. These novel material platforms have been\ndemonstrated to host periodic arrays of excitonic quantum emitters, interlayer\nexcitons with long lifetimes, and exotic many-body states. While much remains\nto be known and understood about these heterostructures, the field of\nhigh-angle, incommensurate bilayers is even less explored. At twist angles\nlarger than a few degrees, the presence of periodicity in these bilayers\nbecomes chaotic, making the systems essentially aperiodic and incommensurate in\nnature due to the limitations of fabrication techniques. In this work, we\ndemonstrate the emergence of a brightened dark intralayer exciton in twisted\nmolybdenum diselenide homobilayer. We show that this dark exciton diffuses\nacross the excitation spot more efficiently as compared to trions or excitons,\nreaching diffusion lengths greater than 4 microns. Temperature-dependent\nspectra provide corroborative evidence and reveal a brightened dark trion. Our\nresults reveal some of the richness of the physics of these high-angle systems.",
            "pdf_url": "http://arxiv.org/pdf/2405.12901v2",
            "published": "2024-05-21 16:15:02+00:00",
            "updated": "2024-07-12 15:08:19+00:00"
        },
        {
            "title": "Enhance students learning outcomes by redesigning individual learning activities into group activities for introductory level Physics courses",
            "authors": "Kalani Hettiarachchilage, Neel Haldolaarachchige",
            "summary": "The evolution of science education is a dynamic process driven by advances in\npedagogy, technology, and especially, our understanding of how students learn.\nEducators are exploring innovative teaching and learning methodologies such as\nactive learning, incorporated technology, interdisciplinary approach, flipped\nclassrooms, personalized teaching, and many more. The goal of all these\nevolving methodologies is to empower students with not only a strong foundation\nin scientific knowledge but also with the skills and mindset required to thrive\nin the future world. By adopting these innovative approaches, educators can\nhelp students become effective problem solvers, critical thinkers, and life\nlearning citizens. Our focus is redesigning individual student learning\nactivities into group learning activities that will benefit various ways of\neducation by building each others support, connection, and communication.\nUnloading individual homework and loading in-class group work during a\nsynchronous classroom setting will benefit all levels of learnings effectively.\nAssigning most of the classwork to be completed during class time has potential\nbenefits since students are more likely to be engaged and focused individually\nand jointly by sharing and communicating subject matter effectively. We are\ndiscussing how to facilitate the group work effectively by creating group\nassignments for personalized classrooms, setting specific rules and class\nethics to follow for the best learning practice, imposing a list of roles to\neach group member, introducing a list of ground rules related to justice,\nequity, and diversity inclusion (JDEI) within the group. The students\nperformances, progress and effectiveness are analyzed and compared.",
            "pdf_url": "http://arxiv.org/pdf/2407.09330v1",
            "published": "2024-07-12 15:08:03+00:00",
            "updated": "2024-07-12 15:08:03+00:00"
        },
        {
            "title": "Loop Special Relativity: Kaluza-Klein area metric as a line element for stringy events",
            "authors": "Aharon Davidson, Nadav Barkai",
            "summary": "Let a physical event constitute a simple loop in spacetime. This in turn\ncalls for a generalized loop line element (= distance$^2$ between two\nneighboring loops) capable of restoring, at the shrinking loop limit, the\nspecial relativistic line element (= distance$^2$ between the two neighboring\ncenters-of-mass, respectively). Sticking at first stage to a flat\nEuclidean/Minkowski background, one is led to such a preliminary loop line\nelement, where the role of coordinates is played by the oriented cross-sections\nprojected by the loop event. Such cross-sections are generically center-of-mass\nindependent, unless (owing to a topological term) the loop events are\nintrinsically wrapped around a Kaluza-Klein like compact fifth dimension.\nSerendipitously, it is the Kaluza-Klein ingredient which, on top of its\ntraditional assignments, is shown to govern the extension of Pythagoras theorem\nto loop space. Associated with $M_4 \\otimes S_1$ is then a 10-dim loop\nspacetime metric, whose 4-dim center-of-mass core term is supplemented by a\n6-dim Maxwell-style fine structure. The imperative inclusion of a positive (say\nNambu-Goto) string tension within the framework of Loop Special Relativity is\nfingerprinted by a low periodicity breathing mode. Nash global isometric\nembedding is conjectured to play a major role in the construction of Loop\nGeneral Relativity.",
            "pdf_url": "http://arxiv.org/pdf/2403.11800v2",
            "published": "2024-03-18 13:59:56+00:00",
            "updated": "2024-07-12 15:01:56+00:00"
        },
        {
            "title": "The $Λ_c\\to Λ\\, l^+ν_\\ell$ weak decay including new physics",
            "authors": "Fernando Alvarado, Luis Alvarez-Ruso, Eliecer Hernandez, Juan Nieves, Neus Penalva",
            "summary": "We investigate the $\\Lambda_c \\to \\Lambda \\ell^{+} \\nu_\\ell$ decay with a\nfocus on potential new physics (NP) effects in the $\\ell = \\mu$ channel. We\nemploy an effective Hamiltonian within the framework of the Standard Model\nEffective Field Theory (SMEFT) to consider generalized dimension-6 semileptonic\n$c\\to s$ operators of scalar, pseudoscalar, vector, axial-vector and tensor\ntypes. We rely on Lattice QCD (LQCD) for the hadronic transition form factors,\nusing heavy quark spin symmetry (HQSS) to determine those that have not yet\nbeen obtained on the lattice. Uncertainties due to the truncation of the NP\nHamiltonian and different implementations of HQSS are taken into account. As a\nresult, we unravel the NP discovery potential of the $\\Lambda_c\\to \\Lambda$\nsemileptonic decay in different observables. Our findings indicate high\nsensitivity to NP in lepton flavour universality ratios, probing multi-TeV\nscales in some cases. On the theoretical side, we identify LQCD uncertainties\nin axial and vector form factors as critical for improving NP sensitivity,\nalongside better SMEFT uncertainty estimations.",
            "pdf_url": "http://arxiv.org/pdf/2407.09325v1",
            "published": "2024-07-12 15:01:15+00:00",
            "updated": "2024-07-12 15:01:15+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "StainFuser: Controlling Diffusion for Faster Neural Style Transfer in Multi-Gigapixel Histology Images",
            "authors": "Robert Jewsbury, Ruoyu Wang, Abhir Bhalerao, Nasir Rajpoot, Quoc Dang Vu",
            "summary": "Stain normalization algorithms aim to transform the color and intensity\ncharacteristics of a source multi-gigapixel histology image to match those of a\ntarget image, mitigating inconsistencies in the appearance of stains used to\nhighlight cellular components in the images. We propose a new approach,\nStainFuser, which treats this problem as a style transfer task using a novel\nConditional Latent Diffusion architecture, eliminating the need for handcrafted\ncolor components. With this method, we curate SPI-2M the largest stain\nnormalization dataset to date of over 2 million histology images with neural\nstyle transfer for high-quality transformations. Trained on this data,\nStainFuser outperforms current state-of-the-art deep learning and handcrafted\nmethods in terms of the quality of normalized images and in terms of downstream\nmodel performance on the CoNIC dataset.",
            "pdf_url": "http://arxiv.org/pdf/2403.09302v2",
            "published": "2024-03-14 11:49:43+00:00",
            "updated": "2024-07-12 16:27:06+00:00"
        },
        {
            "title": "Any-Property-Conditional Molecule Generation with Self-Criticism using Spanning Trees",
            "authors": "Alexia Jolicoeur-Martineau, Aristide Baratin, Kisoo Kwon, Boris Knyazev, Yan Zhang",
            "summary": "Generating novel molecules is challenging, with most representations leading\nto generative models producing many invalid molecules. Spanning Tree-based\nGraph Generation (STGG) is a promising approach to ensure the generation of\nvalid molecules, outperforming state-of-the-art SMILES and graph diffusion\nmodels for unconditional generation. In the real world, we want to be able to\ngenerate molecules conditional on one or multiple desired properties rather\nthan unconditionally. Thus, in this work, we extend STGG to\nmulti-property-conditional generation. Our approach, STGG+, incorporates a\nmodern Transformer architecture, random masking of properties during training\n(enabling conditioning on any subset of properties and classifier-free\nguidance), an auxiliary property-prediction loss (allowing the model to\nself-criticize molecules and select the best ones), and other improvements. We\nshow that STGG+ achieves state-of-the-art performance on in-distribution and\nout-of-distribution conditional generation, and reward maximization.",
            "pdf_url": "http://arxiv.org/pdf/2407.09357v1",
            "published": "2024-07-12 15:32:44+00:00",
            "updated": "2024-07-12 15:32:44+00:00"
        },
        {
            "title": "OneActor: Consistent Character Generation via Cluster-Conditioned Guidance",
            "authors": "Jiahao Wang, Caixia Yan, Haonan Lin, Weizhan Zhang, Mengmeng Wang, Tieliang Gong, Guang Dai, Hao Sun",
            "summary": "Text-to-image diffusion models benefit artists with high-quality image\ngeneration. Yet their stochastic nature hinders artists from creating\nconsistent images of the same subject. Existing methods try to tackle this\nchallenge and generate consistent content in various ways. However, they either\ndepend on external restricted data or require expensive tuning of the diffusion\nmodel. For this issue, we propose a novel one-shot tuning paradigm, termed as\nOneActor. It efficiently performs consistent subject generation solely driven\nby prompts via a learned semantic guidance to bypass the laborious backbone\ntuning. We lead the way to formalize the objective of consistent subject\ngeneration from a clustering perspective, and thus design a cluster-conditioned\nmodel. To mitigate the overfitting challenge shared by one-shot tuning\npipelines, we augment the tuning with auxiliary samples and devise two\ninference strategies: semantic interpolation and cluster guidance. These\ntechniques are later verified to significantly enhance the generation quality.\nComprehensive experiments show that our method outperforms a variety of\nbaselines with satisfactory subject consistency, superior prompt conformity as\nwell as high image quality. Our method is capable of multi-subject generation\nand compatible with popular diffusion extensions. Besides, we achieve a 4 times\nfaster tuning speed than tuning-based baselines and, if desired, avoid\nincreasing inference time. Furthermore, to our best knowledge, we are the first\nto prove that the semantic space of the diffusion model has the same\ninterpolation property as the latent space does. This property can serve as\nanother promising tool for fine generation control.",
            "pdf_url": "http://arxiv.org/pdf/2404.10267v2",
            "published": "2024-04-16 03:45:45+00:00",
            "updated": "2024-07-12 13:03:00+00:00"
        },
        {
            "title": "Applications of artificial intelligence in the analysis of histopathology images of gliomas: a review",
            "authors": "Jan-Philipp Redlich, Friedrich Feuerhake, Joachim Weis, Nadine S. Schaadt, Sarah Teuber-Hanselmann, Christoph Buck, Sabine Luttmann, Andrea Eberle, Stefan Nikolin, Arno Appenzeller, Andreas Portmann, André Homeyer",
            "summary": "In recent years, the diagnosis of gliomas has become increasingly complex.\nAnalysis of glioma histopathology images using artificial intelligence (AI)\noffers new opportunities to support diagnosis and outcome prediction. To give\nan overview of the current state of research, this review examines 83 publicly\navailable research studies that have proposed AI-based methods for whole-slide\nhistopathology images of human gliomas, covering the diagnostic tasks of\nsubtyping (23/83), grading (27/83), molecular marker prediction (20/83), and\nsurvival prediction (29/83). All studies were reviewed with regard to\nmethodological aspects as well as clinical applicability. It was found that the\nfocus of current research is the assessment of hematoxylin and eosin-stained\ntissue sections of adult-type diffuse gliomas. The majority of studies (52/83)\nare based on the publicly available glioblastoma and low-grade glioma datasets\nfrom The Cancer Genome Atlas (TCGA) and only a few studies employed other\ndatasets in isolation (16/83) or in addition to the TCGA datasets (15/83).\nCurrent approaches mostly rely on convolutional neural networks (63/83) for\nanalyzing tissue at 20x magnification (35/83). A new field of research is the\nintegration of clinical data, omics data, or magnetic resonance imaging\n(29/83). So far, AI-based methods have achieved promising results, but are not\nyet used in real clinical settings. Future work should focus on the independent\nvalidation of methods on larger, multi-site datasets with high-quality and\nup-to-date clinical and molecular pathology annotations to demonstrate routine\napplicability.",
            "pdf_url": "http://arxiv.org/pdf/2401.15022v4",
            "published": "2024-01-26 17:29:01+00:00",
            "updated": "2024-07-12 10:16:55+00:00"
        }
    ]
}