{
    "Physics": [
        {
            "title": "Effective field theory for superfluid vortex lattice from coset construction",
            "authors": "Aleksander Głódkowski, Sergej Moroz, Francisco Peña-Benítez, Piotr Surówka",
            "summary": "Guided by symmetry principles, we construct an effective field theory that\ncaptures the long-wavelength dynamics of two-dimensional vortex crystals\nobserved in rotating Bose-Einstein condensates trapped in a harmonic potential.\nBy embedding the system into Newton--Cartan spacetime and analyzing its\nisometries, we identify the appropriate spacetime symmetry group for trapped\ncondensates at finite angular momentum. After introducing a coarse-grained\ndescription of the vortex lattice we consider a homogeneous equilibrium\nconfiguration and discuss the associated symmetry breaking pattern. We apply\nthe coset construction method to identify covariant structures that enter the\neffective action and discuss the physical interpretation of the inverse Higgs\nconstraints. We verify that Kohn's theorem is satisfied within our construction\nand subsequently focus on the gapless sector of the theory. In this regime, the\neffective theory accommodates a single gapless excitation--the Tkachenko\nmode--for which we construct both the leading-order and next-to-leading-order\nactions, the latter including cubic interaction terms.",
            "pdf_url": "http://arxiv.org/pdf/2507.13352v1",
            "published": "2025-07-17 17:59:59+00:00",
            "updated": "2025-07-17 17:59:59+00:00"
        },
        {
            "title": "Challenges for describing unitary evolution in nontrivial geometries: pictures and representations",
            "authors": "Steven B. Giddings, Julie Perkins",
            "summary": "Description of evolution between spatial slices in a general spacetime\nsuffers from a significant difficulty: the states on the slices, in a given\nbasis, are not related by a unitary transformation. This problem, which occurs\nin spacetime dimensions above two, is directly related to the infinite number\nof inequivalent representations of the canonical commutators, and in particular\nwill arise for interacting theories in time-dependent spacetimes. We connect\ndifferent facets of this issue, and discuss its possible resolution. It is\ndirectly related to discussions of failure of a standard Schr\\\"odinger picture\nof evolution, and of evolution via \"many-fingered time.\" One requires a\ncondition specifying a physical unitary equivalence class of states; in general\nthis equivalence class evolves with time, and an important question is how it\nis determined. One approach to this in free theories is by imposing a Hadamard\ncondition on the two point function. We explore a different approach, which\nalso may be helpful for interacting theories, analyzing the structure of the\nstate in a local limit, and relate these approaches. We also elucidate the\nnon-Hadamard behavior of unphysical vacua, and discuss concrete examples of\nthese approaches involving cosmological and black hole evolution. The issues\nare extended in the context of quantum dynamical geometry, and raise important\nquestions for the proper description of the wavefunction of the universe and\nfor the role of the Wheeler-DeWitt equation.",
            "pdf_url": "http://arxiv.org/pdf/2507.13351v1",
            "published": "2025-07-17 17:59:58+00:00",
            "updated": "2025-07-17 17:59:58+00:00"
        },
        {
            "title": "Expansion creates spin-glass order in finite-connectivity models: a rigorous and intuitive approach from the theory of LDPC codes",
            "authors": "Benedikt Placke, Grace M. Sommers, Nikolas P. Breuckmann, Tibor Rakovszky, Vedika Khemani",
            "summary": "Complex free-energy landscapes with many local minima separated by large\nbarriers are believed to underlie glassy behavior across diverse physical\nsystems. This is the heuristic picture associated with replica symmetry\nbreaking (RSB) in spin glasses, but RSB has only been rigorously verified for\ncertain mean-field models with all-to-all connectivity. In this work, we give a\nrigorous proof of finite temperature spin glass order for a family of models\nwith local interactions on finite-connectivity, non-Euclidean expander graphs.\nTo this end, we bypass the RSB formalism entirely, and instead exploit the\nmathematical equivalence of such models to certain low-density parity check\n(LDPC) codes. We use code expansion, a property of LDPC codes which guarantees\nextensive energy barriers around ground states. Together with mild additional\nassumptions, this allows us to construct an explicit decomposition of the\nlow-temperature Gibbs state into disjoint components, each hosting an\nasymptotically long-lived state associated with a local minimum of the\nlandscape. Each component carries at most an exponentially small fraction of\nthe total weight, and almost all components do not contain ground states --\nwhich we take together to define spin-glass order. The proof is elementary, and\ntreats various expanding graph topologies on the same footing, including those\nwith short loops where existing approaches such as the cavity method fail. Our\nresults apply rigorously to diluted p-spin glasses for sufficiently large p,\nand while unproven, we also expect our assumptions to hold in a broader family\nof codes. Motivated by this, we numerically study two simple models, on random\nregular graphs and a regular tesselation of hyperbolic space. We show that both\nmodels undergo two transitions as a function of temperature, corresponding to\nthe onset of weak ergodicity breaking and spin glass order, respectively.",
            "pdf_url": "http://arxiv.org/pdf/2507.13342v1",
            "published": "2025-07-17 17:58:42+00:00",
            "updated": "2025-07-17 17:58:42+00:00"
        },
        {
            "title": "Advancing Seasonal Prediction of Tropical Cyclone Activity with a Hybrid AI-Physics Climate Model",
            "authors": "Gan Zhang, Megha Rao, Janni Yuval, Ming Zhao",
            "summary": "Machine learning (ML) models are successful with weather forecasting and have\nshown progress in climate simulations, yet leveraging them for useful climate\npredictions needs exploration. Here we show this feasibility using Neural\nGeneral Circulation Model (NeuralGCM), a hybrid ML-physics atmospheric model\ndeveloped by Google, for seasonal predictions of large-scale atmospheric\nvariability and Northern Hemisphere tropical cyclone (TC) activity. Inspired by\nphysical model studies, we simplify boundary conditions, assuming sea surface\ntemperature (SST) and sea ice follow their climatological cycle but persist\nanomalies present at the initialization time. With such forcings, NeuralGCM can\ngenerate 100 simulation days in ~8 minutes with a single Graphics Processing\nUnit (GPU), while simulating realistic atmospheric circulation and TC\nclimatology patterns. This configuration yields useful seasonal predictions\n(July to November) for the tropical atmosphere and various TC activity metrics.\nNotably, the predicted and observed TC frequency in the North Atlantic and East\nPacific basins are significantly correlated during 1990 to 2023 (r=~0.7),\nsuggesting prediction skill comparable to existing physical GCMs. Despite\nchallenges associated with model resolution and simplified boundary forcings,\nthe model-predicted interannual variations demonstrate significant correlations\nwith the observation, including the sub-basin TC tracks (p<0.1) and basin-wide\naccumulated cyclone energy (p<0.01) of the North Atlantic and North Pacific\nbasins. These findings highlight the promise of leveraging ML models with\nphysical insights to model TC risks and deliver seamless weather-climate\npredictions.",
            "pdf_url": "http://arxiv.org/pdf/2505.01455v2",
            "published": "2025-04-30 19:42:16+00:00",
            "updated": "2025-07-17 17:20:09+00:00"
        },
        {
            "title": "A fast and accurate method for inferring solid-state diffusivity in lithium-ion battery active materials: improving upon the classical GITT approach",
            "authors": "A. Emir Gumrukcuoglu, James Burridge, Kieran O'Regan, Emma Kendrick, Jamie M. Foster",
            "summary": "Data collected using the galvanostatic intermittent titration technique\n(GITT) and application of the Sand equation is a ubiquitous method for\ninferring the solid-state diffusivity in lithium-ion battery active materials.\nHowever, the experiment is notoriously time-consuming and the Sand equation\nrelies on assumptions whose applicability can be questionable. We propose a\nnovel methodology, termed Inference from a Consistent Model (ICM), which\nenables inference of solid-state diffusivity using the same physical model\nemployed for prediction, and is applicable to more general and quick-to-measure\ndata. We infer the diffusivity (as a function of inserted lithium\nconcentration) by minimising the residual sum of squares between data and\nsolutions to a spherically-symmetric nonlinear diffusion model in a single\nrepresentative active material particle. Using data harvested from the NMC\ncathode of a commercial LG M50 cell we demonstrate that the ICM is robust, and\nyields more accurate diffusivity estimates, while relying on data that are five\ntimes faster to collect than that required by the classical approach. Moreover,\nthere is good reason to believe that further speed ups could be achieved when\nother types of data are available. This work contributes towards developing\nfaster and more reliable techniques in parameter inference for lithium-ion\nbatteries, and the code required to deploy ICM is provided to facilitate its\nadoption in future research.",
            "pdf_url": "http://arxiv.org/pdf/2404.16658v2",
            "published": "2024-04-25 14:49:46+00:00",
            "updated": "2025-07-17 16:35:56+00:00"
        },
        {
            "title": "Partial decidability protocol for the Wang tiling problem from statistical mechanics and chaotic mapping",
            "authors": "Fabrizio Canfora, Marco Cedeno",
            "summary": "We introduce a partial decidability protocol for the Wang tiling problem\n(which is the prototype of undecidable problems in combinatorics and\nstatistical physics) by constructing a suitable mapping from tilings of finite\nsquares of different sizes. Such mapping depends on the initial family of Wang\ntiles (the alphabet) with which one would like to tile the plane. This allows\nto define effective entropy and temperature associated to the alphabet\n(together with the corresponding partition function). We identify a subclass of\ngood alphabets by observing that when the entropy and temperature of a given\nalphabet are well-behaved in the thermodynamical sense then such alphabet can\ntile the infinite two-dimensional plane. Our proposal is tested successfully\nwith the known available good alphabets (which produce periodic tilings,\naperiodic but self-similar tilings as well as tilings which are neither\nperiodic nor self-similar). Our analysis shows that the Kendall Tau coefficient\nis able to distinguish alphabets with a good thermodynamical behavior from\nalphabets with bad thermodynamical behavior. The transition from good to\nundecidable behavior is related to a transition from non-chaotic to chaotic\nregime in discrete dynamical systems of logistic type.",
            "pdf_url": "http://arxiv.org/pdf/2507.13268v1",
            "published": "2025-07-17 16:25:03+00:00",
            "updated": "2025-07-17 16:25:03+00:00"
        },
        {
            "title": "State transfer analysis for linear spin chains with non-uniform on-site energies",
            "authors": "Chad C. Nelmes, Irene D'Amico, Timothy P. Spiller",
            "summary": "High fidelity state transfer is an important ingredient of distributed\nquantum information processing. We present and analyse results on perfect and\nquasi-perfect state transfer with linear spin chains incorporating non-uniform\non-site energies. The motivation is maintenance of coupling uniformity, which\ncould be beneficial for some physical implementations. We relate this coupling\nuniformity to a particle in a discrete potential analogue. Our analysis further\nconsiders the statistical variation in couplings and on-site energies, as a\nfunction of increasing chain site number N.",
            "pdf_url": "http://arxiv.org/pdf/2507.13261v1",
            "published": "2025-07-17 16:09:37+00:00",
            "updated": "2025-07-17 16:09:37+00:00"
        },
        {
            "title": "A Roadmap for Climate-Relevant Robotics Research",
            "authors": "Alan Papalia, Charles Dawson, Laurentiu L. Anton, Norhan Magdy Bayomi, Bianca Champenois, Jung-Hoon Cho, Levi Cai, Joseph DelPreto, Kristen Edwards, Bilha-Catherine Githinji, Cameron Hickert, Vindula Jayawardana, Matthew Kramer, Shreyaa Raghavan, David Russell, Shide Salimi, Jingnan Shi, Soumya Sudhakar, Yanwei Wang, Shouyi Wang, Luca Carlone, Vijay Kumar, Daniela Rus, John E. Fernandez, Cathy Wu, George Kantor, Derek Young, Hanumant Singh",
            "summary": "Climate change is one of the defining challenges of the 21st century, and\nmany in the robotics community are looking for ways to contribute. This paper\npresents a roadmap for climate-relevant robotics research, identifying\nhigh-impact opportunities for collaboration between roboticists and experts\nacross climate domains such as energy, the built environment, transportation,\nindustry, land use, and Earth sciences. These applications include problems\nsuch as energy systems optimization, construction, precision agriculture,\nbuilding envelope retrofits, autonomous trucking, and large-scale environmental\nmonitoring. Critically, we include opportunities to apply not only physical\nrobots but also the broader robotics toolkit - including planning, perception,\ncontrol, and estimation algorithms - to climate-relevant problems. A central\ngoal of this roadmap is to inspire new research directions and collaboration by\nhighlighting specific, actionable problems at the intersection of robotics and\nclimate. This work represents a collaboration between robotics researchers and\ndomain experts in various climate disciplines, and it serves as an invitation\nto the robotics community to bring their expertise to bear on urgent climate\npriorities.",
            "pdf_url": "http://arxiv.org/pdf/2507.11623v2",
            "published": "2025-07-15 18:01:49+00:00",
            "updated": "2025-07-17 16:00:19+00:00"
        },
        {
            "title": "Quantum stress-energy at timelike boundaries: testing a new beyond-$Λ$CDM parameter with cosmological data",
            "authors": "Oliver H. E. Philcox, Eva Silverstein, Gonzalo Torroba",
            "summary": "We analyze the basic cosmological effects of a population of timelike\nboundaries -- a form of nontrivial spacetime topology -- containing a boundary\nlayer of quantum stress energy. This accumulation of vacuum fluctuations of\nquantum fields can be consistently negative and UV sensitive, providing an\nadditional source of cosmic energy density strong enough to compete with matter\nand dark energy. For boundary conditions enabling a solution with fixed\ncomoving boundary size, this effect contributes a qualitatively new term to the\nFriedmann equation determining the expansion history, scaling like $-1/a$ for\nscale factor $a$. It naturally dominates at relatively late times\n($a\\approx1/2$), while leaving intact well-measured early universe physics such\nas big bang nucleosynthesis and recombination. For a wide window of parameters,\nthe boundaries can be larger than the Planck length throughout their history,\nback through the start of inflation at any viable scale. We analyze CMB and BAO\ndata sets (Planck, ACT, and DESI) allowing for this component, finding a slight\npreference ($\\sim 2\\sigma$) and a relaxation of current tensions in the data\n(including the neutrino mass) in a physical manner. This novel parameter fits\ninto a larger space of physical parameters beyond-$\\Lambda$CDM that may serve\nthis role, including negative spatial curvature, which may also be motivated by\ntopological considerations and chaotic dynamics. Finally, we comment on\nadditional phenomenological prospects for testing for this form of topology in\nthe universe.",
            "pdf_url": "http://arxiv.org/pdf/2507.00115v2",
            "published": "2025-06-30 18:00:00+00:00",
            "updated": "2025-07-17 15:54:43+00:00"
        },
        {
            "title": "Resources for bosonic metrology: quantum-enhanced precision from a superselection rule perspective",
            "authors": "Astghik Saharyan, Eloi Descamps, Arne Keller, Pérola Milman",
            "summary": "Quantum optics and atomic systems are prominent platforms for exploiting\nquantum-enhanced precision in parameter estimation. However, not only are\nquantum optical and atomic systems often treated separately, but even within\nquantum optics, identifying optimal probes (quantum states) and evolutions\n(parameter-dependent dynamics) typically relies on case-by-case analyses. Mode,\nand sometimes only particle entanglement, can yield quantum enhancement of\nprecision in continuous- and discrete-variable regimes, yet a clear connection\nbetween these regimes remains elusive. In this work, we present a unified\nframework for quantum metrology that encompasses all known precision-enhancing\nregimes using bosonic resources. We introduce a superselection rule compliant\nrepresentation of the electromagnetic field that explicitly incorporates the\nphase reference, enforcing total particle number conservation. This approach\nprovides a description of the electromagnetic field which is formally\nequivalent to the one employed in atomic systems, and we show how it\nencompasses both the discrete and the continuous limits of quantum optics.\nWithin this framework, we consistently recover established results while\noffering a coherent physical interpretation of the quantum resources\nresponsible for precision enhancement. Moreover, we develop general strategies\nto optimize precision using arbitrary multimode entangled probe states.\nFinally, our formalism readily accommodates noise, measurement strategies and\nnon-unitary evolutions, extending its applicability to realistic experimental\nscenarios.",
            "pdf_url": "http://arxiv.org/pdf/2507.13245v1",
            "published": "2025-07-17 15:54:34+00:00",
            "updated": "2025-07-17 15:54:34+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Generative Diffusion Models for Resource Allocation in Wireless Networks",
            "authors": "Yigit Berkay Uslu, Samar Hadou, Shirin Saeedi Bidokhti, Alejandro Ribeiro",
            "summary": "This paper proposes a supervised training algorithm for learning stochastic\nresource allocation policies with generative diffusion models (GDMs). We\nformulate the allocation problem as the maximization of an ergodic utility\nfunction subject to ergodic Quality of Service (QoS) constraints. Given samples\nfrom a stochastic expert policy that yields a near-optimal solution to the\nconstrained optimization problem, we train a GDM policy to imitate the expert\nand generate new samples from the optimal distribution. We achieve near-optimal\nperformance through the sequential execution of the generated samples. To\nenable generalization to a family of network configurations, we parameterize\nthe backward diffusion process with a graph neural network (GNN) architecture.\nWe present numerical results in a case study of power control.",
            "pdf_url": "http://arxiv.org/pdf/2504.20277v2",
            "published": "2025-04-28 21:44:31+00:00",
            "updated": "2025-07-17 16:38:32+00:00"
        },
        {
            "title": "VITA: Vision-to-Action Flow Matching Policy",
            "authors": "Dechen Gao, Boqi Zhao, Andrew Lee, Ian Chuang, Hanchu Zhou, Hang Wang, Zhe Zhao, Junshan Zhang, Iman Soltani",
            "summary": "We present VITA, a Vision-To-Action flow matching policy that evolves latent\nvisual representations into latent actions for visuomotor control. Traditional\nflow matching and diffusion policies sample from standard source distributions\n(e.g., Gaussian noise) and require additional conditioning mechanisms like\ncross-attention to condition action generation on visual information, creating\ntime and space overheads. VITA proposes a novel paradigm that treats latent\nimages as the flow source, learning an inherent mapping from vision to action\nwhile eliminating separate conditioning modules and preserving generative\nmodeling capabilities. Learning flows between fundamentally different\nmodalities like vision and action is challenging due to sparse action data\nlacking semantic structures and dimensional mismatches between high-dimensional\nvisual representations and raw actions. We address this by creating a\nstructured action latent space via an autoencoder as the flow matching target,\nup-sampling raw actions to match visual representation shapes. Crucially, we\nsupervise flow matching with both encoder targets and final action outputs\nthrough flow latent decoding, which backpropagates action reconstruction loss\nthrough sequential flow matching ODE solving steps for effective end-to-end\nlearning. Implemented as simple MLP layers, VITA is evaluated on challenging\nbi-manual manipulation tasks on the ALOHA platform, including 5 simulation and\n2 real-world tasks. Despite its simplicity, MLP-only VITA outperforms or\nmatches state-of-the-art generative policies while reducing inference latency\nby 50-130% compared to conventional flow matching policies requiring different\nconditioning mechanisms or complex architectures. To our knowledge, VITA is the\nfirst MLP-only flow matching policy capable of solving complex bi-manual\nmanipulation tasks like those in ALOHA benchmarks.",
            "pdf_url": "http://arxiv.org/pdf/2507.13231v1",
            "published": "2025-07-17 15:41:57+00:00",
            "updated": "2025-07-17 15:41:57+00:00"
        },
        {
            "title": "Deep Learning-Based Fetal Lung Segmentation from Diffusion-weighted MRI Images and Lung Maturity Evaluation for Fetal Growth Restriction",
            "authors": "Zhennan Xiao, Katharine Brudkiewicz, Zhen Yuan, Rosalind Aughwane, Magdalena Sokolska, Joanna Chappell, Trevor Gaunt, Anna L. David, Andrew P. King, Andrew Melbourne",
            "summary": "Fetal lung maturity is a critical indicator for predicting neonatal outcomes\nand the need for post-natal intervention, especially for pregnancies affected\nby fetal growth restriction. Intra-voxel incoherent motion analysis has shown\npromising results for non-invasive assessment of fetal lung development, but\nits reliance on manual segmentation is time-consuming, thus limiting its\nclinical applicability. In this work, we present an automated lung maturity\nevaluation pipeline for diffusion-weighted magnetic resonance images that\nconsists of a deep learning-based fetal lung segmentation model and a\nmodel-fitting lung maturity assessment. A 3D nnU-Net model was trained on\nmanually segmented images selected from the baseline frames of 4D\ndiffusion-weighted MRI scans. The segmentation model demonstrated robust\nperformance, yielding a mean Dice coefficient of 82.14%. Next, voxel-wise model\nfitting was performed based on both the nnU-Net-predicted and manual lung\nsegmentations to quantify IVIM parameters reflecting tissue microstructure and\nperfusion. The results suggested no differences between the two. Our work shows\nthat a fully automated pipeline is possible for supporting fetal lung maturity\nassessment and clinical decision-making.",
            "pdf_url": "http://arxiv.org/pdf/2507.13106v1",
            "published": "2025-07-17 13:21:42+00:00",
            "updated": "2025-07-17 13:21:42+00:00"
        },
        {
            "title": "Uni-Instruct: One-step Diffusion Model through Unified Diffusion Divergence Instruction",
            "authors": "Yifei Wang, Weimin Bai, Colin Zhang, Debing Zhang, Weijian Luo, He Sun",
            "summary": "In this paper, we unify more than 10 existing one-step diffusion distillation\napproaches, such as Diff-Instruct, DMD, SIM, SiD, $f$-distill, etc, inside a\ntheory-driven framework which we name the \\textbf{\\emph{Uni-Instruct}}.\nUni-Instruct is motivated by our proposed diffusion expansion theory of the\n$f$-divergence family. Then we introduce key theories that overcome the\nintractability issue of the original expanded $f$-divergence, resulting in an\nequivalent yet tractable loss that effectively trains one-step diffusion models\nby minimizing the expanded $f$-divergence family. The novel unification\nintroduced by Uni-Instruct not only offers new theoretical contributions that\nhelp understand existing approaches from a high-level perspective but also\nleads to state-of-the-art one-step diffusion generation performances. On the\nCIFAR10 generation benchmark, Uni-Instruct achieves record-breaking Frechet\nInception Distance (FID) values of \\textbf{\\emph{1.46}} for unconditional\ngeneration and \\textbf{\\emph{1.38}} for conditional generation. On the\nImageNet-$64\\times 64$ generation benchmark, Uni-Instruct achieves a new SoTA\none-step generation FID of \\textbf{\\emph{1.02}}, which outperforms its 79-step\nteacher diffusion with a significant improvement margin of 1.33 (1.02 vs 2.35).\nWe also apply Uni-Instruct on broader tasks like text-to-3D generation. For\ntext-to-3D generation, Uni-Instruct gives decent results, which slightly\noutperforms previous methods, such as SDS and VSD, in terms of both generation\nquality and diversity. Both the solid theoretical and empirical contributions\nof Uni-Instruct will potentially help future studies on one-step diffusion\ndistillation and knowledge transferring of diffusion models.",
            "pdf_url": "http://arxiv.org/pdf/2505.20755v2",
            "published": "2025-05-27 05:55:45+00:00",
            "updated": "2025-07-17 13:16:31+00:00"
        }
    ]
}