{
    "Physics": [
        {
            "title": "Aether: Geometric-Aware Unified World Modeling",
            "authors": "Aether Team, Haoyi Zhu, Yifan Wang, Jianjun Zhou, Wenzheng Chang, Yang Zhou, Zizun Li, Junyi Chen, Chunhua Shen, Jiangmiao Pang, Tong He",
            "summary": "The integration of geometric reconstruction and generative modeling remains a\ncritical challenge in developing AI systems capable of human-like spatial\nreasoning. This paper proposes Aether, a unified framework that enables\ngeometry-aware reasoning in world models by jointly optimizing three core\ncapabilities: (1) 4D dynamic reconstruction, (2) action-conditioned video\nprediction, and (3) goal-conditioned visual planning. Through task-interleaved\nfeature learning, Aether achieves synergistic knowledge sharing across\nreconstruction, prediction, and planning objectives. Building upon video\ngeneration models, our framework demonstrates unprecedented synthetic-to-real\ngeneralization despite never observing real-world data during training.\nFurthermore, our approach achieves zero-shot generalization in both action\nfollowing and reconstruction tasks, thanks to its intrinsic geometric modeling.\nRemarkably, even without real-world data, its reconstruction performance far\nexceeds that of domain-specific models. Additionally, Aether leverages a\ngeometry-informed action space to seamlessly translate predictions into\nactions, enabling effective autonomous trajectory planning. We hope our work\ninspires the community to explore new frontiers in physically-reasonable world\nmodeling and its applications.",
            "pdf_url": "http://arxiv.org/pdf/2503.18945v1",
            "published": "2025-03-24 17:59:51+00:00",
            "updated": "2025-03-24 17:59:51+00:00"
        },
        {
            "title": "Multimodality in the search for new physics in pulsar timing data and the case of kination-amplified gravitational-wave background from inflation",
            "authors": "Bohua Li, Joel Meyers, Paul R. Shapiro",
            "summary": "We investigate the kination-amplified inflationary gravitational-wave\nbackground (GWB) interpretation of the signal recently reported by various\npulsar timing array (PTA) experiments. Kination is a post-inflationary phase in\nthe expansion history dominated by the kinetic energy of some scalar field,\ncharacterized by a stiff equation of state $w=1$. Within the inflationary GWB\nmodel, we identify two modes which can fit the current data sets (NANOGrav and\nEPTA) with equal likelihood: the kination-amplification (KA) mode and the\nordinary, non-kination-amplification (no-KA) mode. The multimodality of the\nlikelihood motivates a Bayesian analysis with nested sampling. We analyze the\nfree spectra of current PTA data and mock free spectra constructed with higher\nsignal-to-noise ratios, using nested sampling. The analysis of the mock\nspectrum designed to be consistent with the best fit to the NANOGrav 15 yr\n(NG15) data successfully reveals the expected bimodal posterior for the first\ntime while excluding the reheating mode that appears in the fit to the current\nNG15 data, making a case for our correct treatment of potential multimodal\nposteriors arising from future PTA data sets. The resultant Bayes factor is\n$B\\equiv Z_\\mathrm{no-KA}/Z_\\mathrm{KA}=2.9\\pm1.9$, indicating comparable\nstatistical significance between the two modes. Given the theoretical\nmodel-building challenges of producing highly blue-tilted primordial tensor\nspectra, the KA mode has the advantage of requiring a less blue primordial\nspectrum, compared with the no-KA mode. The synergy between future cosmic\nmicrowave background polarization, pulsar timing and laser interferometer\nmeasurements of gravitational waves will help resolve the ambiguity implied by\nthe multimodal posterior in PTA-only searches.",
            "pdf_url": "http://arxiv.org/pdf/2503.18937v1",
            "published": "2025-03-24 17:57:01+00:00",
            "updated": "2025-03-24 17:57:01+00:00"
        },
        {
            "title": "Renormalising the Field-Space Geometry",
            "authors": "Patrick Aigner, Luigi Bellafronte, Emanuele Gendy, Dominik Haslehner, Andreas Weiler",
            "summary": "We present a systematic study of one-loop quantum corrections in scalar\neffective field theories from a geometric viewpoint, emphasizing the role of\nfield-space curvature and its renormalisation. By treating the scalar fields as\ncoordinates on a Riemannian manifold, we exploit field redefinition invariance\nto maintain manifest coordinate independence of physical observables. Focusing\non the non-linear sigma model (NLSM) and \\(\\phi^4\\) theory, we demonstrate how\nloop corrections induce momentum- and scale-dependent shifts in the curvature\nof the field-space manifold. These corrections can be elegantly captured\nthrough the recently proposed geometry-kinematics duality, which generalizes\nthe colour-kinematics duality in gauge theories to curved field-space\nbackgrounds. Our results highlight a universal structure emerging in the\ncontractions of Riemann tensors that contribute to renormalisation of the\nfield-space curvature. In particular, we find explicit expressions and a\nuniversal structure for the running curvature and Ricci scalar in simple\nmodels, illustrating how quantum effects reshape the underlying geometry. This\ngeometric formulation unifies a broad class of scalar EFTs, providing insight\ninto the interplay of curvature, scattering amplitudes, and renormalisation.",
            "pdf_url": "http://arxiv.org/pdf/2503.09785v2",
            "published": "2025-03-12 19:37:42+00:00",
            "updated": "2025-03-24 17:34:08+00:00"
        },
        {
            "title": "A Grad-Shafranov model for compact quasisymmetric stellarators",
            "authors": "Nikita Nikulsin, Wrick Sengupta, Stefan Buller, Amitava Bhattacharjee",
            "summary": "A Grad-Shafranov equation (GSE) valid for compact quasisymmetric stellarators\nis derived by an asymptotic expansion around a vacuum field carried to first\norder. We obtain an equation for the existence of flux surfaces leading up to\nthe GSE. The flux surface label must simultaneously satisfy the existence\nequation and the GSE, which generally leads to an overdetermined problem. We\nshow how the overdetermined problem can be resolved within our model for a\nclass of hybrid devices similar to that studied by Henneberg and Plunk (S.\nHenneberg and G. Plunk, PRR 2024). We are also able to solve the existence\nequation for flux surfaces analytically in the most general case by introducing\na special coordinate system. This will enable us to carry out an optimization\nseeking to minimize the error in our GSE while obeying the flux surface\nexistence equation, which will allow us to find solutions outside the class of\nhybrid devices. This will allow for a coarse-grained approximate search in the\nspace of quasisymmetric equilibria that should be faster than a conventional\nstellarator optimization. Nevertheless, it would still be necessary to\nfine-tune the approximate solutions using conventional tools to obtain a more\nprecise optimized equilibrium.",
            "pdf_url": "http://arxiv.org/pdf/2501.11424v2",
            "published": "2025-01-20 11:46:01+00:00",
            "updated": "2025-03-24 17:27:12+00:00"
        },
        {
            "title": "Design of an aluminum nitride based electro-optic phase modulator and photonic switch for next generation scalable photonic integrated circuits",
            "authors": "Suat Icli, Rangana Banerjee Chaudhuri, Elena Jordan, Fatemeh Salahshoori, Tanja E. Mehlstäubler",
            "summary": "Electro-optic modulators are fundamental components in atomic physics\nexperiments, including trapped-ion systems used in precision metrology and\nquantum computing. To enable scalable photonic integration, we design and\nanalyze an integrated photonic electro-optic phase modulator and switch at 411\nnm for ytterbium ($Yb^{+}$) ions using aluminum nitride (AlN) waveguides. We\nemploy finite element method (FEM) simulations to optimize optical confinement,\nRF impedance matching, and electro-optic modulation efficiency. The phase\nmodulator achieves a DC $V_{\\pi}L$ of 178 V cm for TE polarization. The\nphotonic switch, designed with a push-pull electrode configuration,\ndemonstrates a $V_{\\pi}L$ of 24 V cm, enabling efficient operation at lower\nvoltages. These results highlight AlN as a candidate for ultraviolet photonic\nintegrated circuits, facilitating high-speed optical modulation for trapped-ion\napplications.",
            "pdf_url": "http://arxiv.org/pdf/2503.18861v1",
            "published": "2025-03-24 16:36:24+00:00",
            "updated": "2025-03-24 16:36:24+00:00"
        },
        {
            "title": "Self-Organizing Graph Reasoning Evolves into a Critical State for Continuous Discovery Through Structural-Semantic Dynamics",
            "authors": "Markus J. Buehler",
            "summary": "We report fundamental insights into how agentic graph reasoning systems\nspontaneously evolve toward a critical state that sustains continuous semantic\ndiscovery. By rigorously analyzing structural (Von Neumann graph entropy) and\nsemantic (embedding) entropy, we identify a subtle yet robust regime in which\nsemantic entropy persistently dominates over structural entropy. This interplay\nis quantified by a dimensionless Critical Discovery Parameter that stabilizes\nat a small negative value, indicating a consistent excess of semantic entropy.\nEmpirically, we observe a stable fraction (12%) of \"surprising\" edges, links\nbetween semantically distant concepts, providing evidence of long-range or\ncross-domain connections that drive continuous innovation. Concomitantly, the\nsystem exhibits scale-free and small-world topological features, alongside a\nnegative cross-correlation between structural and semantic measures,\nreinforcing the analogy to self-organized criticality. These results establish\nclear parallels with critical phenomena in physical, biological, and cognitive\ncomplex systems, revealing an entropy-based principle governing adaptability\nand continuous innovation. Crucially, semantic richness emerges as the\nunderlying driver of sustained exploration, despite not being explicitly used\nby the reasoning process. Our findings provide interdisciplinary insights and\npractical strategies for engineering intelligent systems with intrinsic\ncapacities for long-term discovery and adaptation, and offer insights into how\nmodel training strategies can be developed that reinforce critical discovery.",
            "pdf_url": "http://arxiv.org/pdf/2503.18852v1",
            "published": "2025-03-24 16:30:37+00:00",
            "updated": "2025-03-24 16:30:37+00:00"
        },
        {
            "title": "The isoscalar octet axial form factor of the nucleon from lattice QCD",
            "authors": "Alessandro Barone, Dalibor Djukanovic, Georg von Hippel, Jonna Koponen, Harvey B. Meyer, Konstantin Ottnad, Hartmut Wittig",
            "summary": "The isoscalar axial-vector form factor of the nucleon plays a key role in\nunderstanding the electroweak interaction of nucleons. For the interpretation\nof the spin structure of the nucleon the non-singlet isoscalar axial charge is\nindispensable. Moreover, $G_A^{u+d-2s}(Q^2)$ together with the isovector and\nsinglet isoscalar form factors are needed for the flavor-decomposition of the\naxial-vector form factor. Detailed knowledge of the flavor decomposition\nfacilitates extractions of Standard Model (SM) parameters from low energy\nexperiments such as the electroweak charge of the proton in the P2 experiment.\nHere we present a lattice determination of $G_A^{u+d-2s}(Q^2)$ on $N_f=2+1$\n$\\mathcal{O}(a)$ improved Wilson fermions, with a full error budget concerning\nextrapolations and interpolations to the continuum and infinite volume and\nphysical quark masses.",
            "pdf_url": "http://arxiv.org/pdf/2503.18848v1",
            "published": "2025-03-24 16:26:13+00:00",
            "updated": "2025-03-24 16:26:13+00:00"
        },
        {
            "title": "Cherenkov emission by a fast-moving uncharged Schwarzschild black hole",
            "authors": "Sergei Khlebnikov, Maxim Lyutikov",
            "summary": "We demonstrate that in the presence of an external magnetic field, an\nuncharged classical Schwarzschild black hole moving superluminally in a\ndielectric with permittivity $\\epsilon > 1$ produces Cherenkov emission. This\nis a new physical effect: classical (non-quantum) emission of electromagnetic\nwaves by a completely charge-neutral ``particle''. The governing equations\n(involving General Relativity, electromagnetism, and the physics of continuous\nmedia) have no external electromagnetic source - it is the distortion of the\ninitial electromagnetic fields by the gravity of the black hole that plays the\nrole of a superluminally moving source. The effect relies on nonzero values of\nboth the magnetic field and the gravitational radius, as well as on the usual\nCherenkov condition on the velocity, $v/c > 1/\\sqrt{\\epsilon}$. Unlike\nCherenkov emission by a point charge, the effective source in this case is\nspatially distributed, with emission generated along the single Cherenkov\nemission cone. The emitted spectrum is red-dominated, with power $\\propto dk_z\n/|k_z|$ for wave numbers $|k_z| \\leq 1/R_G$, where $R_G$ is the Schwarzschild\nradius. We comment on possible observability of this process during black hole\n-- neutron star mergers.",
            "pdf_url": "http://arxiv.org/pdf/2502.02811v3",
            "published": "2025-02-05 01:17:32+00:00",
            "updated": "2025-03-24 16:23:15+00:00"
        },
        {
            "title": "Connecting Gravity and Quantum Physics: Primordial Black Holes and Accelerated Evolution of the Universe",
            "authors": "Victor Borsevici, Samit Ganguly, Goutam Manna",
            "summary": "This study presents a new framework to explore the fundamental relationship\nbetween gravity and quantum mechanics, with particular emphasis on the\nfundamental role of primordial black holes (PBHs) in cosmology. Through the\nconcept of self-gravitating condensed light in the form of the experimentally\ndiscovered quantum photon Bose-Einstein condensate, this work examines the\nquantized gravitational, informational, thermodynamical, traditional, and other\nattributes of PBHs and their implications for early universe dynamics,\nbaryogenesis, the very early formation of galaxies, supermassive black holes\n(SMBHs) and large-scale structures. Precise calculations have shown that\nprimordial protogalaxies with supermassive black holes at their centers of\ngravity were formed before the recombination epoch. By solving issues like the\ncosmological constant problem and the information loss paradox, dark matter and\ndark energy, this work provides insights into Planck-scale physics and it's\nimpact to cosmology. In such a way PBHs serve as a bridge between quantum\ntheory and general relativity. This study ultimately posits that presented PBH\nphysics is essential to resolving major cosmological and astrophysical issues,\nparadoxes and \"mysteries\", such as the accelerated evolution of the Universe\nestablished by JWST and other observations.",
            "pdf_url": "http://arxiv.org/pdf/2411.11047v3",
            "published": "2024-11-17 11:55:16+00:00",
            "updated": "2025-03-24 16:21:36+00:00"
        },
        {
            "title": "Streaming Federated Learning with Markovian Data",
            "authors": "Tan-Khiem Huynh, Malcolm Egan, Giovanni Neglia, Jean-Marie Gorce",
            "summary": "Federated learning (FL) is now recognized as a key framework for\ncommunication-efficient collaborative learning. Most theoretical and empirical\nstudies, however, rely on the assumption that clients have access to\npre-collected data sets, with limited investigation into scenarios where\nclients continuously collect data. In many real-world applications,\nparticularly when data is generated by physical or biological processes, client\ndata streams are often modeled by non-stationary Markov processes. Unlike\nstandard i.i.d. sampling, the performance of FL with Markovian data streams\nremains poorly understood due to the statistical dependencies between client\nsamples over time. In this paper, we investigate whether FL can still support\ncollaborative learning with Markovian data streams. Specifically, we analyze\nthe performance of Minibatch SGD, Local SGD, and a variant of Local SGD with\nmomentum. We answer affirmatively under standard assumptions and smooth\nnon-convex client objectives: the sample complexity is proportional to the\ninverse of the number of clients with a communication complexity comparable to\nthe i.i.d. scenario. However, the sample complexity for Markovian data streams\nremains higher than for i.i.d. sampling.",
            "pdf_url": "http://arxiv.org/pdf/2503.18807v1",
            "published": "2025-03-24 15:49:42+00:00",
            "updated": "2025-03-24 15:49:42+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "A semantic communication-based workload-adjustable transceiver for wireless AI-generated content (AIGC) delivery",
            "authors": "Runze Cheng, Yao Sun, Lan Zhang, Lei Feng, Lei Zhang, Muhammad Ali Imran",
            "summary": "With the significant advances in generative AI (GAI) and the proliferation of\nmobile devices, providing high-quality AI-generated content (AIGC) services via\nwireless networks is becoming the future direction. However, the primary\nchallenges of AIGC service delivery in wireless networks lie in unstable\nchannels, limited bandwidth resources, and unevenly distributed computational\nresources. In this paper, we employ semantic communication (SemCom) in\ndiffusion-based GAI models to propose a Resource-aware wOrkload-adjUstable\nTransceivEr (ROUTE) for AIGC delivery in dynamic wireless networks.\nSpecifically, to relieve the communication resource bottleneck, SemCom is\nutilized to prioritize semantic information of the generated content. Then, to\nimprove computational resource utilization in both edge and local and reduce\nAIGC semantic distortion in transmission, modified diffusion-based models are\napplied to adjust the computing workload and semantic density in cooperative\ncontent generation. Simulations verify the superiority of our proposed ROUTE in\nterms of latency and content quality compared to conventional AIGC approaches.",
            "pdf_url": "http://arxiv.org/pdf/2503.18874v1",
            "published": "2025-03-24 16:49:06+00:00",
            "updated": "2025-03-24 16:49:06+00:00"
        },
        {
            "title": "Dual-domain Multi-path Self-supervised Diffusion Model for Accelerated MRI Reconstruction",
            "authors": "Yuxuan Zhang, Jinkui Hao, Bo Zhou",
            "summary": "Magnetic resonance imaging (MRI) is a vital diagnostic tool, but its\ninherently long acquisition times reduce clinical efficiency and patient\ncomfort. Recent advancements in deep learning, particularly diffusion models,\nhave improved accelerated MRI reconstruction. However, existing diffusion\nmodels' training often relies on fully sampled data, models incur high\ncomputational costs, and often lack uncertainty estimation, limiting their\nclinical applicability. To overcome these challenges, we propose a novel\nframework, called Dual-domain Multi-path Self-supervised Diffusion Model\n(DMSM), that integrates a self-supervised dual-domain diffusion model training\nscheme, a lightweight hybrid attention network for the reconstruction diffusion\nmodel, and a multi-path inference strategy, to enhance reconstruction accuracy,\nefficiency, and explainability. Unlike traditional diffusion-based models, DMSM\neliminates the dependency on training from fully sampled data, making it more\npractical for real-world clinical settings. We evaluated DMSM on two human MRI\ndatasets, demonstrating that it achieves favorable performance over several\nsupervised and self-supervised baselines, particularly in preserving fine\nanatomical structures and suppressing artifacts under high acceleration\nfactors. Additionally, our model generates uncertainty maps that correlate\nreasonably well with reconstruction errors, offering valuable clinically\ninterpretable guidance and potentially enhancing diagnostic confidence.",
            "pdf_url": "http://arxiv.org/pdf/2503.18836v1",
            "published": "2025-03-24 16:10:51+00:00",
            "updated": "2025-03-24 16:10:51+00:00"
        },
        {
            "title": "Quantifying Climate Change Impacts on Renewable Energy Generation: A Super-Resolution Recurrent Diffusion Model",
            "authors": "Xiaochong Dong, Jun Dan, Yingyun Sun, Yang Liu, Xuemin Zhang, Shengwei Mei",
            "summary": "Driven by global climate change and the ongoing energy transition, the\ncoupling between power supply capabilities and meteorological factors has\nbecome increasingly significant. Over the long term, accurately quantifying the\npower generation of renewable energy under the influence of climate change is\nessential for the development of sustainable power systems. However, due to\ninterdisciplinary differences in data requirements, climate data often lacks\nthe necessary hourly resolution to capture the short-term variability and\nuncertainties of renewable energy resources. To address this limitation, a\nsuper-resolution recurrent diffusion model (SRDM) has been developed to enhance\nthe temporal resolution of climate data and model the short-term uncertainty.\nThe SRDM incorporates a pre-trained decoder and a denoising network, that\ngenerates long-term, high-resolution climate data through a recurrent coupling\nmechanism. The high-resolution climate data is then converted into power value\nusing the mechanism model, enabling the simulation of wind and photovoltaic\n(PV) power generation on future long-term scales. Case studies were conducted\nin the Ejina region of Inner Mongolia, China, using fifth-generation reanalysis\n(ERA5) and coupled model intercomparison project (CMIP6) data under two climate\npathways: SSP126 and SSP585. The results demonstrate that the SRDM outperforms\nexisting generative models in generating super-resolution climate data.\nFurthermore, the research highlights the estimation biases introduced when\nlow-resolution climate data is used for power conversion.",
            "pdf_url": "http://arxiv.org/pdf/2412.11399v2",
            "published": "2024-12-16 02:54:21+00:00",
            "updated": "2025-03-24 15:22:46+00:00"
        },
        {
            "title": "MaRS: A Fast Sampler for Mean Reverting Diffusion based on ODE and SDE Solvers",
            "authors": "Ao Li, Wei Fang, Hongbo Zhao, Le Lu, Ge Yang, Minfeng Xu",
            "summary": "In applications of diffusion models, controllable generation is of practical\nsignificance, but is also challenging. Current methods for controllable\ngeneration primarily focus on modifying the score function of diffusion models,\nwhile Mean Reverting (MR) Diffusion directly modifies the structure of the\nstochastic differential equation (SDE), making the incorporation of image\nconditions simpler and more natural. However, current training-free fast\nsamplers are not directly applicable to MR Diffusion. And thus MR Diffusion\nrequires hundreds of NFEs (number of function evaluations) to obtain\nhigh-quality samples. In this paper, we propose a new algorithm named MaRS (MR\nSampler) to reduce the sampling NFEs of MR Diffusion. We solve the reverse-time\nSDE and the probability flow ordinary differential equation (PF-ODE) associated\nwith MR Diffusion, and derive semi-analytical solutions. The solutions consist\nof an analytical function and an integral parameterized by a neural network.\nBased on this solution, we can generate high-quality samples in fewer steps.\nOur approach does not require training and supports all mainstream\nparameterizations, including noise prediction, data prediction and velocity\nprediction. Extensive experiments demonstrate that MR Sampler maintains high\nsampling quality with a speedup of 10 to 20 times across ten different image\nrestoration tasks. Our algorithm accelerates the sampling procedure of MR\nDiffusion, making it more practical in controllable generation.",
            "pdf_url": "http://arxiv.org/pdf/2502.07856v4",
            "published": "2025-02-11 14:57:33+00:00",
            "updated": "2025-03-24 15:18:25+00:00"
        },
        {
            "title": "Thermalizer: Stable autoregressive neural emulation of spatiotemporal chaos",
            "authors": "Chris Pedersen, Laure Zanna, Joan Bruna",
            "summary": "Autoregressive surrogate models (or \\textit{emulators}) of spatiotemporal\nsystems provide an avenue for fast, approximate predictions, with broad\napplications across science and engineering. At inference time, however, these\nmodels are generally unable to provide predictions over long time rollouts due\nto accumulation of errors leading to diverging trajectories. In essence,\nemulators operate out of distribution, and controlling the online distribution\nquickly becomes intractable in large-scale settings. To address this\nfundamental issue, and focusing on time-stationary systems admitting an\ninvariant measure, we leverage diffusion models to obtain an implicit estimator\nof the score of this invariant measure. We show that this model of the score\nfunction can be used to stabilize autoregressive emulator rollouts by applying\non-the-fly denoising during inference, a process we call\n\\textit{thermalization}. Thermalizing an emulator rollout is shown to extend\nthe time horizon of stable predictions by an order of magnitude in complex\nsystems exhibiting turbulent and chaotic behavior, opening up a novel\napplication of diffusion models in the context of neural emulation.",
            "pdf_url": "http://arxiv.org/pdf/2503.18731v1",
            "published": "2025-03-24 14:38:33+00:00",
            "updated": "2025-03-24 14:38:33+00:00"
        }
    ]
}