{
    "Physics": [
        {
            "title": "Probing Long-Range Forces in Neutrino Oscillations at the ESSnuSB Experiment",
            "authors": "ESSnuSB, :, J. Aguilar, M. Anastasopoulos, D. Barčot, E. Baussan, A. K. Bhattacharyya, A. Bignami, M. Blennow, M. Bogomilov, B. Bolling, E. Bouquerel, F. Bramati, A. Branca, G. Brunetti, I. Bustinduy, C. J. Carlile, J. Cederkall, T. W. Choi, S. Choubey, P. Christiansen, M. Collins, E. Cristaldo Morales, P. Cupiał, D. D'Ago, H. Danared, J. P. A. M. de André, M. Dracos, I. Efthymiopoulos, T. Ekelöf, M. Eshraqi, G. Fanourakis, A. Farricker, E. Fasoula, T. Fukuda, N. Gazis, Th. Geralis, M. Ghosh, A. Giarnetti, G. Gokbulut, A. Gupta, C. Hagner, L. Halić, M. Hooft, K. E. Iversen, N. Jachowicz, M. Jakkapu, M. Jenssen, R. Johansson, E. Kasimi, A. Kayis Topaksu, B. Kildetoft, B. Kliček, K. Kordas, B. Kovač, A. Leisos, M. Lindroos, A. Longhin, C. Maiano, D. Majumdar, S. Marangoni, S. Marciano, J. G. Marcos, C. Marrelli, D. Meloni, M. Mezzetto, N. Milas, J. L. Muñoz, K. Niewczas, M. Oglakci, T. Ohlsson, M. Olvegård, M. Pari, D. Patrzalek, G. Petkov, Ch. Petridou, P. Poussot, A. Psallidas, F. Pupilli, D. Saiang, D. Sampsonidis, C. Schwab, F. Sordo, G. Stavropoulos, M. Stipčević, R. Tarkeshian, F. Terranova, T. Tolba, E. Trachanas, R. Tsenov, A. Tsirigotis, S. E. Tzamarias, M. Vanderpoorten, G. Vankova-Kirilova, N. Vassilopoulos, S. Vihonen, J. Wurtz, V. Zeter, O. Zormpa",
            "summary": "Neutrino oscillations constitute an excellent tool to probe physics beyond\nthe Standard Model. In this paper, we investigate the potential of the \\ess\nexperiment to constrain the effects of flavour-dependent long-range forces\n(LRFs) in neutrino oscillations, which may arise due to the extension of the\nStandard Model gauge group by introducing new $U(1)$ symmetries. Focusing on\nthree specific $U(1)$ symmetries -- $L_e - L_\\mu$, $L_e - L_\\tau$, and $L_\\mu -\nL_\\tau$, we demonstrate that \\ess offers a favourable environment to search for\nLRF effects. Our analyses reveal that \\ess can set 90\\% confidence level bounds\nof $V_{e\\mu} < 2.99 \\times 10^{-14} \\, \\text{eV}$, $V_{e\\tau} < 2.05 \\times\n10^{-14} \\, \\text{eV}$, and $V_{\\mu\\tau} < 1.81 \\times 10^{-14} \\, \\text{eV}$,\nwhich are competitive to the upcoming Deep Underground Neutrino Experiment\n(DUNE). It is also observed that reducing the systematic uncertainties from\n$5\\%$ to $2\\%$ improves the \\ess limits on $V_{\\alpha\\beta}$. Interestingly, we\nfind limited correlations between LRF parameters and the less constrained\nlepton mixing parameters $\\theta_{23}$ and $\\delta_{\\text{CP}}$, preserving the\nrobustness of ESSnuSB's sensitivity to CP violation. Even under extreme LRF\npotentials ($V_{\\alpha\\beta} \\gg 10^{-13} \\, \\text{eV}$), the CP-violation\nsensitivity and $\\delta_{\\text{CP}}$ precision remain largely unaffected. These\nresults establish ESSnuSB as a competitive experimental setup for probing LRF\neffects, complementing constraints from other neutrino sources and offering\ncritical insights into the physics of long-range forces.",
            "pdf_url": "http://arxiv.org/pdf/2504.10480v1",
            "published": "2025-04-14 17:59:25+00:00",
            "updated": "2025-04-14 17:59:25+00:00"
        },
        {
            "title": "European Strategy for Particle Physics Update -- PIONEER: a next generation rare pion decay experiment",
            "authors": "PIONEER Collaboration, A. Adelmann, W. Altmannshofer, S. Ban, O. Beesley, A. Bolotnikov, T. Brunner, D. Bryman, Q. Buat, L. Caminada, J. Carlton, S. Chen, M. Chiu, V. Cirigliano, S. Corrodi, A. Crivellin, S. Cuen-Rochin, J. Datta, B. Davis-Purcell, A. Deshpande, A. Di Canto, A. Ebrahimi, P. Fisher, S. Foster, K. Frahm, L. Gerritzen, G. Giacomini, L. Gibbons, C. Glaser, T. Gorringe, C. Hamilton, S. Heinekamp, D. Hertzog, S. Hochrein, M. Hoferichter, S. Ito, T. Iwamoto, P. Kammel, E. Klemets, L. Kurchaninov, K. Labe, U. Langenegger, Y. Li, C. Malbrunot, A. Matsushita, S. M. Mazza, S. Mehrotra, S. Mihara, R. Mischke, A. Molnar, T. Mori, T. Numao, W. Ootani, J. Ott, K. Pachal, D. Pocanic, X. Qian, D. Ries, R. Roehnelt, T. Rohe, T. Rostomyan, B. Schumm, P. Schwendimann, A. Seiden, A. Sher, R. Shrock, A. Soter, T. Sullivan, E. Swanson, V. Tishchenko, A. Tricoli, T. Tsang, Y. Uchiyama, B. Velghe, M. Worcester, E. Worcester, J. Yang, Y. Zhang, C. Zhang",
            "summary": "PIONEER is a rapidly developing effort aimed to perform a pristine test of\nlepton flavour universality (LFU) and of the unitarity of the first row of the\nCKM matrix by significantly improving the measurements of rare decays of the\ncharged pion. In Phase I, PIONEER aims to measure the charged-pion branching\nratio to electrons vs.\\ muons $R_{e/\\mu}$ to 1 part in $10^4$, improving the\ncurrent experimental result $R_{e/\\mu}\\,\\text{(exp)} =1.2327(23)\\times10^{-4}$\nby a factor of 15. This precision on $R_{e/\\mu}$ will match the theoretical\naccuracy of the SM prediction allowing for a test of LFU at an unprecedented\nlevel, probing non-SM explanations of LFU violation through sensitivity to\nquantum effects of new particles up to the PeV mass scale. Phase II and III\nwill aim to improve the experimental precision of the branching ratio of pion\nbeta decay, $\\pi^+\\to \\pi^0 e^+ \\nu (\\gamma)$, currently at\n$1.036(6)\\times10^{-8}$, by a factor of three and six, respectively. The\nimproved measurements will be used to extract $V_{ud}$ in a theoretically\npristine manner. The ultimate precision of $V_{ud}$ is expected to reach the\n0.05\\,\\% level, allowing for a stringent test of CKM unitarity. The PIONEER\nexperiment will also improve the experimental limits by an order of magnitude\nor more on a host of exotic decays that probe the effects of heavy neutrinos\nand dark sector physics. This input to the 2026 update of the European Strategy\nfor Particle Physics Strategy describes the physics motivation and the\nconceptual design of the PIONEER experiment, and is prepared based on the\nPIONEER proposal submitted to and approved with high priority by the PSI\nprogram advisory committee (PAC). Using intense pion beams, and\nstate-of-the-art instrumentation and computational resources, the PIONEER\nexperiment is aiming to begin data taking by the end of this decade.",
            "pdf_url": "http://arxiv.org/pdf/2504.06375v2",
            "published": "2025-04-08 18:46:11+00:00",
            "updated": "2025-04-14 17:54:54+00:00"
        },
        {
            "title": "Online Advanced Labs in Physics",
            "authors": "Peter A. Bennett",
            "summary": "At Arizona State University we have built the first and only fully online\nBachelor of Science degree in Physics, with a complete curriculum, including\nlabs. The upper division Advanced Lab courses present a special challenge for\nonline delivery. We address that using a set of custom-built simulator modules\nthat replicate all the imperfections (noise, background, etc) inherent in\nreal-world data. The set of experiments duplicates those of the in-person\nclasses. In this paper, we present an overview of these labs and discuss the\nadvantages and challenges of delivering them online. We assert that these labs\nprovide a valid and rigorous component for the fully online degree. The entire\nset of labs is available as Open Source Supplemental Materials and is shared\nfor others to use in part or in whole, with suitable attribution.",
            "pdf_url": "http://arxiv.org/pdf/2504.10470v1",
            "published": "2025-04-14 17:54:14+00:00",
            "updated": "2025-04-14 17:54:14+00:00"
        },
        {
            "title": "De-excitation of $K$-shell hollow atoms with $12 \\le Z \\le 20$: transition rates and branching ratios",
            "authors": "Karol Kozioł, Jacek Rzadkiewicz",
            "summary": "Investigating $K$-shell hollow atom spectra enhances our understanding of\nfemtosecond phenomena in atomic physics, chemistry, and biology. Synchrotron\nmeasurements of two-electron one-photon (TEOP) transitions in low-$Z$ atoms\nhave revealed discrepancies between experimental results and theoretical\npredictions of TEOP relative intensities. These discrepancies appear to\noriginate from an incomplete description of an atom's response to the strong\nperturbation caused by $K$-shell double photoionization (DPI). The\nmulticonfiguration Dirac-Hartree-Fock relativistic configuration interaction\nmethod has been applied for studying the TEOP spectra of Mg, Al, Si, S, Ar, and\nCa atoms. The results show that branching ratios can be accurately reproduced\nby accounting for the effects of core and valence electron correlations, as\nwell as the outer-shell ionization and excitation processes following $K$-shell\nDPI.",
            "pdf_url": "http://arxiv.org/pdf/2504.10467v1",
            "published": "2025-04-14 17:53:16+00:00",
            "updated": "2025-04-14 17:53:16+00:00"
        },
        {
            "title": "Natural Top Quark Condensation (a Redux)",
            "authors": "Christopher T. Hill",
            "summary": "The Nambu--Jona-Lasinio (NJL) model involves a pointlike 4-fermion\ninteraction. While it gives a useful description of chiral dynamics (mainly in\nQCD), it nonetheless omits the crucially important internal wave-function of a\ntwo-body bound state, $\\phi(r)$. This becomes significant near critical\ncoupling where $\\phi(r)$ extends to large distance, leading to dilution and\nsuppression of induced couplings $\\propto \\phi(0)$, such as the Yukawa and\nquartic couplings, as well as reduced fine-tuning of a hierarchy. In top quark\ncondensation, where the BEH boson is a $\\bar{t}t$ bound state and we have a UV\ncompletion such as topcolor, we must go beyond the NJL model and include\neffects of $\\phi(r)$. We provide a formulation of this for the\nBrout-Englert-Higgs boson, and find that it leads to an extended $\\phi(r)$, a\nsignificantly reduced and natural composite scale of $M_0 \\sim 6$ TeV, a\nsuccessful prediction for the quartic coupling, $\\lambda$, and fine tuning that\nis reduced to a few percent, providing a compelling candidate solution to the\nnaturalness problem of the BEH boson. The theory is testable and new physics\nshould begin to emerge on the multi-TeV mass scales and possibly accessible to\nthe LHC.",
            "pdf_url": "http://arxiv.org/pdf/2503.21518v3",
            "published": "2025-03-27 14:08:26+00:00",
            "updated": "2025-04-14 17:52:13+00:00"
        },
        {
            "title": "The stellar decomposition of Gaussian quantum states",
            "authors": "Arsalan Motamedi, Yuan Yao, Kasper Nielsen, Ulysse Chabaud, J. Eli Bourassa, Rafael Alexander, Filippo Miatto",
            "summary": "We introduce the stellar decomposition, a novel method for characterizing\nnon-Gaussian states produced by photon-counting measurements on Gaussian\nstates. Given an (m+n)-mode Gaussian state G, we express it as an (m+n)-mode\n\"Gaussian core state\" G_core followed by a fixed m-mode Gaussian transformation\nT that only acts on the first m modes. The defining property of the Gaussian\ncore state G_core is that measuring the last n of its modes in the\nphoton-number basis leaves the first m modes on a finite Fock support, i.e. a\ncore state. Since T is measurement-independent and G_core has an exact and\nfinite Fock representation, this decomposition exactly describes all\nnon-Gaussian states obtainable by projecting n modes of G onto the Fock basis.\nFor pure states we prove that a physical pair (G_core, T) always exists with\nG_core pure and T unitary. For mixed states, we establish necessary and\nsufficient conditions for (G_core, T) to be a Gaussian mixed state and a\nGaussian channel. Finally, we develop a semidefinite program to extract the\n\"largest\" possible Gaussian channel when these conditions fail. The stellar\ndecomposition leads to practical bounds on achievable state quality in photonic\ncircuits and for GKP state generation in particular. Our results are based on a\nnew characterization of Gaussian completely positive maps in the Bargmann\npicture, which may be of independent interest. As a result, this work provides\nnovel tools for improved simulations of quantum optical systems, and for\nunderstanding the generation of non-Gaussian resource states.",
            "pdf_url": "http://arxiv.org/pdf/2504.10455v1",
            "published": "2025-04-14 17:41:54+00:00",
            "updated": "2025-04-14 17:41:54+00:00"
        },
        {
            "title": "A High-Precision, Fast, Robust, and Cost-Effective Muon Detector Concept for the FCC-ee",
            "authors": "F. Anulli, H. Beauchemin, C. Bini, A. Bross, M. Corradi, T. Dai, D. Denisov, E. C. Dukes, C. Ferretti, P. Fleischmann, M. Franklin, J. Freeman, J. Ge, L. Guan, Y. Guo, C. Herwig, S. -C. Hsu, J. Huth, D. Levin, C. Li, H. -C. Lin, H. Lubatti, C. Luci, V. Martinez Outschoorn, K. Nelson, J. Qian, S. Rosati, E. Salzer, T. Schwarz, R. Schwienhorst, C. Suslu, A. Taffard, Y. Teng, R. Vari, S. Veneziano, C. Weaverdyck, S. Willocq, C. Young, B. Zhou, J. Zhu",
            "summary": "We propose a high-precision, fast, robust and cost-effective muon detector\nconcept for an FCC-ee experiment. This design combines precision drift tubes\nwith fast plastic scintillator strips to enable both spatial and timing\nmeasurements. The drift tubes deliver two-dimensional position measurements\nperpendicular to the tubes with a resolution around 100~$\\mu$m. Meanwhile, the\nscintillator strips, read out with the wavelength-shifting fibers and silicon\nphotomultipliers, provide fast timing information with a precision of 200~ps or\nbetter and measure the third coordinate along the tubes with a resolution of\nabout 1~mm.",
            "pdf_url": "http://arxiv.org/pdf/2504.10448v1",
            "published": "2025-04-14 17:38:24+00:00",
            "updated": "2025-04-14 17:38:24+00:00"
        },
        {
            "title": "Novel Polarimetric Analysis of Near Horizon Flaring Episodes in M87* in Millimeter Wavelength",
            "authors": "Razieh Emami, Matthew Liska, Koushik Chatterjee, Geoffrey C. Bower, Wystan Benbow, Douglas Finkbeiner, Maciek Wielgus, Lars Hernquist, Randall Smith, Grant Tremblay, Angelo Ricarte, James F. Steiner, Avery E. Broderick, Saurabh, Jordy Davelaar, Josh Grindlay, Mark Vogelsberger, Chi-Kwan Chan",
            "summary": "Recent multi-wavelength observations of M87* \\citep{2024A&A...692A.140A}\nrevealed a high-energy $\\gamma$-ray flare without a corresponding millimeter\ncounterpart. We present a theoretical polarimetric study to evaluate the\npresence and nature of a potential millimeter flare in M87*, using a suite of\ngeneral relativistic magnetohydrodynamical simulations with varying black hole\n(BH) spins and magnetic field configurations. We find that the emergence of a\nmillimeter flare is strongly influenced by both spin and magnetic structure,\nwith limited sensitivity to the electron distribution (thermal vs.\nnon-thermal). We model the intensity light curve with a damped random walk\n(DRW) and compare the characteristic timescale ($\\tau$) with recent SMA\nobservations, finding that the simulated $\\tau$ exceeds observed values by over\nan order of magnitude. In a flaring case with BH spin a=+0.5, we identify a\ndistinct millimeter flare followed by an order-of-magnitude flux drop. All\nStokes parameters show variability near the flare, including a sign reversal in\nthe electric vector position angle. While most $\\beta_m$ modes remain stable,\nthe $EB$-correlation phase is highly sensitive to both the flare peak and\ndecay. We examine polarimetric signatures in photon sub-rings, focusing on\nmodes ns=0 and ns=1. The ns=0 signal closely matches the full image, while ns=1\nreveals distinct behaviors, highlighting the potential of space VLBI to isolate\nsub-ring features. Finally, we analyze the magnetic and velocity field\nevolution during the flare, finding that magnetic reconnection weakens during\nthe flux decay, and the clockwise velocity flow transitions into an\noutflow-dominated regime. These results suggest that transient radio\nvariability near flares encodes key information about black hole spin and\nmagnetic field structure, offering a novel probe into the physics of active\ngalactic nuclei.",
            "pdf_url": "http://arxiv.org/pdf/2504.04695v2",
            "published": "2025-04-07 03:00:21+00:00",
            "updated": "2025-04-14 17:37:12+00:00"
        },
        {
            "title": "No reliable studies of climate change without Henry's Law and a new thermometer for the global temperature",
            "authors": "Jyrki Kauppinen, Pekka Malmi",
            "summary": "In our previous paper \"No experimental evidence for the significant\nanthropogenic climate change\" we had a reference to this paper. Thus, we have\npresented a new theory: how Henry's Law regulates the concentration of CO$_2$\nin the atmosphere. This theory uses a physically perfect unit impulse response\nto convolve signals. By comparing the theory and the present observations we\nare able to derive the response time about 7.4 years, which is roughly the\nresidence time of CO$_2$ in the atmosphere. In addition, according to Henry's\nLaw we can derive the temperature dependence of the equilibrium concentration\nof CO$_2$. It turns out that now the major increase of CO$_2$ in the atmosphere\nis due to the temperature change, the reason for which is approximately a\nchange of cloudiness ($90\\%$) and the rest ($10\\%$) the greenhouse effect. The\ncorresponding increase of CO$_2$ is $83$~ppm/$^\\circ$C. According to our\ntheory, the causality is very clear: the increase of the temperature results in\nmore CO$_2$ in the atmosphere. This further CO$_2$ concentration increases also\nthe temperature but less than $10\\%$ via the greenhouse effect. The human\ncontribution to the CO$_2$ concentration and the temperature is very small.\nAbout $90\\%$ of a big human release of CO$_2$ dissolves in water. That is why\nthe human release now warms the climate less than $0.03 ^\\circ$C. We can also\nperform an inverse operation or calculate the temperature profile from the\nobserved CO$_2$ curve. So we propose a new thermometer for the global surface\ntemperature. This can be used almost in real time and it is more accurate than\nthe present methods. It turns out that probably also N$_2$O and SF$_6$\nconcentrations in the atmosphere operate as global thermometers.",
            "pdf_url": "http://arxiv.org/pdf/2304.01245v2",
            "published": "2023-04-03 15:44:17+00:00",
            "updated": "2025-04-14 17:36:08+00:00"
        },
        {
            "title": "Compatibilidad del Argumento Cosmológico Kalam con la Ciencia Contemporánea",
            "authors": "Carlos Desa",
            "summary": "The Kalam cosmological argument, of a metaphysical nature, asserts that the\nuniverse had a first cause. This study examines the compatibility of its\npremises through a bibliographic review of advancements in contemporary\nphysics. Quantum theory demonstrates that quantum phenomena are indeterministic\nand non-causal. Even in deterministic theories, causality lacks a clear\ndefinition. Moreover, cosmological models, such as cosmic inflation, suggest\nthat the early stages of the universe do not require a first cause. In\nconclusion, the premises of the Kalam argument are not compatible with\ncontemporary physics.",
            "pdf_url": "http://arxiv.org/pdf/2302.11022v2",
            "published": "2023-02-21 21:39:47+00:00",
            "updated": "2025-04-14 17:18:56+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "REPA-E: Unlocking VAE for End-to-End Tuning with Latent Diffusion Transformers",
            "authors": "Xingjian Leng, Jaskirat Singh, Yunzhong Hou, Zhenchang Xing, Saining Xie, Liang Zheng",
            "summary": "In this paper we tackle a fundamental question: \"Can we train latent\ndiffusion models together with the variational auto-encoder (VAE) tokenizer in\nan end-to-end manner?\" Traditional deep-learning wisdom dictates that\nend-to-end training is often preferable when possible. However, for latent\ndiffusion transformers, it is observed that end-to-end training both VAE and\ndiffusion-model using standard diffusion-loss is ineffective, even causing a\ndegradation in final performance. We show that while diffusion loss is\nineffective, end-to-end training can be unlocked through the\nrepresentation-alignment (REPA) loss -- allowing both VAE and diffusion model\nto be jointly tuned during the training process. Despite its simplicity, the\nproposed training recipe (REPA-E) shows remarkable performance; speeding up\ndiffusion model training by over 17x and 45x over REPA and vanilla training\nrecipes, respectively. Interestingly, we observe that end-to-end tuning with\nREPA-E also improves the VAE itself; leading to improved latent space structure\nand downstream generation performance. In terms of final performance, our\napproach sets a new state-of-the-art; achieving FID of 1.26 and 1.83 with and\nwithout classifier-free guidance on ImageNet 256 x 256. Code is available at\nhttps://end2end-diffusion.github.io.",
            "pdf_url": "http://arxiv.org/pdf/2504.10483v1",
            "published": "2025-04-14 17:59:53+00:00",
            "updated": "2025-04-14 17:59:53+00:00"
        },
        {
            "title": "MESA: Text-Driven Terrain Generation Using Latent Diffusion and Global Copernicus Data",
            "authors": "Paul Borne--Pons, Mikolaj Czerkawski, Rosalie Martin, Romain Rouffet",
            "summary": "Terrain modeling has traditionally relied on procedural techniques, which\noften require extensive domain expertise and handcrafted rules. In this paper,\nwe present MESA - a novel data-centric alternative by training a diffusion\nmodel on global remote sensing data. This approach leverages large-scale\ngeospatial information to generate high-quality terrain samples from text\ndescriptions, showcasing a flexible and scalable solution for terrain\ngeneration. The model's capabilities are demonstrated through extensive\nexperiments, highlighting its ability to generate realistic and diverse terrain\nlandscapes. The dataset produced to support this work, the Major TOM Core-DEM\nextension dataset, is released openly as a comprehensive resource for global\nterrain data. The results suggest that data-driven models, trained on remote\nsensing data, can provide a powerful tool for realistic terrain modeling and\ngeneration.",
            "pdf_url": "http://arxiv.org/pdf/2504.07210v2",
            "published": "2025-04-09 18:37:24+00:00",
            "updated": "2025-04-14 17:25:41+00:00"
        },
        {
            "title": "GAF: Gaussian Avatar Reconstruction from Monocular Videos via Multi-view Diffusion",
            "authors": "Jiapeng Tang, Davide Davoli, Tobias Kirschstein, Liam Schoneveld, Matthias Niessner",
            "summary": "We propose a novel approach for reconstructing animatable 3D Gaussian avatars\nfrom monocular videos captured by commodity devices like smartphones.\nPhotorealistic 3D head avatar reconstruction from such recordings is\nchallenging due to limited observations, which leaves unobserved regions\nunder-constrained and can lead to artifacts in novel views. To address this\nproblem, we introduce a multi-view head diffusion model, leveraging its priors\nto fill in missing regions and ensure view consistency in Gaussian splatting\nrenderings. To enable precise viewpoint control, we use normal maps rendered\nfrom FLAME-based head reconstruction, which provides pixel-aligned inductive\nbiases. We also condition the diffusion model on VAE features extracted from\nthe input image to preserve facial identity and appearance details. For\nGaussian avatar reconstruction, we distill multi-view diffusion priors by using\niteratively denoised images as pseudo-ground truths, effectively mitigating\nover-saturation issues. To further improve photorealism, we apply latent\nupsampling priors to refine the denoised latent before decoding it into an\nimage. We evaluate our method on the NeRSemble dataset, showing that GAF\noutperforms previous state-of-the-art methods in novel view synthesis.\nFurthermore, we demonstrate higher-fidelity avatar reconstructions from\nmonocular videos captured on commodity devices.",
            "pdf_url": "http://arxiv.org/pdf/2412.10209v2",
            "published": "2024-12-13 15:31:22+00:00",
            "updated": "2025-04-14 16:02:03+00:00"
        },
        {
            "title": "Improving Decoupled Posterior Sampling for Inverse Problems using Data Consistency Constraint",
            "authors": "Zhi Qi, Shihong Yuan, Yulin Yuan, Linling Kuang, Yoshiyuki Kabashima, Xiangming Meng",
            "summary": "Diffusion models have shown strong performances in solving inverse problems\nthrough posterior sampling while they suffer from errors during earlier steps.\nTo mitigate this issue, several Decoupled Posterior Sampling methods have been\nrecently proposed. However, the reverse process in these methods ignores\nmeasurement information, leading to errors that impede effective optimization\nin subsequent steps. To solve this problem, we propose Guided Decoupled\nPosterior Sampling (GDPS) by integrating a data consistency constraint in the\nreverse process. The constraint performs a smoother transition within the\noptimization process, facilitating a more effective convergence toward the\ntarget distribution. Furthermore, we extend our method to latent diffusion\nmodels and Tweedie's formula, demonstrating its scalability. We evaluate GDPS\non the FFHQ and ImageNet datasets across various linear and nonlinear tasks\nunder both standard and challenging conditions. Experimental results\ndemonstrate that GDPS achieves state-of-the-art performance, improving accuracy\nover existing methods.",
            "pdf_url": "http://arxiv.org/pdf/2412.00664v2",
            "published": "2024-12-01 03:57:21+00:00",
            "updated": "2025-04-14 13:25:03+00:00"
        },
        {
            "title": "Efficient Generative Model Training via Embedded Representation Warmup",
            "authors": "Deyuan Liu, Peng Sun, Xufeng Li, Tao Lin",
            "summary": "Diffusion models excel at generating high-dimensional data but fall short in\ntraining efficiency and representation quality compared to self-supervised\nmethods. We identify a key bottleneck: the underutilization of high-quality,\nsemantically rich representations during training notably slows down\nconvergence. Our systematic analysis reveals a critical representation\nprocessing region -- primarily in the early layers -- where semantic and\nstructural pattern learning takes place before generation can occur. To address\nthis, we propose Embedded Representation Warmup (ERW), a plug-and-play\nframework where in the first stage we get the ERW module serves as a warmup\nthat initializes the early layers of the diffusion model with high-quality,\npretrained representations. This warmup minimizes the burden of learning\nrepresentations from scratch, thereby accelerating convergence and boosting\nperformance. Our theoretical analysis demonstrates that ERW's efficacy depends\non its precise integration into specific neural network layers -- termed the\nrepresentation processing region -- where the model primarily processes and\ntransforms feature representations for later generation. We further establish\nthat ERW not only accelerates training convergence but also enhances\nrepresentation quality: empirically, our method achieves a 40$\\times$\nacceleration in training speed compared to REPA, the current state-of-the-art\nmethods. Code is available at https://github.com/LINs-lab/ERW.",
            "pdf_url": "http://arxiv.org/pdf/2504.10188v1",
            "published": "2025-04-14 12:43:17+00:00",
            "updated": "2025-04-14 12:43:17+00:00"
        }
    ]
}