{
    "Physics": [
        {
            "title": "Apparent $w<-1$ and a Lower $S_8$ from Dark Axion and Dark Baryons Interactions",
            "authors": "Justin Khoury, Meng-Xiang Lin, Mark Trodden",
            "summary": "We show that a simple coupling between dark energy and dark matter can\nsimultaneously address two distinct hints at new physics coming from\ncosmological observations. The first is the recent evidence from the DESI\nproject and supernovae observations that the dark energy equation of state~$w$\nis evolving over cosmic time from an earlier value that is~$<-1$ to a\npresent-day value~$>-1$. The second observation is the so-called~$S_8$ tension,\ndescribing the suppression of the growth of matter overdensities compared to\nthat expected in the~$\\Lambda$CDM model. We propose a stable, technically\nnatural particle physics implementation of this idea, in which dark matter\nconsists of dark baryons in a strongly-coupled hidden sector, and the dark\nenergy field is the associated dark axion. The time-variation of the dark\nmatter mass results in an effective dark energy equation of state that exhibits\na phantom crossing behavior consistent with recent results. It also results in\na slight delay in matter-radiation equality, which suppresses the overall\ngrowth of density perturbations.",
            "pdf_url": "http://arxiv.org/pdf/2503.16415v1",
            "published": "2025-03-20 17:59:22+00:00",
            "updated": "2025-03-20 17:59:22+00:00"
        },
        {
            "title": "RoboFactory: Exploring Embodied Agent Collaboration with Compositional Constraints",
            "authors": "Yiran Qin, Li Kang, Xiufeng Song, Zhenfei Yin, Xiaohong Liu, Xihui Liu, Ruimao Zhang, Lei Bai",
            "summary": "Designing effective embodied multi-agent systems is critical for solving\ncomplex real-world tasks across domains. Due to the complexity of multi-agent\nembodied systems, existing methods fail to automatically generate safe and\nefficient training data for such systems. To this end, we propose the concept\nof compositional constraints for embodied multi-agent systems, addressing the\nchallenges arising from collaboration among embodied agents. We design various\ninterfaces tailored to different types of constraints, enabling seamless\ninteraction with the physical world. Leveraging compositional constraints and\nspecifically designed interfaces, we develop an automated data collection\nframework for embodied multi-agent systems and introduce the first benchmark\nfor embodied multi-agent manipulation, RoboFactory. Based on RoboFactory\nbenchmark, we adapt and evaluate the method of imitation learning and analyzed\nits performance in different difficulty agent tasks. Furthermore, we explore\nthe architectures and training strategies for multi-agent imitation learning,\naiming to build safe and efficient embodied multi-agent systems.",
            "pdf_url": "http://arxiv.org/pdf/2503.16408v1",
            "published": "2025-03-20 17:58:38+00:00",
            "updated": "2025-03-20 17:58:38+00:00"
        },
        {
            "title": "Hamiltonian Neural Networks approach to fuzzball geodesics",
            "authors": "Andrea Cipriani, Alessandro De Santis, Giorgio Di Russo, Alfredo Grillo, Luca Tabarroni",
            "summary": "The recent increase in computational resources and data availability has led\nto a significant rise in the use of Machine Learning (ML) techniques for data\nanalysis in physics. However, the application of ML methods to solve\ndifferential equations capable of describing even complex physical systems is\nnot yet fully widespread in theoretical high-energy physics. Hamiltonian Neural\nNetworks (HNNs) are tools that minimize a loss function defined to solve\nHamilton equations of motion. In this work, we implement several HNNs trained\nto solve, with high accuracy, the Hamilton equations for a massless probe\nmoving inside a smooth and horizonless geometry known as D1-D5 circular\nfuzzball. We study both planar (equatorial) and non-planar geodesics in\ndifferent regimes according to the impact parameter, some of which are\nunstable. Our findings suggest that HNNs could eventually replace standard\nnumerical integrators, as they are equally accurate but more reliable in\ncritical situations.",
            "pdf_url": "http://arxiv.org/pdf/2502.20881v2",
            "published": "2025-02-28 09:25:49+00:00",
            "updated": "2025-03-20 17:54:41+00:00"
        },
        {
            "title": "Enhancing the Scalability and Applicability of Kohn-Sham Hamiltonians for Molecular Systems",
            "authors": "Yunyang Li, Zaishuo Xia, Lin Huang, Xinran Wei, Han Yang, Sam Harshe, Zun Wang, Chang Liu, Jia Zhang, Bin Shao, Mark B. Gerstein",
            "summary": "Density Functional Theory (DFT) is a pivotal method within quantum chemistry\nand materials science, with its core involving the construction and solution of\nthe Kohn-Sham Hamiltonian. Despite its importance, the application of DFT is\nfrequently limited by the substantial computational resources required to\nconstruct the Kohn-Sham Hamiltonian. In response to these limitations, current\nresearch has employed deep-learning models to efficiently predict molecular and\nsolid Hamiltonians, with roto-translational symmetries encoded in their neural\nnetworks. However, the scalability of prior models may be problematic when\napplied to large molecules, resulting in non-physical predictions of\nground-state properties. In this study, we generate a substantially larger\ntraining set (PubChemQH) than used previously and use it to create a scalable\nmodel for DFT calculations with physical accuracy. For our model, we introduce\na loss function derived from physical principles, which we call Wavefunction\nAlignment Loss (WALoss). WALoss involves performing a basis change on the\npredicted Hamiltonian to align it with the observed one; thus, the resulting\ndifferences can serve as a surrogate for orbital energy differences, allowing\nmodels to make better predictions for molecular orbitals and total energies\nthan previously possible. WALoss also substantially accelerates\nself-consistent-field (SCF) DFT calculations. Here, we show it achieves a\nreduction in total energy prediction error by a factor of 1347 and an SCF\ncalculation speed-up by a factor of 18%. These substantial improvements set new\nbenchmarks for achieving accurate and applicable predictions in larger\nmolecular systems.",
            "pdf_url": "http://arxiv.org/pdf/2502.19227v2",
            "published": "2025-02-26 15:36:25+00:00",
            "updated": "2025-03-20 17:54:16+00:00"
        },
        {
            "title": "Heat transfer and mixing in initiated Chemical Vapor Deposition analyzed by in-situ gas composition sensing",
            "authors": "Simon Shindler, Rong Yang",
            "summary": "Studies of iCVD kinetics often make assumptions about the iCVD vapor phase\nthat have been challenging to validate experimentally. We address this gap by\ninvestigating heat transfer and mixing in the iCVD reactor using in-situ gas\ncomposition sensing. Our work allows practitioners of iCVD to estimate the\ndegree of mixing and temperature profile in the vapor phase based on reactor\ndimensions and process variables such as chamber pressure. We begin by using\ndimensional analysis to simplify the parameter space governing heat transfer\nand mixing, identifying key dimensionless groups that capture the dominant\nphysics. We find that the degree of mixing in the reactor is primarily\ndetermined by the Peclet number (Pe), and heat transfer is primarily determined\nby the Knudsen number (Kn). Multiphysics simulations of the iCVD reactor\nprovide visualizations of non-ideal mixing and allow us to identify the\ncritical Pe above which the well-mixed assumption may begin to break down. To\nverify that the well-mixed assumption applies to iCVD at low Pe, we measured\nthe residence time distribution (RTD) for argon and isopropanol flowing at 1\nsccm, finding a close match to the well-mixed model. We used a Pirani pressure\ngauge for composition sensing to measure the RTD. We demonstrate the Pirani\ngauge to be a precise gas composition sensor, which is more modular and less\nexpensive than methods like in-situ infrared spectroscopy and mass\nspectrometry. We then address heat transfer by measuring thermal diffusion from\nthe filament at a range of pressures in argon and isopropanol. We quantified\nthe effects of non-ideal heat transfer at low pressures and identified a\ncritical Kn, above which heat transfer is independent of pressure. Measurement\nof thermally driven pressure changes in batch mode enables us to define and\nmodel an \"effective temperature\" for the reactor, matching the thermal\ndiffusion model.",
            "pdf_url": "http://arxiv.org/pdf/2503.16373v1",
            "published": "2025-03-20 17:35:31+00:00",
            "updated": "2025-03-20 17:35:31+00:00"
        },
        {
            "title": "Fluctuation Relations associated to an arbitrary bijection in path space",
            "authors": "Raphael Chetrite, Stefano Marcantoni",
            "summary": "We introduce a framework to identify Fluctuation Relations for vector-valued\nobservables in physical systems evolving through a stochastic dynamics. These\nrelations arise from the particular structure of a suitable entropic functional\nand are induced by transformations in trajectory space that are invertible but\nare not involutions, typical examples being spatial rotations and translations.\nIn doing so, we recover as particular cases results known in the literature as\nisometric fluctuation relations or spatial fluctuation relations and moreover\nwe provide a recipe to find new ones. We mainly discuss two case studies,\nnamely stochastic processes described by a canonical path probability and non\ndegenerate diffusion processes. In both cases we provide sufficient conditions\nfor the fluctuation relation to hold, considering either finite time or\nasymptotically large times.",
            "pdf_url": "http://arxiv.org/pdf/2503.16369v1",
            "published": "2025-03-20 17:26:05+00:00",
            "updated": "2025-03-20 17:26:05+00:00"
        },
        {
            "title": "Neural Networks: According to the Principles of Grassmann Algebra",
            "authors": "Z. Zarezadeh, N. Zarezadeh",
            "summary": "In this paper, we explore the algebra of quantum idempotents and the\nquantization of fermions which gives rise to a Hilbert space equal to the\nGrassmann algebra associated with the Lie algebra. Since idempotents carry\nrepresentations of the algebra under consideration, they form algebraic\nvarieties and smooth manifolds in the natural topology. In addition to the\nmotivation of linking up mathematical physics with machine learning, it is also\nshown that by using idempotents and invariant subspace of the corresponding\nalgebras, these representations encode and perhaps provide a probabilistic\ninterpretation of reasoning and relational paths in geometrical terms.",
            "pdf_url": "http://arxiv.org/pdf/2503.16364v1",
            "published": "2025-03-20 17:21:23+00:00",
            "updated": "2025-03-20 17:21:23+00:00"
        },
        {
            "title": "On a hyperbolic Duffing oscillator with linear damping and periodic forcing",
            "authors": "Alain M. Dikandé",
            "summary": "The Duffing oscillator describes the dynamics of a mass suspended on a spring\nwith position-dependent stiffness. The mass is assumed to experience a linear\ndamping and a time-dependent external forcing. The model has been instrumental\nin theoretical investigations of dynamical properties of systems with\nparity-conserving symmetry, where a double-well substrate connects two\nmetastable states separated by a barrier. Physical systems of interest include\nnonlinear feedback-controlled mass-spring-damper oscillators, active hysteresis\ncircuits (e.g. memristors), protein chains prone to hydrogen bond-mediated\nconformational transitions, centro-symmetric crystals and so on. In this work\nwe consider a Duffing-type oscillator with a double-well potential represented\nby a hyperbolic function of mass position. The hyperbolic double-well potential\nhas two degenerate minima that can be smoothly tuned by varying a deformability\nparameter, leaving unchanged the barrier height. We investigate solutions of\nthe equation of motion in the absence and presence of damping and forcing. In\nthe absence of perturbations numerical solutions lead to a periodic train of\nanharmonic oscillations featuring a crystal of pulse solitons of sech types.\nHowever, when the hyperbolic double-well potential is inverted, analytical\nsolutions can be obtained which turn out to be kink-soliton crystals described\nby Jacobi elliptic functions. When damping and forcing are taken into\nconsideration, the system dynamics can transit from periodic to chaotic phases\nor vice-versa via period-doubling or period-halving bifurcations, by simply\nvarying the deformability parameter. The Poincar\\'e map of the proposed model\ncarries the well-known characteristic signatures of chaos presursors of the\nstandard Duffing model, which happens to be just a particular case of the\nbistable oscillator model with the hyperbolic double-well potential.",
            "pdf_url": "http://arxiv.org/pdf/2503.01196v2",
            "published": "2025-03-03 05:47:46+00:00",
            "updated": "2025-03-20 16:59:24+00:00"
        },
        {
            "title": "Real-time simulations of laser-induced electron excitations in crystalline ZnO",
            "authors": "Xiao Chen, Thomas Lettau, Ulf Peschel, Nicolas Tancogne-Dejean, Silvana Botti",
            "summary": "We investigate non-equilibrium electron dynamics in crystalline ZnO induced\nby ultrashort, relatively intense, infrared laser pulses. Our focus is on\nunderstanding the mechanism that facilitates efficient conduction band\npopulation in ZnO to enable optically pumped lasing. We consider two different\npulse frequencies (in the near-infrared and mid-infrared) for which\nexperimental data are available, and we calculate the electronic response of a\nZnO crystal for a wide range of pulse intensities. We apply and compare three\ncomplementary theoretical approaches: the analytical Keldysh model, the\nnumerical solution of the semiconductor Bloch equations, and real-time\ntime-dependent density functional theory. We conclude that time-dependent\ndensity functional theory is a valid \\textit{ab initio} approach for predicting\nconduction band population, that offers an accurate enough description of\nstatic and transient optical properties of solids and provides physics insight\ninto the intermediate excitation regime, where electronic excitations are\ndetermined by the interplay of intraband tunneling, a consequence of band\nbending, and interband multi-photon absorption.",
            "pdf_url": "http://arxiv.org/pdf/2503.16329v1",
            "published": "2025-03-20 16:52:44+00:00",
            "updated": "2025-03-20 16:52:44+00:00"
        },
        {
            "title": "A trilinear quantum dot architecture for semiconductor spin qubits",
            "authors": "R. Li, V. Levajac, C. Godfrin, S. Kubicek, G. Simion, B. Raes, S. Beyne, I. Fattal, A. Loenders, W. De Roeck, M. Mongillo, D. Wan, K. De Greve",
            "summary": "Semiconductor quantum dot spin qubits hold significant potential for scaling\nto millions of qubits for practical quantum computing applications, as their\nstructure highly resembles the structure of conventional transistors. Since\nclassical semiconductor manufacturing technology has reached an unprecedented\nlevel of maturity, reliably mass-producing CMOS chips with hundreds of billions\nof components, conventional wisdom dictates that leveraging CMOS technologies\nfor quantum dot qubits can result in upscaled quantum processors with thousands\nor even millions of interconnected qubits. However, the interconnect\nrequirements for quantum circuits are very different from those for classical\ncircuits, where for each qubit individual control and readout wiring could be\nneeded. Although significant developments have been demonstrated on small scale\nsystems, qubit numbers remain limited, to a large extent due to the lack of\nscalable qubit interconnect schemes. Here, we present a trilinear quantum dot\narray that is simple in physical layout while allowing individual wiring to\neach quantum dot. By means of electron shuttling, the trilinear architecture\nprovides qubit connectivity that is equivalent to or even surpasses that of 2D\nsquare lattice. Assuming the current qubit fidelities of small-scale devices\ncan be extrapolated to large-scale arrays, medium-length shuttling arrays on\nthe order of tens of microns would allow million-scale qubit systems, while\nmaintaining manageable overheads. We also present a scalable control scheme,\nwhere the qubit chip is 3D-integrated with a low-power switch-based cryoCMOS\ncircuit for parallel qubit operation with limited control inputs. As our\ntrilinear quantum dot array is fully compatible with existing semiconductor\ntechnologies, this qubit architecture represents one possible framework for\nfuture research and development of large-scale spin qubit systems.",
            "pdf_url": "http://arxiv.org/pdf/2501.17814v2",
            "published": "2025-01-29 18:06:38+00:00",
            "updated": "2025-03-20 16:49:26+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "InfiniteYou: Flexible Photo Recrafting While Preserving Your Identity",
            "authors": "Liming Jiang, Qing Yan, Yumin Jia, Zichuan Liu, Hao Kang, Xin Lu",
            "summary": "Achieving flexible and high-fidelity identity-preserved image generation\nremains formidable, particularly with advanced Diffusion Transformers (DiTs)\nlike FLUX. We introduce InfiniteYou (InfU), one of the earliest robust\nframeworks leveraging DiTs for this task. InfU addresses significant issues of\nexisting methods, such as insufficient identity similarity, poor text-image\nalignment, and low generation quality and aesthetics. Central to InfU is\nInfuseNet, a component that injects identity features into the DiT base model\nvia residual connections, enhancing identity similarity while maintaining\ngeneration capabilities. A multi-stage training strategy, including pretraining\nand supervised fine-tuning (SFT) with synthetic single-person-multiple-sample\n(SPMS) data, further improves text-image alignment, ameliorates image quality,\nand alleviates face copy-pasting. Extensive experiments demonstrate that InfU\nachieves state-of-the-art performance, surpassing existing baselines. In\naddition, the plug-and-play design of InfU ensures compatibility with various\nexisting methods, offering a valuable contribution to the broader community.",
            "pdf_url": "http://arxiv.org/pdf/2503.16418v1",
            "published": "2025-03-20 17:59:34+00:00",
            "updated": "2025-03-20 17:59:34+00:00"
        },
        {
            "title": "DreamTexture: Shape from Virtual Texture with Analysis by Augmentation",
            "authors": "Ananta R. Bhattarai, Xingzhe He, Alla Sheffer, Helge Rhodin",
            "summary": "DreamFusion established a new paradigm for unsupervised 3D reconstruction\nfrom virtual views by combining advances in generative models and\ndifferentiable rendering. However, the underlying multi-view rendering, along\nwith supervision from large-scale generative models, is computationally\nexpensive and under-constrained. We propose DreamTexture, a novel\nShape-from-Virtual-Texture approach that leverages monocular depth cues to\nreconstruct 3D objects. Our method textures an input image by aligning a\nvirtual texture with the real depth cues in the input, exploiting the inherent\nunderstanding of monocular geometry encoded in modern diffusion models. We then\nreconstruct depth from the virtual texture deformation with a new conformal map\noptimization, which alleviates memory-intensive volumetric representations. Our\nexperiments reveal that generative models possess an understanding of monocular\nshape cues, which can be extracted by augmenting and aligning texture cues -- a\nnovel monocular reconstruction paradigm that we call Analysis by Augmentation.",
            "pdf_url": "http://arxiv.org/pdf/2503.16412v1",
            "published": "2025-03-20 17:59:12+00:00",
            "updated": "2025-03-20 17:59:12+00:00"
        },
        {
            "title": "ScalingNoise: Scaling Inference-Time Search for Generating Infinite Videos",
            "authors": "Haolin Yang, Feilong Tang, Ming Hu, Yulong Li, Junjie Guo, Yexin Liu, Zelin Peng, Junjun He, Zongyuan Ge, Imran Razzak",
            "summary": "Video diffusion models (VDMs) facilitate the generation of high-quality\nvideos, with current research predominantly concentrated on scaling efforts\nduring training through improvements in data quality, computational resources,\nand model complexity. However, inference-time scaling has received less\nattention, with most approaches restricting models to a single generation\nattempt. Recent studies have uncovered the existence of \"golden noises\" that\ncan enhance video quality during generation. Building on this, we find that\nguiding the scaling inference-time search of VDMs to identify better noise\ncandidates not only evaluates the quality of the frames generated in the\ncurrent step but also preserves the high-level object features by referencing\nthe anchor frame from previous multi-chunks, thereby delivering long-term\nvalue. Our analysis reveals that diffusion models inherently possess flexible\nadjustments of computation by varying denoising steps, and even a one-step\ndenoising approach, when guided by a reward signal, yields significant\nlong-term benefits. Based on the observation, we proposeScalingNoise, a\nplug-and-play inference-time search strategy that identifies golden initial\nnoises for the diffusion sampling process to improve global content consistency\nand visual diversity. Specifically, we perform one-step denoising to convert\ninitial noises into a clip and subsequently evaluate its long-term value,\nleveraging a reward model anchored by previously generated content. Moreover,\nto preserve diversity, we sample candidates from a tilted noise distribution\nthat up-weights promising noises. In this way, ScalingNoise significantly\nreduces noise-induced errors, ensuring more coherent and spatiotemporally\nconsistent video generation. Extensive experiments on benchmark datasets\ndemonstrate that the proposed ScalingNoise effectively improves long video\ngeneration.",
            "pdf_url": "http://arxiv.org/pdf/2503.16400v1",
            "published": "2025-03-20 17:54:37+00:00",
            "updated": "2025-03-20 17:54:37+00:00"
        },
        {
            "title": "Do Visual Imaginations Improve Vision-and-Language Navigation Agents?",
            "authors": "Akhil Perincherry, Jacob Krantz, Stefan Lee",
            "summary": "Vision-and-Language Navigation (VLN) agents are tasked with navigating an\nunseen environment using natural language instructions. In this work, we study\nif visual representations of sub-goals implied by the instructions can serve as\nnavigational cues and lead to increased navigation performance. To synthesize\nthese visual representations or imaginations, we leverage a text-to-image\ndiffusion model on landmark references contained in segmented instructions.\nThese imaginations are provided to VLN agents as an added modality to act as\nlandmark cues and an auxiliary loss is added to explicitly encourage relating\nthese with their corresponding referring expressions. Our findings reveal an\nincrease in success rate (SR) of around 1 point and up to 0.5 points in success\nscaled by inverse path length (SPL) across agents. These results suggest that\nthe proposed approach reinforces visual understanding compared to relying on\nlanguage instructions alone. Code and data for our work can be found at\nhttps://www.akhilperincherry.com/VLN-Imagine-website/.",
            "pdf_url": "http://arxiv.org/pdf/2503.16394v1",
            "published": "2025-03-20 17:53:12+00:00",
            "updated": "2025-03-20 17:53:12+00:00"
        },
        {
            "title": "Unleashing Vecset Diffusion Model for Fast Shape Generation",
            "authors": "Zeqiang Lai, Yunfei Zhao, Zibo Zhao, Haolin Liu, Fuyun Wang, Huiwen Shi, Xianghui Yang, Qinxiang Lin, Jinwei Huang, Yuhong Liu, Jie Jiang, Chunchao Guo, Xiangyu Yue",
            "summary": "3D shape generation has greatly flourished through the development of\nso-called \"native\" 3D diffusion, particularly through the Vecset Diffusion\nModel (VDM). While recent advancements have shown promising results in\ngenerating high-resolution 3D shapes, VDM still struggles with high-speed\ngeneration. Challenges exist because of difficulties not only in accelerating\ndiffusion sampling but also VAE decoding in VDM, areas under-explored in\nprevious works. To address these challenges, we present FlashVDM, a systematic\nframework for accelerating both VAE and DiT in VDM. For DiT, FlashVDM enables\nflexible diffusion sampling with as few as 5 inference steps and comparable\nquality, which is made possible by stabilizing consistency distillation with\nour newly introduced Progressive Flow Distillation. For VAE, we introduce a\nlightning vecset decoder equipped with Adaptive KV Selection, Hierarchical\nVolume Decoding, and Efficient Network Design. By exploiting the locality of\nthe vecset and the sparsity of shape surface in the volume, our decoder\ndrastically lowers FLOPs, minimizing the overall decoding overhead. We apply\nFlashVDM to Hunyuan3D-2 to obtain Hunyuan3D-2 Turbo. Through systematic\nevaluation, we show that our model significantly outperforms existing fast 3D\ngeneration methods, achieving comparable performance to the state-of-the-art\nwhile reducing inference time by over 45x for reconstruction and 32x for\ngeneration. Code and models are available at\nhttps://github.com/Tencent/FlashVDM.",
            "pdf_url": "http://arxiv.org/pdf/2503.16302v1",
            "published": "2025-03-20 16:23:44+00:00",
            "updated": "2025-03-20 16:23:44+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Exploring the Reliability of Self-explanation and its Relationship with Classification in Language Model-driven Financial Analysis",
            "authors": "Han Yuan, Li Zhang, Zheng Ma",
            "summary": "Language models (LMs) have exhibited exceptional versatility in reasoning and\nin-depth financial analysis through their proprietary information processing\ncapabilities. Previous research focused on evaluating classification\nperformance while often overlooking explainability or pre-conceived that\nrefined explanation corresponds to higher classification accuracy. Using a\npublic dataset in finance domain, we quantitatively evaluated self-explanations\nby LMs, focusing on their factuality and causality. We identified the\nstatistically significant relationship between the accuracy of classifications\nand the factuality or causality of self-explanations. Our study built an\nempirical foundation for approximating classification confidence through\nself-explanations and for optimizing classification via proprietary reasoning.",
            "pdf_url": "http://arxiv.org/pdf/2503.15985v1",
            "published": "2025-03-20 09:33:59+00:00",
            "updated": "2025-03-20 09:33:59+00:00"
        }
    ]
}