{
    "Physics": [
        {
            "title": "Dilaton-induced variations in Planck constant and speed of light: An alternative to Dark Energy",
            "authors": "Hoang Ky Nguyen",
            "summary": "We reveal a novel aspect of scale-invariant actions that allow matter to\ncouple with a dilaton field: $\\,$The dynamics of the dilaton can induce\nvariations in the Planck constant $\\hbar$ and speed of light $c$. $\\,$Our\nmechanism for generating variable $\\hbar$ and $c$ in $\\textit{curved}$\nspacetimes via the dilaton offers a viable alternative account for late-time\ncosmic acceleration, bypassing the need for dark energy.",
            "pdf_url": "http://arxiv.org/pdf/2412.04257v3",
            "published": "2024-12-05 15:38:12+00:00",
            "updated": "2025-02-26 18:59:05+00:00"
        },
        {
            "title": "Hi Robot: Open-Ended Instruction Following with Hierarchical Vision-Language-Action Models",
            "authors": "Lucy Xiaoyang Shi, Brian Ichter, Michael Equi, Liyiming Ke, Karl Pertsch, Quan Vuong, James Tanner, Anna Walling, Haohuan Wang, Niccolo Fusai, Adrian Li-Bell, Danny Driess, Lachy Groom, Sergey Levine, Chelsea Finn",
            "summary": "Generalist robots that can perform a range of different tasks in open-world\nsettings must be able to not only reason about the steps needed to accomplish\ntheir goals, but also process complex instructions, prompts, and even feedback\nduring task execution. Intricate instructions (e.g., \"Could you make me a\nvegetarian sandwich?\" or \"I don't like that one\") require not just the ability\nto physically perform the individual steps, but the ability to situate complex\ncommands and feedback in the physical world. In this work, we describe a system\nthat uses vision-language models in a hierarchical structure, first reasoning\nover complex prompts and user feedback to deduce the most appropriate next step\nto fulfill the task, and then performing that step with low-level actions. In\ncontrast to direct instruction following methods that can fulfill simple\ncommands (\"pick up the cup\"), our system can reason through complex prompts and\nincorporate situated feedback during task execution (\"that's not trash\"). We\nevaluate our system across three robotic platforms, including single-arm,\ndual-arm, and dual-arm mobile robots, demonstrating its ability to handle tasks\nsuch as cleaning messy tables, making sandwiches, and grocery shopping.",
            "pdf_url": "http://arxiv.org/pdf/2502.19417v1",
            "published": "2025-02-26 18:58:41+00:00",
            "updated": "2025-02-26 18:58:41+00:00"
        },
        {
            "title": "Artificial Intelligence for Science in Quantum, Atomistic, and Continuum Systems",
            "authors": "Xuan Zhang, Limei Wang, Jacob Helwig, Youzhi Luo, Cong Fu, Yaochen Xie, Meng Liu, Yuchao Lin, Zhao Xu, Keqiang Yan, Keir Adams, Maurice Weiler, Xiner Li, Tianfan Fu, Yucheng Wang, Alex Strasser, Haiyang Yu, YuQing Xie, Xiang Fu, Shenglong Xu, Yi Liu, Yuanqi Du, Alexandra Saxton, Hongyi Ling, Hannah Lawrence, Hannes Stärk, Shurui Gui, Carl Edwards, Nicholas Gao, Adriana Ladera, Tailin Wu, Elyssa F. Hofgard, Aria Mansouri Tehrani, Rui Wang, Ameya Daigavane, Montgomery Bohde, Jerry Kurtin, Qian Huang, Tuong Phung, Minkai Xu, Chaitanya K. Joshi, Simon V. Mathis, Kamyar Azizzadenesheli, Ada Fang, Alán Aspuru-Guzik, Erik Bekkers, Michael Bronstein, Marinka Zitnik, Anima Anandkumar, Stefano Ermon, Pietro Liò, Rose Yu, Stephan Günnemann, Jure Leskovec, Heng Ji, Jimeng Sun, Regina Barzilay, Tommi Jaakkola, Connor W. Coley, Xiaoning Qian, Xiaofeng Qian, Tess Smidt, Shuiwang Ji",
            "summary": "Advances in artificial intelligence (AI) are fueling a new paradigm of\ndiscoveries in natural sciences. Today, AI has started to advance natural\nsciences by improving, accelerating, and enabling our understanding of natural\nphenomena at a wide range of spatial and temporal scales, giving rise to a new\narea of research known as AI for science (AI4Science). Being an emerging\nresearch paradigm, AI4Science is unique in that it is an enormous and highly\ninterdisciplinary area. Thus, a unified and technical treatment of this field\nis needed yet challenging. This work aims to provide a technically thorough\naccount of a subarea of AI4Science; namely, AI for quantum, atomistic, and\ncontinuum systems. These areas aim at understanding the physical world from the\nsubatomic (wavefunctions and electron density), atomic (molecules, proteins,\nmaterials, and interactions), to macro (fluids, climate, and subsurface) scales\nand form an important subarea of AI4Science. A unique advantage of focusing on\nthese areas is that they largely share a common set of challenges, thereby\nallowing a unified and foundational treatment. A key common challenge is how to\ncapture physics first principles, especially symmetries, in natural systems by\ndeep learning methods. We provide an in-depth yet intuitive account of\ntechniques to achieve equivariance to symmetry transformations. We also discuss\nother common technical challenges, including explainability,\nout-of-distribution generalization, knowledge transfer with foundation and\nlarge language models, and uncertainty quantification. To facilitate learning\nand education, we provide categorized lists of resources that we found to be\nuseful. We strive to be thorough and unified and hope this initial effort may\ntrigger more community interests and efforts to further advance AI4Science.",
            "pdf_url": "http://arxiv.org/pdf/2307.08423v4",
            "published": "2023-07-17 12:14:14+00:00",
            "updated": "2025-02-26 18:45:58+00:00"
        },
        {
            "title": "Collinear and TMD distributions with dynamical soft-gluon resolution scale",
            "authors": "F. Hautmann, L. Keersmaekers, A. Lelek, S. Sadeghi Barzani, S. Taheri Monfared",
            "summary": "Soft-gluon resolution scales characterize parton branching Monte Carlo\nimplementations of the evolution equations for parton distribution functions in\nQuantum Chromodynamics (QCD). We examine scenarios with dynamical, i.e.,\nbranching-scale dependent, resolution scale, and discuss physical implications\nfor both collinear and transverse-momentum dependent (TMD) distributions. We\nperform the first determination of parton distributions with dynamical\nresolution scale, at next-to-leading order (NLO) in perturbation theory, from\nfits to precision deep-inelastic scattering measurements from HERA. We present\nan application of TMD distributions with dynamical resolution scale to\nDrell-Yan lepton-pair transverse momentum spectra at the LHC, and comment on\nthe extraction of non-perturbative intrinsic-kT parameters from Drell-Yan data\nat small transverse momenta.",
            "pdf_url": "http://arxiv.org/pdf/2502.19380v1",
            "published": "2025-02-26 18:27:55+00:00",
            "updated": "2025-02-26 18:27:55+00:00"
        },
        {
            "title": "Extracting scattering amplitudes for arbitrary two-particle systems with one-particle left-hand cuts via lattice QCD",
            "authors": "André Baião Raposo, Raúl A Briceño, Maxwell T Hansen, Andrew W Jackura",
            "summary": "We derive a general formalism that relates the spectrum of two-particle\nsystems in a finite volume to physical scattering amplitudes, taking into\naccount the presence of any left-hand branch cuts due to single-particle\nexchanges. The method first relates the finite-volume spectrum to an\ninfinite-volume short-range quantity, denoted \\mathcal{M}_0, and then relates\nthe latter to the physical scattering amplitudes via known integral equations.\nThe derivation of both relations is performed using all-orders perturbation\ntheory and is exact up to neglected exponentially suppressed volume dependence.\nThe relations hold for arbitrary two-particle systems with any number of\ncoupled channels, non-identical and non-degenerate particles, and any intrinsic\nspin.",
            "pdf_url": "http://arxiv.org/pdf/2502.19375v1",
            "published": "2025-02-26 18:16:26+00:00",
            "updated": "2025-02-26 18:16:26+00:00"
        },
        {
            "title": "The chiral SYK model in three-dimensional holography",
            "authors": "Alexander Altland, Dmitry Bagrets, Nele Callebaut, Konstantin Weisenberger",
            "summary": "A celebrated realization of the holographic principle posits an approximate\nduality between the $(0+1)$-dimensional quantum mechanical SYK model and\ntwo-dimensional Jackiw-Teitelboim gravity, mediated by the Schwarzian action as\nan effective low energy theory common to both systems. We here propose a\ngeneralization of this correspondence to one dimension higher. Starting from\ndifferent microscopic realizations of effectively chiral $(1+1)$-dimensional\ngeneralizations of the SYK model, we derive a reduction to the\nAlekseev-Shatashvilli (AS)-action, a minimal extension of the Schwarzian action\nwhich has been proposed as the effective boundary action of three-dimensional\ngravity. In the bulk, we show how the same action describes fluctuations around\nthe Euclidean BTZ black hole configuration, the dominant stationary solution of\nthree-dimensional gravity. These two constructions allow us to match bulk and\nboundary coupling constants, and to compute observables. Specifically, we apply\nsemiclassical techniques inspired by condensed matter physics to the\ncomputation of out-of-time-order correlation functions (OTOCs), demonstrating\nmaximal chaos in the chiral SYK chain and its gravity dual.",
            "pdf_url": "http://arxiv.org/pdf/2502.19370v1",
            "published": "2025-02-26 18:07:28+00:00",
            "updated": "2025-02-26 18:07:28+00:00"
        },
        {
            "title": "Quantum geometric moment encodes stacking order of moiré matter",
            "authors": "Surat Layek, Subhajit Sinha, Atasi Chakraborty, Ayshi Mukherjee, Heena Agarwal, Kenji Watanabe, Takashi Taniguchi, Amit Agarwal, Mandar M. Deshmukh",
            "summary": "Exploring the topological characteristics of electronic bands is essential in\ncondensed matter physics. Moir\\'e materials featuring flat bands provide a\nversatile platform for engineering band topology and correlation effects. In\nmoir\\'e materials that break either time-reversal symmetry or inversion\nsymmetry or both, electronic bands exhibit Berry curvature hotspots. Different\nstacking orders in these materials result in varied Berry curvature\ndistributions within the flat bands, even when the band dispersion remains\nsimilar. However, experimental studies probing the impact of stacking order on\nthe quantum geometric quantities are lacking. 1.4$^\\circ$ twisted double\nbilayer graphene (TDBG) facilitates two distinct stacking orders (AB-AB, AB-BA)\nand forms an inversion broken \\moire superlattice with electrically tunable\nflat bands. The valley Chern numbers of the flat bands depend on the stacking\norder, and the nonlinear Hall (NLH) effect distinguishes the differences in\nBerry curvature dipole (BCD), the first moment of Berry curvature. The BCD\nexhibits antisymmetric behavior, flipping its sign with the polarity of the\nperpendicular electric field in AB-AB TDBG, while it displays a symmetric\nbehavior, maintaining the same sign regardless of the electric field's polarity\nin AB-BA TDBG. This approach electronically detects stacking-induced quantum\ngeometry, while opening a pathway to quantum geometry engineering and\ndetection.",
            "pdf_url": "http://arxiv.org/pdf/2502.19365v1",
            "published": "2025-02-26 18:02:32+00:00",
            "updated": "2025-02-26 18:02:32+00:00"
        },
        {
            "title": "Deep Learning For Time Series Analysis With Application On Human Motion",
            "authors": "Ali Ismail-Fawaz",
            "summary": "Time series data, defined by equally spaced points over time, is essential in\nfields like medicine, telecommunications, and energy. Analyzing it involves\ntasks such as classification, clustering, prototyping, and regression.\nClassification identifies normal vs. abnormal movements in skeleton-based\nmotion sequences, clustering detects stock market behavior patterns,\nprototyping expands physical therapy datasets, and regression predicts patient\nrecovery. Deep learning has recently gained traction in time series analysis\ndue to its success in other domains. This thesis leverages deep learning to\nenhance classification with feature engineering, introduce foundation models,\nand develop a compact yet state-of-the-art architecture. We also address\nlimited labeled data with self-supervised learning. Our contributions apply to\nreal-world tasks, including human motion analysis for action recognition and\nrehabilitation. We introduce a generative model for human motion data, valuable\nfor cinematic production and gaming. For prototyping, we propose a shape-based\nsynthetic sample generation method to support regression models when data is\nscarce. Lastly, we critically evaluate discriminative and generative models,\nidentifying limitations in current methodologies and advocating for a robust,\nstandardized evaluation framework. Our experiments on public datasets provide\nnovel insights and methodologies, advancing time series analysis with practical\napplications.",
            "pdf_url": "http://arxiv.org/pdf/2502.19364v1",
            "published": "2025-02-26 18:01:51+00:00",
            "updated": "2025-02-26 18:01:51+00:00"
        },
        {
            "title": "Physics-Based Hybrid Machine Learning for Critical Heat Flux Prediction with Uncertainty Quantification",
            "authors": "Aidan Furlong, Xingang Zhao, Robert Salko, Xu Wu",
            "summary": "Critical heat flux is a key quantity in boiling system modeling due to its\nimpact on heat transfer and component temperature and performance. This study\ninvestigates the development and validation of an uncertainty-aware hybrid\nmodeling approach that combines machine learning with physics-based models in\nthe prediction of critical heat flux in nuclear reactors for cases of dryout.\nTwo empirical correlations, Biasi and Bowring, were employed with three machine\nlearning uncertainty quantification techniques: deep neural network ensembles,\nBayesian neural networks, and deep Gaussian processes. A pure machine learning\nmodel without a base model served as a baseline for comparison. This study\nexamines the performance and uncertainty of the models under both plentiful and\nlimited training data scenarios using parity plots, uncertainty distributions,\nand calibration curves. The results indicate that the Biasi hybrid deep neural\nnetwork ensemble achieved the most favorable performance (with a mean absolute\nrelative error of 1.846% and stable uncertainty estimates), particularly in the\nplentiful data scenario. The Bayesian neural network models showed slightly\nhigher error and uncertainty but superior calibration. By contrast, deep\nGaussian process models underperformed by most metrics. All hybrid models\noutperformed pure machine learning configurations, demonstrating resistance\nagainst data scarcity.",
            "pdf_url": "http://arxiv.org/pdf/2502.19357v1",
            "published": "2025-02-26 17:55:01+00:00",
            "updated": "2025-02-26 17:55:01+00:00"
        },
        {
            "title": "UNB StepUP: A footStep database for gait analysis and recognition using Underfoot Pressure",
            "authors": "Robyn Larracy, Angkoon Phinyomark, Ala Salehi, Eve MacDonald, Saeed Kazemi, Shikder Shafiul Bashar, Aaron Tabor, Erik Scheme",
            "summary": "Gait refers to the patterns of limb movement generated during walking, which\nare unique to each individual due to both physical and behavioural traits.\nWalking patterns have been widely studied in biometrics, biomechanics, sports,\nand rehabilitation. While traditional methods rely on video and motion capture,\nadvances in underfoot pressure sensing technology now offer deeper insights\ninto gait. However, underfoot pressures during walking remain underexplored due\nto the lack of large, publicly accessible datasets. To address this, the UNB\nStepUP database was created, featuring gait pressure data collected with\nhigh-resolution pressure sensing tiles (4 sensors/cm$^2$, 1.2m by 3.6m). Its\nfirst release, UNB StepUP-P150, includes over 200,000 footsteps from 150\nindividuals across various walking speeds (preferred, slow-to-stop, fast, and\nslow) and footwear types (barefoot, standard shoes, and two personal shoes). As\nthe largest and most comprehensive dataset of its kind, it supports biometric\ngait recognition while presenting new research opportunities in biomechanics\nand deep learning. The UNB StepUP-P150 dataset sets a new benchmark for\npressure-based gait analysis and recognition.\n  Please note that the hypertext links to the dataset on FigShare remain\ndormant while the document is under review.",
            "pdf_url": "http://arxiv.org/pdf/2502.17244v2",
            "published": "2025-02-24 15:21:02+00:00",
            "updated": "2025-02-26 17:51:31+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "RetinaRegen: A Hybrid Model for Readability and Detail Restoration in Fundus Images",
            "authors": "Yuhan Tang, Yudian Wang, Weizhen Li, Ye Yue, Chengchang Pan, Honggang Qi",
            "summary": "Fundus image quality is crucial for diagnosing eye diseases, but real-world\nconditions often result in blurred or unreadable images, increasing diagnostic\nuncertainty. To address these challenges, this study proposes RetinaRegen, a\nhybrid model for retinal image restoration that integrates a readability\nclassifi-cation model, a Diffusion Model, and a Variational Autoencoder (VAE).\nEx-periments on the SynFundus-1M dataset show that the proposed method achieves\na PSNR of 27.4521, an SSIM of 0.9556, and an LPIPS of 0.1911 for the\nreadability labels of the optic disc (RO) region. These results demonstrate\nsuperior performance in restoring key regions, offering an effective solution\nto enhance fundus image quality and support clinical diagnosis.",
            "pdf_url": "http://arxiv.org/pdf/2502.19153v1",
            "published": "2025-02-26 14:10:30+00:00",
            "updated": "2025-02-26 14:10:30+00:00"
        },
        {
            "title": "CCDM: Continuous Conditional Diffusion Models for Image Generation",
            "authors": "Xin Ding, Yongwei Wang, Kao Zhang, Z. Jane Wang",
            "summary": "Continuous Conditional Generative Modeling (CCGM) estimates high-dimensional\ndata distributions, such as images, conditioned on scalar continuous variables\n(aka regression labels). While Continuous Conditional Generative Adversarial\nNetworks (CcGANs) were designed for this task, their instability during\nadversarial learning often leads to suboptimal results. Conditional Diffusion\nModels (CDMs) offer a promising alternative, generating more realistic images,\nbut their diffusion processes, label conditioning, and model fitting procedures\nare either not optimized for or incompatible with CCGM, making it difficult to\nintegrate CcGANs' vicinal approach. To address these issues, we introduce\nContinuous Conditional Diffusion Models (CCDMs), the first CDM specifically\ntailored for CCGM. CCDMs address existing limitations with specially designed\nconditional diffusion processes, a novel hard vicinal image denoising loss, a\ncustomized label embedding method, and efficient conditional sampling\nprocedures. Through comprehensive experiments on four datasets with resolutions\nranging from 64x64 to 192x192, we demonstrate that CCDMs outperform\nstate-of-the-art CCGM models, establishing a new benchmark. Ablation studies\nfurther validate the model design and implementation, highlighting that some\nwidely used CDM implementations are ineffective for the CCGM task. Our code is\npublicly available at https://github.com/UBCDingXin/CCDM.",
            "pdf_url": "http://arxiv.org/pdf/2405.03546v2",
            "published": "2024-05-06 15:10:19+00:00",
            "updated": "2025-02-26 12:45:40+00:00"
        },
        {
            "title": "Efficient and Accurate Spatial Mixing of Machine Learned Interatomic Potentials for Materials Science",
            "authors": "Fraser Birks, Thomas D Swinburne, James R Kermode",
            "summary": "Machine-learned interatomic potentials offer near first-principles accuracy\nbut are computationally expensive, limiting their application in large-scale\nmolecular dynamics simulations. Inspired by quantum mechanics/molecular\nmechanics methods, we present ML-MIX, an efficient and flexible LAMMPS package\nfor accelerating simulations by spatially mixing interatomic potentials of\ndifferent complexities. Through constrained linear fitting, we show it is\npossible to generate a 'cheap' approximate model which closely matches an\n'expensive' reference in relevant regions of configuration space. We\ndemonstrate the capability of ML-MIX through case-studies in Si, Fe, and W-He\nsystems, achieving up to an 11x speedup on 8,000 atom systems without\nsacrificing accuracy on static and dynamic quantities, including calculation of\nminimum energy paths and dynamical simulations of defect diffusion. For larger\ndomain sizes, we show that the achievable speedup of ML-MIX simulations is\nlimited only by the relative speed of the cheap potential over the expensive\npotential. The ease of use and flexible nature of this method will extend the\npractical reach of MLIPs throughout computational materials science, enabling\nparsimonious application to large spatial and temporal domains.",
            "pdf_url": "http://arxiv.org/pdf/2502.19081v1",
            "published": "2025-02-26 12:19:39+00:00",
            "updated": "2025-02-26 12:19:39+00:00"
        },
        {
            "title": "Fast, Scale-Adaptive, and Uncertainty-Aware Downscaling of Earth System Model Fields with Generative Machine Learning",
            "authors": "Philipp Hess, Michael Aich, Baoxiang Pan, Niklas Boers",
            "summary": "Accurate and high-resolution Earth system model (ESM) simulations are\nessential to assess the ecological and socio-economic impacts of anthropogenic\nclimate change, but are computationally too expensive to be run at sufficiently\nhigh spatial resolution. Recent machine learning approaches have shown\npromising results in downscaling ESM simulations, outperforming\nstate-of-the-art statistical approaches. However, existing methods require\ncomputationally costly retraining for each ESM and extrapolate poorly to\nclimates unseen during training. We address these shortcomings by learning a\nconsistency model (CM) that efficiently and accurately downscales arbitrary ESM\nsimulations without retraining in a zero-shot manner. Our approach yields\nprobabilistic downscaled fields at a resolution only limited by the\nobservational reference data. We show that the CM outperforms state-of-the-art\ndiffusion models at a fraction of computational cost while maintaining high\ncontrollability on the downscaling task. Further, our method generalizes to\nclimate states unseen during training without explicitly formulated physical\nconstraints.",
            "pdf_url": "http://arxiv.org/pdf/2403.02774v4",
            "published": "2024-03-05 08:41:41+00:00",
            "updated": "2025-02-26 11:43:09+00:00"
        }
    ]
}