{
    "Physics": [
        {
            "title": "Bridging Machine Learning and Glassy Dynamics Theory for Predictive Polymer Modeling",
            "authors": "Anh D. Phan, Ngo T. Que, Nguyen T. T. Duyen, Phan Thanh Viet, Quach K. Quang, Baicheng Mei",
            "summary": "Understanding and predicting the glassy dynamics of polymers remain\nfundamental challenges in soft matter physics. While the Elastically Collective\nNonlinear Langevin Equation (ECNLE) theory has been successful in describing\nrelaxation dynamics, its practical application to polymers depends on a thermal\nmapping to connect theory with experiment, which in turn requires detailed\nthermodynamic data. Such data may not be available for chemically complex or\nnewly designed polymers. In this work, we propose a simple approach that\nintegrates machine learning-predicted glass transition temperatures (Tg) with a\nsimplified thermal mapping based on an effective thermal expansion coefficient\nto overcome these limitations. This approach can provide quantitatively\naccurate predictions of relaxation dynamics across a broad range of polymers.\nRather than replacing the original thermal mapping, our method complements it\nby trading formal rigor for computational efficiency and broader applicability\nin high-throughput screening and materials with limited available data.\nMoreover, we introduce a physically motivated modification to the thermal\nmapping that resolves discrepancies in the description of low-Tg polymers. Our\nresults establish a generalizable approach for predictive modeling of glassy\npolymer dynamics and point toward new directions for theory-guided materials\ndiscovery.",
            "pdf_url": "http://arxiv.org/pdf/2507.06194v1",
            "published": "2025-07-08 17:21:11+00:00",
            "updated": "2025-07-08 17:21:11+00:00"
        },
        {
            "title": "Constraining new physics effective interactions via a global fit of electroweak, Drell-Yan, Higgs, top, and flavour observables",
            "authors": "J. de Blas, A. Goncalves, V. Miralles, L. Reina, L. Silvestrini, M. Valli",
            "summary": "We present results from a global fit of Standard Model parameters and\ndimension-6 SMEFT Wilson coefficients that includes electroweak, Drell-Yan,\nHiggs-boson, top-quark, and flavour observables. Fits obtained by floating\nindividual coefficients are also discussed. The leading-order scale dependence\nof the SMEFT Wilson coefficients is consistently included in the evolution from\nthe UV scale to the electroweak scale and the low-energy scale of flavour\nobservables. In defining the SMEFT set of active operators we consider both the\n$U(3)^5$ and the $U(2)^5$ flavour symmetric limits. All fits are obtained\nwithin the $\\texttt{HEPfit}$ framework and are based on the most recent\nexperimental results and state-of-the-art theoretical predictions for all the\nobservables considered.",
            "pdf_url": "http://arxiv.org/pdf/2507.06191v1",
            "published": "2025-07-08 17:19:51+00:00",
            "updated": "2025-07-08 17:19:51+00:00"
        },
        {
            "title": "\"Ideal\" Topological Heavy Fermion Model in Two-dimensional Moiré Heterostructures with Type-II Band Alignment",
            "authors": "Yunzhe Liu, Anoj Aryal, Dumitru Calugaru, Zhenyao Fang, Kaijie Yang, Haoyu Hu, Qimin Yan, B. Andrei Bernevig, Chao-xing Liu",
            "summary": "Topological flat bands play an essential role in inducing exotic interacting\nphysics, ranging from fractional Chern insulators to superconductivity, in\nmoir\\'e materials. When topological flat bands possess concentrated quantum\ngeometry, a topological heavy fermion (THF) model was proposed as the starting\npoint to describe the interacting moir\\'e physics. In this work, we propose a\ndesign principle for realizing \"ideal\" THF model, which can host an exact flat\nband with \"ideal quantum geometry\", namely the trace of Fubini-Study metric\nequals to the Berry curvature, in a class of two-dimensional moir\\'e\nheterostructures with type-II band alignment. We first introduce a moir\\'e\nChern-band model to describe this system and show that topological flat bands\ncan be realized in this model when the moir\\'e superlattice potential is\nstronger than the type-II atomic band gap of the heterostructure. Next, we map\nthis model into a THF model that consists of a localized orbital for\n\"f-electron\" and a conducting band for \"c-electron\". We find that both the\nflatness and quantum geometry of the mini-bands in this THF model depend on the\nenergy gap between c-electron and f-electron bands at $\\Gamma$ which is\nexperimentally controllable via external gate voltages. This tunability will\nallow us to realize an \"ideal\" topological flat band with zero band-width and\n\"ideal quantum geometry\" in this THF model. Our design strategy of topological\nflat bands is insensitive of twist angle. We also discuss possible material\ncandidates for moir\\'e heterostructures with type-II band alignment.",
            "pdf_url": "http://arxiv.org/pdf/2507.06168v1",
            "published": "2025-07-08 16:48:11+00:00",
            "updated": "2025-07-08 16:48:11+00:00"
        },
        {
            "title": "Electromagnetic energy calibration of the SoLid detector with horizontal muons",
            "authors": "SoLid collaboration",
            "summary": "SoLid is a neutrino experiment at very-short baseline searching for\nactive-to-sterile oscillations of reactor antineutrinos. The detection\nprinciple is based on the pairing of two types of solid scintillators:\npolyvinyl toluene and $^6$Li:ZnS(Ag), which is a new technology used in this\nfield of Physics. In addition to good neutron-gamma discrimination, this setup\nallows the detector to be highly segmented; the basic detection unit is a 5 cm\ncube. High segmentation provides numerous advantages including precise\nlocalisation of the Inverse Beta Decay (IBD) products, the derivation of an\nantineutrino energy estimator based on the isolated positron energy, and a\npowerful background reduction tool that relies on the topological signature of\nthe signal. Finally, the system is read out by a network of WLS fibres coupled\nto photosensors. A relative electromagnetic calibration is performed with\nhorizontal cosmic muons. This source poses the simplest calibration problem in\nwhich a single detection unit is involved. In addition, large muon energy\ndeposits allow us to perform a calibration at the most detailed level (i.e. per\nfibre) and to accurately define the fraction of energy escaping to neighbouring\ndetection cells. A statistical precision at the sub-percent level is reached.\nThe paper also discusses two methods to calibrate the absolute energy scale.\nThe first method relies on horizontal muons, though the precision is limited to\naround 10\\% because of the uncertainty in the energy distribution of such\nmuons. A novel, alternative method based on the radioactive AmBe source is\nproposed. It takes advantage of the electron-positron pair-production process\nand provides a calibration point at 3.4 MeV (i.e. in the core of the IBD\npositron spectrum). The paper is concluded with various cross-check including a\ndetermination of the energy spectrum of the standard cosmogenic background\ncandle: $^{12}$B.",
            "pdf_url": "http://arxiv.org/pdf/2507.05180v2",
            "published": "2025-07-07 16:35:32+00:00",
            "updated": "2025-07-08 16:36:20+00:00"
        },
        {
            "title": "Mott's law for the v.r.h. random resistor network and for Mott's random walk",
            "authors": "Alessandra Faggionato",
            "summary": "Mott's variable range hopping (v.r.h.) is the phonon-induced hopping of\nelectrons in disordered solids (such as doped semiconductors) within the regime\nof strong Anderson localization. It was introduced by N.~Mott to explain the\nanomalous low temperature conductivity decay in dimension $d\\geq 2$,\ncorresponding now to the so called Mott's law. We provide a rigorous derivation\nof this Physics law for two effective models of Mott v.r.h.: the random\nresistor network for v.r.h. of \\cite[Section~IV]{AHL} and Mott's random walk.\nWe also determine the constant multiplying the power of the inverse temperature\nin the exponent in Mott's law, which was an open problem also on a heuristic\nlevel.",
            "pdf_url": "http://arxiv.org/pdf/2301.06318v4",
            "published": "2023-01-16 09:18:20+00:00",
            "updated": "2025-07-08 16:35:56+00:00"
        },
        {
            "title": "A Homothetic Gauge Theory",
            "authors": "Fereidoun Sabetghadam",
            "summary": "While the principle of local gauge invariance forms the bedrock of modern\nphysics, the symmetry of scale invariance has traditionally been treated on a\ndifferent footing. This paper develops a \\emph{homothetic gauge theory} (HGT)\nthat elevates local scale transformations to a genuine gauge symmetry, placing\nthem within the same geometric framework as conventional interactions. We\nintroduce a novel mathematical structure based on an extended vector bundle\nthat linearizes the action of local scaling, allowing for the definition of a\nhomothetic connection and a corresponding gauge-covariant field strength. When\nthis formalism is applied to classical U(1) electromagnetism, the theory yields\na generalized field-strength tensor that naturally incorporates both the\nstandard Maxwell field and a new scalar partner field governing the local\nscale. The resulting dynamics, including modified conservation laws and wave\nequations, are shown to be fully consistent. As a significant physical\napplication, this framework provides a compelling resolution to the classical\nproblem of the infinite self-energy of a point charge. By modeling the source\nas a penalized Dirichlet boundary condition on a shrinking interface, we\nconstruct a non-singular electrostatic potential, thereby removing the\ndivergence in a natural, geometric manner without introducing ad-hoc\nregularization schemes. The emergence of penalty terms due to essentially\ngeometric transformations promises a physically meaningful theory, and\nencourages to re-examining the role of scale invariance in other areas of\nclassical and quantum field theory.",
            "pdf_url": "http://arxiv.org/pdf/2507.06153v1",
            "published": "2025-07-08 16:35:11+00:00",
            "updated": "2025-07-08 16:35:11+00:00"
        },
        {
            "title": "Online Planning for Multi-UAV Pursuit-Evasion in Unknown Environments Using Deep Reinforcement Learning",
            "authors": "Jiayu Chen, Chao Yu, Guosheng Li, Wenhao Tang, Shilong Ji, Xinyi Yang, Botian Xu, Huazhong Yang, Yu Wang",
            "summary": "Multi-UAV pursuit-evasion, where pursuers aim to capture evaders, poses a key\nchallenge for UAV swarm intelligence. Multi-agent reinforcement learning (MARL)\nhas demonstrated potential in modeling cooperative behaviors, but most RL-based\napproaches remain constrained to simplified simulations with limited dynamics\nor fixed scenarios. Previous attempts to deploy RL policy to real-world\npursuit-evasion are largely restricted to two-dimensional scenarios, such as\nground vehicles or UAVs at fixed altitudes. In this paper, we address multi-UAV\npursuit-evasion by considering UAV dynamics and physical constraints. We\nintroduce an evader prediction-enhanced network to tackle partial observability\nin cooperative strategy learning. Additionally, we propose an adaptive\nenvironment generator within MARL training, enabling higher exploration\nefficiency and better policy generalization across diverse scenarios.\nSimulations show our method significantly outperforms all baselines in\nchallenging scenarios, generalizing to unseen scenarios with a 100% capture\nrate. Finally, we derive a feasible policy via a two-stage reward refinement\nand deploy the policy on real quadrotors in a zero-shot manner. To our\nknowledge, this is the first work to derive and deploy an RL-based policy using\ncollective thrust and body rates control commands for multi-UAV pursuit-evasion\nin unknown environments. The open-source code and videos are available at\nhttps://sites.google.com/view/pursuit-evasion-rl.",
            "pdf_url": "http://arxiv.org/pdf/2409.15866v4",
            "published": "2024-09-24 08:40:04+00:00",
            "updated": "2025-07-08 16:34:36+00:00"
        },
        {
            "title": "Topic Modeling and Link-Prediction for Material Property Discovery",
            "authors": "Ryan C. Barron, Maksim E. Eren, Valentin Stanev, Cynthia Matuszek, Boian S. Alexandrov",
            "summary": "Link prediction infers missing or future relations between graph nodes, based\non connection patterns. Scientific literature networks and knowledge graphs are\ntypically large, sparse, and noisy, and often contain missing links between\nentities. We present an AI-driven hierarchical link prediction framework that\nintegrates matrix factorization to infer hidden associations and steer\ndiscovery in complex material domains. Our method combines Hierarchical\nNonnegative Matrix Factorization (HNMFk) and Boolean matrix factorization\n(BNMFk) with automatic model selection, as well as Logistic matrix\nfactorization (LMF), we use to construct a three-level topic tree from a\n46,862-document corpus focused on 73 transition-metal dichalcogenides (TMDs).\nThese materials are studied in a variety of physics fields with many current\nand potential applications.\n  An ensemble BNMFk + LMF approach fuses discrete interpretability with\nprobabilistic scoring. The resulting HNMFk clusters map each material onto\ncoherent topics like superconductivity, energy storage, and tribology. Also,\nmissing or weakly connected links are highlight between topics and materials,\nsuggesting novel hypotheses for cross-disciplinary exploration. We validate our\nmethod by removing publications about superconductivity in well-known\nsuperconductors, and show the model predicts associations with the\nsuperconducting TMD clusters. This shows the method finds hidden connections in\na graph of material to latent topic associations built from scientific\nliterature, especially useful when examining a diverse corpus of scientific\ndocuments covering the same class of phenomena or materials but originating\nfrom distinct communities and perspectives. The inferred links generating new\nhypotheses, produced by our method, are exposed through an interactive\nStreamlit dashboard, designed for human-in-the-loop scientific discovery.",
            "pdf_url": "http://arxiv.org/pdf/2507.06139v1",
            "published": "2025-07-08 16:20:46+00:00",
            "updated": "2025-07-08 16:20:46+00:00"
        },
        {
            "title": "Moduli space of spin connections on three-dimensional homogeneous spaces",
            "authors": "Matteo Bruno, Gabriele Peluso",
            "summary": "In this manuscript, we aim to classify and characterize the moduli space of\nhomogeneous spin connections and homogeneous $SU(2)$ connections on\nthree-dimensional Riemannian homogeneous spaces. An analysis of the topology of\nthe associated moduli spaces reveals that they are finite-dimensional\ntopological manifolds (possibly with boundary) possessing trivial homotopy\ngroups.\n  Owing to their deep connection with cosmological models in the\nAshtekar-Barbero-Immirzi formulation of General Relativity, this study offers a\nmathematically rigorous interpretation of the Ashtekar-Barbero-Immirzi-Sen\nconnection within a cosmological context. In particular, we show that a correct\nformulation of the theory relies crucially on identifying the moduli space of\nhomogeneous spin connections, thereby emphasizing the essential role of the\nspin structure in ensuring consistency with the physical content of the theory.\n  The favorable topological properties of these moduli spaces circumvent many\nof the usual difficulties associated with singularities and the definition of\nregular measures in Quantum Field Theory and Quantum Gravity. As a result, they\nprovide a solid foundation for the rigorous implementation of quantum theory in\nthe cosmological setting.",
            "pdf_url": "http://arxiv.org/pdf/2507.06104v1",
            "published": "2025-07-08 15:45:30+00:00",
            "updated": "2025-07-08 15:45:30+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "StreamDiffusion: A Pipeline-level Solution for Real-time Interactive Generation",
            "authors": "Akio Kodaira, Chenfeng Xu, Toshiki Hazama, Takanori Yoshimoto, Kohei Ohno, Shogo Mitsuhori, Soichi Sugano, Hanying Cho, Zhijian Liu, Masayoshi Tomizuka, Kurt Keutzer",
            "summary": "We introduce StreamDiffusion, a real-time diffusion pipeline designed for\ninteractive image generation. Existing diffusion models are adept at creating\nimages from text or image prompts, yet they often fall short in real-time\ninteraction. This limitation becomes particularly evident in scenarios\ninvolving continuous input, such as Metaverse, live video streaming, and\nbroadcasting, where high throughput is imperative. To address this, we present\na novel approach that transforms the original sequential denoising into the\nbatching denoising process. Stream Batch eliminates the conventional\nwait-and-interact approach and enables fluid and high throughput streams. To\nhandle the frequency disparity between data input and model throughput, we\ndesign a novel input-output queue for parallelizing the streaming process.\nMoreover, the existing diffusion pipeline uses classifier-free guidance(CFG),\nwhich requires additional U-Net computation. To mitigate the redundant\ncomputations, we propose a novel residual classifier-free guidance (RCFG)\nalgorithm that reduces the number of negative conditional denoising steps to\nonly one or even zero. Besides, we introduce a stochastic similarity\nfilter(SSF) to optimize power consumption. Our Stream Batch achieves around\n1.5x speedup compared to the sequential denoising method at different denoising\nlevels. The proposed RCFG leads to speeds up to 2.05x higher than the\nconventional CFG. Combining the proposed strategies and existing mature\nacceleration tools makes the image-to-image generation achieve up-to 91.07fps\non one RTX4090, improving the throughputs of AutoPipline developed by Diffusers\nover 59.56x. Furthermore, our proposed StreamDiffusion also significantly\nreduces the energy consumption by 2.39x on one RTX3060 and 1.99x on one\nRTX4090, respectively.",
            "pdf_url": "http://arxiv.org/pdf/2312.12491v2",
            "published": "2023-12-19 18:18:33+00:00",
            "updated": "2025-07-08 17:45:49+00:00"
        },
        {
            "title": "Modern Methods in Associative Memory",
            "authors": "Dmitry Krotov, Benjamin Hoover, Parikshit Ram, Bao Pham",
            "summary": "Associative Memories like the famous Hopfield Networks are elegant models for\ndescribing fully recurrent neural networks whose fundamental job is to store\nand retrieve information. In the past few years they experienced a surge of\ninterest due to novel theoretical results pertaining to their information\nstorage capabilities, and their relationship with SOTA AI architectures, such\nas Transformers and Diffusion Models. These connections open up possibilities\nfor interpreting the computation of traditional AI networks through the\ntheoretical lens of Associative Memories. Additionally, novel Lagrangian\nformulations of these networks make it possible to design powerful distributed\nmodels that learn useful representations and inform the design of novel\narchitectures. This tutorial provides an approachable introduction to\nAssociative Memories, emphasizing the modern language and methods used in this\narea of research, with practical hands-on mathematical derivations and coding\nnotebooks.",
            "pdf_url": "http://arxiv.org/pdf/2507.06211v1",
            "published": "2025-07-08 17:40:39+00:00",
            "updated": "2025-07-08 17:40:39+00:00"
        },
        {
            "title": "Few-Shot Learning by Explicit Physics Integration: An Application to Groundwater Heat Transport",
            "authors": "Julia Pelzer, Corné Verburg, Alexander Heinlein, Miriam Schulte",
            "summary": "Machine learning methods often struggle with real-world applications in\nscience and engineering due to limited or low-quality training data. In this\nwork, the example of groundwater flow with heat transport is considered; this\ncorresponds to an advection-diffusion process under heterogeneous flow\nconditions, that is, spatially distributed material parameters and heat\nsources. Classical numerical simulations are costly and challenging due to high\nspatio-temporal resolution requirements and large domains. While often\ncomputationally more efficient, purely data-driven surrogate models face\ndifficulties, particularly in predicting the advection process, which is highly\nsensitive to input variations and involves long-range spatial interactions.\nTherefore, in this work, a Local-Global Convolutional Neural Network (LGCNN)\napproach is introduced. It combines a lightweight numerical surrogate for the\ntransport process (global) with convolutional neural networks for the\ngroundwater velocity and heat diffusion processes (local). With the LGCNN, a\ncity-wide subsurface temperature field is modeled, involving a heterogeneous\ngroundwater flow field and one hundred groundwater heat pump injection points\nforming interacting heat plumes over long distances. The model is first\nsystematically analyzed based on random subsurface input fields. Then, the\nmodel is trained on a handful of cut-outs from a real-world subsurface map of\nthe Munich region in Germany, and it scales to larger cut-outs without\nretraining. All datasets, our code, and trained models are published for\nreproducibility.",
            "pdf_url": "http://arxiv.org/pdf/2507.06062v1",
            "published": "2025-07-08 15:06:15+00:00",
            "updated": "2025-07-08 15:06:15+00:00"
        },
        {
            "title": "UniCombine: Unified Multi-Conditional Combination with Diffusion Transformer",
            "authors": "Haoxuan Wang, Jinlong Peng, Qingdong He, Hao Yang, Ying Jin, Jiafu Wu, Xiaobin Hu, Yanjie Pan, Zhenye Gan, Mingmin Chi, Bo Peng, Yabiao Wang",
            "summary": "With the rapid development of diffusion models in image generation, the\ndemand for more powerful and flexible controllable frameworks is increasing.\nAlthough existing methods can guide generation beyond text prompts, the\nchallenge of effectively combining multiple conditional inputs while\nmaintaining consistency with all of them remains unsolved. To address this, we\nintroduce UniCombine, a DiT-based multi-conditional controllable generative\nframework capable of handling any combination of conditions, including but not\nlimited to text prompts, spatial maps, and subject images. Specifically, we\nintroduce a novel Conditional MMDiT Attention mechanism and incorporate a\ntrainable LoRA module to build both the training-free and training-based\nversions. Additionally, we propose a new pipeline to construct\nSubjectSpatial200K, the first dataset designed for multi-conditional generative\ntasks covering both the subject-driven and spatially-aligned conditions.\nExtensive experimental results on multi-conditional generation demonstrate the\noutstanding universality and powerful capability of our approach with\nstate-of-the-art performance.",
            "pdf_url": "http://arxiv.org/pdf/2503.09277v2",
            "published": "2025-03-12 11:22:47+00:00",
            "updated": "2025-07-08 14:44:44+00:00"
        },
        {
            "title": "TextPixs: Glyph-Conditioned Diffusion with Character-Aware Attention and OCR-Guided Supervision",
            "authors": "Syeda Anshrah Gillani, Mirza Samad Ahmed Baig, Osama Ahmed Khan, Shahid Munir Shah, Umema Mujeeb, Maheen Ali",
            "summary": "The modern text-to-image diffusion models boom has opened a new era in\ndigital content production as it has proven the previously unseen ability to\nproduce photorealistic and stylistically diverse imagery based on the semantics\nof natural-language descriptions. However, the consistent disadvantage of these\nmodels is that they cannot generate readable, meaningful, and correctly spelled\ntext in generated images, which significantly limits the use of practical\npurposes like advertising, learning, and creative design. This paper introduces\na new framework, namely Glyph-Conditioned Diffusion with Character-Aware\nAttention (GCDA), using which a typical diffusion backbone is extended by three\nwell-designed modules. To begin with, the model has a dual-stream text encoder\nthat encodes both semantic contextual information and explicit glyph\nrepresentations, resulting in a character-aware representation of the input\ntext that is rich in nature. Second, an attention mechanism that is aware of\nthe character is proposed with a new attention segregation loss that aims to\nlimit the attention distribution of each character independently in order to\navoid distortion artifacts. Lastly, GCDA has an OCR-in-the-loop fine-tuning\nphase, where a full text perceptual loss, directly optimises models to be\nlegible and accurately spell. Large scale experiments to benchmark datasets,\nsuch as MARIO-10M and T2I-CompBench, reveal that GCDA sets a new\nstate-of-the-art on all metrics, with better character based metrics on text\nrendering (Character Error Rate: 0.08 vs 0.21 for the previous best; Word Error\nRate: 0.15 vs 0.25), human perception, and comparable image synthesis quality\non high-fidelity (FID: 14.3).",
            "pdf_url": "http://arxiv.org/pdf/2507.06033v1",
            "published": "2025-07-08 14:35:02+00:00",
            "updated": "2025-07-08 14:35:02+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "skfolio: Portfolio Optimization in Python",
            "authors": "Carlo Nicolini, Matteo Manzi, Hugo Delatte",
            "summary": "Portfolio optimization is a fundamental challenge in quantitative finance,\nrequiring robust computational tools that integrate statistical rigor with\npractical implementation. We present skfolio, an open-source Python library for\nportfolio construction and risk management that seamlessly integrates with the\nscikit-learn ecosystem. skfolio provides a unified framework for diverse\nallocation strategies, from classical mean-variance optimization to modern\nclustering-based methods, state-of-the-art financial estimators with native\ninterfaces, and advanced cross-validation techniques tailored for financial\ntime series. By adhering to scikit-learn's fit-predict-transform paradigm, the\nlibrary enables researchers and practitioners to leverage machine learning\nworkflows for portfolio optimization, promoting reproducibility and\ntransparency in quantitative finance.",
            "pdf_url": "http://arxiv.org/pdf/2507.04176v2",
            "published": "2025-07-05 22:08:26+00:00",
            "updated": "2025-07-08 13:15:03+00:00"
        }
    ]
}