{
    "Physics": [
        {
            "title": "Quantum Machine Learning Algorithms for Anomaly Detection: a Survey",
            "authors": "Sebastiano Corli, Lorenzo Moro, Daniele Dragoni, Massimiliano Dispenza, Enrico Prati",
            "summary": "The advent of quantum computers has justified the development of quantum\nmachine learning algorithms , based on the adaptation of the principles of\nmachine learning to the formalism of qubits. Among such quantum algorithms,\nanomaly detection represents an important problem crossing several disciplines\nfrom cybersecurity, to fraud detection to particle physics. We summarize the\nkey concepts involved in quantum computing, introducing the formal concept of\nquantum speed up. The survey provides a structured map of anomaly detection\nbased on quantum machine learning. We have grouped existing algorithms\naccording to the different learning methods, namely quantum supervised, quantum\nunsupervised and quantum reinforcement learning, respectively. We provide an\nestimate of the hardware resources to provide sufficient computational power in\nthe future. The survey provides a systematic and compact understanding of the\ntechniques belonging to each category. We eventually provide a discussion on\nthe computational complexity of the learning methods in real application\ndomains.",
            "pdf_url": "http://arxiv.org/pdf/2408.11047v1",
            "published": "2024-08-20 17:55:25+00:00",
            "updated": "2024-08-20 17:55:25+00:00"
        },
        {
            "title": "Representation Theory of Solitons",
            "authors": "Clay Cordova, Nicholas Holfester, Kantaro Ohmori",
            "summary": "Solitons in two-dimensional quantum field theory exhibit patterns of\ndegeneracies and associated selection rules on scattering amplitudes. We\ndevelop a representation theory that captures these intriguing features of\nsolitons. This representation theory is based on an algebra we refer to as the\n\"strip algebra\", $\\textrm{Str}_{\\mathcal{C}}(\\mathcal{M})$, which is defined in\nterms of the non-invertible symmetry, $\\mathcal{C},$ a fusion category, and its\naction on boundary conditions encoded by a module category, $\\mathcal{M}$. The\nstrip algebra is a $C^*$-weak Hopf algebra, a fact which can be elegantly\ndeduced by quantizing the three-dimensional Drinfeld center TQFT,\n$\\mathcal{Z}(\\mathcal{C}),$ on a spatial manifold with corners. These\nstructures imply that the representation category of the strip algebra is also\na unitary fusion category which we identify with a dual category\n$\\mathcal{C}_{\\mathcal{M}}^{*}.$ We present a straightforward method for\nanalyzing these representations in terms of quiver diagrams where nodes are\nvacua and arrows are solitons and provide examples demonstrating how the\nrepresentation theory reproduces known degeneracies and selection rules of\nsoliton scattering. Our analysis provides the general framework for analyzing\nnon-invertible symmetry on manifolds with boundary and applies both to the case\nof boundaries at infinity, relevant to particle physics, and boundaries at\nfinite distance, relevant in conformal field theory or condensed matter\nsystems.",
            "pdf_url": "http://arxiv.org/pdf/2408.11045v1",
            "published": "2024-08-20 17:55:06+00:00",
            "updated": "2024-08-20 17:55:06+00:00"
        },
        {
            "title": "Search for magnetic monopole pair production in ultraperipheral Pb+Pb collisions at $\\sqrt{s_{_\\textrm{NN}}}=5.36$ TeV with the ATLAS detector at the LHC",
            "authors": "ATLAS Collaboration",
            "summary": "This Letter presents a search for highly ionizing magnetic monopoles in\n262$~\\mu$b$^{-1}$ of ultraperipheral Pb+Pb collision data at\n$\\sqrt{s_{_\\textrm{NN}}}=5.36$ TeV collected by the ATLAS detector at the LHC.\nA new methodology that exploits the properties of clusters of hits\nreconstructed in the innermost silicon detector layers is introduced to study\nhighly ionizing particles in heavy-ion data. No significant excess above the\nbackground, which is estimated using a data-driven technique, is observed.\nUsing a nonperturbative semiclassical model, upper limits at 95% confidence\nlevel are set on the cross-section for pair production of monopoles with a\nsingle Dirac magnetic charge in the mass range of 20-150 GeV. The search\nsignificantly improves on the previous cross-section limits for production of\nlow-mass monopoles in ultraperipheral Pb+Pb collisions.",
            "pdf_url": "http://arxiv.org/pdf/2408.11035v1",
            "published": "2024-08-20 17:41:56+00:00",
            "updated": "2024-08-20 17:41:56+00:00"
        },
        {
            "title": "Atmospheric Transport Modeling of CO$_2$ with Neural Networks",
            "authors": "Vitus Benson, Ana Bastos, Christian Reimers, Alexander J. Winkler, Fanny Yang, Markus Reichstein",
            "summary": "Accurately describing the distribution of CO$_2$ in the atmosphere with\natmospheric tracer transport models is essential for greenhouse gas monitoring\nand verification support systems to aid implementation of international climate\nagreements. Large deep neural networks are poised to revolutionize weather\nprediction, which requires 3D modeling of the atmosphere. While similar in this\nregard, atmospheric transport modeling is subject to new challenges. Both,\nstable predictions for longer time horizons and mass conservation throughout\nneed to be achieved, while IO plays a larger role compared to computational\ncosts. In this study we explore four different deep neural networks (UNet,\nGraphCast, Spherical Fourier Neural Operator and SwinTransformer) which have\nproven as state-of-the-art in weather prediction to assess their usefulness for\natmospheric tracer transport modeling. For this, we assemble the CarbonBench\ndataset, a systematic benchmark tailored for machine learning emulators of\nEulerian atmospheric transport. Through architectural adjustments, we decouple\nthe performance of our emulators from the distribution shift caused by a steady\nrise in atmospheric CO$_2$. More specifically, we center CO$_2$ input fields to\nzero mean and then use an explicit flux scheme and a mass fixer to assure mass\nbalance. This design enables stable and mass conserving transport for over 6\nmonths with all four neural network architectures. In our study, the\nSwinTransformer displays particularly strong emulation skill (90-day $R^2 >\n0.99$), with physically plausible emulation even for forward runs of multiple\nyears. This work paves the way forward towards high resolution forward and\ninverse modeling of inert trace gases with neural networks.",
            "pdf_url": "http://arxiv.org/pdf/2408.11032v1",
            "published": "2024-08-20 17:33:20+00:00",
            "updated": "2024-08-20 17:33:20+00:00"
        },
        {
            "title": "Hubble Tension or Distance Ladder Crisis?",
            "authors": "Leandros Perivolaropoulos",
            "summary": "We present an up-to-date compilation of published Hubble constant ($H_0$)\nmeasurements that are independent of the CMB sound horizon scale. This\ncompilation is categorized into two distinct groups: A. Distance Ladder\nMeasurements: This group comprises 19 recent measurements, primarily from the\npast four years, utilizing various rung 2 calibrators and rung 3 cosmic\ndistance indicators. B.One-Step Measurements: This category includes 31\nmeasurements of $H_0$ that are independent of both the CMB sound horizon scale\nand the distance ladder approach. These are derived from diverse probes such as\nCosmic Chronometers, gamma-ray attenuation, time-delay strong lensing,\nmegamasers etc. Statistical analysis reveals a significant distinction between\nthese two groups. The distance ladder-based measurements yield a weighted mean\n$H_0 = 72.76 \\pm 0.50$ km s$^{-1}$ Mpc$^{-1}$, while the one-step measurements\nresult in a weighted mean $H_0 = 69.01 \\pm 0.49$ km s$^{-1}$ Mpc$^{-1}$. To\nquantify the statistical significance of this difference, we implemented a\nKolmogorov-Smirnov (KS) test, which yielded a p-value of 0.000102. This\nextremely low p-value strongly indicates that the two samples are fundamentally\ndistinct, with a probability of less than 0.01\\% that they are drawn from the\nsame underlying distribution. These findings suggest that late-time one-step\nmeasurements of $H_0$ are more consistent with early-time measurements,\nindicating that the core of the Hubble tension lies not between early-time and\nlate-time measurements per se, but specifically between distance ladder\nmeasurements and all other $H_0$ determinations. This discrepancy points to\neither a systematic effect influencing all distance ladder measurements or a\nfundamental physics anomaly affecting at least one rung of the distance ladder.",
            "pdf_url": "http://arxiv.org/pdf/2408.11031v1",
            "published": "2024-08-20 17:32:26+00:00",
            "updated": "2024-08-20 17:32:26+00:00"
        },
        {
            "title": "Enhanced Shadow Tomography of Molecular Excited States from Enforcing $N$-representability Conditions by Semidefinite Programming",
            "authors": "Irma Avdic, David A. Mazziotti",
            "summary": "Excited-state properties of highly correlated systems are key to\nunderstanding photosynthesis, luminescence, and the development of novel\noptical materials, but accurately capturing their interactions is\ncomputationally costly. We present an algorithm that combines classical shadow\ntomography with physical constraints on the two-electron reduced density matrix\n(2-RDM) to treat excited states. The method reduces the number of measurements\nof the many-electron 2-RDM on quantum computers by (i) approximating the\nquantum state through a random sampling technique called shadow tomography and\n(ii) ensuring that the 2-RDM represents an $N$-electron system through imposing\n$N$-representability constraints by semidefinite programming. This generalizes\nrecent work on the $N$-representability-enhanced shadow tomography of\nground-state 2-RDMs. We compute excited-state energies and 2-RDMs of the H$_4$\nchain and analyze the critical points along the photoexcited reaction pathway\nfrom gauche-1,3-butadiene to bicyclobutane via a conical intersection. The\nresults show that the generalized shadow tomography retains critical\nmultireference correlation effects while significantly reducing the number of\nrequired measurements, offering a promising avenue for the efficient treatment\nof electronically excited states on quantum devices.",
            "pdf_url": "http://arxiv.org/pdf/2408.11025v1",
            "published": "2024-08-20 17:27:48+00:00",
            "updated": "2024-08-20 17:27:48+00:00"
        },
        {
            "title": "Learning Realistic Joint Space Boundaries for Range of Motion Analysis of Healthy and Impaired Human Arms",
            "authors": "Shafagh Keyvanian, Michelle J. Johnson, Nadia Figueroa",
            "summary": "A realistic human kinematic model that satisfies anatomical constraints is\nessential for human-robot interaction, biomechanics and robot-assisted\nrehabilitation. Modeling realistic joint constraints, however, is challenging\nas human arm motion is constrained by joint limits, inter- and intra-joint\ndependencies, self-collisions, individual capabilities and muscular or\nneurological constraints which are difficult to represent. Hence, physicians\nand researchers have relied on simple box-constraints, ignoring important\nanatomical factors. In this paper, we propose a data-driven method to learn\nrealistic anatomically constrained upper-limb range of motion (RoM) boundaries\nfrom motion capture data. This is achieved by fitting a one-class support\nvector machine to a dataset of upper-limb joint space exploration motions with\nan efficient hyper-parameter tuning scheme. Our approach outperforms similar\nworks focused on valid RoM learning. Further, we propose an impairment index\n(II) metric that offers a quantitative assessment of capability/impairment when\ncomparing healthy and impaired arms. We validate the metric on healthy subjects\nphysically constrained to emulate hemiplegia and different disability levels as\nstroke patients.",
            "pdf_url": "http://arxiv.org/pdf/2311.10653v2",
            "published": "2023-11-17 17:14:42+00:00",
            "updated": "2024-08-20 17:21:43+00:00"
        },
        {
            "title": "Temporal solitons in active optical resonators",
            "authors": "Dmitry Kazakov, Federico Capasso, Marco Piccardo",
            "summary": "Solitons, as coherent structures that maintain their shape while traveling at\nconstant velocity, are ubiquitous across various branches of physics, from\nfluid dynamics to quantum fields. However, it is within the realm of optics\nwhere solitons have not only served as a primary testbed for understanding\nsolitary wave phenomena but have also transitioned into applications ranging\nfrom telecommunications to metrology. In the optical domain, temporal solitons\nare localized light pulses, self-reinforcing via a delicate balance between\nnonlinearity and dispersion. Among the many systems hosting temporal solitons,\nactive optical resonators stand out due to their inherent gain medium, enabling\nto actively sustain solitons. Unlike conventional modelocked lasers, active\nresonators offer a richer landscape for soliton dynamics through hybrid driving\nschemes, such as coupling to passive cavities or under external optical\ninjection, affording them unparalleled control and versatility. We discuss key\nadvantages of these systems, with a particular focus on quantum cascade lasers\nas a promising soliton technology within the class of active resonators. By\nexploring diverse architectures from traditional Fabry-Perot cavities to\nracetrack devices operated under external injection, we present the current\nstate-of-the-art and future directions for soliton-based sources in the realm\nof semiconductor lasers and hybrid integrated photonic systems.",
            "pdf_url": "http://arxiv.org/pdf/2408.11020v1",
            "published": "2024-08-20 17:20:31+00:00",
            "updated": "2024-08-20 17:20:31+00:00"
        },
        {
            "title": "A hierarchy of KPZ equation scaling limits arising from directed random walk models in random media",
            "authors": "Shalin Parekh",
            "summary": "We consider a generalized model of random walk in dynamical random\nenvironment, and we show that the multiplicative-noise stochastic heat equation\n(SHE) describes the fluctuations of the quenched density at a certain precise\nlocation in the tail. The distribution of transition kernels is fixed rather\nthan changing under the diffusive rescaling of space-time, i.e., there is no\ncritical tuning of the model parameters when scaling to the stochastic PDE\nlimit. The proof is done by pushing the methods developed in [arxiv 2304.14279,\narXiv 2311.09151] to their maximum, substantially weakening the assumptions and\nobtaining fairly sharp conditions under which one expects to see the SHE arise\nin a wide variety of random walk models in random media. In particular we are\nable to get rid of conditions such as nearest-neighbor interaction as well as\nspatial independence of quenched transition kernels. Moreover, we observe an\nentire hierarchy of moderate deviation exponents at which the SHE can be found,\nconfirming a physics prediction of J. Hass.",
            "pdf_url": "http://arxiv.org/pdf/2401.06073v2",
            "published": "2024-01-11 17:43:07+00:00",
            "updated": "2024-08-20 16:45:30+00:00"
        },
        {
            "title": "Confined phases at finite density in the Hardwall model",
            "authors": "Akash Singh, K. P. Yogendran",
            "summary": "AdS/QCD models are being extensively studied because they seem to offer an\nentirely tractable and radically different approach to the phases of QCD whose\nregion of validity is precisely the region of strong interactions. In this\ncontext, a missing ingredient has been the absence of a bulk description dual\nto a confined hadronic phase at finite baryon density. In this work, we discuss\na class of backgrounds that fill this lacuna. Applying physically motivated\nboundary conditions, we obtain phase diagrams which compare reasonably with\napproaches based on the PNJL model. We also show that such backgrounds can play\na similar role in geometries with a dilaton field.",
            "pdf_url": "http://arxiv.org/pdf/2408.10986v1",
            "published": "2024-08-20 16:29:56+00:00",
            "updated": "2024-08-20 16:29:56+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Transfusion: Predict the Next Token and Diffuse Images with One Multi-Modal Model",
            "authors": "Chunting Zhou, Lili Yu, Arun Babu, Kushal Tirumala, Michihiro Yasunaga, Leonid Shamis, Jacob Kahn, Xuezhe Ma, Luke Zettlemoyer, Omer Levy",
            "summary": "We introduce Transfusion, a recipe for training a multi-modal model over\ndiscrete and continuous data. Transfusion combines the language modeling loss\nfunction (next token prediction) with diffusion to train a single transformer\nover mixed-modality sequences. We pretrain multiple Transfusion models up to 7B\nparameters from scratch on a mixture of text and image data, establishing\nscaling laws with respect to a variety of uni- and cross-modal benchmarks. Our\nexperiments show that Transfusion scales significantly better than quantizing\nimages and training a language model over discrete image tokens. By introducing\nmodality-specific encoding and decoding layers, we can further improve the\nperformance of Transfusion models, and even compress each image to just 16\npatches. We further demonstrate that scaling our Transfusion recipe to 7B\nparameters and 2T multi-modal tokens produces a model that can generate images\nand text on a par with similar scale diffusion models and language models,\nreaping the benefits of both worlds.",
            "pdf_url": "http://arxiv.org/pdf/2408.11039v1",
            "published": "2024-08-20 17:48:20+00:00",
            "updated": "2024-08-20 17:48:20+00:00"
        },
        {
            "title": "Denoising Plane Wave Ultrasound Images Using Diffusion Probabilistic Models",
            "authors": "Hojat Asgariandehkordi, Sobhan Goudarzi, Mostafa Sharifzadeh, Adrian Basarab, Hassan Rivaz",
            "summary": "Ultrasound plane wave imaging is a cutting-edge technique that enables high\nframe-rate imaging. However, one challenge associated with high frame-rate\nultrasound imaging is the high noise associated with them, hindering their\nwider adoption. Therefore, the development of a denoising method becomes\nimperative to augment the quality of plane wave images. Drawing inspiration\nfrom Denoising Diffusion Probabilistic Models (DDPMs), our proposed solution\naims to enhance plane wave image quality. Specifically, the method considers\nthe distinction between low-angle and high-angle compounding plane waves as\nnoise and effectively eliminates it by adapting a DDPM to beamformed\nradiofrequency (RF) data. The method underwent training using only 400\nsimulated images. In addition, our approach employs natural image segmentation\nmasks as intensity maps for the generated images, resulting in accurate\ndenoising for various anatomy shapes. The proposed method was assessed across\nsimulation, phantom, and in vivo images. The results of the evaluations\nindicate that our approach not only enhances image quality on simulated data\nbut also demonstrates effectiveness on phantom and in vivo data in terms of\nimage quality. Comparative analysis with other methods underscores the\nsuperiority of our proposed method across various evaluation metrics. The\nsource code and trained model will be released along with the dataset at:\nhttp://code.sonography.ai",
            "pdf_url": "http://arxiv.org/pdf/2408.10987v1",
            "published": "2024-08-20 16:31:31+00:00",
            "updated": "2024-08-20 16:31:31+00:00"
        },
        {
            "title": "Kilometer-Scale Convection Allowing Model Emulation using Generative Diffusion Modeling",
            "authors": "Jaideep Pathak, Yair Cohen, Piyush Garg, Peter Harrington, Noah Brenowitz, Dale Durran, Morteza Mardani, Arash Vahdat, Shaoming Xu, Karthik Kashinath, Michael Pritchard",
            "summary": "Storm-scale convection-allowing models (CAMs) are an important tool for\npredicting the evolution of thunderstorms and mesoscale convective systems that\nresult in damaging extreme weather. By explicitly resolving convective dynamics\nwithin the atmosphere they afford meteorologists the nuance needed to provide\noutlook on hazard. Deep learning models have thus far not proven skilful at\nkm-scale atmospheric simulation, despite being competitive at coarser\nresolution with state-of-the-art global, medium-range weather forecasting. We\npresent a generative diffusion model called StormCast, which emulates the\nhigh-resolution rapid refresh (HRRR) model-NOAA's state-of-the-art 3km\noperational CAM. StormCast autoregressively predicts 99 state variables at km\nscale using a 1-hour time step, with dense vertical resolution in the\natmospheric boundary layer, conditioned on 26 synoptic variables. We present\nevidence of successfully learnt km-scale dynamics including competitive 1-6\nhour forecast skill for composite radar reflectivity alongside physically\nrealistic convective cluster evolution, moist updrafts, and cold pool\nmorphology. StormCast predictions maintain realistic power spectra for multiple\npredicted variables across multi-hour forecasts. Together, these results\nestablish the potential for autoregressive ML to emulate CAMs -- opening up new\nkm-scale frontiers for regional ML weather prediction and future climate hazard\ndynamical downscaling.",
            "pdf_url": "http://arxiv.org/pdf/2408.10958v1",
            "published": "2024-08-20 15:56:01+00:00",
            "updated": "2024-08-20 15:56:01+00:00"
        },
        {
            "title": "A Grey-box Attack against Latent Diffusion Model-based Image Editing by Posterior Collapse",
            "authors": "Zhongliang Guo, Lei Fang, Jingyu Lin, Yifei Qian, Shuai Zhao, Zeyu Wang, Junhao Dong, Cunjian Chen, Ognjen Arandjelović, Chun Pong Lau",
            "summary": "Recent advancements in generative AI, particularly Latent Diffusion Models\n(LDMs), have revolutionized image synthesis and manipulation. However, these\ngenerative techniques raises concerns about data misappropriation and\nintellectual property infringement. Adversarial attacks on machine learning\nmodels have been extensively studied, and a well-established body of research\nhas extended these techniques as a benign metric to prevent the underlying\nmisuse of generative AI. Current approaches to safeguarding images from\nmanipulation by LDMs are limited by their reliance on model-specific knowledge\nand their inability to significantly degrade semantic quality of generated\nimages. In response to these shortcomings, we propose the Posterior Collapse\nAttack (PCA) based on the observation that VAEs suffer from posterior collapse\nduring training. Our method minimizes dependence on the white-box information\nof target models to get rid of the implicit reliance on model-specific\nknowledge. By accessing merely a small amount of LDM parameters, in specific\nmerely the VAE encoder of LDMs, our method causes a substantial semantic\ncollapse in generation quality, particularly in perceptual consistency, and\ndemonstrates strong transferability across various model architectures.\nExperimental results show that PCA achieves superior perturbation effects on\nimage generation of LDMs with lower runtime and VRAM. Our method outperforms\nexisting techniques, offering a more robust and generalizable solution that is\nhelpful in alleviating the socio-technical challenges posed by the rapidly\nevolving landscape of generative AI.",
            "pdf_url": "http://arxiv.org/pdf/2408.10901v1",
            "published": "2024-08-20 14:43:53+00:00",
            "updated": "2024-08-20 14:43:53+00:00"
        },
        {
            "title": "BrainVis: Exploring the Bridge between Brain and Visual Signals via Image Reconstruction",
            "authors": "Honghao Fu, Zhiqi Shen, Jing Jih Chin, Hao Wang",
            "summary": "Analyzing and reconstructing visual stimuli from brain signals effectively\nadvances the understanding of human visual system. However, the EEG signals are\ncomplex and contain significant noise. This leads to substantial limitations in\nexisting works of visual stimuli reconstruction from EEG, such as difficulties\nin aligning EEG embeddings with the fine-grained semantic information and a\nheavy reliance on additional large self-collected dataset for training. To\naddress these challenges, we propose a novel approach called BrainVis. Firstly,\nwe divide the EEG signals into various units and apply a self-supervised\napproach on them to obtain EEG time-domain features, in an attempt to ease the\ntraining difficulty. Additionally, we also propose to utilize the\nfrequency-domain features to enhance the EEG representations. Then, we\nsimultaneously align EEG time-frequency embeddings with the interpolation of\nthe coarse and fine-grained semantics in the CLIP space, to highlight the\nprimary visual components and reduce the cross-modal alignment difficulty.\nFinally, we adopt the cascaded diffusion models to reconstruct images. Using\nonly 10\\% training data of the previous work, our proposed BrainVis outperforms\nstate of the arts in both semantic fidelity reconstruction and generation\nquality. The code is available at https://github.com/RomGai/BrainVis.",
            "pdf_url": "http://arxiv.org/pdf/2312.14871v2",
            "published": "2023-12-22 17:49:11+00:00",
            "updated": "2024-08-20 14:06:39+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "The Evolution of Reinforcement Learning in Quantitative Finance",
            "authors": "Nikolaos Pippas, Cagatay Turkay, Elliot A. Ludvig",
            "summary": "Reinforcement Learning (RL) has experienced significant advancement over the\npast decade, prompting a growing interest in applications within finance. This\nsurvey critically evaluates 167 publications, exploring diverse RL applications\nand frameworks in finance. Financial markets, marked by their complexity,\nmulti-agent nature, information asymmetry, and inherent randomness, serve as an\nintriguing test-bed for RL. Traditional finance offers certain solutions, and\nRL advances these with a more dynamic approach, incorporating machine learning\nmethods, including transfer learning, meta-learning, and multi-agent solutions.\nThis survey dissects key RL components through the lens of Quantitative\nFinance. We uncover emerging themes, propose areas for future research, and\ncritique the strengths and weaknesses of existing methods.",
            "pdf_url": "http://arxiv.org/pdf/2408.10932v1",
            "published": "2024-08-20 15:15:10+00:00",
            "updated": "2024-08-20 15:15:10+00:00"
        }
    ]
}