{
    "Physics": [
        {
            "title": "What is the Hierarchy Problem?",
            "authors": "Michael E. Peskin",
            "summary": "Is there a Hierarchy Problem? If so, what, exactly, is the problem? Almost\nevery theorist has a personal answer to these questions. In this article, I\ngive my answers. I will explain that the Hierarchy Problem is not a formal\nproblem but rather our ignorance of a crucial physics explanation -- the\nexplanation of the nature of the Higgs boson. Without the solution to this\nproblem, we cannot make progress on the major questions of our field.",
            "pdf_url": "http://arxiv.org/pdf/2505.00694v1",
            "published": "2025-05-01 17:55:26+00:00",
            "updated": "2025-05-01 17:55:26+00:00"
        },
        {
            "title": "Physical Limits and Optimal Synthesis of Beyond Diagonal Anomalous Scatterers",
            "authors": "Mats Gustafsson",
            "summary": "Realizing metasurfaces for anomalous scattering is fundamental to designing\nreflector arrays, reconfigurable intelligent surfaces, and metasurface\nantennas. However, the basic cost of steering scattering into non-specular\ndirections is not fully understood. This paper derives tight physical bounds on\nanomalous scattering using antenna array systems equipped with non-local\nmatching networks. The matching networks are explicitly synthesized based on\nthe solutions of the optimization problems that define these bounds.\nFurthermore, we analyze fundamental limits for metasurface antennas implemented\nwith metallic and dielectric materials exhibiting minimal loss within a finite\ndesign region. The results reveal a typical 6dB reduction in bistatic radar\ncross section (RCS) in anomalous directions compared to the forward direction.\nNumerical examples complement the theory and illustrate the inherent cost of\nachieving anomalous scattering relative to forward or specular scattering for\ncanonical configurations.",
            "pdf_url": "http://arxiv.org/pdf/2505.00691v1",
            "published": "2025-05-01 17:53:04+00:00",
            "updated": "2025-05-01 17:53:04+00:00"
        },
        {
            "title": "Action-Minimization Meets Generative Modeling: Efficient Transition Path Sampling with the Onsager-Machlup Functional",
            "authors": "Sanjeev Raja, Martin Šípka, Michael Psenka, Tobias Kreiman, Michal Pavelka, Aditi S. Krishnapriyan",
            "summary": "Transition path sampling (TPS), which involves finding probable paths\nconnecting two points on an energy landscape, remains a challenge due to the\ncomplexity of real-world atomistic systems. Current machine learning approaches\nuse expensive, task-specific, and data-free training procedures, limiting their\nability to benefit from recent advances in atomistic machine learning, such as\nhigh-quality datasets and large-scale pre-trained models. In this work, we\naddress TPS by interpreting candidate paths as trajectories sampled from\nstochastic dynamics induced by the learned score function of pre-trained\ngenerative models, specifically denoising diffusion and flow matching. Under\nthese dynamics, finding high-likelihood transition paths becomes equivalent to\nminimizing the Onsager-Machlup (OM) action functional. This enables us to\nrepurpose pre-trained generative models for TPS in a zero-shot manner, in\ncontrast with bespoke, task-specific TPS models trained in previous work. We\ndemonstrate our approach on varied molecular systems, obtaining diverse,\nphysically realistic transition pathways and generalizing beyond the\npre-trained model's original training dataset. Our method can be easily\nincorporated into new generative models, making it practically relevant as\nmodels continue to scale and improve with increased data availability.",
            "pdf_url": "http://arxiv.org/pdf/2504.18506v2",
            "published": "2025-04-25 17:17:17+00:00",
            "updated": "2025-05-01 17:52:23+00:00"
        },
        {
            "title": "TumorTwin: A python framework for patient-specific digital twins in oncology",
            "authors": "Michael Kapteyn, Anirban Chaudhuri, Ernesto A. B. F. Lima, Graham Pash, Rafael Bravo, Karen Willcox, Thomas E. Yankeelov, David A. Hormuth II",
            "summary": "Background: Advances in the theory and methods of computational oncology have\nenabled accurate characterization and prediction of tumor growth and treatment\nresponse on a patient-specific basis. This capability can be integrated into a\ndigital twin framework in which bi-directional data-flow between the physical\ntumor and the digital tumor facilitate dynamic model re-calibration,\nuncertainty quantification, and clinical decision-support via recommendation of\noptimal therapeutic interventions. However, many digital twin frameworks rely\non bespoke implementations tailored to each disease site, modeling choice, and\nalgorithmic implementation.\n  Findings: We present TumorTwin, a modular software framework for\ninitializing, updating, and leveraging patient-specific cancer tumor digital\ntwins. TumorTwin is publicly available as a Python package, with associated\ndocumentation, datasets, and tutorials. Novel contributions include the\ndevelopment of a patient-data structure adaptable to different disease sites, a\nmodular architecture to enable the composition of different data, model,\nsolver, and optimization objects, and CPU- or GPU-parallelized implementations\nof forward model solves and gradient computations. We demonstrate the\nfunctionality of TumorTwin via an in silico dataset of high-grade glioma growth\nand response to radiation therapy.\n  Conclusions: The TumorTwin framework enables rapid prototyping and testing of\nimage-guided oncology digital twins. This allows researchers to systematically\ninvestigate different models, algorithms, disease sites, or treatment decisions\nwhile leveraging robust numerical and computational infrastructure.",
            "pdf_url": "http://arxiv.org/pdf/2505.00670v1",
            "published": "2025-05-01 17:20:20+00:00",
            "updated": "2025-05-01 17:20:20+00:00"
        },
        {
            "title": "Why the hyperbolic polaritons are hyperbolic?",
            "authors": "Xiaoyu Xiong, Le Zhou, Yihang Fan, Weipeng Wang, Yongzheng Wen, Yang Shen, Zhengjun Zhang, Jingbo Sun, Ji Zhou",
            "summary": "Polaritons travelling along a hyperbolic medium's surface have recently\nsparked significant interest in nanophotonics for the unprecedented\nmanipulation ability on light at the nanoscale in a planar way, promising\npotential nano-optical applications, especially in two-dimensional circuitry.\nDespite of being named hyperbolic polaritons, the hyperbolic nature has not\nbeen thoroughly revealed since an analytical description of the Iso-frequency\ncontour is still elusive. In this work, we proposed an analytical form for\ndescribing the iso-frequency contour of the hyperbolic polaritons, showcasing\ntheir strictly hyperbolic nature. Such an analytical form is obtained based on\nthe focusing behavior of the hyperbolic polaritons and verified by both the\npublished data from commonly used hyperbolic media systems of the hyperbolic\npolaritons and our own experimental characterizations on a hyperbolic\nmetamaterial film. By presenting a concise and intuitive physical image, this\nwork may provide a groundbreaking methodology in developing novel hyperbolic\npolaritons based optical devices.",
            "pdf_url": "http://arxiv.org/pdf/2505.00655v1",
            "published": "2025-05-01 16:57:35+00:00",
            "updated": "2025-05-01 16:57:35+00:00"
        },
        {
            "title": "Deep Learning Assisted Outer Volume Removal for Highly-Accelerated Real-Time Dynamic MRI",
            "authors": "Merve Gülle, Sebastian Weingärtner, Mehmet Akçakaya",
            "summary": "Real-time (RT) dynamic MRI plays a vital role in capturing rapid\nphysiological processes, offering unique insights into organ motion and\nfunction. Among these applications, RT cine MRI is particularly important for\nfunctional assessment of the heart with high temporal resolution. RT imaging\nenables free-breathing, ungated imaging of cardiac motion, making it a crucial\nalternative for patients who cannot tolerate conventional breath-hold,\nECG-gated acquisitions. However, achieving high acceleration rates in RT cine\nMRI is challenging due to aliasing artifacts from extra-cardiac tissues,\nparticularly at high undersampling factors. In this study, we propose a novel\nouter volume removal (OVR) method to address this challenge by eliminating\naliasing contributions from non-cardiac regions in a post-processing framework.\nOur approach estimates the outer volume signal for each timeframe using\ncomposite temporal images from time-interleaved undersampling patterns, which\ninherently contain pseudo-periodic ghosting artifacts. A deep learning (DL)\nmodel is trained to identify and remove these artifacts, producing a clean\nouter volume estimate that is subsequently subtracted from the corresponding\nk-space data. The final reconstruction is performed with a physics-driven DL\n(PD-DL) method trained using an OVR-specific loss function to restore high\nspatio-temporal resolution images. Experimental results show that the proposed\nmethod at high accelerations achieves image quality that is visually comparable\nto clinical baseline images, while outperforming conventional reconstruction\ntechniques, both qualitatively and quantitatively. The proposed approach\nprovides a practical and effective solution for artifact reduction in RT cine\nMRI without requiring acquisition modifications, offering a pathway to higher\nacceleration rates while preserving diagnostic quality.",
            "pdf_url": "http://arxiv.org/pdf/2505.00643v1",
            "published": "2025-05-01 16:31:52+00:00",
            "updated": "2025-05-01 16:31:52+00:00"
        },
        {
            "title": "The heat flow conjecture for polynomials and random matrices",
            "authors": "Brian C. Hall, Ching-Wei Ho",
            "summary": "We study the evolution of the roots of a polynomial of degree $N$, when the\npolynomial itself is evolving according to the heat flow. We propose a general\nconjecture for the large-$N$ limit of this evolution. Specifically, we propose\n(1) that the log potential of the limiting root distribution should evolve\naccording to a certain first-order, nonlinear PDE, and (2) that the limiting\nroot distribution at a general time should be the push-forward of the initial\ndistribution under a certain explicit transport map. These results should hold\nfor sufficiently small times, that is, until singularities begin to form.\n  We offer three lines of reasoning in support of our conjecture. First, from a\nrandom matrix perspective, the conjecture is supported by a deformation theorem\nfor the second moment of the characteristic polynomial of certain random matrix\nmodels. Second, from a dynamical systems perspective, the conjecture is\nsupported by the computation of the second derivative of the roots with respect\nto time, which is formally small before singularities form. Third, from a PDE\nperspective, the conjecture is supported by the exact PDE\\ satisfied by the log\npotential of the empirical root distribution of the polynomial, which formally\nconverges to the desired PDE as $N\\rightarrow \\infty.$ We also present a\n\"multiplicative\" version of the the conjecture, supported by similar arguments.\n  Finally, we verify rigorously that the conjectures hold at the level of the\nholomorphic moments.",
            "pdf_url": "http://arxiv.org/pdf/2202.09660v4",
            "published": "2022-02-19 19:03:57+00:00",
            "updated": "2025-05-01 16:28:01+00:00"
        },
        {
            "title": "SA-GAT-SR: Self-Adaptable Graph Attention Networks with Symbolic Regression for high-fidelity material property prediction",
            "authors": "Liu Junchi, Tang Ying, Tretiak Sergei, Duan Wenhui, Zhou Liujiang",
            "summary": "Recent advances in machine learning have demonstrated an enormous utility of\ndeep learning approaches, particularly Graph Neural Networks (GNNs) for\nmaterials science. These methods have emerged as powerful tools for\nhigh-throughput prediction of material properties, offering a compelling\nenhancement and alternative to traditional first-principles calculations. While\nthe community has predominantly focused on developing increasingly complex and\nuniversal models to enhance predictive accuracy, such approaches often lack\nphysical interpretability and insights into materials behavior. Here, we\nintroduce a novel computational paradigm, Self-Adaptable Graph Attention\nNetworks integrated with Symbolic Regression (SA-GAT-SR), that synergistically\ncombines the predictive capability of GNNs with the interpretative power of\nsymbolic regression. Our framework employs a self-adaptable encoding algorithm\nthat automatically identifies and adjust attention weights so as to screen\ncritical features from an expansive 180-dimensional feature space while\nmaintaining O(n) computational scaling. The integrated SR module subsequently\ndistills these features into compact analytical expressions that explicitly\nreveal quantum-mechanically meaningful relationships, achieving 23 times\nacceleration compared to conventional SR implementations that heavily rely on\nfirst principle calculations-derived features as input. This work suggests a\nnew framework in computational materials science, bridging the gap between\npredictive accuracy and physical interpretability, offering valuable physical\ninsights into material behavior.",
            "pdf_url": "http://arxiv.org/pdf/2505.00625v1",
            "published": "2025-05-01 16:05:10+00:00",
            "updated": "2025-05-01 16:05:10+00:00"
        },
        {
            "title": "ParkDiffusion: Heterogeneous Multi-Agent Multi-Modal Trajectory Prediction for Automated Parking using Diffusion Models",
            "authors": "Jiarong Wei, Niclas Vödisch, Anna Rehr, Christian Feist, Abhinav Valada",
            "summary": "Automated parking is a critical feature of Advanced Driver Assistance Systems\n(ADAS), where accurate trajectory prediction is essential to bridge perception\nand planning modules. Despite its significance, research in this domain remains\nrelatively limited, with most existing studies concentrating on single-modal\ntrajectory prediction of vehicles. In this work, we propose ParkDiffusion, a\nnovel approach that predicts the trajectories of both vehicles and pedestrians\nin automated parking scenarios. ParkDiffusion employs diffusion models to\ncapture the inherent uncertainty and multi-modality of future trajectories,\nincorporating several key innovations. First, we propose a dual map encoder\nthat processes soft semantic cues and hard geometric constraints using a\ntwo-step cross-attention mechanism. Second, we introduce an adaptive agent type\nembedding module, which dynamically conditions the prediction process on the\ndistinct characteristics of vehicles and pedestrians. Third, to ensure\nkinematic feasibility, our model outputs control signals that are subsequently\nused within a kinematic framework to generate physically feasible trajectories.\nWe evaluate ParkDiffusion on the Dragon Lake Parking (DLP) dataset and the\nIntersections Drone (inD) dataset. Our work establishes a new baseline for\nheterogeneous trajectory prediction in parking scenarios, outperforming\nexisting methods by a considerable margin.",
            "pdf_url": "http://arxiv.org/pdf/2505.00586v1",
            "published": "2025-05-01 15:16:59+00:00",
            "updated": "2025-05-01 15:16:59+00:00"
        },
        {
            "title": "A continuum thermodynamic model of the influence of non-ionic surfactant on mass transfer from gas bubbles",
            "authors": "Dieter Bothe, Akio Tomiyama",
            "summary": "Mass transfer of gaseous components from rising bubbles to the ambient liquid\ndepends not only on the chemical potential difference of the transfer component\nbut also on the interfacial free energy and composition. The latter is strongly\naffected by surface active agents that are present in many applications.\nSurfactants lead to local changes in the interfacial tension, which influence\nthe mass transfer rates in two different ways. On the one hand, inhomogeneous\ninterfacial tension leads to Marangoni stress, which can strongly change the\nlocal hydrodynamics. One the other hand, the coverage by surfactant molecules\nresults in a mass transfer resistance. This hindrance effect is not included in\ncurrent continuum physical models. The present work provides the experimental\nvalidation of a recently introduced extended sharp-interface model for\ntwo-phase flows with mass transfer that also accounts for the mass transfer\nhindrance due to adsorbed surfactant. The crucial feature is to account for\narea-specific concentrations not only of adsorbed constituents but also of\ntransfer species, and to model mass transfer as a series of two bi-directional\nsorption-type bulk-interface exchange processes. The resulting model is shown\nto quantitatively describe experimental measurements on mass transfer reduction\nfor the dissolution of CO$_2$ bubbles in different surfactant solutions.",
            "pdf_url": "http://arxiv.org/pdf/2505.00581v1",
            "published": "2025-05-01 15:12:04+00:00",
            "updated": "2025-05-01 15:12:04+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Gaussian Mixture Flow Matching Models",
            "authors": "Hansheng Chen, Kai Zhang, Hao Tan, Zexiang Xu, Fujun Luan, Leonidas Guibas, Gordon Wetzstein, Sai Bi",
            "summary": "Diffusion models approximate the denoising distribution as a Gaussian and\npredict its mean, whereas flow matching models reparameterize the Gaussian mean\nas flow velocity. However, they underperform in few-step sampling due to\ndiscretization error and tend to produce over-saturated colors under\nclassifier-free guidance (CFG). To address these limitations, we propose a\nnovel Gaussian mixture flow matching (GMFlow) model: instead of predicting the\nmean, GMFlow predicts dynamic Gaussian mixture (GM) parameters to capture a\nmulti-modal flow velocity distribution, which can be learned with a KL\ndivergence loss. We demonstrate that GMFlow generalizes previous diffusion and\nflow matching models where a single Gaussian is learned with an $L_2$ denoising\nloss. For inference, we derive GM-SDE/ODE solvers that leverage analytic\ndenoising distributions and velocity fields for precise few-step sampling.\nFurthermore, we introduce a novel probabilistic guidance scheme that mitigates\nthe over-saturation issues of CFG and improves image generation quality.\nExtensive experiments demonstrate that GMFlow consistently outperforms flow\nmatching baselines in generation quality, achieving a Precision of 0.942 with\nonly 6 sampling steps on ImageNet 256$\\times$256.",
            "pdf_url": "http://arxiv.org/pdf/2504.05304v2",
            "published": "2025-04-07 17:59:42+00:00",
            "updated": "2025-05-01 17:23:22+00:00"
        },
        {
            "title": "Generative Predictive Control: Flow Matching Policies for Dynamic and Difficult-to-Demonstrate Tasks",
            "authors": "Vince Kurtz, Joel W. Burdick",
            "summary": "Generative control policies have recently unlocked major progress in\nrobotics. These methods produce action sequences via diffusion or flow\nmatching, with training data provided by demonstrations. But existing methods\ncome with two key limitations: they require expert demonstrations, which can be\ndifficult to obtain, and they are limited to relatively slow, quasi-static\ntasks. In this paper, we leverage a tight connection between sampling-based\npredictive control and generative modeling to address each of these issues. In\nparticular, we introduce generative predictive control, a supervised learning\nframework for tasks with fast dynamics that are easy to simulate but difficult\nto demonstrate. We then show how trained flow-matching policies can be\nwarm-started at inference time, maintaining temporal consistency and enabling\nhigh-frequency feedback. We believe that generative predictive control offers a\ncomplementary approach to existing behavior cloning methods, and hope that it\npaves the way toward generalist policies that extend beyond quasi-static\ndemonstration-oriented tasks.",
            "pdf_url": "http://arxiv.org/pdf/2502.13406v2",
            "published": "2025-02-19 03:33:01+00:00",
            "updated": "2025-05-01 17:23:06+00:00"
        },
        {
            "title": "Conditional Diffusion-Based Retrieval of Atmospheric CO2 from Earth Observing Spectroscopy",
            "authors": "William R. Keely, Otto Lamminpää, Steffen Mauceri, Sean M. R. Crowell, Christopher W. O'Dell, Gregory R. McGarragh",
            "summary": "Satellite-based estimates of greenhouse gas (GHG) properties from\nobservations of reflected solar spectra are integral for understanding and\nmonitoring complex terrestrial systems and their impact on the carbon cycle due\nto their near global coverage. Known as retrieval, making GHG concentration\nestimations from these observations is a non-linear Bayesian inverse problem,\nwhich is operationally solved using a computationally expensive algorithm\ncalled Optimal Estimation (OE), providing a Gaussian approximation to a\nnon-Gaussian posterior. This leads to issues in solver algorithm convergence,\nand to unrealistically confident uncertainty estimates for the retrieved\nquantities. Upcoming satellite missions will provide orders of magnitude more\ndata than the current constellation of GHG observers. Development of fast and\naccurate retrieval algorithms with robust uncertainty quantification is\ncritical. Doing so stands to provide substantial climate impact of moving\ntowards the goal of near continuous real-time global monitoring of carbon\nsources and sinks which is essential for policy making. To achieve this goal,\nwe propose a diffusion-based approach to flexibly retrieve a Gaussian or\nnon-Gaussian posterior, for NASA's Orbiting Carbon Observatory-2 spectrometer,\nwhile providing a substantial computational speed-up over the current\noperational state-of-the-art.",
            "pdf_url": "http://arxiv.org/pdf/2504.17074v3",
            "published": "2025-04-23 19:46:18+00:00",
            "updated": "2025-05-01 16:24:15+00:00"
        }
    ]
}