{
    "Physics": [
        {
            "title": "Scintillating Fibre Detector for the Mu3e Experiment",
            "authors": "Robert Mihai Amarinei",
            "summary": "We present a compact scintillating fibre timing detector developed for the\nMu3e experiment. Mu3e is one of the flagship experiments of the Swiss particle\nphysics scene, aiming to search for the charged lepton flavour violating\n(neutrinoless) muon decay $\\mu^+ \\rightarrow e^+e^-e^+$. Mu3e is planned to\nstart taking data in 2025 at the Paul Scherrer Institute in Switzerland, using\nthe most intense continuous surface muon beam in the world (10$^8$ muons per\nsecond).\n  At the University of Geneva, together with partners from ETH Zurich, we are\ndeveloping a scintillating fibre detector formed by staggering three layers of\n250 $\\mu m$ diameter round scintillating fibres. The fibre ribbons are coupled\nat both ends to multi-channel silicon photo-multiplier arrays, which are read\nout with the MuTRiG ASIC, specifically developed for this experiment.\n  This presentation is focused on the performances of the scintillating fibre\ndetector, notably on the time resolution around 250 ps, the efficiency greater\nthan 97\\% and the spatial resolution of $\\sim$ 100 $\\mu m$. In this\npresentation, we also include the challenges overcome to build this very thin\nscintillating fibre detector, having a thickness smaller than 0.2\\% of the\nradiation length. Furthermore, we discuss the operation and performance of the\nMuTRiG ASIC, used for reading out the 3072 channels of the fibre detector.",
            "pdf_url": "http://arxiv.org/pdf/2501.14692v1",
            "published": "2025-01-24 18:05:25+00:00",
            "updated": "2025-01-24 18:05:25+00:00"
        },
        {
            "title": "Upgrades and maintenance of the CRYRING@ESR electron cooler for improved internal electron target operation",
            "authors": "Athanasios Koutsostathis, Claude Krantz, Elena-Oana Hanu, Frank Herfurth, Regina Heß, Wolfgang Kaufmann, Michael Lestinsky, Mirko Dieter Looshorn, Esther Babette Menz, Andreas Reiter, Jon Roßbach, Stefan Schippers, Phe Man Suherman",
            "summary": "The electron cooler of the CRYRING@ESR storage ring at the GSI-FAIR\naccelerator complex is a unique instrument, which not only provides beam\ncooling of the stored ions, but also serves as a low-energy electron target for\nDielectronic Recombination experiments. The minimisation of vacuum\ncontamination and the response to rapid energy changes are key requirements of\nthe cooler in electron target mode. Therefore, a test bench was prepared to\nstudy the outgassing behaviour of the electron gun components and a setup was\nconstructed to evaluate the drift-electrode-modulation of the acceleration\nvoltage of the cooler. The vacuum studies showed that the electron gun cathode\nwas severely malfunctioning and resulted in its replacement. The\ndrift-electrode-modulation of the acceleration voltage showed significant\nimprovements compared to direct modulation of the terminal voltage of the\ncooler.",
            "pdf_url": "http://arxiv.org/pdf/2501.14690v1",
            "published": "2025-01-24 18:03:46+00:00",
            "updated": "2025-01-24 18:03:46+00:00"
        },
        {
            "title": "Artificial Intelligence Could Have Predicted All Space Weather Events Associated with the May 2024 Superstorm",
            "authors": "Sabrina Guastavino, Edoardo Legnaro, Anna Maria Massone, Michele Piana",
            "summary": "Space weather, driven by solar flares and Coronal Mass Ejections (CMEs),\nposes significant risks to technological systems. Accurately forecasting these\nevents and their impact on Earth's magnetosphere remains a challenge because of\nthe complexity of solar-terrestrial interactions. This study applied artificial\nintelligence (AI) to predict the chain of events associated with the May $2024$\nsuperstorm, including solar flares from NOAA active region 13644,\nEarth-directed CMEs, and a violent geomagnetic storm. Using magnetogram\ncut-outs, a Vision Transformer was able to classify the evolution of the active\nregion morphologies, and a video-based deep learning method predicted the\noccurrence of solar flares; a physics-driven model improved the precision of\nCME travel-time prediction using coronal observations and solar wind\nmeasurements; and a data-driven method exploited these in situ measurements to\nsound alerts of the geomagnetic storm unrolled over time. The results showed\nunprecedented accuracy in predicting CME arrival with uncertainty as small as\none minute. Moreover, these AI models outperformed traditional methods in\npredicting solar flares occurrences, onset, and recovery phases of the\ngeomagnetic storm. These findings highlight the impressive potential of AI for\nspace weather forecasting and as a tool to mitigate the impact of extreme solar\nevents on critical infrastructure.",
            "pdf_url": "http://arxiv.org/pdf/2501.14684v1",
            "published": "2025-01-24 18:00:15+00:00",
            "updated": "2025-01-24 18:00:15+00:00"
        },
        {
            "title": "How deep is the dip and how tall are the wiggles in inflationary power spectra?",
            "authors": "Vadim Briaud, Alexandros Karam, Niko Koivunen, Eemeli Tomberg, Hardi Veermäe, Vincent Vennin",
            "summary": "We study linear scalar perturbations in single-field models of inflation\nfeaturing a non-attractor phase. These models lead to a peak in the curvature\npower spectrum that may result in the formation of primordial black holes. We\ndevelop a transfer-matrix formalism, analogous to the S-matrix program in\nquantum-field theory, that maps perturbations throughout the transitory phase.\nAt scales smaller than the peak, the power spectrum features damped\noscillations, and the duration of the transition sets the scale at which\npower-law damping switches to exponential damping. At scales larger than the\npeak, we demonstrate that a dip appears in the power spectrum if and only if\nthe inflaton's velocity does not flip sign. We show that the amplitude at the\ndip always scales as the inverse square-rooted amplitude of the peak, and\ncomment on the physical consequences of this universal relationship. We also\ntest the robustness of our results with a few toy models and interpret them\nwith an intuitive mechanical analogy.",
            "pdf_url": "http://arxiv.org/pdf/2501.14681v1",
            "published": "2025-01-24 17:58:44+00:00",
            "updated": "2025-01-24 17:58:44+00:00"
        },
        {
            "title": "The Mu3e Experiment: Status and Short-Term Plans",
            "authors": "Robert Mihai Amarinei",
            "summary": "Mu3e is an experiment currently under construction at the Paul Scherrer\nInstitute in Switzerland, designed to search for the Lepton Flavor Violating\n(LFV) decay $\\mu^+ \\rightarrow e^+e^-e^+$. In extensions of the Standard Model\n(SM) that account for neutrino masses, this decay is theoretically allowed but\noccurs only through extremely rare loop processes, with a predicted branching\nratio of approximately $\\mathcal{O}(10^{-54})$. Such a small probability\nimplies that any observation of this decay would provide clear evidence for\nphysics beyond the SM.\n  The Mu3e experiment aims to probe the $\\mu^+ \\rightarrow e^+e^-e^+$ decay\nwith a sensitivity of approximately $\\mathcal{O}(10^{-15})$ in its Phase-1 and\nplans to achieve a sensitivity of $\\mathcal{O}(10^{-16})$ after future\nupgrades. To reach its Phase-1 ambitious goals, Mu3e is going to use the most\nintense continuous muon beam in the world, generating 10$^{8}$ muon stops per\nsecond in the target placed at the center of the Mu3e.\n  Mu3e will use three main technologies for particle detection. The tracking\nwill done through ultra-thin (50 - 70 $\\mu m$) pixel detectors based on MuPix11\nsensors. These are high-voltage monolithic active pixel sensors (HV-MAPS) with\na $\\sim$ 23~$\\mu$m spatial resolution. The timing will be done through\nscintillating fibres ($\\sim$ 250 ps) and tiles ($\\sim$ 40 ps), coupled to\nsilicon photomultipliers and read out by MuTRiG3 ASICs. A triggerless DAQ\nsystem based on FPGAs will collect data from the detectors, which will then\nundergo reconstruction in a GPU filter farm. The assembly of the detectors has\nstarted, with a detector commissioning beam time planned for 2025. This\ndocument reports on the status of the construction, installation, and\ndata-taking plans for the near future.",
            "pdf_url": "http://arxiv.org/pdf/2501.14667v1",
            "published": "2025-01-24 17:43:18+00:00",
            "updated": "2025-01-24 17:43:18+00:00"
        },
        {
            "title": "Emittance Minimization for Aberration Correction II: Physics-informed Bayesian Optimization of an Electron Microscope",
            "authors": "Desheng Ma, Steven E. Zeltmann, Chenyu Zhang, Zhaslan Baraissov, Yu-Tsun Shao, Cameron Duncan, Jared Maxson, Auralee Edelen, David A. Muller",
            "summary": "Aberration-corrected Scanning Transmission Electron Microscopy (STEM) has\nbecome an essential tool in understanding materials at the atomic scale.\nHowever, tuning the aberration corrector to produce a sub-{\\AA}ngstr\\\"om probe\nis a complex and time-costly procedure, largely due to the difficulty of\nprecisely measuring the optical state of the system. When measurements are both\ncostly and noisy, Bayesian methods provide rapid and efficient optimization. To\nthis end, we develop a Bayesian approach to fully automate the process by\nminimizing a new quality metric, beam emittance, which is shown to be\nequivalent to performing aberration correction. In part I, we derived several\nimportant properties of the beam emittance metric and trained a deep neural\nnetwork to predict beam emittance growth from a single Ronchigram. Here we use\nthis as the black box function for Bayesian Optimization and demonstrate\nautomated tuning of simulated and real electron microscopes. We explore\ndifferent surrogate functions for the Bayesian optimizer and implement a deep\nneural network kernel to effectively learn the interactions between different\ncontrol channels without the need to explicitly measure a full set of\naberration coefficients. Both simulation and experimental results show the\nproposed method outperforms conventional approaches by achieving a better\noptical state with a higher convergence rate.",
            "pdf_url": "http://arxiv.org/pdf/2412.20356v2",
            "published": "2024-12-29 05:27:25+00:00",
            "updated": "2025-01-24 16:40:42+00:00"
        },
        {
            "title": "Nonlinear Hall Effect in Two-dimensional Materials",
            "authors": "Shuo Wang, Wei Niu, Yue-Wen Fang",
            "summary": "Symmetry is a cornerstone of condensed matter physics, fundamentally shaping\nthe behavior of electronic systems and inducing the emergence of novel\nphenomena. The Hall effect, a key concept in this field, demonstrates how\nsymmetry breaking, particularly of time-reversal symmetry, influences\nelectronic transport properties. Recently, the nonlinear Hall effect has\nextended this understanding by generating a transverse voltage that modulates\nat twice the frequency of the driving alternating current without breaking\ntime-reversal symmetry. This effect is closely tied to the symmetry and quantum\ngeometric properties of materials, offering a new approach to probing the Berry\ncurvature and quantum metric. Here, we provide a review of the theoretical\ninsights and experimental advancements in the nonlinear Hall effect,\nparticularly focusing on its realization in two-dimensional materials. We\ndiscuss the challenges still ahead, look at potential applications for devices,\nand explore how these ideas might apply to other nonlinear transport phenomena.\nBy elucidating these aspects, this review aims to advance the understanding of\nnonlinear transport effects and their broader implications for future\ntechnologies.",
            "pdf_url": "http://arxiv.org/pdf/2412.09298v2",
            "published": "2024-12-12 14:16:14+00:00",
            "updated": "2025-01-24 16:36:11+00:00"
        },
        {
            "title": "Single-neuron deep generative model uncovers underlying physics of neuronal activity in Ca imaging data",
            "authors": "Jordi Abante, Angelo Piga, Berta Ros, Clara F López-León, Josep M Canals, Jordi Soriano",
            "summary": "Calcium imaging has become a powerful alternative to electrophysiology for\nstudying neuronal activity, offering spatial resolution and the ability to\nmeasure large populations of neurons in a minimally invasive manner. This\ntechnique has broad applications in neuroscience, neuroengineering, and\nmedicine, enabling researchers to explore the relationship between neuron\nlocation and activity. Recent advancements in deep generative models (DGMs)\nhave facilitated the modeling of neuronal population dynamics, uncovering\nlatent representations that provide insights into behavior prediction and\nneuronal variance. However, these models often rely on spike inference\nalgorithms and primarily focus on population-level dynamics, limiting their\napplicability for single-neuron analyses. To address this gap, we propose a\nnovel framework for single-neuron representation learning using autoregressive\nvariational autoencoders (AVAEs). Our approach embeds individual neurons'\nspatiotemporal signals into a reduced-dimensional space without the need for\nspike inference algorithms. The AVAE excels over traditional linear methods by\ngenerating more informative and discriminative latent representations,\nimproving tasks such as visualization, clustering, and the understanding of\nneuronal activity. Additionally, the reconstruction performance of the AVAE\noutperforms the state of the art, demonstrating its ability to accurately\nrecover the original fluorescence signal from the learned representation. Using\nrealistic simulations, we show that our model captures underlying physical\nproperties and connectivity patterns, enabling it to distinguish between\ndifferent firing and connectivity types. These findings position the AVAE as a\nversatile and powerful tool for advancing single-neuron analysis and lays the\ngroundwork for future integration of multimodal single-cell datasets in\nneuroscience.",
            "pdf_url": "http://arxiv.org/pdf/2501.14615v1",
            "published": "2025-01-24 16:33:52+00:00",
            "updated": "2025-01-24 16:33:52+00:00"
        },
        {
            "title": "Unmixing sub-leading Regge trajectories of $\\mathcal{N} = 4$ Super-Yang-Mills",
            "authors": "Julius Julius, Nika Sergeevna Sokolova",
            "summary": "We study the conformal field theory data (CFT-data) of planar 4D $\\mathcal{N}\n= 4$ Super-Yang-Mills theory in the strong 't Hooft coupling limit. This regime\nexplores the physics of massive short strings in the flat-space limit of the\ndual AdS. We focus on the CFT-data of the massive short strings exchanged in\nthe operator product expansion (OPE) of the four-point function dual to the\nVirasoro-Shapiro amplitude. This CFT-data arranges itself into Regge\ntrajectories in the flat-space limit. Using inputs from recent advances in the\ncomputation of the AdS Virasoro-Shapiro amplitude, integrability, and a\nstipulation based on analyticity of the CFT-data in spin, we are able to fix\nall the CFT-data on the four unique sub-leading Regge trajectories, at leading\nnon-trivial order, as a function of the string-mass level. One of our\npredictions is that one of the four unique sub-leading Regge trajectories\ndecouples from the OPE in the flat-space limit. This hints at an emergent\nselection rule in the flat-space limit, similar to our previous results in\narXiv:2310.06041. Our procedure should be applicable in a variety of similar\nsetups like for the AdS Veneziano amplitude or in ABJM.",
            "pdf_url": "http://arxiv.org/pdf/2409.07529v2",
            "published": "2024-09-11 18:00:05+00:00",
            "updated": "2025-01-24 15:56:57+00:00"
        },
        {
            "title": "The standard no-signalling constraints in Bell scenarios are neither sufficient nor necessary for preventing superluminal signalling with general interventions",
            "authors": "V. Vilasini, Roger Colbeck",
            "summary": "Non-classical correlations resulting from entangled quantum systems have\nsparked debates about the compatibility of quantum theory and relativity, and\nabout the right way to think about causation. Key to a causal theory is that\nsuperluminal signalling is forbidden, which holds in quantum theory. In Bell\nscenarios, relativistic causality principles like no superluminal signalling\nare often assumed to follow from the standard no-signalling constraints on\ncorrelations. We explore the connections between a range of relativistic\nprinciples, including no superluminal signalling and no causal loops, and\nconstraints on correlations that can arise with arbitrary interventions, within\nmulti-party Bell scenarios. This includes standard no-signalling conditions and\nproposed relaxations allowing phenomena like jamming, where it was suggested\nthat superluminal signalling and causal loops remain impossible. Using our\nrecent framework combining relativistic principles with causal modelling, we\nshow that any theory (classical or non-classical) allowing jamming must rely on\ncausal fine-tuning and superluminal causal influences. Additionally, we show\nthat jamming theories can lead to superluminal signalling in certain\nsituations, highlighting limitations for their physicality. However, we\nidentify cases where jamming correlations avoid superluminal signalling under\ngeneral interventions, demonstrating that standard no-signalling constraints\nare not necessary for this purpose. We also show that these constraints are\ninsufficient to rule out superluminal signalling and are neither necessary nor\nsufficient for ensuring no causal loops under general interventions. Finally,\nwe derive necessary and sufficient conditions for ruling out superluminal\nsignalling and operationally detectable causal loops, solidifying our\nunderstanding of relativistic causality principles in information processing\ntasks in space-time.",
            "pdf_url": "http://arxiv.org/pdf/2311.18465v2",
            "published": "2023-11-30 11:17:49+00:00",
            "updated": "2025-01-24 15:56:05+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Controlling Moments with Kernel Stein Discrepancies",
            "authors": "Heishiro Kanagawa, Alessandro Barp, Arthur Gretton, Lester Mackey",
            "summary": "Kernel Stein discrepancies (KSDs) measure the quality of a distributional\napproximation and can be computed even when the target density has an\nintractable normalizing constant. Notable applications include the diagnosis of\napproximate MCMC samplers and goodness-of-fit tests for unnormalized\nstatistical models. The present work analyzes the convergence control\nproperties of KSDs. We first show that standard KSDs used for weak convergence\ncontrol fail to control moment convergence. To address this limitation, we next\nprovide sufficient conditions under which alternative diffusion KSDs control\nboth moment and weak convergence. As an immediate consequence we develop, for\neach $q > 0$, the first KSDs known to exactly characterize $q$-Wasserstein\nconvergence.",
            "pdf_url": "http://arxiv.org/pdf/2211.05408v6",
            "published": "2022-11-10 08:24:52+00:00",
            "updated": "2025-01-24 17:16:34+00:00"
        },
        {
            "title": "One-Prompt-One-Story: Free-Lunch Consistent Text-to-Image Generation Using a Single Prompt",
            "authors": "Tao Liu, Kai Wang, Senmao Li, Joost van de Weijer, Fahad Shahbaz Khan, Shiqi Yang, Yaxing Wang, Jian Yang, Ming-Ming Cheng",
            "summary": "Text-to-image generation models can create high-quality images from input\nprompts. However, they struggle to support the consistent generation of\nidentity-preserving requirements for storytelling. Existing approaches to this\nproblem typically require extensive training in large datasets or additional\nmodifications to the original model architectures. This limits their\napplicability across different domains and diverse diffusion model\nconfigurations. In this paper, we first observe the inherent capability of\nlanguage models, coined context consistency, to comprehend identity through\ncontext with a single prompt. Drawing inspiration from the inherent context\nconsistency, we propose a novel training-free method for consistent\ntext-to-image (T2I) generation, termed \"One-Prompt-One-Story\" (1Prompt1Story).\nOur approach 1Prompt1Story concatenates all prompts into a single input for T2I\ndiffusion models, initially preserving character identities. We then refine the\ngeneration process using two novel techniques: Singular-Value Reweighting and\nIdentity-Preserving Cross-Attention, ensuring better alignment with the input\ndescription for each frame. In our experiments, we compare our method against\nvarious existing consistent T2I generation approaches to demonstrate its\neffectiveness through quantitative metrics and qualitative assessments. Code is\navailable at https://github.com/byliutao/1Prompt1Story.",
            "pdf_url": "http://arxiv.org/pdf/2501.13554v2",
            "published": "2025-01-23 10:57:22+00:00",
            "updated": "2025-01-24 12:43:48+00:00"
        },
        {
            "title": "Handling Heterophily in Recommender Systems with Wavelet Hypergraph Diffusion",
            "authors": "Darnbi Sakong, Thanh Tam Nguyen",
            "summary": "Recommender systems are pivotal in delivering personalised user experiences\nacross various domains. However, capturing the heterophily patterns and the\nmulti-dimensional nature of user-item interactions poses significant\nchallenges. To address this, we introduce FWHDNN (Fusion-based Wavelet\nHypergraph Diffusion Neural Networks), an innovative framework aimed at\nadvancing representation learning in hypergraph-based recommendation tasks. The\nmodel incorporates three key components: (1) a cross-difference relation\nencoder leveraging heterophily-aware hypergraph diffusion to adapt\nmessage-passing for diverse class labels, (2) a multi-level cluster-wise\nencoder employing wavelet transform-based hypergraph neural network layers to\ncapture multi-scale topological relationships, and (3) an integrated\nmulti-modal fusion mechanism that combines structural and textual information\nthrough intermediate and late-fusion strategies. Extensive experiments on\nreal-world datasets demonstrate that FWHDNN surpasses state-of-the-art methods\nin accuracy, robustness, and scalability in capturing high-order\ninterconnections between users and items.",
            "pdf_url": "http://arxiv.org/pdf/2501.14399v1",
            "published": "2025-01-24 11:08:29+00:00",
            "updated": "2025-01-24 11:08:29+00:00"
        },
        {
            "title": "A Survey on Diffusion Models for Anomaly Detection",
            "authors": "Jing Liu, Zhenchao Ma, Zepu Wang, Yang Liu, Zehua Wang, Peng Sun, Liang Song, Bo Hu, Azzedine Boukerche, Victor C. M. Leung",
            "summary": "Diffusion models (DMs) have emerged as a powerful class of generative AI\nmodels, showing remarkable potential in anomaly detection (AD) tasks across\nvarious domains, such as cybersecurity, fraud detection, healthcare, and\nmanufacturing. The intersection of these two fields, termed diffusion models\nfor anomaly detection (DMAD), offers promising solutions for identifying\ndeviations in increasingly complex and high-dimensional data. In this survey,\nwe review recent advances in DMAD research. We begin by presenting the\nfundamental concepts of AD and DMs, followed by a comprehensive analysis of\nclassic DM architectures including DDPMs, DDIMs, and Score SDEs. We further\ncategorize existing DMAD methods into reconstruction-based, density-based, and\nhybrid approaches, providing detailed examinations of their methodological\ninnovations. We also explore the diverse tasks across different data\nmodalities, encompassing image, time series, video, and multimodal data\nanalysis. Furthermore, we discuss critical challenges and emerging research\ndirections, including computational efficiency, model interpretability,\nrobustness enhancement, edge-cloud collaboration, and integration with large\nlanguage models. The collection of DMAD research papers and resources is\navailable at https://github.com/fdjingliu/DMAD.",
            "pdf_url": "http://arxiv.org/pdf/2501.11430v3",
            "published": "2025-01-20 12:06:54+00:00",
            "updated": "2025-01-24 09:58:41+00:00"
        },
        {
            "title": "TFG-Flow: Training-free Guidance in Multimodal Generative Flow",
            "authors": "Haowei Lin, Shanda Li, Haotian Ye, Yiming Yang, Stefano Ermon, Yitao Liang, Jianzhu Ma",
            "summary": "Given an unconditional generative model and a predictor for a target property\n(e.g., a classifier), the goal of training-free guidance is to generate samples\nwith desirable target properties without additional training. As a highly\nefficient technique for steering generative models toward flexible outcomes,\ntraining-free guidance has gained increasing attention in diffusion models.\nHowever, existing methods only handle data in continuous spaces, while many\nscientific applications involve both continuous and discrete data (referred to\nas multimodality). Another emerging trend is the growing use of the simple and\ngeneral flow matching framework in building generative foundation models, where\nguided generation remains under-explored. To address this, we introduce\nTFG-Flow, a novel training-free guidance method for multimodal generative flow.\nTFG-Flow addresses the curse-of-dimensionality while maintaining the property\nof unbiased sampling in guiding discrete variables. We validate TFG-Flow on\nfour molecular design tasks and show that TFG-Flow has great potential in drug\ndesign by generating molecules with desired properties.",
            "pdf_url": "http://arxiv.org/pdf/2501.14216v1",
            "published": "2025-01-24 03:44:16+00:00",
            "updated": "2025-01-24 03:44:16+00:00"
        }
    ]
}