{
    "Physics": [
        {
            "title": "Efficient Preparation of Solvable Anyons with Adaptive Quantum Circuits",
            "authors": "Yuanjie Ren, Nathanan Tantivasadakarn, Dominic J. Williamson",
            "summary": "The classification of topological phases of matter is a fundamental challenge\nin quantum many-body physics, with applications to quantum technology.\nRecently, this classification has been extended to the setting of Adaptive\nFinite-Depth Local Unitary (AFDLU) circuits which allow global classical\ncommunication. In this setting, the trivial phase is the collection of all\ntopological states that can be prepared via AFDLU. Here, we propose a complete\nclassification of the trivial phase by showing how to prepare all solvable\nanyon theories that admit a gapped boundary via AFDLU, extending recent results\non solvable groups. Our construction includes non-Abelian anyons with\nirrational quantum dimensions, such as Ising anyons, and more general acyclic\nanyons. Specifically, we introduce a sequential gauging procedure, with an\nAFDLU implementation, to produce a string-net ground state in any topological\nphase described by a solvable anyon theory with gapped boundary. In addition,\nwe introduce a sequential ungauging and regauging procedure, with an AFDLU\nimplementation, to apply string operators of arbitrary length for anyons and\nsymmetry twist defects in solvable anyon theories. We apply our procedure to\nthe quantum double of the group $S_3$ and to several examples that are beyond\nsolvable groups, including the doubled Ising theory, the $\\mathbb{Z}_3$\nTambara-Yamagami string-net, and doubled $SU(2)_4$ anyons.",
            "pdf_url": "http://arxiv.org/pdf/2411.04985v1",
            "published": "2024-11-07 18:55:09+00:00",
            "updated": "2024-11-07 18:55:09+00:00"
        },
        {
            "title": "DINO-WM: World Models on Pre-trained Visual Features enable Zero-shot Planning",
            "authors": "Gaoyue Zhou, Hengkai Pan, Yann LeCun, Lerrel Pinto",
            "summary": "The ability to predict future outcomes given control actions is fundamental\nfor physical reasoning. However, such predictive models, often called world\nmodels, have proven challenging to learn and are typically developed for\ntask-specific solutions with online policy learning. We argue that the true\npotential of world models lies in their ability to reason and plan across\ndiverse problems using only passive data. Concretely, we require world models\nto have the following three properties: 1) be trainable on offline,\npre-collected trajectories, 2) support test-time behavior optimization, and 3)\nfacilitate task-agnostic reasoning. To realize this, we present DINO World\nModel (DINO-WM), a new method to model visual dynamics without reconstructing\nthe visual world. DINO-WM leverages spatial patch features pre-trained with\nDINOv2, enabling it to learn from offline behavioral trajectories by predicting\nfuture patch features. This design allows DINO-WM to achieve observational\ngoals through action sequence optimization, facilitating task-agnostic behavior\nplanning by treating desired goal patch features as prediction targets. We\nevaluate DINO-WM across various domains, including maze navigation, tabletop\npushing, and particle manipulation. Our experiments demonstrate that DINO-WM\ncan generate zero-shot behavioral solutions at test time without relying on\nexpert demonstrations, reward modeling, or pre-learned inverse models. Notably,\nDINO-WM exhibits strong generalization capabilities compared to prior\nstate-of-the-art work, adapting to diverse task families such as arbitrarily\nconfigured mazes, push manipulation with varied object shapes, and\nmulti-particle scenarios.",
            "pdf_url": "http://arxiv.org/pdf/2411.04983v1",
            "published": "2024-11-07 18:54:37+00:00",
            "updated": "2024-11-07 18:54:37+00:00"
        },
        {
            "title": "Kinetic Theory of Stellar Systems: A Tutorial",
            "authors": "Chris Hamilton, Jean-Baptiste Fouvry",
            "summary": "Stellar systems - star clusters, galaxies, dark matter haloes, and so on -\nare ubiquitous characters in the evolutionary tale of our Universe. This\ntutorial article is an introduction to the collective dynamical evolution of\nthe very large numbers of stars and/or other self-gravitating objects that\ncomprise such systems, i.e. their kinetic theory.\n  We begin by introducing the basic phenomenology of stellar systems, and\nexplaining why and when we must develop a kinetic theory that transcends the\ntraditional two-body relaxation picture of Chandrasekhar. We study the orbits\nthat comprise stellar systems, how those orbits are modified by perturbations,\nhow a system responds self-consistently to fluctuations in its gravitational\npotential, and how one can predict the long term fate of a stellar system in\nvarious dynamical regimes. Though our treatment is necessarily mathematical, we\ndevelop the formalism only to the extent that it facilitates real calculations.\nWe give many examples throughout the text of the equations being applied to\ntopics of major astrophysical importance.\n  Furthermore, in the 1960s and 1970s the kinetic theory of stellar systems was\na fledgling subject which developed in tandem with the kinetic theory of\nplasmas. However, the two fields have long since diverged. Yet once one has\nbecome fluent in both Plasmaish and Galacticese, and has a dictionary relating\nthe two, one can pull ideas directly from one field to solve a problem in the\nother. Therefore, another aim of this tutorial article is to provide our plasma\ncolleagues with a jargon-light understanding of the key properties of stellar\nsystems, to point out the many direct analogies between stellar- and\nplasma-kinetic calculations, and ultimately to convince them that stellar\ndynamics and plasma kinetics are, in a deep and beautiful and useful sense, the\nsame thing.",
            "pdf_url": "http://arxiv.org/pdf/2402.13322v2",
            "published": "2024-02-20 19:02:08+00:00",
            "updated": "2024-11-07 18:24:36+00:00"
        },
        {
            "title": "Optimization of experimental quantum randomness expansion",
            "authors": "Amelie Piveteau, Alban Seguinard, Piotr Mironowicz, Mohamed Bourennane",
            "summary": "Quantum technologies provide many applications for information processing\ntasks that are impossible to realize within classical physics. These\ncapabilities include such fundamental resources as generating secure, i.e.\nprivate and unpredictable random values. Yet, the problem of quantifying the\namount of generated randomness is still not fully solved. This work presents a\ncomprehensive analysis of the design and performance optimization of a Quantum\nRandom Number Generator (QRNG) based on Bell inequality violations. We\ninvestigate key protocol parameters, including the smoothing parameter\n($\\epsilon_{\\text{s}}$), test round probability ($\\gamma$), and switching\ndelays, and their effects on the generation rate and quality of randomness. We\nidentify optimal ranges for $\\gamma$ and $p_\\Omega$ (the protocol's\nnon-aborting probability) to balance the trade-off between randomness\nconsumption and net randomness generation. Additionally, we explore the impact\nof switching delays on the system's performance, providing strategies to\nmitigate these effects. Our results indicate substantial developments in QRNG\nimplementations and offer higher randomness expansion rates. The work provides\npractical guidelines for the efficient and secure design of QRNG systems and\nother cryptographic protocols.",
            "pdf_url": "http://arxiv.org/pdf/2411.04934v1",
            "published": "2024-11-07 18:12:58+00:00",
            "updated": "2024-11-07 18:12:58+00:00"
        },
        {
            "title": "Concurrence speed limit and its connection with bounds in many body physics",
            "authors": "Shrobona Bagchi",
            "summary": "Quantum speed limit is a fundamental speed limit for the evolution of quantum\nstates. It is the single-most important interpretation of the time energy\nuncertainty relation. Recently the speed limit of quantum correlations have\nbeen proposed like the concurrence for pure quantum states. In this direction,\nwe derive a speed limit bound for a quantum correlation named the concurrence\nfor the generally mixed quantum states of two qubits. By this we mean that we\nfind an expression for the minimum time required to reach a given value of\nentanglement starting from an arbitrary initial generally mixed state. We\ndiscuss the connection of the findings of this article in the interdisciplinary\narea of the condensed matter physics or the many body physics and quantum\ninformation science such as on the topic of Lieb-Robinson bound in a\nquantitative manner.",
            "pdf_url": "http://arxiv.org/pdf/2411.04930v1",
            "published": "2024-11-07 18:09:58+00:00",
            "updated": "2024-11-07 18:09:58+00:00"
        },
        {
            "title": "Existence and Uniqueness of Solutions to the Generalized Hydrodynamics Equation",
            "authors": "Friedrich Hübner, Benjamin Doyon",
            "summary": "The generalized hydrodynamics (GHD) equation is the equivalent of the Euler\nequations of hydrodynamics for integrable models. Systems of hyperbolic\nequations such as the Euler equations usually develop shocks and are plagued by\nproblems of uniqueness. We establish for the first time the existence and\nuniqueness of solutions to the full GHD equation and the absence of shocks,\nfrom a large class of initial conditions with bounded occupation function. We\nassume only absolute integrability of the two-body scattering shift. In\napplications to quantum models of fermionic type, this includes all commonly\nused physical initial states, such as locally thermal states and zero-entropy\nstates. We show in particular that differentiable initial conditions give\ndifferentiable solutions at all times and that weak initial conditions such as\nthe Riemann problem have unique weak solutions which preserve entropy. For this\npurpose, we write the GHD equation as a new fixed-point problem (announced in a\ncompanion paper). We show that the fixed point exists, is unique, and is\napproached, under an iterative solution procedure, in the Banach topology on\nfunctions of momenta.",
            "pdf_url": "http://arxiv.org/pdf/2411.04922v1",
            "published": "2024-11-07 17:58:53+00:00",
            "updated": "2024-11-07 17:58:53+00:00"
        },
        {
            "title": "Efficient quantum pseudorandomness under conservation laws",
            "authors": "Zimu Li, Han Zheng, Zi-Wen Liu",
            "summary": "The efficiency of locally generating unitary designs, which capture\nstatistical notions of quantum pseudorandomness, lies at the heart of\nwide-ranging areas in physics and quantum information technologies. While there\nare extensive potent methods and results for this problem, the evidently\nimportant setting where continuous symmetries or conservation laws (most\nnotably U(1) and SU(d)) are involved is known to present fundamental\ndifficulties. In particular, even the basic question of whether any local\nsymmetric circuit can generate 2-designs efficiently (in time that grows at\nmost polynomially in the system size) remains open with no circuit\nconstructions provably known to do so, despite intensive efforts. In this work,\nwe resolve this long-standing open problem for both U(1) and SU(d) symmetries\nby explicitly constructing local symmetric quantum circuits which we prove to\nconverge to symmetric unitary 2-designs in polynomial time using a combination\nof representation theory, graph theory, and Markov chain methods. As a direct\napplication, our constructions can be used to efficiently generate near-optimal\nrandom covariant quantum error-correcting codes, confirming a conjecture in\n[PRX Quantum 3, 020314 (2022)].",
            "pdf_url": "http://arxiv.org/pdf/2411.04893v1",
            "published": "2024-11-07 17:32:04+00:00",
            "updated": "2024-11-07 17:32:04+00:00"
        },
        {
            "title": "Machine learning and optimization-based approaches to duality in statistical physics",
            "authors": "Andrea E. V. Ferrari, Prateek Gupta, Nabil Iqbal",
            "summary": "The notion of duality -- that a given physical system can have two different\nmathematical descriptions -- is a key idea in modern theoretical physics.\nEstablishing a duality in lattice statistical mechanics models requires the\nconstruction of a dual Hamiltonian and a map from the original to the dual\nobservables. By using simple neural networks to parameterize these maps and\nintroducing a loss function that penalises the difference between correlation\nfunctions in original and dual models, we formulate the process of duality\ndiscovery as an optimization problem. We numerically solve this problem and\nshow that our framework can rediscover the celebrated Kramers-Wannier duality\nfor the 2d Ising model, reconstructing the known mapping of temperatures. We\nalso discuss an alternative approach which uses known features of the mapping\nof topological lines to reduce the problem to optimizing the couplings in a\ndual Hamiltonian, and explore next-to-nearest neighbour deformations of the 2d\nIsing duality. We discuss future directions and prospects for discovering new\ndualities within this framework.",
            "pdf_url": "http://arxiv.org/pdf/2411.04838v1",
            "published": "2024-11-07 16:29:03+00:00",
            "updated": "2024-11-07 16:29:03+00:00"
        },
        {
            "title": "Collisionless conduction in a high-beta plasma: a collision operator for whistler turbulence",
            "authors": "Evan L. Yerger, Matthew W. Kunz, Archie F. A. Bott, Anatoly Spitkovsky",
            "summary": "The regulation of electron heat transport in high-beta, weakly collisional,\nmagnetized plasma is investigated. A temperature gradient oriented along a mean\nmagnetic field can induce a kinetic heat-flux-driven whistler instability\n(HWI), which back-reacts on the transport by scattering electrons and impeding\ntheir flow. Previous analytical and numerical studies have shown that the heat\nflux for the saturated HWI scales as the inverse of electron beta. These\nnumerical studies, however, had limited scale separation and consequently large\nfluctuation amplitudes, which calls into question their relevance at\nastrophysical scales. To this end, we perform a series of particle-in-cell\nsimulations of the HWI across a range of electron beta and temperature-gradient\nlength scales under two different physical setups. The saturated heat flux in\nall of our simulations follows the expected inverse-electron-beta scaling,\nsupporting the robustness of the result. We also use our simulation results to\ndevelop and implement several methods to construct an effective collision\noperator for whistler turbulence. The results point to an issue with the\nstandard quasi-linear explanation of HWI saturation, which is analogous to the\nwell-known 90-degree scattering problem in the cosmic ray community. Despite\nthis limitation, the methods developed here can serve as a blueprint for future\nwork seeking to characterize the effective collisionality caused by kinetic\ninstabilities.",
            "pdf_url": "http://arxiv.org/pdf/2405.06481v2",
            "published": "2024-05-10 13:58:05+00:00",
            "updated": "2024-11-07 16:17:39+00:00"
        },
        {
            "title": "Si/SiO$_\\text{2}$ MOSFET Reliability Physics: From Four-State Model to All-State Model",
            "authors": "Xinjing Guo, Menglin Huang, Shiyou Chen",
            "summary": "As implemented in the commercialized device modeling software, the four-state\nnonradiative multi-phonon model has attracted intensive attention in the past\ndecade for describing the physics in negative bias temperature instability\n(NBTI) and other reliability issues of Si/SiO$_\\text{2}$ MOSFET devices. It was\nproposed initially based on the assumption that the oxygen vacancy defects\n(V$_\\text{O}$) in SiO$_\\text{2}$ dielectric layer are bistable in the Si-dimer\nand back-projected structures during carrier capture and emission. Through\nhigh-throughput first-principles structural search, we found V$_\\text{O}$ on\nnon-equivalent O sites in amorphous SiO$_\\text{2}$ can take 4 types of\nstructural configurations in neutral state and 7 types of configurations in +1\ncharged state after capturing holes, which produce a wide range of charge-state\ntransition levels for trapping holes. The finding contrasts the\nstructural-bistability assumption and makes the four-state model invalid for\nmost of O sites. To describe the reliability physics accurately, we propose an\nall-state model to consider all these structural configurations as well as all\nthe carrier capture/emission transitions and thermal transitions between them.\nWith the all-state model, we show that the V$_\\text{O}$ defects play important\nroles in causing NBTI, which challenges the recent studies that discarded\nV$_\\text{O}$ as a possible hole trap in NBTI. Our systematical calculations on\nthe diversified V$_\\text{O}$ properties and the all-state model provide the\nmicroscopic foundation for describing the reliability physics of MOSFETs and\nother transistors accurately.",
            "pdf_url": "http://arxiv.org/pdf/2411.04823v1",
            "published": "2024-11-07 16:01:15+00:00",
            "updated": "2024-11-07 16:01:15+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "SVDQunat: Absorbing Outliers by Low-Rank Components for 4-Bit Diffusion Models",
            "authors": "Muyang Li, Yujun Lin, Zhekai Zhang, Tianle Cai, Xiuyu Li, Junxian Guo, Enze Xie, Chenlin Meng, Jun-Yan Zhu, Song Han",
            "summary": "Diffusion models have been proven highly effective at generating high-quality\nimages. However, as these models grow larger, they require significantly more\nmemory and suffer from higher latency, posing substantial challenges for\ndeployment. In this work, we aim to accelerate diffusion models by quantizing\ntheir weights and activations to 4 bits. At such an aggressive level, both\nweights and activations are highly sensitive, where conventional post-training\nquantization methods for large language models like smoothing become\ninsufficient. To overcome this limitation, we propose SVDQuant, a new 4-bit\nquantization paradigm. Different from smoothing which redistributes outliers\nbetween weights and activations, our approach absorbs these outliers using a\nlow-rank branch. We first consolidate the outliers by shifting them from\nactivations to weights, then employ a high-precision low-rank branch to take in\nthe weight outliers with Singular Value Decomposition (SVD). This process eases\nthe quantization on both sides. However, na\\\"{\\i}vely running the low-rank\nbranch independently incurs significant overhead due to extra data movement of\nactivations, negating the quantization speedup. To address this, we co-design\nan inference engine Nunchaku that fuses the kernels of the low-rank branch into\nthose of the low-bit branch to cut off redundant memory access. It can also\nseamlessly support off-the-shelf low-rank adapters (LoRAs) without the need for\nre-quantization. Extensive experiments on SDXL, PixArt-$\\Sigma$, and FLUX.1\nvalidate the effectiveness of SVDQuant in preserving image quality. We reduce\nthe memory usage for the 12B FLUX.1 models by 3.5$\\times$, achieving\n3.0$\\times$ speedup over the 4-bit weight-only quantized baseline on the 16GB\nlaptop 4090 GPU, paving the way for more interactive applications on PCs. Our\nquantization library and inference engine are open-sourced.",
            "pdf_url": "http://arxiv.org/pdf/2411.05007v1",
            "published": "2024-11-07 18:59:58+00:00",
            "updated": "2024-11-07 18:59:58+00:00"
        },
        {
            "title": "Diff-2-in-1: Bridging Generation and Dense Perception with Diffusion Models",
            "authors": "Shuhong Zheng, Zhipeng Bao, Ruoyu Zhao, Martial Hebert, Yu-Xiong Wang",
            "summary": "Beyond high-fidelity image synthesis, diffusion models have recently\nexhibited promising results in dense visual perception tasks. However, most\nexisting work treats diffusion models as a standalone component for perception\ntasks, employing them either solely for off-the-shelf data augmentation or as\nmere feature extractors. In contrast to these isolated and thus sub-optimal\nefforts, we introduce a unified, versatile, diffusion-based framework,\nDiff-2-in-1, that can simultaneously handle both multi-modal data generation\nand dense visual perception, through a unique exploitation of the\ndiffusion-denoising process. Within this framework, we further enhance\ndiscriminative visual perception via multi-modal generation, by utilizing the\ndenoising network to create multi-modal data that mirror the distribution of\nthe original training set. Importantly, Diff-2-in-1 optimizes the utilization\nof the created diverse and faithful data by leveraging a novel self-improving\nlearning mechanism. Comprehensive experimental evaluations validate the\neffectiveness of our framework, showcasing consistent performance improvements\nacross various discriminative backbones and high-quality multi-modal data\ngeneration characterized by both realism and usefulness.",
            "pdf_url": "http://arxiv.org/pdf/2411.05005v1",
            "published": "2024-11-07 18:59:53+00:00",
            "updated": "2024-11-07 18:59:53+00:00"
        },
        {
            "title": "ReCapture: Generative Video Camera Controls for User-Provided Videos using Masked Video Fine-Tuning",
            "authors": "David Junhao Zhang, Roni Paiss, Shiran Zada, Nikhil Karnad, David E. Jacobs, Yael Pritch, Inbar Mosseri, Mike Zheng Shou, Neal Wadhwa, Nataniel Ruiz",
            "summary": "Recently, breakthroughs in video modeling have allowed for controllable\ncamera trajectories in generated videos. However, these methods cannot be\ndirectly applied to user-provided videos that are not generated by a video\nmodel. In this paper, we present ReCapture, a method for generating new videos\nwith novel camera trajectories from a single user-provided video. Our method\nallows us to re-generate the reference video, with all its existing scene\nmotion, from vastly different angles and with cinematic camera motion. Notably,\nusing our method we can also plausibly hallucinate parts of the scene that were\nnot observable in the reference video. Our method works by (1) generating a\nnoisy anchor video with a new camera trajectory using multiview diffusion\nmodels or depth-based point cloud rendering and then (2) regenerating the\nanchor video into a clean and temporally consistent reangled video using our\nproposed masked video fine-tuning technique.",
            "pdf_url": "http://arxiv.org/pdf/2411.05003v1",
            "published": "2024-11-07 18:59:45+00:00",
            "updated": "2024-11-07 18:59:45+00:00"
        },
        {
            "title": "SG-I2V: Self-Guided Trajectory Control in Image-to-Video Generation",
            "authors": "Koichi Namekata, Sherwin Bahmani, Ziyi Wu, Yash Kant, Igor Gilitschenski, David B. Lindell",
            "summary": "Methods for image-to-video generation have achieved impressive,\nphoto-realistic quality. However, adjusting specific elements in generated\nvideos, such as object motion or camera movement, is often a tedious process of\ntrial and error, e.g., involving re-generating videos with different random\nseeds. Recent techniques address this issue by fine-tuning a pre-trained model\nto follow conditioning signals, such as bounding boxes or point trajectories.\nYet, this fine-tuning procedure can be computationally expensive, and it\nrequires datasets with annotated object motion, which can be difficult to\nprocure. In this work, we introduce SG-I2V, a framework for controllable\nimage-to-video generation that is self-guided$\\unicode{x2013}$offering\nzero-shot control by relying solely on the knowledge present in a pre-trained\nimage-to-video diffusion model without the need for fine-tuning or external\nknowledge. Our zero-shot method outperforms unsupervised baselines while being\ncompetitive with supervised models in terms of visual quality and motion\nfidelity.",
            "pdf_url": "http://arxiv.org/pdf/2411.04989v1",
            "published": "2024-11-07 18:56:11+00:00",
            "updated": "2024-11-07 18:56:11+00:00"
        },
        {
            "title": "Uncovering Hidden Subspaces in Video Diffusion Models Using Re-Identification",
            "authors": "Mischa Dombrowski, Hadrien Reynaud, Bernhard Kainz",
            "summary": "Latent Video Diffusion Models can easily deceive casual observers and domain\nexperts alike thanks to the produced image quality and temporal consistency.\nBeyond entertainment, this creates opportunities around safe data sharing of\nfully synthetic datasets, which are crucial in healthcare, as well as other\ndomains relying on sensitive personal information. However, privacy concerns\nwith this approach have not fully been addressed yet, and models trained on\nsynthetic data for specific downstream tasks still perform worse than those\ntrained on real data. This discrepancy may be partly due to the sampling space\nbeing a subspace of the training videos, effectively reducing the training data\nsize for downstream models. Additionally, the reduced temporal consistency when\ngenerating long videos could be a contributing factor.\n  In this paper, we first show that training privacy-preserving models in\nlatent space is computationally more efficient and generalize better.\nFurthermore, to investigate downstream degradation factors, we propose to use a\nre-identification model, previously employed as a privacy preservation filter.\nWe demonstrate that it is sufficient to train this model on the latent space of\nthe video generator. Subsequently, we use these models to evaluate the subspace\ncovered by synthetic video datasets and thus introduce a new way to measure the\nfaithfulness of generative machine learning models. We focus on a specific\napplication in healthcare echocardiography to illustrate the effectiveness of\nour novel methods. Our findings indicate that only up to 30.8% of the training\nvideos are learned in latent video diffusion models, which could explain the\nlack of performance when training downstream tasks on synthetic data.",
            "pdf_url": "http://arxiv.org/pdf/2411.04956v1",
            "published": "2024-11-07 18:32:00+00:00",
            "updated": "2024-11-07 18:32:00+00:00"
        }
    ]
}