{
    "Physics": [
        {
            "title": "Spatiotemporal optical vortex (STOV) polariton",
            "authors": "M. S. Le, S. W. Hancock, N. Tripathi, H. M. Milchberg",
            "summary": "We confirm the existence of the spatiotemporal optical vortex (STOV)\npolariton and the value of its tOAM, verifying our theory of transverse orbital\nangular momentum in a simple dispersive medium [S. W. Hancock et al., Phys.\nRev. Lett. 127, 193901 (2021)]. We also develop a physical picture of the\npolariton as a structure driven by torques induced by the ponderomotive force\nof the light in the presence of material dispersion. This is a new type of\nspatiotemporal torque unanticipated in our recent work [S. W. Hancock et al.,\nPhys. Rev. X 14, 011031 (2024)]. These results are accomplished by high\nresolution particle-in-cell (PIC) simulations of STOV pulse reflection from and\ntransmission through a fully ionized hydrogen plasma slab. The linear theory\nmatches the PIC simulations up to near-critical plasma densities and\nnear-relativistic field strengths. For higher intensities, optical tOAM becomes\ninvested in collective modes of the plasma.",
            "pdf_url": "http://arxiv.org/pdf/2502.17413v1",
            "published": "2025-02-24 18:46:40+00:00",
            "updated": "2025-02-24 18:46:40+00:00"
        },
        {
            "title": "Multi-scale physics of cryogenic liquid helium-4: Inverse coarse-graining properties of smoothed particle hydrodynamics",
            "authors": "Satori Tsuzuki",
            "summary": "Our recent numerical studies on cryogenic liquid helium-4 strongly indicate\nthe features of multiscale physics that can be identified using the Landau's\ntwo-fluid model. This study presents the possibility that two-fluid models\nbased on classical and quantum hydrodynamics have a relationship between the\nscale transformation using filtering in large eddy simulations (LES) and the\ninverse scale transformation using smoothed particle hydrodynamics (SPH). We\nshow that the spin angular momentum conservation term, which we previously\nintroduced into the two-fluid model as a quantum mechanical correction,\nformally corresponds to the subgrid-scale (SGS) model, which can be derived\nfrom the scale transformation of the two-fluid model from quantum to classical\nhydrodynamics. Our theoretical analysis shows that solving the two-fluid model\nbased on classical hydrodynamics using SPH can reproduce the microscopic\nfluctuations even at the macroscopic scale because the truncation errors owing\nto the smoothing kernel approximation can substitute the microscopic\nfluctuations. In particular, the fluctuations can be amplified according to the\nsize of the kernel radius at the macroscopic scale. Our further theoretical\nanalysis shows that the Condiff viscosity model can serve as an SGS model and\nincorporate the quantum vortex interactions into the two-fluid model. Our\nresults and discussion provide new insights into the microscopic composition of\nthe cryogenic liquid helium-4 within a multiscale framework. First, a normal\nfluid can be a mixture of inviscid and viscous fluid particles. Second, a flow\nidentified as a normal fluid on the microscopic scale because of the presence\nof molecular viscosity is still classified as an inviscid fluid on the\nhydrodynamic scale because its viscosity is insufficient to produce eddy\nviscosity.",
            "pdf_url": "http://arxiv.org/pdf/2501.14244v2",
            "published": "2025-01-24 05:09:58+00:00",
            "updated": "2025-02-24 18:31:21+00:00"
        },
        {
            "title": "Robust Confinement State Classification with Uncertainty Quantification through Ensembled Data-Driven Methods",
            "authors": "Yoeri Poels, Cristina Venturini, Alessandro Pau, Olivier Sauter, Vlado Menkovski, the TCV team, the WPTE team",
            "summary": "Maximizing fusion performance in tokamaks relies on high energy confinement,\noften achieved through distinct operating regimes. The automated labeling of\nthese confinement states is crucial to enable large-scale analyses or for\nreal-time control applications. While this task becomes difficult to automate\nnear state transitions or in marginal scenarios, much success has been achieved\nwith data-driven models. However, these methods generally provide predictions\nas point estimates, and cannot adequately deal with missing and/or broken input\nsignals. To enable wide-range applicability, we develop methods for confinement\nstate classification with uncertainty quantification and model robustness. We\nfocus on off-line analysis for TCV discharges, distinguishing L-mode, H-mode,\nand an in-between dithering phase (D). We propose ensembling data-driven\nmethods on two axes: model formulations and feature sets. The former considers\na dynamic formulation based on a recurrent Fourier Neural Operator-architecture\nand a static formulation based on gradient-boosted decision trees. These models\nare trained using multiple feature groupings categorized by diagnostic system\nor physical quantity. A dataset of 302 TCV discharges is fully labeled, and\nwill be publicly released. We evaluate our method quantitatively using Cohen's\nkappa coefficient for predictive performance and the Expected Calibration Error\nfor the uncertainty calibration. Furthermore, we discuss performance using a\nvariety of common and alternative scenarios, the performance of individual\ncomponents, out-of-distribution performance, cases of broken or missing\nsignals, and evaluate conditionally-averaged behavior around different state\ntransitions. Overall, the proposed method can distinguish L, D and H-mode with\nhigh performance, can cope with missing or broken signals, and provides\nmeaningful uncertainty estimates.",
            "pdf_url": "http://arxiv.org/pdf/2502.17397v1",
            "published": "2025-02-24 18:25:22+00:00",
            "updated": "2025-02-24 18:25:22+00:00"
        },
        {
            "title": "Data efficiency and long-term prediction capabilities for neural operator surrogate models of edge plasma simulations",
            "authors": "N. Carey, L. Zanisi, S. Pamela, V. Gopakumar, J. Omotani, J. Buchanan, J. Brandstetter, F. Paischer, G. Galletti, P. Setinek",
            "summary": "Modelling of plasma dynamics is fundamental to ensure appropriate diverter\nand core performance, and is desirable for both interpreting the current\ngeneration of experiments and informing the next generation devices like ITER\n\\cite{Loarte2007Chapter4P,Eich2013ScalingOT}. Yet the computational expense of\nmany plasma simulations makes them unsuitable for real-time applications or\niterative design workflows. Neural operator surrogate models of JOREK\n\\cite{Hoelzl_2021} and STORM \\cite{Walkden2016-ys} are evaluated, investigating\ntheir capability to replicate plasma dynamics accurately whilst reducing\ncomputational cost. It is found that the accuracy of the surrogate models will\ndegrade for long term predictions, and that physics considerations are\nimportant in assessing the performance of the surrogates. Surrogates trained on\none dataset can be effectively fine tuned with only a few simulations from a\ntarget domain. This is particularly effective where the source domain is a low\nfidelity physics model and the target domain is a high fidelity model, with an\norder of magnitude improvement in performance for a small dataset and a short\nrollout.",
            "pdf_url": "http://arxiv.org/pdf/2502.17386v1",
            "published": "2025-02-24 18:13:10+00:00",
            "updated": "2025-02-24 18:13:10+00:00"
        },
        {
            "title": "Travel Time Reliability in Stochastic Kinematic Flow Models",
            "authors": "Alexander Hammerl, Ravi Seshadri, Thomas Kjær Rasmussen, Otto Anker Nielsen",
            "summary": "This paper analyzes the time-dependent relationship between the mean and\nvariance of travel time on a single corridor under rush hour like congestion\npatterns. To model this phenomenon, we apply the LWR ((Lighthill & Whitham,\n1955), (Richards, 1956)) theory on a homogenous freeway with a discontinuous\nbottleneck at its downstream end, assuming a uni-modal demand profile with a\nstochastic peak. We establish conditions for typical counterclockwise\nhysteresis loops under these assumptions. It is demonstrated that shapes of the\nfundamental diagram which always produce a counterclockwise loop can be\ninterpreted as an indication of aggressive driving behavior, while deviations\nmay occur under defensive driving. This classification enables a detailed\nexplanation of the qualitative physical mechanisms behind this pattern, as well\nas an analysis of the causes for quantitatively limited deviations. Some of the\nmathematical properties of the LWR model identified in our analysis have not\nyet been addressed in the literature and we critically examine the extent to\nwhich these reflect actual traffic flow behavior. Our considerations are\nsupported by numerical experiments. The obtained results aim to improve the\nfundamental understanding of the physical causes of this hysteresis pattern and\nto facilitate its better estimation in traffic planning and control.",
            "pdf_url": "http://arxiv.org/pdf/2502.17359v1",
            "published": "2025-02-24 17:37:15+00:00",
            "updated": "2025-02-24 17:37:15+00:00"
        },
        {
            "title": "An Explainable AI Model for Binary LJ Fluids",
            "authors": "Israrul H Hashmi, Rahul Karmakar, Marripelli Maniteja, Kumar Ayush, Tarak K. Patra",
            "summary": "Lennard-Jones (LJ) fluids serve as an important theoretical framework for\nunderstanding molecular interactions. Binary LJ fluids, where two distinct\nspecies of particles interact based on the LJ potential, exhibit rich phase\nbehavior and provide valuable insights of complex fluid mixtures. Here we\nreport the construction and utility of an artificial intelligence (AI) model\nfor binary LJ fluids, focusing on their effectiveness in predicting radial\ndistribution functions (RDFs) across a range of conditions. The RDFs of a\nbinary mixture with varying compositions and temperatures are collected from\nmolecular dynamics (MD) simulations to establish and validate the AI model. In\nthis AI pipeline, RDFs are discretized in order to reduce the output dimension\nof the model. This, in turn, improves the efficacy, and reduce the complexity\nof an AI RDF model. The model is shown to predict RDFs for many unknown\nmixtures very accurately, especially outside the training temperature range.\nOur analysis suggests that the particle size ratio has a higher order impact on\nthe microstructure of a binary mixture. We also highlight the areas where the\nfidelity of the AI model is low when encountering new regimes with different\nunderlying physics.",
            "pdf_url": "http://arxiv.org/pdf/2502.17357v1",
            "published": "2025-02-24 17:35:01+00:00",
            "updated": "2025-02-24 17:35:01+00:00"
        },
        {
            "title": "Hierarchical poromechanical approach to investigate the impact of mechanical loading on human skin micro-circulation",
            "authors": "Thomas Lavigne, Stéphane Urcun, Bérengère Fromy, Audrey Josset-Lamaugarny, Alexandre Lagache, Camilo A. Suarez-Afanador, Stéphane P. A. Bordas, Pierre-Yves Rohan, Giuseppe Sciumè",
            "summary": "Research on human skin anatomy reveals its complex multi-scale, multi-phase\nnature, with up to 70% of its composition being bounded and free water. Fluid\nmovement plays a key role in the skin's mechanical and biological responses,\ninfluencing its time-dependent behavior and nutrient transport.\n  Poroelastic modeling is a promising approach for studying skin dynamics\nacross scales by integrating multi-physics processes. This paper introduces a\nhierarchical two-compartment model capturing fluid distribution in the\ninterstitium and micro-circulation. A theoretical framework is developed with a\nbiphasic interstitium -- distinguishing interstitial fluid and non-structural\ncells -- and analyzed through a one-dimensional consolidation test of a column.\nThis biphasic approach allows separate modeling of cell and fluid motion,\nconsidering their differing characteristic times. An appendix discusses\nextending the model to include biological exchanges like oxygen transport.\nPreliminary results indicate that cell viscosity introduces a second\ncharacteristic time, and at high viscosity and short time scales, cells behave\nsimilarly to solids.\n  A simplified model was used to replicate an experimental campaign on short\ntime scales. Local pressure (up to 31 kPa) was applied to dorsal finger skin\nusing a laser Doppler probe PF801 (Perimed Sweden), following a setup described\nin Fromy Brain Res (1998). The model qualitatively captured ischemia and\npost-occlusive reactive hyperemia, aligning with experimental data.\n  All numerical simulations used the open-source software FEniCSx v0.9.0. To\nensure transparency and reproducibility, anonymized experimental data and\nfinite element codes are publicly available on GitHub.",
            "pdf_url": "http://arxiv.org/pdf/2502.17354v1",
            "published": "2025-02-24 17:29:42+00:00",
            "updated": "2025-02-24 17:29:42+00:00"
        },
        {
            "title": "Optimized circuits for windowed modular arithmetic with applications to quantum attacks against RSA",
            "authors": "Alessandro Luongo, Varun Narasimhachar, Adithya Sireesh",
            "summary": "Windowed arithmetic [Gidney, 2019] is a technique for reducing the cost of\nquantum arithmetic circuits with space--time tradeoffs using memory queries to\nprecomputed tables. It can reduce the asymptotic cost of modular exponentiation\nfrom $O\\left(n^3\\right)$ to $O\\left(n^3/\\log^2 n\\right)$ operations, resulting\nin the current state-of-the-art compilations of quantum attacks against modern\ncryptography. In this work we introduce four optimizations to windowed modular\nexponentiation. We (1) show how the cost of unlookups can be reduced by $66\\%$\nasymptotically in the number of bits, (2) illustrate how certain addresses can\nbe bypassed, reducing both circuit depth and the overall lookup cost, (3)\ndemonstrate that multiple lookup--addition operations can be merged into a\nsingle, larger lookup at the start of the modular exponentiation circuit, and\n(4) reduce the depth of the unary conversion for unlookups. On a logical level,\nthis leads to a $3\\%$ improvement in Toffoli count and Toffoli depth for\nmodular exponentiation circuits relevant to cryptographic applications. This\ntranslates to some improvements on [Gidney and Eker\\r{a}, 2021]'s factoring\nalgorithm: for a given number of physical qubits, our improvements show a\nreduction in the expected runtime from $2\\%$ to $6\\%$ for factoring\n$\\mathsf{RSA}$-$2048$ integers.",
            "pdf_url": "http://arxiv.org/pdf/2502.17325v1",
            "published": "2025-02-24 16:59:16+00:00",
            "updated": "2025-02-24 16:59:16+00:00"
        },
        {
            "title": "Engineering of Anyons on M5-Probes via Flux Quantization",
            "authors": "Hisham Sati, Urs Schreiber",
            "summary": "These extended lecture notes survey a novel derivation of anyonic topological\norder (as seen in fractional quantum Hall systems) on single magnetized\nM5-branes probing Seifert orbi-singularities (\"geometric engineering\" of\nanyons), which we motivate from fundamental open problems in the field of\nquantum computing.\n  The rigorous construction is non-Lagrangian and non-perturbative, based on\npreviously neglected global completion of the M5-brane's tensor field by\nflux-quantization consistent with its non-linear self-duality and its twisting\nby the bulk C-field. This exists only in little-studied non-abelian generalized\ncohomology theories, notably in a twisted equivariant (and \"twistorial\") form\nof unstable Cohomotopy (\"Hypothesis H\").\n  As a result, topological quantum observables form Pontrjagin homology\nalgebras of mapping spaces from the orbi-fixed worldvolume into a classifying\n2-sphere. Remarkably, results from algebraic topology imply from this the\nquantum observables and modular functor of abelian Chern-Simons theory, as well\nas braid group actions on defect anyons of the kind envisioned as hardware for\ntopologically protected quantum gates.",
            "pdf_url": "http://arxiv.org/pdf/2501.17927v2",
            "published": "2025-01-29 19:00:04+00:00",
            "updated": "2025-02-24 16:49:45+00:00"
        },
        {
            "title": "Hyperfine and Zeeman Optical Pumping and Transverse Laser Cooling of a Thermal Atomic Beam of Dysprosium Using a Single 421 nm Laser",
            "authors": "Rohan Chakravarthy, Jonathan Agil, Arijit Sharma, Jung Bog Kim, Dmitry Budker",
            "summary": "We demonstrate the effect of Zeeman and hyperfine optical pumping and\ntransverse laser cooling of a dysprosium (Dy) atomic beam on the $4f^{10}6s^2(J\n= 8) \\rightarrow 4f^{10}6s6p(J = 9)$ transition at 421.291 nm. For $^{163}$Dy,\nan electro-optic modulator is used to generate five frequency sidebands\nrequired to pump the atoms to the $F = 10.5$ ground state hyperfine level and\nthe light polarization is chosen to pump the atoms to the $m_F = 10.5$ Zeeman\nsublevel. The atoms are simultaneously laser-cooled using a standing wave\northogonal to the atomic beam. The resulting polarized and cooled atomic beam\nwill be used in fundamental physics experiments taking advantage of the\naccidental degeneracy of excited states in Dy including the ongoing measurement\nof parity violation in this system.",
            "pdf_url": "http://arxiv.org/pdf/2502.17310v1",
            "published": "2025-02-24 16:46:12+00:00",
            "updated": "2025-02-24 16:46:12+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "S4S: Solving for a Diffusion Model Solver",
            "authors": "Eric Frankel, Sitan Chen, Jerry Li, Pang Wei Koh, Lillian J. Ratliff, Sewoong Oh",
            "summary": "Diffusion models (DMs) create samples from a data distribution by starting\nfrom random noise and iteratively solving a reverse-time ordinary differential\nequation (ODE). Because each step in the iterative solution requires an\nexpensive neural function evaluation (NFE), there has been significant interest\nin approximately solving these diffusion ODEs with only a few NFEs without\nmodifying the underlying model. However, in the few NFE regime, we observe that\ntracking the true ODE evolution is fundamentally impossible using traditional\nODE solvers. In this work, we propose a new method that learns a good solver\nfor the DM, which we call Solving for the Solver (S4S). S4S directly optimizes\na solver to obtain good generation quality by learning to match the output of a\nstrong teacher solver. We evaluate S4S on six different pre-trained DMs,\nincluding pixel-space and latent-space DMs for both conditional and\nunconditional sampling. In all settings, S4S uniformly improves the sample\nquality relative to traditional ODE solvers. Moreover, our method is\nlightweight, data-free, and can be plugged in black-box on top of any\ndiscretization schedule or architecture to improve performance. Building on top\nof this, we also propose S4S-Alt, which optimizes both the solver and the\ndiscretization schedule. By exploiting the full design space of DM solvers,\nwith 5 NFEs, we achieve an FID of 3.73 on CIFAR10 and 13.26 on MS-COCO,\nrepresenting a $1.5\\times$ improvement over previous training-free ODE methods.",
            "pdf_url": "http://arxiv.org/pdf/2502.17423v1",
            "published": "2025-02-24 18:55:54+00:00",
            "updated": "2025-02-24 18:55:54+00:00"
        },
        {
            "title": "Score Change of Variables",
            "authors": "Stephen Robbins",
            "summary": "We derive a general change of variables formula for score functions, showing\nthat for a smooth, invertible transformation $\\mathbf{y} = \\phi(\\mathbf{x})$,\nthe transformed score function $\\nabla_{\\mathbf{y}} \\log q(\\mathbf{y})$ can be\nexpressed directly in terms of $\\nabla_{\\mathbf{x}} \\log p(\\mathbf{x})$. Using\nthis result, we develop two applications: First, we establish a reverse-time\nIt\\^o lemma for score-based diffusion models, allowing the use of\n$\\nabla_{\\mathbf{x}} \\log p_t(\\mathbf{x})$ to reverse an SDE in the transformed\nspace without directly learning $\\nabla_{\\mathbf{y}} \\log q_t(\\mathbf{y})$.\nThis approach enables training diffusion models in one space but sampling in\nanother, effectively decoupling the forward and reverse processes. Second, we\nintroduce generalized sliced score matching, extending traditional sliced score\nmatching from linear projections to arbitrary smooth transformations. This\nprovides greater flexibility in high-dimensional density estimation. We\ndemonstrate these theoretical advances through applications to diffusion on the\nprobability simplex and empirically compare our generalized score matching\napproach against traditional sliced score matching methods.",
            "pdf_url": "http://arxiv.org/pdf/2412.07904v3",
            "published": "2024-12-10 20:27:15+00:00",
            "updated": "2025-02-24 17:56:03+00:00"
        },
        {
            "title": "FetDTIAlign: A Deep Learning Framework for Affine and Deformable Registration of Fetal Brain dMRI",
            "authors": "Bo Li, Qi Zeng, Simon K. Warfield, Davood Karimi",
            "summary": "Diffusion MRI (dMRI) provides unique insights into fetal brain microstructure\nin utero. Longitudinal and cross-sectional fetal dMRI studies can reveal\ncrucial neurodevelopmental changes but require precise spatial alignment across\nscans and subjects. This is challenging due to low data quality, rapid brain\ndevelopment, and limited anatomical landmarks. Existing registration methods,\ndesigned for high-quality adult data, struggle with these complexities. To\naddress this, we introduce FetDTIAlign, a deep learning approach for fetal\nbrain dMRI registration, enabling accurate affine and deformable alignment.\nFetDTIAlign features a dual-encoder architecture and iterative feature-based\ninference, reducing the impact of noise and low resolution. It optimizes\nnetwork configurations and domain-specific features at each registration stage,\nenhancing both robustness and accuracy. We validated FetDTIAlign on data from\n23 to 36 weeks gestation, covering 60 white matter tracts. It consistently\noutperformed two classical optimization-based methods and a deep learning\npipeline, achieving superior anatomical correspondence. Further validation on\nexternal data from the Developing Human Connectome Project confirmed its\ngeneralizability across acquisition protocols. Our results demonstrate the\nfeasibility of deep learning for fetal brain dMRI registration, providing a\nmore accurate and reliable alternative to classical techniques. By enabling\nprecise cross-subject and tract-specific analyses, FetDTIAlign supports new\ndiscoveries in early brain development.",
            "pdf_url": "http://arxiv.org/pdf/2502.01057v3",
            "published": "2025-02-03 05:10:00+00:00",
            "updated": "2025-02-24 17:55:45+00:00"
        },
        {
            "title": "HybridLinker: Topology-Guided Posterior Sampling for Enhanced Diversity and Validity in 3D Molecular Linker Generation",
            "authors": "Minyeong Hwang, Ziseok Lee, Gwangsoo Kim, Kyungsu Kim, Eunho Yang",
            "summary": "Linker generation is critical in drug discovery applications such as lead\noptimization and PROTAC design, where molecular fragments are assembled into\ndiverse drug candidates. Existing methods fall into PC-Free and PC-Aware\ncategories based on their use of 3D point clouds (PC). PC-Free models\nprioritize diversity but suffer from lower validity due to overlooking PC\nconstraints, while PC-Aware models ensure higher validity but restrict\ndiversity by enforcing strict PC constraints. To overcome these trade-offs\nwithout additional training, we propose HybridLinker, a framework that enhances\nPC-Aware inference by providing diverse bonding topologies from a pretrained\nPC-Free model as guidance. At its core, we propose LinkerDPS, the first\ndiffusion posterior sampling (DPS) method operating across PC-Free and PC-Aware\nspaces, bridging molecular topology with 3D point clouds via an energy-inspired\nfunction. By transferring the diverse sampling distribution of PC-Free models\ninto the PC-Aware distribution, HybridLinker significantly and consistently\nsurpasses baselines, improving both validity and diversity in foundational\nmolecular design and applied property optimization tasks, establishing a new\nDPS framework in the molecular and graph domains beyond imaging.",
            "pdf_url": "http://arxiv.org/pdf/2502.17349v1",
            "published": "2025-02-24 17:23:40+00:00",
            "updated": "2025-02-24 17:23:40+00:00"
        },
        {
            "title": "AnyTop: Character Animation Diffusion with Any Topology",
            "authors": "Inbar Gat, Sigal Raab, Guy Tevet, Yuval Reshef, Amit H. Bermano, Daniel Cohen-Or",
            "summary": "Generating motion for arbitrary skeletons is a longstanding challenge in\ncomputer graphics, remaining largely unexplored due to the scarcity of diverse\ndatasets and the irregular nature of the data. In this work, we introduce\nAnyTop, a diffusion model that generates motions for diverse characters with\ndistinct motion dynamics, using only their skeletal structure as input. Our\nwork features a transformer-based denoising network, tailored for arbitrary\nskeleton learning, integrating topology information into the traditional\nattention mechanism. Additionally, by incorporating textual joint descriptions\ninto the latent feature representation, AnyTop learns semantic correspondences\nbetween joints across diverse skeletons. Our evaluation demonstrates that\nAnyTop generalizes well, even with as few as three training examples per\ntopology, and can produce motions for unseen skeletons as well. Furthermore,\nour model's latent space is highly informative, enabling downstream tasks such\nas joint correspondence, temporal segmentation and motion editing. Our webpage,\nhttps://anytop2025.github.io/Anytop-page, includes links to videos and code.",
            "pdf_url": "http://arxiv.org/pdf/2502.17327v1",
            "published": "2025-02-24 17:00:36+00:00",
            "updated": "2025-02-24 17:00:36+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Rebalancing the Scales: A Systematic Mapping Study of Generative Adversarial Networks (GANs) in Addressing Data Imbalance",
            "authors": "Pankaj Yadav, Gulshan Sihag, Vivek Vijay",
            "summary": "Machine learning algorithms are used in diverse domains, many of which face\nsignificant challenges due to data imbalance. Studies have explored various\napproaches to address the issue, like data preprocessing, cost-sensitive\nlearning, and ensemble methods. Generative Adversarial Networks (GANs) showed\nimmense potential as a data preprocessing technique that generates good quality\nsynthetic data. This study employs a systematic mapping methodology to analyze\n3041 papers on GAN-based sampling techniques for imbalanced data sourced from\nfour digital libraries. A filtering process identified 100 key studies spanning\ndomains such as healthcare, finance, and cybersecurity. Through comprehensive\nquantitative analysis, this research introduces three categorization mappings\nas application domains, GAN techniques, and GAN variants used to handle the\nimbalanced nature of the data. GAN-based over-sampling emerges as an effective\npreprocessing method. Advanced architectures and tailored frameworks helped\nGANs to improve further in the case of data imbalance. GAN variants like\nvanilla GAN, CTGAN, and CGAN show great adaptability in structured imbalanced\ndata cases. Interest in GANs for imbalanced data has grown tremendously,\ntouching a peak in recent years, with journals and conferences playing crucial\nroles in transmitting foundational theories and practical applications. While\nwith these advances, none of the reviewed studies explicitly explore hybridized\nGAN frameworks with diffusion models or reinforcement learning techniques. This\ngap leads to a future research idea develop innovative approaches for\neffectively handling data imbalance.",
            "pdf_url": "http://arxiv.org/pdf/2502.16535v1",
            "published": "2025-02-23 11:03:29+00:00",
            "updated": "2025-02-23 11:03:29+00:00"
        }
    ]
}