{
    "Physics": [
        {
            "title": "Accurate Point Defect Energy Levels from Non-Empirical Screened Range-Separated Hybrid Functionals: the Case of Native Vacancies in ZnO",
            "authors": "Sijia Ke, Stephen E. Gant, Leeor Kronik, Jeffrey B. Neaton",
            "summary": "We use density functional theory (DFT) with non-empirically tuned screened\nrange-separated hybrid (SRSH) functionals to calculate the electronic\nproperties of native zinc and oxygen vacancy point defects in ZnO, and we\npredict their defect levels for thermal and optical transitions in excellent\nagreement with available experiments and prior calculations that use empirical\nhybrid functionals. The ability of this non-empirical first-principles\nframework to accurately predict quantities of relevance to both bulk and defect\nlevel spectroscopy enables high-accuracy DFT calculations with non-empirical\nhybrid functionals for defect physics, at a reduced computational cost.",
            "pdf_url": "http://arxiv.org/pdf/2504.13799v1",
            "published": "2025-04-18 17:01:33+00:00",
            "updated": "2025-04-18 17:01:33+00:00"
        },
        {
            "title": "Meta-Learning and Knowledge Discovery based Physics-Informed Neural Network for Remaining Useful Life Prediction",
            "authors": "Yu Wang, Shujie Liu, Shuai Lv, Gengshuo Liu",
            "summary": "Predicting the remaining useful life (RUL) of rotating machinery is critical\nfor industrial safety and maintenance, but existing methods struggle with\nscarce target-domain data and unclear degradation dynamics. We propose a\nMeta-Learning and Knowledge Discovery-based Physics-Informed Neural Network\n(MKDPINN) to address these challenges. The method first maps noisy sensor data\nto a low-dimensional hidden state space via a Hidden State Mapper (HSM). A\nPhysics-Guided Regulator (PGR) then learns unknown nonlinear PDEs governing\ndegradation evolution, embedding these physical constraints into the PINN\nframework. This integrates data-driven and physics-based approaches. The\nframework uses meta-learning, optimizing across source-domain meta-tasks to\nenable few-shot adaptation to new target tasks. Experiments on industrial data\nand the C-MAPSS benchmark show MKDPINN outperforms baselines in generalization\nand accuracy, proving its effectiveness for RUL prediction under data scarcity",
            "pdf_url": "http://arxiv.org/pdf/2504.13797v1",
            "published": "2025-04-18 16:58:38+00:00",
            "updated": "2025-04-18 16:58:38+00:00"
        },
        {
            "title": "Neutrino Scattering: Connections Across Theory and Experiment",
            "authors": "L. Alvarez-Ruso, A. M. Ankowski, A. Ashkenazi, J. Barrow, M. Betancourt, K. Borah, M. Sajjad Athar, E. Catano-Mur, P. Coloma, P. Dunne, L. Doria, A. Fedynitch, A. Garcia-Soto, S. Gardiner, R. Gonzalez-Jimenez, P. Huber, N. Jachowicz, E. Kajomovitz, B. Klicek, J. Kopp, K. Long, I. Martinez-Soler, A. S. Meyer, C. Marshall, L. Munteanu, A. Nikolakopoulos, V. Pandey, A. Papadopoulou, M. Scott, N. Rocco, K. Scholberg, J. E. Sobczyk, C. Wret, Z. Tabrizi",
            "summary": "In this document drafted by the Neutrino Scattering Theory Experiment\nCollaboration (NuSTEC), we provide input on the synergies between theoretical\nand experimental efforts that can provide critical input to the prediction\naccuracy needed for the forthcoming high-precision neutrino measurements. These\nefforts involve a wide range of energies and interaction processes, as well as\ntarget nuclei and interaction probes. The challenges discussed will be overcome\nonly through the active support of integrated collaboration across strong and\nelectroweak physics from both the nuclear and high energy physics communities.",
            "pdf_url": "http://arxiv.org/pdf/2503.23556v3",
            "published": "2025-03-30 18:40:53+00:00",
            "updated": "2025-04-18 16:41:55+00:00"
        },
        {
            "title": "Equi-Euler GraphNet: An Equivariant, Temporal-Dynamics Informed Graph Neural Network for Dual Force and Trajectory Prediction in Multi-Body Systems",
            "authors": "Vinay Sharma, Rémi Tanguy Oddon, Pietro Tesini, Jens Ravesloot, Cees Taal, Olga Fink",
            "summary": "Accurate real-time modeling of multi-body dynamical systems is essential for\nenabling digital twin applications across industries. While many data-driven\napproaches aim to learn system dynamics, jointly predicting internal loads and\nsystem trajectories remains a key challenge. This dual prediction is especially\nimportant for fault detection and predictive maintenance, where internal\nloads-such as contact forces-act as early indicators of faults, reflecting wear\nor misalignment before affecting motion. These forces also serve as inputs to\ndegradation models (e.g., crack growth), enabling damage prediction and\nremaining useful life estimation. We propose Equi-Euler GraphNet, a\nphysics-informed graph neural network (GNN) that simultaneously predicts\ninternal forces and global trajectories in multi-body systems. In this\nmesh-free framework, nodes represent system components and edges encode\ninteractions. Equi-Euler GraphNet introduces two inductive biases: (1) an\nequivariant message-passing scheme, interpreting edge messages as interaction\nforces consistent under Euclidean transformations; and (2) a temporal-aware\niterative node update mechanism, based on Euler integration, to capture\ninfluence of distant interactions over time. Tailored for cylindrical roller\nbearings, it decouples ring dynamics from constrained motion of rolling\nelements. Trained on high-fidelity multiphysics simulations, Equi-Euler\nGraphNet generalizes beyond the training distribution, accurately predicting\nloads and trajectories under unseen speeds, loads, and configurations. It\noutperforms state-of-the-art GNNs focused on trajectory prediction, delivering\nstable rollouts over thousands of time steps with minimal error accumulation.\nAchieving up to a 200x speedup over conventional solvers while maintaining\ncomparable accuracy, it serves as an efficient reduced-order model for digital\ntwins, design, and maintenance.",
            "pdf_url": "http://arxiv.org/pdf/2504.13768v1",
            "published": "2025-04-18 16:09:57+00:00",
            "updated": "2025-04-18 16:09:57+00:00"
        },
        {
            "title": "Explanation for the development of surface -plasma method of negative ion production in BINP and around the World",
            "authors": "Vadim Dudnikov",
            "summary": "Development of charge-exchange ions injection into circular accelerators and\nstorage rings and development of surface-plasma method of negative ion\nproduction in Budker Institute of Nuclear Physics (Novosibirsk) and around the\nWorld are described.",
            "pdf_url": "http://arxiv.org/pdf/2504.13742v1",
            "published": "2025-04-18 15:17:15+00:00",
            "updated": "2025-04-18 15:17:15+00:00"
        },
        {
            "title": "Expected statistical uncertainties at future $e^+e^-$ colliders",
            "authors": "Hieu Minh Tran, Sang Quang Dinh, Trang Quynh Trieu",
            "summary": "In future colliders, the frontiers of luminosity and energy are extended to\nexplore the physics of elementary particles at extremely high precision, and to\ndiscover new phenomena suggested from current experimental anomalies. In this\nletter, we present a simple method to estimate the expected statistical\nuncertainties of scattering cross sections at future colliders using their\nconceptual design reports. In particular, the expected statistical\nuncertainties of muon pair production cross section at the Future Circular\nCollider (FCC-ee) and the Circular Electron-Positron Collider (CEPC) are\ncalculated. The results can be used to set a goal for systematic uncertainty\nimprovement, to determine the standard model parameters accurately, and to\nidentify the viable parameter space of new physics models.",
            "pdf_url": "http://arxiv.org/pdf/2504.13734v1",
            "published": "2025-04-18 15:02:55+00:00",
            "updated": "2025-04-18 15:02:55+00:00"
        },
        {
            "title": "The relativity of color perception",
            "authors": "Michel Berthier, Valerie Garcin, Nicoletta Prencipe, Edoardo Provenzi",
            "summary": "Physical colors, i.e. reflected or emitted lights entering the eyes from a\nvisual environment, are converted into perceived colors sensed by humans by\nneurophysiological mechanisms. These processes involve both three types of\nphotoreceptors, the LMS cones, and spectrally opponent and non-opponent\ninteractions resulting from the activity rates of ganglion and lateral\ngeniculate nucleus cells. Thus, color perception is a phenomenon inherently\nlinked to an experimental environment (the visual scene) and an observing\napparatus (the human visual system). This is clearly reminiscent of the\nconceptual foundation of both relativity and quantum mechanics, where the link\nis between a physical system and the measuring instruments. The relationship\nbetween color perception and relativity was explicitly examined for the first\ntime by the physicist H. Yilmaz in 1962 from an experimental point of view. The\nmain purpose of this contribution is to present a rigorous mathematical model\nthat, by taking into account both trichromacy and color opponency, permits to\nexplain on a purely theoretical basis the relativistic color perception\nphenomena argued by Yilmaz. Instead of relying directly on relativistic\nconsiderations, we base our theory on a quantum interpretation of color\nperception together with just one assumption, called trichromacy axiom, that\nsummarizes well-established properties of trichromatic color vision within the\nframework of Jordan algebras. We show how this approach allows us to reconcile\ntrichromacy with Hering's opponency and also to derive the relativistic\nproperties of perceived colors without any additional mathematical or\nexperimental assumption.",
            "pdf_url": "http://arxiv.org/pdf/2504.13720v1",
            "published": "2025-04-18 14:46:29+00:00",
            "updated": "2025-04-18 14:46:29+00:00"
        },
        {
            "title": "Landscape of Quantum Information Science and Engineering Education: From Physics Foundations to Interdisciplinary Frontiers",
            "authors": "A. R. Piña, Shams El-Adawy, Mike Verostek, Brett T. Boyle, Mateo Cacheiro, Matt Lawler, Namitha Pradeep, Ella Watts, Colin G. West, H. J. Lewandowski, Benjamin M. Zwickl",
            "summary": "Quantum Information Science and Engineering (QISE) is rapidly gaining\ninterest from those within many disciplines and higher education needs to adapt\nto the changing landscape. Although QISE education still has a strong presence\nand roots in physics, the field is becoming increasingly interdisciplinary.\nThere is a need to understand the presence of QISE instruction and\nquantum-related instruction across all disciplines in order to figure out where\nQISE education is already happening and where it could be expanded. Although\nthere is recent work that characterizes introductory QISE courses, there is no\nholistic picture of the landscape of QISE and quantum-related education in the\nUnited States. We analyzed course catalogs from 1,456 U.S. institutions. We\nfound 61 institutions offering QISE degree programs, mostly at PhD-granting\nschools, with physics, electrical and computer engineering (ECE), and computer\nscience(CS) as their primary contributors . Across all institutions, we\nidentified over 8,000 courses mentioning 'quantum,' but about one-third of\ninstitutions in our study had none. We also found over 500 dedicated QISE\ncourses, concentrated in PhD-granting institutions, primarily in physics, ECE,\nand CS. Physics leads in offering both general quantum-related ($\\sim$4,700)\nand QISE-specific ($\\sim$200) courses. Across multiple disciplines, we see that\nQISE topics are being introduced in courses not fully dedicated to QISE, which\nmay be a productive strategy for increasing access to QISE education. Our\ndataset and analysis provide the most comprehensive overview to date of quantum\neducation across US higher education. To ensure broad access, all data are\npublicly available and downloadable at quantumlandscape.streamlit.app. We hope\nthese findings will support and guide future efforts in curriculum design,\nworkforce development, and education policy across the quantum ecosystem.",
            "pdf_url": "http://arxiv.org/pdf/2504.13719v1",
            "published": "2025-04-18 14:41:58+00:00",
            "updated": "2025-04-18 14:41:58+00:00"
        },
        {
            "title": "Exploring unique design features of the Monolithic Stitched Sensor with Timing (MOST): yield, powering, timing, and sensor reverse bias",
            "authors": "Mariia Selina, R. Barthel, S. Bugiel, L. Cecconi, J. De Melo, M. Fransen, A. Grelli, I. Hobus, A. Isakov, A. Junique, P. Leitao, M. Mager, Y. Otarid, F. Piro, M. J. Rossewij, S. Solokhin, J. Sonneveld, W. Snoeys, N. Tiltmann, A. Vitkovskiy, H. Wennloef",
            "summary": "Monolithic stitched CMOS sensors are explored for the upgrade of Inner\nTracking System of the ALICE experiment (ITS3) and the R&D of the CERN\nExperimental Physics Department. To learn about stitching, two 26 cm long\nstitched sensors, the Monolithic Stitched Sensor (MOSS), and the Monolithic\nStitched Sensor with Timing (MOST), were implemented in the Engineering Round 1\n(ER1) in the TPSCo 65nm ISC technology. Contrary to the MOSS, powered by 20\ndistinct power domains accessible from separate pads, the MOST has one global\nanalog and digital power domain to or from which small fractions of the matrix\ncan be connected or disconnected by conservatively designed power switches to\nprevent shorts or defects from affecting the full chip. Instead of the\nsynchronous readout in the MOSS, the MOST immediately transfers hit information\nupon a hit, preserving timing information. The sensor reverse bias is also\napplied through the bias of the front-end rather than by a reverse substrate\nbias. This paper presents the first characterization results of the MOST, with\nthe focus on its specific characteristics, including yield analysis, precise\ntiming measurements, and the potential of its alternative biasing approach for\nimproved sensor performance.",
            "pdf_url": "http://arxiv.org/pdf/2504.13696v1",
            "published": "2025-04-18 13:56:45+00:00",
            "updated": "2025-04-18 13:56:45+00:00"
        },
        {
            "title": "Adiabatic Fine-Tuning of Neural Quantum States Enables Detection of Phase Transitions in Weight Space",
            "authors": "Vinicius Hernandes, Thomas Spriggs, Saqar Khaleefah, Eliska Greplova",
            "summary": "Neural quantum states (NQS) have emerged as a powerful tool for approximating\nquantum wavefunctions using deep learning. While these models achieve\nremarkable accuracy, understanding how they encode physical information remains\nan open challenge. In this work, we introduce adiabatic fine-tuning, a scheme\nthat trains NQS across a phase diagram, leading to strongly correlated weight\nrepresentations across different models. This correlation in weight space\nenables the detection of phase transitions in quantum systems by analyzing the\ntrained network weights alone. We validate our approach on the transverse field\nIsing model and the J1-J2 Heisenberg model, demonstrating that phase\ntransitions manifest as distinct structures in weight space. Our results\nestablish a connection between physical phase transitions and the geometry of\nneural network parameters, opening new directions for the interpretability of\nmachine learning models in physics.",
            "pdf_url": "http://arxiv.org/pdf/2503.17140v2",
            "published": "2025-03-21 13:42:11+00:00",
            "updated": "2025-04-18 13:30:49+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Decoding Vision Transformers: the Diffusion Steering Lens",
            "authors": "Ryota Takatsuki, Sonia Joseph, Ippei Fujisawa, Ryota Kanai",
            "summary": "Logit Lens is a widely adopted method for mechanistic interpretability of\ntransformer-based language models, enabling the analysis of how internal\nrepresentations evolve across layers by projecting them into the output\nvocabulary space. Although applying Logit Lens to Vision Transformers (ViTs) is\ntechnically straightforward, its direct use faces limitations in capturing the\nrichness of visual representations. Building on the work of Toker et al.\n(2024)~\\cite{Toker2024-ve}, who introduced Diffusion Lens to visualize\nintermediate representations in the text encoders of text-to-image diffusion\nmodels, we demonstrate that while Diffusion Lens can effectively visualize\nresidual stream representations in image encoders, it fails to capture the\ndirect contributions of individual submodules. To overcome this limitation, we\npropose \\textbf{Diffusion Steering Lens} (DSL), a novel, training-free approach\nthat steers submodule outputs and patches subsequent indirect contributions. We\nvalidate our method through interventional studies, showing that DSL provides\nan intuitive and reliable interpretation of the internal processing in ViTs.",
            "pdf_url": "http://arxiv.org/pdf/2504.13763v1",
            "published": "2025-04-18 16:00:53+00:00",
            "updated": "2025-04-18 16:00:53+00:00"
        },
        {
            "title": "Adjoint Sampling: Highly Scalable Diffusion Samplers via Adjoint Matching",
            "authors": "Aaron Havens, Benjamin Kurt Miller, Bing Yan, Carles Domingo-Enrich, Anuroop Sriram, Brandon Wood, Daniel Levine, Bin Hu, Brandon Amos, Brian Karrer, Xiang Fu, Guan-Horng Liu, Ricky T. Q. Chen",
            "summary": "We introduce Adjoint Sampling, a highly scalable and efficient algorithm for\nlearning diffusion processes that sample from unnormalized densities, or energy\nfunctions. It is the first on-policy approach that allows significantly more\ngradient updates than the number of energy evaluations and model samples,\nallowing us to scale to much larger problem settings than previously explored\nby similar methods. Our framework is theoretically grounded in stochastic\noptimal control and shares the same theoretical guarantees as Adjoint Matching,\nbeing able to train without the need for corrective measures that push samples\ntowards the target distribution. We show how to incorporate key symmetries, as\nwell as periodic boundary conditions, for modeling molecules in both cartesian\nand torsional coordinates. We demonstrate the effectiveness of our approach\nthrough extensive experiments on classical energy functions, and further scale\nup to neural network-based energy models where we perform amortized conformer\ngeneration across many molecular systems. To encourage further research in\ndeveloping highly scalable sampling methods, we plan to open source these\nchallenging benchmarks, where successful methods can directly impact progress\nin computational chemistry.",
            "pdf_url": "http://arxiv.org/pdf/2504.11713v2",
            "published": "2025-04-16 02:20:06+00:00",
            "updated": "2025-04-18 15:57:13+00:00"
        },
        {
            "title": "ESPLoRA: Enhanced Spatial Precision with Low-Rank Adaption in Text-to-Image Diffusion Models for High-Definition Synthesis",
            "authors": "Andrea Rigo, Luca Stornaiuolo, Mauro Martino, Bruno Lepri, Nicu Sebe",
            "summary": "Diffusion models have revolutionized text-to-image (T2I) synthesis, producing\nhigh-quality, photorealistic images. However, they still struggle to properly\nrender the spatial relationships described in text prompts. To address the lack\nof spatial information in T2I generations, existing methods typically use\nexternal network conditioning and predefined layouts, resulting in higher\ncomputational costs and reduced flexibility. Our approach builds upon a curated\ndataset of spatially explicit prompts, meticulously extracted and synthesized\nfrom LAION-400M to ensure precise alignment between textual descriptions and\nspatial layouts. Alongside this dataset, we present ESPLoRA, a flexible\nfine-tuning framework based on Low-Rank Adaptation, specifically designed to\nenhance spatial consistency in generative models without increasing generation\ntime or compromising the quality of the outputs. In addition to ESPLoRA, we\npropose refined evaluation metrics grounded in geometric constraints, capturing\n3D spatial relations such as \\textit{in front of} or \\textit{behind}. These\nmetrics also expose spatial biases in T2I models which, even when not fully\nmitigated, can be strategically exploited by our TORE algorithm to further\nimprove the spatial consistency of generated images. Our method outperforms the\ncurrent state-of-the-art framework, CoMPaSS, by 13.33% on established spatial\nconsistency benchmarks.",
            "pdf_url": "http://arxiv.org/pdf/2504.13745v1",
            "published": "2025-04-18 15:21:37+00:00",
            "updated": "2025-04-18 15:21:37+00:00"
        },
        {
            "title": "Entropic Time Schedulers for Generative Diffusion Models",
            "authors": "Dejan Stancevic, Luca Ambrogioni",
            "summary": "The practical performance of generative diffusion models depends on the\nappropriate choice of the noise scheduling function, which can also be\nequivalently expressed as a time reparameterization. In this paper, we present\na time scheduler that selects sampling points based on entropy rather than\nuniform time spacing, ensuring that each point contributes an equal amount of\ninformation to the final generation. We prove that this time reparameterization\ndoes not depend on the initial choice of time. Furthermore, we provide a\ntractable exact formula to estimate this \\emph{entropic time} for a trained\nmodel using the training loss without substantial overhead. Alongside the\nentropic time, inspired by the optimality results, we introduce a rescaled\nentropic time. In our experiments with mixtures of Gaussian distributions and\nImageNet, we show that using the (rescaled) entropic times greatly improves the\ninference performance of trained models. In particular, we found that the image\nquality in pretrained EDM2 models, as evaluated by FID and FD-DINO scores, can\nbe substantially increased by the rescaled entropic time reparameterization\nwithout increasing the number of function evaluations, with greater\nimprovements in the few NFEs regime.",
            "pdf_url": "http://arxiv.org/pdf/2504.13612v1",
            "published": "2025-04-18 10:35:19+00:00",
            "updated": "2025-04-18 10:35:19+00:00"
        },
        {
            "title": "Task Assignment and Exploration Optimization for Low Altitude UAV Rescue via Generative AI Enhanced Multi-agent Reinforcement Learning",
            "authors": "Xin Tang, Qian Chen, Wenjie Weng, Chao Jin, Zhang Liu, Jiacheng Wang, Geng Sun, Xiaohuan Li, Dusit Niyato",
            "summary": "Artificial Intelligence (AI)-driven convolutional neural networks enhance\nrescue, inspection, and surveillance tasks performed by low-altitude uncrewed\naerial vehicles (UAVs) and ground computing nodes (GCNs) in unknown\nenvironments. However, their high computational demands often exceed a single\nUAV's capacity, leading to system instability, further exacerbated by the\nlimited and dynamic resources of GCNs. To address these challenges, this paper\nproposes a novel cooperation framework involving UAVs, ground-embedded robots\n(GERs), and high-altitude platforms (HAPs), which enable resource pooling\nthrough UAV-to-GER (U2G) and UAV-to-HAP (U2H) communications to provide\ncomputing services for UAV offloaded tasks. Specifically, we formulate the\nmulti-objective optimization problem of task assignment and exploration\noptimization in UAVs as a dynamic long-term optimization problem. Our objective\nis to minimize task completion time and energy consumption while ensuring\nsystem stability over time. To achieve this, we first employ the Lyapunov\noptimization technique to transform the original problem, with stability\nconstraints, into a per-slot deterministic problem. We then propose an\nalgorithm named HG-MADDPG, which combines the Hungarian algorithm with a\ngenerative diffusion model (GDM)-based multi-agent deep deterministic policy\ngradient (MADDPG) approach. We first introduce the Hungarian algorithm as a\nmethod for exploration area selection, enhancing UAV efficiency in interacting\nwith the environment. We then innovatively integrate the GDM and multi-agent\ndeep deterministic policy gradient (MADDPG) to optimize task assignment\ndecisions, such as task offloading and resource allocation. Simulation results\ndemonstrate the effectiveness of the proposed approach, with significant\nimprovements in task offloading efficiency, latency reduction, and system\nstability compared to baseline methods.",
            "pdf_url": "http://arxiv.org/pdf/2504.13554v1",
            "published": "2025-04-18 08:44:06+00:00",
            "updated": "2025-04-18 08:44:06+00:00"
        }
    ]
}