{
    "Physics": [
        {
            "title": "Non-Universality from Conserved Superoperators in Unitary Circuits",
            "authors": "Marco Lastres, Frank Pollmann, Sanjay Moudgalya",
            "summary": "An important result in the theory of quantum control is the \"universality\" of\n$2$-local unitary gates, i.e. the fact that any global unitary evolution of a\nsystem of $L$ qudits can be implemented by composition of $2$-local unitary\ngates. Surprisingly, recent results have shown that universality can break down\nin the presence of symmetries: in general, not all globally symmetric unitaries\ncan be constructed using $k$-local symmetric unitary gates. This also restricts\nthe dynamics that can be implemented by symmetric local Hamiltonians. In this\npaper, we show that obstructions to universality in such settings can in\ngeneral be understood in terms of superoperator symmetries associated with\nunitary evolution by restricted sets of gates. These superoperator symmetries\nlead to block decompositions of the operator Hilbert space, which dictate the\nconnectivity of operator space, and hence the structure of the dynamical Lie\nalgebra. We demonstrate this explicitly in several examples by systematically\nderiving the superoperator symmetries from the gate structure using the\nframework of commutant algebras, which has been used to systematically derive\nsymmetries in other quantum many-body systems. We clearly delineate two\ndifferent types of non-universality, which stem from different structures of\nthe superoperator symmetries, and discuss its signatures in physical\nobservables. In all, our work establishes a comprehensive framework to explore\nthe universality of unitary circuits and derive physical consequences of its\nabsence.",
            "pdf_url": "http://arxiv.org/pdf/2409.11407v2",
            "published": "2024-09-17 17:59:42+00:00",
            "updated": "2024-10-16 17:55:01+00:00"
        },
        {
            "title": "Optomechanical self-organization in a mesoscopic atom array",
            "authors": "Jacquelyn Ho, Yue-Hui Lu, Tai Xiang, Cosimo C. Rusconi, Stuart J. Masson, Ana Asenjo-Garcia, Zhenjie Yan, Dan M. Stamper-Kurn",
            "summary": "A fundamental challenge in modern physics is bridging the gap between an\nexact description of few-body microscopic systems and the emergent description\nof many-body macroscopic systems. This gap may be bridged by tracing the\nproperties of well-controlled intermediate-size mesoscopic systems. Here, we\nstudy mesoscopic signatures of a spatial self-organization phase transition in\ndeterministically prepared arrays of between 10 and 22 atoms inside an optical\ncavity. Through precise engineering of the atom-cavity interactions, we reveal\nhow critical behavior depends on atom number. We identify characteristic\ndynamical behaviors related to symmetry breaking and system size in the\nself-organized regime, and observe a finite optomechanical susceptibility at\nthe critical point. This work opens the door to probing particle-number- and\ntime-resolved properties of phase transitions in mesoscopic systems.",
            "pdf_url": "http://arxiv.org/pdf/2410.12754v1",
            "published": "2024-10-16 17:18:15+00:00",
            "updated": "2024-10-16 17:18:15+00:00"
        },
        {
            "title": "A transformational approach to collective behavior",
            "authors": "Michael E. Glinsky",
            "summary": "This paper presents a revolutionary approach to the characterization,\nforecast, and control of collective systems. Collective systems are an ensemble\nof conservatively interacting entities. The evolution of the entities are\ndetermined by symmetries of the entities. Collective systems take many\ndifferent forms. A plasma is a collective of charged particles, a fluid is a\ncollective of molecules, a elementary field is a collective of elementary\nparticles, and a cosmos is a collective of celestial bodies. Our new theory\nbuilds on the canonical transformation approach to dynamics. This approach\nrecognizes that the symmetry leads to the conservation of a real function, that\nis the infinitesimal generator of a Lie group. The finite generator of the\ncanonical transformation is derived from the infinitesimal generator by the\nsolution of the Hamilton-Jacobi equation. This generating function is also\nknown as the action, the entropy, and the logarithmic likelihood. The new\ntheory generalizes this generating function to the generating functional of the\ncollective field. Finally, this paper derives the formula for the Mayer Cluster\nExpansion, or the S-matrix expansion of the generating functional. We call it\nthe Heisenberg Scattering Transformation (HST). Practically, this is a\nlocalized Fourier Transformation, whose principal components give the\nsingularity spectrums, that is the solution to the Renormalization Group\nEquations. Limitations on the measurement of the system (that is the Born Rule\nand the Heisenberg Uncertainty Principle) lead to quantization of the\nstochastic probabilities of the collective field. How different collective\nsystems couple together to form systems-of-systems is formalized. The details\nof a practical implementation of the HST will be presented.",
            "pdf_url": "http://arxiv.org/pdf/2410.08558v2",
            "published": "2024-10-11 06:19:57+00:00",
            "updated": "2024-10-16 16:55:09+00:00"
        },
        {
            "title": "Quantum Embedding of Non-local Quantum Many-body Interactions in Prototypal Anti-tumor Vaccine Metalloprotein on Near Term Quantum Computing Hardware",
            "authors": "Elena Chachkarova, Terence Tse, Cedric Weber, Yordan Yordanov, Yao Wei",
            "summary": "The real world obeys quantum physics and quantum computing presents an\nalternative way to map physical problems to systems that follow the same laws.\nSuch computation fundamentally constitutes a better way to understand the most\nchallenging quantum problems. One such problem is the accurate simulation of\nhighly correlated quantum systems. Due to the high dimensionality of the\nproblem classical computers require considerable computer power to accurately\npredict material properties, especially when strong electron interactions are\npresent. Still, modern day quantum hardware has many limitations and only\nallows for modeling of very simple systems. Here we present for the first time\na quantum computer model simulation of a complex hemocyanin molecule, which is\nan important respiratory protein involved in various physiological processes\nsuch as oxygen transport and immune defence, and is also used as a key\ncomponent in therapeutic vaccines for cancer. To better characterise the\nmechanism by which hemocyanin transports oxygen, variational quantum\neigensolver (VQE) based on fermionic excitations and quantum embedding methods\nis used in the context of dynamic mean field theory to solve Anderson impurity\nmodel (AIM). Finally, it is concluded that the magnetic structure of hemocyanin\nis largely influenced by the many-body correction and that the computational\neffort for solving correlated electron systems could be substantially reduced\nwith the introduction of quantum computing algorithms. We encourage the use of\nthe Hamiltonian systems presented in this paper as a benchmark for testing\nquantum computing algorithms efficiency for chemistry applications.",
            "pdf_url": "http://arxiv.org/pdf/2410.12733v1",
            "published": "2024-10-16 16:49:42+00:00",
            "updated": "2024-10-16 16:49:42+00:00"
        },
        {
            "title": "Measurement of muon flux behind the beam dump of the J-PARC Hadron Experimental Facility",
            "authors": "T. Matsumura, Y. Hirayama, G. Y. Lim, H. Nanjo, T. Nomura, K. Shiomi, H. Watanabe",
            "summary": "A muon-flux measurement behind the beam dump of the J-PARC Hadron\nExperimental Facility was performed with a compact muon detector that can be\ninserted into a vertical observing hole with 81 mm in diameter which was dug\nunderground. The detector consists of 12 plastic scintillation strips with a\nlength of 80 mm each, which are arranged with cylindrical shape and contained\ninside an aluminum housing with an outer diameter of 75 mm. A silicon\nphotomultiplier is coupled to the end of each strip to collect the\nscintillating light. The flux of the muons penetrating the beam dump was\nscanned vertically at intervals of 0.5 m, showing a wide distribution with a\nmaximum at the beam level. The muon flux was consistent with the expectation\nfrom a Monte-Carlo simulation at more than 1 m away from the beam axis, which\nis expected to be used for signal-loss evaluation in the future KOTO II\nexperiment for measuring rare kaon decays. The data can also be used in\nimproving the accuracy of shielding calculations in the radiation protection.",
            "pdf_url": "http://arxiv.org/pdf/2407.17868v2",
            "published": "2024-07-25 08:42:02+00:00",
            "updated": "2024-10-16 16:34:21+00:00"
        },
        {
            "title": "The bulk one-arm exponent for the CLE$_{κ'}$ percolations",
            "authors": "Haoyu Liu, Xin Sun, Pu Yu, Zijie Zhuang",
            "summary": "The conformal loop ensemble (CLE) is a conformally invariant random\ncollection of loops. In the non-simple regime $\\kappa'\\in (4,8)$, it describes\nthe scaling limit of the critical Fortuin-Kasteleyn (FK) percolations. CLE\npercolations were introduced by Miller-Sheffield-Werner (2017). The\nCLE$_{\\kappa'}$ percolations describe the scaling limit of a natural variant of\nthe FK percolation called the fuzzy Potts model, which has an additional\npercolation parameter $r$. Based on CLE percolations and assuming that the\nconvergence of the FK percolation to CLE, K{\\\"o}hler-Schindler and Lehmkuehler\n(2022) derived all the arm exponents for the fuzzy Potts model except the bulk\none-arm exponent. In this paper, we exactly solve this exponent, which\nprescribes the dimension of the clusters in CLE$_{\\kappa'}$ percolations. As a\nspecial case, the bichromatic one-arm exponent for the critical 3-state Potts\nmodel should be $4/135$. To the best of our knowledge, this natural exponent\nwas not predicted in physics. Our derivation relies on the iterative\nconstruction of CLE percolations from the boundary conformal loop ensemble\n(BCLE), and the coupling between Liouville quantum gravity and SLE curves. The\nsource of the exact solvability comes from the structure constants of boundary\nLiouville conformal field theory. A key technical step is to prove a conformal\nwelding result for the target-invariant radial SLE curves. As intermediate\nsteps in our derivation, we obtain several exact results for BCLE in both the\nsimple and non-simple regimes, which extend results of Ang-Sun-Yu-Zhuang (2024)\non the touching probability of non-simple CLE. This also provides an\nalternative derivation of the relation between the BCLE parameter $\\rho$ and\nthe additional percolation parameter $r$ in CLE percolations, which was\noriginally due to Miller-Sheffield-Werner (2021, 2022).",
            "pdf_url": "http://arxiv.org/pdf/2410.12724v1",
            "published": "2024-10-16 16:32:57+00:00",
            "updated": "2024-10-16 16:32:57+00:00"
        },
        {
            "title": "Extreme time extrapolation capabilities and thermodynamic consistency of physics-inspired Neural Networks for the 3D microstructure evolution of materials via Cahn-Hilliard flow",
            "authors": "Daniele Lanzoni, Andrea Fantasia, Roberto Bergamaschini, Olivier Pierre-Louis, Francesco Montalenti",
            "summary": "A Convolutional Recurrent Neural Network (CRNN) is trained to reproduce the\nevolution of the spinodal decomposition process in three dimensions as\ndescribed by the Cahn-Hilliard equation. A specialized, physics-inspired\narchitecture is proven to provide close accordance between the predicted\nevolutions and the ground truth ones obtained via conventional integration\nschemes. The method can accurately reproduce the evolution of microstructures\nnot represented in the training set at a fraction of the computational costs.\nExtremely long-time extrapolation capabilities are achieved, up to reaching the\ntheoretically expected equilibrium state of the system, consisting of a\nlayered, phase-separated morphology, despite the training set containing only\nrelatively-short, initial phases of the evolution. Quantitative accordance with\nthe decay rate of the Free energy is also demonstrated up to the late\ncoarsening stages, proving that this class of Machine Learning approaches can\nbecome a new and powerful tool for the long timescale and high throughput\nsimulation of materials, while retaining thermodynamic consistency and\nhigh-accuracy.",
            "pdf_url": "http://arxiv.org/pdf/2407.20126v2",
            "published": "2024-07-29 15:55:52+00:00",
            "updated": "2024-10-16 16:20:44+00:00"
        },
        {
            "title": "Phase vs coin vs position disorder as a probe for the resilience and revival of single particle entanglement in cyclic quantum walks",
            "authors": "Dinesh Kumar Panda, Colin Benjamin",
            "summary": "Quantum states exhibiting single-particle entanglement (SPE) can encode and\nprocess quantum information more robustly than their multi-particle analogs.\nUnderstanding the vulnerability and resilience of SPE to disorder is therefore\ncrucial. This letter investigates phase, coin, and position disorder via\ndiscrete-time quantum walks on odd and even cyclic graphs to study their effect\non SPE. The reduction in SPE is insignificant for low levels of phase or coin\ndisorder, showing the resilience of SPE to minor perturbations. However, SPE is\nseen to be more vulnerable to position disorder. We analytically prove that\nmaximally entangled single-particle states (MESPS) at time step $t=1$ are\nimpervious to phase disorder regardless of the choice of the initial state.\nFurther, MESPS at timestep $t=1$ is also wholly immune to coin disorder for\nphase-symmetric initial states. Position disorder breaks odd-even parity and\ndistorts the physical time cone of the quantum walker, unlike phase or coin\ndisorder. SPE saturates towards a fixed value for position disorder,\nirrespective of the disorder strength at large timestep $t$. Furthermore, SPE\ncan be enhanced with moderate to significant phase or coin disorder strengths\nat specific time steps. Interestingly, disorder can revive single-particle\nentanglement from absolute zero in some instances, too. These results are\ncrucial in understanding single-particle entanglement evolution and dynamics in\na lab setting.",
            "pdf_url": "http://arxiv.org/pdf/2410.12710v1",
            "published": "2024-10-16 16:15:48+00:00",
            "updated": "2024-10-16 16:15:48+00:00"
        },
        {
            "title": "QPUF 2.0: Exploring Quantum Physical Unclonable Functions for Security-by-Design of Energy Cyber-Physical Systems",
            "authors": "Venkata K. V. V. Bathalapalli, Saraju P. Mohanty, Chenyun Pan, Elias Kougianos",
            "summary": "Sustainable advancement is being made to improve the efficiency of the\ngeneration, transmission, and distribution of renewable energy resources, as\nwell as managing them to ensure the reliable operation of the smart grid.\nSupervisory control and data acquisition (SCADA) enables sustainable management\nof grid communication flow through its real-time data sensing, processing, and\nactuation capabilities at various levels in the energy distribution framework.\nThe security vulnerabilities associated with the SCADA-enabled grid\ninfrastructure and management could jeopardize the smart grid operations. This\nwork explores the potential of Quantum Physical Unclonable Functions (QPUF) for\nthe security, privacy, and reliability of the smart grid's energy transmission\nand distribution framework.\n  Quantum computing has emerged as a formidable security solution for\nhigh-performance computing applications through its probabilistic nature of\ninformation processing. This work has a quantum hardware-assisted security\nmechanism based on intrinsic properties of quantum hardware driven by quantum\nmechanics to provide tamper-proof security for quantum computing driven smart\ngrid infrastructure. This work introduces a novel QPUF architecture using\nquantum logic gates based on quantum decoherence, entanglement, and\nsuperposition. This generates a unique bitstream for each quantum device as a\nfingerprint. The proposed QPUF design is evaluated on IBM and Google quantum\nsystems and simulators. The deployment on the IBM quantum simulator\n(ibmq_qasm_simulator) has achieved an average Hamming distance of 50.07%, 51%\nrandomness, and 86% of the keys showing 100% reliability.",
            "pdf_url": "http://arxiv.org/pdf/2410.12702v1",
            "published": "2024-10-16 16:04:45+00:00",
            "updated": "2024-10-16 16:04:45+00:00"
        },
        {
            "title": "Area measures and branched polymers in supercritical Liouville quantum gravity",
            "authors": "Manan Bhatia, Ewain Gwynne, Jinwoo Sung",
            "summary": "We study Liouville quantum gravity (LQG) in the supercritical (a.k.a.\nstrongly coupled) phase, which has background charge $Q \\in (0,2)$ and central\ncharge $\\mathbf{c}_{\\mathrm{L}} = 1+6Q^2 \\in (1,25)$. Recent works have shown\nhow to define LQG in this phase as a planar random geometry associated with a\nvariant of the Gaussian free field, which exhibits \"infinite spikes.\" In\ncontrast, a number of results from physics, dating back to the 1980s, suggest\nthat supercritical LQG surfaces should behave like \"branched polymers\": i.e.,\nthey should look like the continuum random tree. We prove a result which\nreconciles these two descriptions of supercritical LQG. More precisely, we show\nthat for a family of random planar maps with boundary in the universality class\nof supercritical LQG, if we condition on the (small probability) event that the\nplanar map is finite, then the scaling limit is the continuum random tree. We\nalso show that there does not exist any locally finite measure associated with\nsupercritical LQG which is locally determined by the field and satisfies the\nLQG coordinate change formula. Our proofs are based on a branching process\ndescription of supercritical LQG which comes from its coupling with CLE$_4$\n(Ang and Gwynne, arXiv:2308.11832).",
            "pdf_url": "http://arxiv.org/pdf/2410.12693v1",
            "published": "2024-10-16 15:53:45+00:00",
            "updated": "2024-10-16 15:53:45+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Meta-Unlearning on Diffusion Models: Preventing Relearning Unlearned Concepts",
            "authors": "Hongcheng Gao, Tianyu Pang, Chao Du, Taihang Hu, Zhijie Deng, Min Lin",
            "summary": "With the rapid progress of diffusion-based content generation, significant\nefforts are being made to unlearn harmful or copyrighted concepts from\npretrained diffusion models (DMs) to prevent potential model misuse. However,\nit is observed that even when DMs are properly unlearned before release,\nmalicious finetuning can compromise this process, causing DMs to relearn the\nunlearned concepts. This occurs partly because certain benign concepts (e.g.,\n\"skin\") retained in DMs are related to the unlearned ones (e.g., \"nudity\"),\nfacilitating their relearning via finetuning. To address this, we propose\nmeta-unlearning on DMs. Intuitively, a meta-unlearned DM should behave like an\nunlearned DM when used as is; moreover, if the meta-unlearned DM undergoes\nmalicious finetuning on unlearned concepts, the related benign concepts\nretained within it will be triggered to self-destruct, hindering the relearning\nof unlearned concepts. Our meta-unlearning framework is compatible with most\nexisting unlearning methods, requiring only the addition of an\neasy-to-implement meta objective. We validate our approach through empirical\nexperiments on meta-unlearning concepts from Stable Diffusion models (SD-v1-4\nand SDXL), supported by extensive ablation studies. Our code is available at\nhttps://github.com/sail-sg/Meta-Unlearning.",
            "pdf_url": "http://arxiv.org/pdf/2410.12777v1",
            "published": "2024-10-16 17:51:25+00:00",
            "updated": "2024-10-16 17:51:25+00:00"
        },
        {
            "title": "SAFREE: Training-Free and Adaptive Guard for Safe Text-to-Image And Video Generation",
            "authors": "Jaehong Yoon, Shoubin Yu, Vaidehi Patil, Huaxiu Yao, Mohit Bansal",
            "summary": "Recent advances in diffusion models have significantly enhanced their ability\nto generate high-quality images and videos, but they have also increased the\nrisk of producing unsafe content. Existing unlearning/editing-based methods for\nsafe generation remove harmful concepts from models but face several\nchallenges: (1) They cannot instantly remove harmful concepts without training.\n(2) Their safe generation capabilities depend on collected training data. (3)\nThey alter model weights, risking degradation in quality for content unrelated\nto toxic concepts. To address these, we propose SAFREE, a novel, training-free\napproach for safe T2I and T2V, that does not alter the model's weights.\nSpecifically, we detect a subspace corresponding to a set of toxic concepts in\nthe text embedding space and steer prompt embeddings away from this subspace,\nthereby filtering out harmful content while preserving intended semantics. To\nbalance the trade-off between filtering toxicity and preserving safe concepts,\nSAFREE incorporates a novel self-validating filtering mechanism that\ndynamically adjusts the denoising steps when applying the filtered embeddings.\nAdditionally, we incorporate adaptive re-attention mechanisms within the\ndiffusion latent space to selectively diminish the influence of features\nrelated to toxic concepts at the pixel level. In the end, SAFREE ensures\ncoherent safety checking, preserving the fidelity, quality, and safety of the\noutput. SAFREE achieves SOTA performance in suppressing unsafe content in T2I\ngeneration compared to training-free baselines and effectively filters targeted\nconcepts while maintaining high-quality images. It also shows competitive\nresults against training-based methods. We extend SAFREE to various T2I\nbackbones and T2V tasks, showcasing its flexibility and generalization. SAFREE\nprovides a robust and adaptable safeguard for ensuring safe visual generation.",
            "pdf_url": "http://arxiv.org/pdf/2410.12761v1",
            "published": "2024-10-16 17:32:23+00:00",
            "updated": "2024-10-16 17:32:23+00:00"
        },
        {
            "title": "Diffusion Language Models Are Versatile Protein Learners",
            "authors": "Xinyou Wang, Zaixiang Zheng, Fei Ye, Dongyu Xue, Shujian Huang, Quanquan Gu",
            "summary": "This paper introduces diffusion protein language model (DPLM), a versatile\nprotein language model that demonstrates strong generative and predictive\ncapabilities for protein sequences. We first pre-train scalable DPLMs from\nevolutionary-scale protein sequences within a generative self-supervised\ndiscrete diffusion probabilistic framework, which generalizes language modeling\nfor proteins in a principled way. After pre-training, DPLM exhibits the ability\nto generate structurally plausible, novel, and diverse protein sequences for\nunconditional generation. We further demonstrate the proposed diffusion\ngenerative pre-training makes DPLM possess a better understanding of proteins,\nmaking it a superior representation learner, which can be fine-tuned for\nvarious predictive tasks, comparing favorably to ESM2 (Lin et al., 2022).\nMoreover, DPLM can be tailored for various needs, which showcases its prowess\nof conditional generation in several ways: (1) conditioning on partial peptide\nsequences, e.g., generating scaffolds for functional motifs with high success\nrate; (2) incorporating other modalities as conditioner, e.g.,\nstructure-conditioned generation for inverse folding; and (3) steering sequence\ngeneration towards desired properties, e.g., satisfying specified secondary\nstructures, through a plug-and-play classifier guidance. Code is released at\n\\url{https://github.com/bytedance/dplm}.",
            "pdf_url": "http://arxiv.org/pdf/2402.18567v2",
            "published": "2024-02-28 18:57:56+00:00",
            "updated": "2024-10-16 16:26:16+00:00"
        },
        {
            "title": "Embedding an Ethical Mind: Aligning Text-to-Image Synthesis via Lightweight Value Optimization",
            "authors": "Xingqi Wang, Xiaoyuan Yi, Xing Xie, Jia Jia",
            "summary": "Recent advancements in diffusion models trained on large-scale data have\nenabled the generation of indistinguishable human-level images, yet they often\nproduce harmful content misaligned with human values, e.g., social bias, and\noffensive content. Despite extensive research on Large Language Models (LLMs),\nthe challenge of Text-to-Image (T2I) model alignment remains largely\nunexplored. Addressing this problem, we propose LiVO (Lightweight Value\nOptimization), a novel lightweight method for aligning T2I models with human\nvalues. LiVO only optimizes a plug-and-play value encoder to integrate a\nspecified value principle with the input prompt, allowing the control of\ngenerated images over both semantics and values. Specifically, we design a\ndiffusion model-tailored preference optimization loss, which theoretically\napproximates the Bradley-Terry model used in LLM alignment but provides a more\nflexible trade-off between image quality and value conformity. To optimize the\nvalue encoder, we also develop a framework to automatically construct a\ntext-image preference dataset of 86k (prompt, aligned image, violating image,\nvalue principle) samples. Without updating most model parameters and through\nadaptive value selection from the input prompt, LiVO significantly reduces\nharmful outputs and achieves faster convergence, surpassing several strong\nbaselines and taking an initial step towards ethically aligned T2I models.",
            "pdf_url": "http://arxiv.org/pdf/2410.12700v1",
            "published": "2024-10-16 16:03:42+00:00",
            "updated": "2024-10-16 16:03:42+00:00"
        },
        {
            "title": "Hamiltonian bridge: A physics-driven generative framework for targeted pattern control",
            "authors": "Vishaal Krishnan, Sumit Sinha, L. Mahadevan",
            "summary": "Patterns arise spontaneously in a range of systems spanning the sciences, and\ntheir study typically focuses on mechanisms to understand their evolution in\nspace-time. Increasingly, there has been a transition towards controlling these\npatterns in various functional settings, with implications for engineering.\nHere, we combine our knowledge of a general class of dynamical laws for pattern\nformation in non-equilibrium systems, and the power of stochastic optimal\ncontrol approaches to present a framework that allows us to control patterns at\nmultiple scales, which we dub the \"Hamiltonian bridge\". We use a mapping\nbetween stochastic many-body Lagrangian physics and deterministic Eulerian\npattern forming PDEs to leverage our recent approach utilizing the\nFeynman-Kac-based adjoint path integral formulation for the control of\ninteracting particles and generalize this to the active control of patterning\nfields. We demonstrate the applicability of our computational framework via\nnumerical experiments on the control of phase separation with and without a\nconserved order parameter, self-assembly of fluid droplets, coupled\nreaction-diffusion equations and finally a phenomenological model for\nspatio-temporal tissue differentiation. We interpret our numerical experiments\nin terms of a theoretical understanding of how the underlying physics shapes\nthe geometry of the pattern manifold, altering the transport paths of patterns\nand the nature of pattern interpolation. We finally conclude by showing how\noptimal control can be utilized to generate complex patterns via an iterative\ncontrol protocol over pattern forming pdes which can be casted as gradient\nflows. All together, our study shows how we can systematically build in\nphysical priors into a generative framework for pattern control in\nnon-equilibrium systems across multiple length and time scales.",
            "pdf_url": "http://arxiv.org/pdf/2410.12665v1",
            "published": "2024-10-16 15:24:54+00:00",
            "updated": "2024-10-16 15:24:54+00:00"
        }
    ]
}