{
    "Physics": [
        {
            "title": "Flowing Through Hilbert Space: Quantum-Enhanced Generative Models for Lattice Field Theory",
            "authors": "Jehu Martinez, Andrea Delgado",
            "summary": "Sampling from high-dimensional and structured probability distributions is a\nfundamental challenge in computational physics, particularly in the context of\nlattice field theory (LFT), where generating field configurations efficiently\nis critical, yet computationally intensive. In this work, we apply a previously\ndeveloped hybrid quantum-classical normalizing flow model to explore\nquantum-enhanced sampling in such regimes. Our approach embeds parameterized\nquantum circuits within a classical normalizing flow architecture, leveraging\namplitude encoding and quantum entanglement to enhance expressivity in the\ngenerative process. The quantum circuit serves as a trainable transformation\nwithin the flow, while classical networks provide adaptive coupling and\ncompensate for quantum hardware imperfections. This design enables efficient\ndensity estimation and sample generation, potentially reducing the resources\nrequired compared to purely classical methods. While LFT provides a\nrepresentative and physically meaningful application for benchmarking, our\nfocus is on improving the sampling efficiency of generative models through\nquantum components. This work contributes toward the development of\nquantum-enhanced generative modeling frameworks that address the sampling\nbottlenecks encountered in physics and beyond.",
            "pdf_url": "http://arxiv.org/pdf/2505.10553v1",
            "published": "2025-05-15 17:58:16+00:00",
            "updated": "2025-05-15 17:58:16+00:00"
        },
        {
            "title": "Parastatistics and a secret communication challenge",
            "authors": "Zhiyuan Wang",
            "summary": "One of the most unconventional features of topological phases of matter is\nthe emergence of quasiparticles with exotic statistics, such as non-Abelian\nanyons in two dimensional systems. Recently, a different type of exotic\nparticle statistics that is consistently defined in any dimension, called\nparastatistics, is also shown to be possible in a special family of topological\nphases. However, the physical significance of emergent parastatistics still\nremains elusive. Here we demonstrate a distinctive physical consequence of\nparastatistics by proposing a challenge game that can only be won using\nphysical systems hosting paraparticles, as passing the challenge requires the\ntwo participating players to secretly communicate in an indirect way by\nexploiting the nontrivial exchange statistics of the quasiparticles. The\nwinning strategy using emergent paraparticles is robust against noise, as well\nas the most relevant class of eavesdropping via local measurements. This\nprovides both an operational definition and an experimental identity test for\nparaparticles, alongside a potential application in secret communication.",
            "pdf_url": "http://arxiv.org/pdf/2412.13360v4",
            "published": "2024-12-17 22:19:33+00:00",
            "updated": "2025-05-15 17:57:06+00:00"
        },
        {
            "title": "Magnon Nesting in Driven Two-Dimensional Quantum Magnets",
            "authors": "Hossein Hosseinabadi, Yaroslav Tserkovnyak, Eugene Demler, Jamir Marino",
            "summary": "We uncover a new class of dynamical quantum instability in driven magnets\nleading to emergent enhancement of antiferromagnetic correlations even for\npurely ferromagnetic microscopic couplings. A primary parametric amplification\ncreates a frequency-tuned nested magnon distribution in momentum space, which\nseeds a secondary instability marked by the emergence of enhanced\nantiferromagnetic correlations, mirroring Fermi surface nesting instabilities\nin electronic systems. In sharp contrast to the fermionic case, however, the\nmagnon-driven instability is intrinsically non-equilibrium and fundamentally\ninaccessible in thermal physics. Its quantum mechanical origin sets it apart\nfrom classical instabilities such as Faraday and modulation instabilities,\nwhich underlie several instances of dynamical behavior observed in magnetic and\ncold-atom systems.",
            "pdf_url": "http://arxiv.org/pdf/2505.10531v1",
            "published": "2025-05-15 17:41:44+00:00",
            "updated": "2025-05-15 17:41:44+00:00"
        },
        {
            "title": "Shift of nanodroplet and nanocluster size distributions induced by dopant pick-up statistics",
            "authors": "Marie Riddle, Angel I. Pena Dominguez, Benjamin S. Kamerin, Vitaly V. Kresin",
            "summary": "In pick-up experiments using nanodroplet and nanocluster beams, the size\ndistribution of hosts carrying a specified number of dopants changes when the\nvapor density in the pick-up region is altered. This change, analyzed here, has\nquantitative consequences for the interpretation of data that are sensitive to\nhost size, such as mass spectrometric, spectroscopic, and deflection\nmeasurements.",
            "pdf_url": "http://arxiv.org/pdf/2505.10516v1",
            "published": "2025-05-15 17:22:27+00:00",
            "updated": "2025-05-15 17:22:27+00:00"
        },
        {
            "title": "Learning Nonlinear Dynamics in Physical Modelling Synthesis using Neural Ordinary Differential Equations",
            "authors": "Victor Zheleznov, Stefan Bilbao, Alec Wright, Simon King",
            "summary": "Modal synthesis methods are a long-standing approach for modelling\ndistributed musical systems. In some cases extensions are possible in order to\nhandle geometric nonlinearities. One such case is the high-amplitude vibration\nof a string, where geometric nonlinear effects lead to perceptually important\neffects including pitch glides and a dependence of brightness on striking\namplitude. A modal decomposition leads to a coupled nonlinear system of\nordinary differential equations. Recent work in applied machine learning\napproaches (in particular neural ordinary differential equations) has been used\nto model lumped dynamic systems such as electronic circuits automatically from\ndata. In this work, we examine how modal decomposition can be combined with\nneural ordinary differential equations for modelling distributed musical\nsystems. The proposed model leverages the analytical solution for linear\nvibration of system's modes and employs a neural network to account for\nnonlinear dynamic behaviour. Physical parameters of a system remain easily\naccessible after the training without the need for a parameter encoder in the\nnetwork architecture. As an initial proof of concept, we generate synthetic\ndata for a nonlinear transverse string and show that the model can be trained\nto reproduce the nonlinear dynamics of the system. Sound examples are\npresented.",
            "pdf_url": "http://arxiv.org/pdf/2505.10511v1",
            "published": "2025-05-15 17:17:21+00:00",
            "updated": "2025-05-15 17:17:21+00:00"
        },
        {
            "title": "Giant elastoresistance in magic-angle twisted bilayer graphene",
            "authors": "Xuetao Ma, Zhaoyu Liu, Jiaqi Cai, Kenji Watanabe, Takashi Taniguchi, Xiaodong Xu, Jiun-Haw Chu, Matthew Yankowitz",
            "summary": "Strongly correlated and topological phases in moir\\'e materials are\nexquisitely sensitive to lattice geometry at both atomic and superlattice\nlength scales. Twist angle, pressure, and strain directly modify the lattice,\nand thus act as highly effective tuning parameters. Here we examine electrical\ntransport in twisted bilayer graphene subjected to continuous uniaxial strain.\nNear the magic angle ($\\approx 1.1^{\\circ}$), devices exhibit a pronounced\nelastoresistance that depends on band filling and temperature, with a gauge\nfactor more than two orders of magnitude larger than that of conventional\nmetals. In selected doping regimes the elastoresistance exhibits a\nCurie-Weiss-like temperature divergence. We discuss possible microscopic\norigins, including nematic fluctuations and enhanced electronic entropy from\nfluctuating isospin moments. Our work establishes uniaxial strain as a\nversatile probe of correlated physics in a moir\\'e material.",
            "pdf_url": "http://arxiv.org/pdf/2505.10506v1",
            "published": "2025-05-15 17:10:34+00:00",
            "updated": "2025-05-15 17:10:34+00:00"
        },
        {
            "title": "Simulation of the 1d XY model on a quantum computer",
            "authors": "Marc Farreras, Alba Cervera-Lierta",
            "summary": "The field of quantum computing has grown fast in recent years, both in\ntheoretical advancements and the practical construction of quantum computers.\nThese computers were initially proposed, among other reasons, to efficiently\nsimulate and comprehend the complexities of quantum physics. In this paper, we\npresent a comprehensive scheme for the exact simulation of the 1-D XY model on\na quantum computer. We successfully diagonalize the proposed Hamiltonian,\nenabling access to the complete energy spectrum. Furthermore, we propose a\nnovel approach to design a quantum circuit to perform exact time evolution.\nAmong all the possibilities this opens, we compute the ground and excited state\nenergies for the symmetric XY model with spin chains of $n=4$ and $n=8$ spins.\nFurther, we calculate the expected value of transverse magnetization for the\nground state in the transverse Ising model. Both studies allow the observation\nof a quantum phase transition from an antiferromagnetic to a paramagnetic\nstate. Additionally, we have simulated the time evolution of the state all\nspins up in the transverse Ising model. The scalability and high performance of\nour algorithm make it an ideal candidate for benchmarking purposes, while also\nlaying the foundation for simulating other integrable models on quantum\ncomputers.",
            "pdf_url": "http://arxiv.org/pdf/2410.21143v3",
            "published": "2024-10-28 15:44:13+00:00",
            "updated": "2025-05-15 16:56:49+00:00"
        },
        {
            "title": "Phenomenological study of semitauonic decays of $B$ and $B_s$ mesons to charm states",
            "authors": "Sonali Patnaik, Lopamudra Nayak, Sanjay Kumar Swain",
            "summary": "In this work, we compute the branching fraction of $B \\to D^{(*)} \\,\\tau \\,\n\\nu_{\\tau}$ and $B_s \\to D_s^{(*)}\\, \\tau\\, \\nu_{\\tau}$ within the Relativistic\nIndependent Quark Model, emphasizing the harmonic potential model-dependent\nanalysis of these decay channels in the precision flavor physics era.\nConsidering the experimental observation of longitudinal $\\tau$-polarization\nand fraction of longitudinal polarization ($F_L$) at LHCb and Belle, we have\nalso investigated these observables within our model framework which are\naligning well with the standard model expectations. We perform a comprehensive\nanalysis of the form factors across the whole accessible kinematic range of\n$q^2$. Our results are consistent and agree well with other theoretical\napproaches as well as with the experimental measurements. Furthermore, we\nevaluated the clean ratios of $B_s$ to $B_0$ in the semimuonic mode that are in\naccordance with the LHCb measurements, and support the validity of the SU(3)\nflavor symmetry. Although the concept of new physics is facing a significant\nchallenge at the current TeV scale, semileptonic $B$ decays, nevertheless,\nalways serve as a valuable probe to study the decay dynamics.",
            "pdf_url": "http://arxiv.org/pdf/2505.10491v1",
            "published": "2025-05-15 16:46:50+00:00",
            "updated": "2025-05-15 16:46:50+00:00"
        },
        {
            "title": "Characterizing quantum dynamics using multipartite entanglement generation",
            "authors": "Gaurav Rudra Malik, Rohit Kumar Shukla, S. Aravinda, Sunil Kumar Mishra",
            "summary": "Entanglement is a defining feature of many-body quantum systems and is an\nessential requirement for quantum computing. It is therefore useful to study\nphysical processes which generate entanglement within a large system, as they\nmaybe replicated for applications involving the said requirements in quantum\ninformation processing. A possible avenue to maximize entanglement generation\nis to rely on the phenomena of information scrambling, i.e. transport of\ninitially localized information throughout the system. Here the rationale is\nthat the spread of information carries with it an inherent capacity of\nentanglement generation. Scrambling greatly depends upon the dynamical nature\nof the system Hamiltonian, and the interplay between entanglement generation\nand information scrambling maybe investigated taking a chain of interacting\nspins on a one dimensional lattice. This system is analogous to an array of\nqubits and this relative simplicity implies that the resulting unitary dynamics\ncan be efficiently simulated using present-day cloud based NISQ devices. In our\npresent work, we consider such a spin model which is made up of nearest and\nnext nearest neighbor XXZ Model, along with an introduced coupling term lambda.\nThis coupling term serves as a tuning parameter which modifies the dynamical\nnature of the system from the integrable to the quantum chaotic regime. In\norder to quantify the entanglement generated within the system we use the more\ngeneral multipartite metric which computes the average entanglement across all\nsystem bipartitions to obtain a global picture of the entanglement structure\nwithin the entire system.",
            "pdf_url": "http://arxiv.org/pdf/2505.10477v1",
            "published": "2025-05-15 16:25:03+00:00",
            "updated": "2025-05-15 16:25:03+00:00"
        },
        {
            "title": "Comparison of high-order moment models for the ion dynamics in a bounded low-temperature plasma",
            "authors": "Anatole Berger, Thierry Magin, Anne Bourdon, Alejandro Alvarez Laguna",
            "summary": "Low-temperature plasmas often present non-equilibrium ion distribution\nfunctions due to the collisions with the background gas and the presence of\nstrong electric fields. This non-equilibrium is beyond classical fluid models,\noften requiring computationally-intensive kinetic simulations. In our work, we\nstudy high-order moment models in order to capture the non-equilibrium state\nwith a macroscopic set of equations, which is more computationally efficient\nthan kinetic simulations. We compare numerical simulations of different moment\nclosures: Grad's closure, the hyperbolic quadrature method of moments (HyQMOM),\nthe extended quadrature method of moments, and a method based on entropy\nmaximization. We assess the different closures for plasma applications and\npropose efficient numerical discretizations. The numerical solution of the\nhigh-order moment models is compared to kinetic simulations of an argon plasma\nbetween two floating walls at different pressure regimes, from nearly\ncollisionless to collisionally-dominated. In general, all the high-order moment\nclosures capture the ion transport with high fidelity as compared to the\nkinetic simulations, providing an improvement as compared to classical fluid\nmodels. Classical fluid closures such as the Fourier law for the heat flux is\nshown to be not suitable to capture the sheath or the low pressure regime. In\naddition, the ability of each moment method to reconstruct the velocity\ndistribution function from the moments is assessed. The high-order moment\nmodels are able to capture the non-equilibrium distributions in the bulk and\nsheath with remarkable fidelity, dramatically improving classical fluid models\nwhile having comparable computational cost. In particular, the HyQMOM shows to\nbe a robust method that provides an excellent comparison with the kinetic\nsimulations of both the moments and the distribution function in the bulk and\nthe sheath.",
            "pdf_url": "http://arxiv.org/pdf/2505.10456v1",
            "published": "2025-05-15 16:12:50+00:00",
            "updated": "2025-05-15 16:12:50+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Does Feasibility Matter? Understanding the Impact of Feasibility on Synthetic Training Data",
            "authors": "Yiwen Liu, Jessica Bader, Jae Myung Kim",
            "summary": "With the development of photorealistic diffusion models, models trained in\npart or fully on synthetic data achieve progressively better results. However,\ndiffusion models still routinely generate images that would not exist in\nreality, such as a dog floating above the ground or with unrealistic texture\nartifacts. We define the concept of feasibility as whether attributes in a\nsynthetic image could realistically exist in the real-world domain; synthetic\nimages containing attributes that violate this criterion are considered\ninfeasible. Intuitively, infeasible images are typically considered\nout-of-distribution; thus, training on such images is expected to hinder a\nmodel's ability to generalize to real-world data, and they should therefore be\nexcluded from the training set whenever possible. However, does feasibility\nreally matter? In this paper, we investigate whether enforcing feasibility is\nnecessary when generating synthetic training data for CLIP-based classifiers,\nfocusing on three target attributes: background, color, and texture. We\nintroduce VariReal, a pipeline that minimally edits a given source image to\ninclude feasible or infeasible attributes given by the textual prompt generated\nby a large language model. Our experiments show that feasibility minimally\naffects LoRA-fine-tuned CLIP performance, with mostly less than 0.3% difference\nin top-1 accuracy across three fine-grained datasets. Also, the attribute\nmatters on whether the feasible/infeasible images adversarially influence the\nclassification performance. Finally, mixing feasible and infeasible images in\ntraining datasets does not significantly impact performance compared to using\npurely feasible or infeasible datasets.",
            "pdf_url": "http://arxiv.org/pdf/2505.10551v1",
            "published": "2025-05-15 17:57:38+00:00",
            "updated": "2025-05-15 17:57:38+00:00"
        },
        {
            "title": "Pharmacophore-Conditioned Diffusion Model for Ligand-Based De Novo Drug Design",
            "authors": "Amira Alakhdar, Barnabas Poczos, Newell Washburn",
            "summary": "Developing bioactive molecules remains a central, time- and cost-heavy\nchallenge in drug discovery, particularly for novel targets lacking structural\nor functional data. Pharmacophore modeling presents an alternative for\ncapturing the key features required for molecular bioactivity against a\nbiological target. In this work, we present PharmaDiff, a\npharmacophore-conditioned diffusion model for 3D molecular generation.\nPharmaDiff employs a transformer-based architecture to integrate an atom-based\nrepresentation of the 3D pharmacophore into the generative process, enabling\nthe precise generation of 3D molecular graphs that align with predefined\npharmacophore hypotheses. Through comprehensive testing, PharmaDiff\ndemonstrates superior performance in matching 3D pharmacophore constraints\ncompared to ligand-based drug design methods. Additionally, it achieves higher\ndocking scores across a range of proteins in structure-based drug design,\nwithout the need for target protein structures. By integrating pharmacophore\nmodeling with 3D generative techniques, PharmaDiff offers a powerful and\nflexible framework for rational drug design.",
            "pdf_url": "http://arxiv.org/pdf/2505.10545v1",
            "published": "2025-05-15 17:54:29+00:00",
            "updated": "2025-05-15 17:54:29+00:00"
        },
        {
            "title": "Fine-tuning Diffusion Policies with Backpropagation Through Diffusion Timesteps",
            "authors": "Ningyuan Yang, Jiaxuan Gao, Feng Gao, Yi Wu, Chao Yu",
            "summary": "Diffusion policies, widely adopted in decision-making scenarios such as\nrobotics, gaming and autonomous driving, are capable of learning diverse skills\nfrom demonstration data due to their high representation power. However, the\nsub-optimal and limited coverage of demonstration data could lead to diffusion\npolicies that generate sub-optimal trajectories and even catastrophic failures.\nWhile reinforcement learning (RL)-based fine-tuning has emerged as a promising\nsolution to address these limitations, existing approaches struggle to\neffectively adapt Proximal Policy Optimization (PPO) to diffusion models. This\nchallenge stems from the computational intractability of action likelihood\nestimation during the denoising process, which leads to complicated\noptimization objectives. In our experiments starting from randomly initialized\npolicies, we find that online tuning of Diffusion Policies demonstrates much\nlower sample efficiency compared to directly applying PPO on MLP policies\n(MLP+PPO). To address these challenges, we introduce NCDPO, a novel framework\nthat reformulates Diffusion Policy as a noise-conditioned deterministic policy.\nBy treating each denoising step as a differentiable transformation conditioned\non pre-sampled noise, NCDPO enables tractable likelihood evaluation and\ngradient backpropagation through all diffusion timesteps. Our experiments\ndemonstrate that NCDPO achieves sample efficiency comparable to MLP+PPO when\ntraining from scratch, outperforming existing methods in both sample efficiency\nand final performance across diverse benchmarks, including continuous robot\ncontrol and multi-agent game scenarios. Furthermore, our experimental results\nshow that our method is robust to the number denoising timesteps in the\nDiffusion Policy.",
            "pdf_url": "http://arxiv.org/pdf/2505.10482v1",
            "published": "2025-05-15 16:33:44+00:00",
            "updated": "2025-05-15 16:33:44+00:00"
        },
        {
            "title": "Score-based diffusion nowcasting of GOES imagery",
            "authors": "Randy J. Chase, Katherine Haynes, Lander Ver Hoef, Imme Ebert-Uphoff",
            "summary": "Clouds and precipitation are important for understanding weather and climate.\nSimulating clouds and precipitation with traditional numerical weather\nprediction is challenging because of the sub-grid parameterizations required.\nMachine learning has been explored for forecasting clouds and precipitation,\nbut early machine learning methods often created blurry forecasts. In this\npaper we explore a newer method, named score-based diffusion, to nowcast (zero\nto three hour forecast) clouds and precipitation. We discuss the background and\nintuition of score-based diffusion models - thus providing a starting point for\nthe community - while exploring the methodology's use for nowcasting\ngeostationary infrared imagery. We experiment with three main types of\ndiffusion models: a standard score-based diffusion model (Diff); a residual\ncorrection diffusion model (CorrDiff); and a latent diffusion model (LDM). Our\nresults show that the diffusion models are able to not only advect existing\nclouds, but also generate and decay clouds, including convective initiation.\nThese results are surprising because the forecasts are initiated with only the\npast 20 mins of infrared satellite imagery. A case study qualitatively shows\nthe preservation of high resolution features longer into the forecast than a\nconventional mean-squared error trained U-Net. The best of the three diffusion\nmodels tested was the CorrDiff approach, outperforming all other diffusion\nmodels, the traditional U-Net, and a persistence forecast by one to two kelvin\non root mean squared error. The diffusion models also enable out-of-the-box\nensemble generation, which shows skillful calibration, with the spread of the\nensemble correlating well to the error.",
            "pdf_url": "http://arxiv.org/pdf/2505.10432v1",
            "published": "2025-05-15 15:51:41+00:00",
            "updated": "2025-05-15 15:51:41+00:00"
        },
        {
            "title": "Learning Graph Representation of Agent Diffusers",
            "authors": "Youcef Djenouri, Nassim Belmecheri, Tomasz Michalak, Jan Dubiński, Ahmed Nabil Belbachir, Anis Yazidi",
            "summary": "Diffusion-based generative models have significantly advanced text-to-image\nsynthesis, demonstrating impressive text comprehension and zero-shot\ngeneralization. These models refine images from random noise based on textual\nprompts, with initial reliance on text input shifting towards enhanced visual\nfidelity over time. This transition suggests that static model parameters might\nnot optimally address the distinct phases of generation. We introduce LGR-AD\n(Learning Graph Representation of Agent Diffusers), a novel multi-agent system\ndesigned to improve adaptability in dynamic computer vision tasks. LGR-AD\nmodels the generation process as a distributed system of interacting agents,\neach representing an expert sub-model. These agents dynamically adapt to\nvarying conditions and collaborate through a graph neural network that encodes\ntheir relationships and performance metrics. Our approach employs a\ncoordination mechanism based on top-$k$ maximum spanning trees, optimizing the\ngeneration process. Each agent's decision-making is guided by a meta-model that\nminimizes a novel loss function, balancing accuracy and diversity. Theoretical\nanalysis and extensive empirical evaluations show that LGR-AD outperforms\ntraditional diffusion models across various benchmarks, highlighting its\npotential for scalable and flexible solutions in complex image generation\ntasks. Code is available at: https://github.com/YousIA/LGR_AD",
            "pdf_url": "http://arxiv.org/pdf/2505.06761v2",
            "published": "2025-05-10 21:42:24+00:00",
            "updated": "2025-05-15 15:32:55+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Choices or constraints: decoding financial empowerment among women entrepreneurs in France",
            "authors": "Jonathan Labbé, Typhaine Lebègue, Abdel Malik Ola",
            "summary": "This research examines the empowerment of women entrepreneurs in the context\nof entrepreneurial financing in France. It explores the factors that allow some\nwomen entrepreneurs to access certain categories of external finance more\neasily. The theoretical framework used is based on the concept of empowerment,\nexplored through its personal and relational dimensions. The study relies on a\nquantitative approach, using data from a representative of women entrepreneurs.\nThe results show that the status of a founder affects access to external\nfinance in different ways: it increases the chances of successful fundraising,\nbut reduces the chances of obtaining bank finance. This finding highlights the\nimportance of empowerment dynamics, which vary according to the type of\nfinancing. In addition, characteristics such as the presence of a spouse in the\nbusiness, high income, membership of a professional network and the diversity\nof this network complete the analysis of inequalities in access. This study,\nthe first of its kind in France, suggests ways of enriching our understanding\nof the diversity of situations experienced by female founders, thus helping to\ndeconstruct the homogeneous image of women's entrepreneurship.",
            "pdf_url": "http://arxiv.org/pdf/2505.10064v1",
            "published": "2025-05-15 08:06:09+00:00",
            "updated": "2025-05-15 08:06:09+00:00"
        }
    ]
}