{
    "Physics": [
        {
            "title": "Particle creation from non-geodesic trajectories in multifield inflation",
            "authors": "Nicolás Parra, Spyros Sypsas, Gonzalo A. Palma, Cristóbal Zenteno",
            "summary": "Particle production in de Sitter spacetime arises from the exponential\nexpansion of space, rendering the Bunch-Davies vacuum perceived as a\nparticle-containing state by late-time observers. For states defined as\neigenstates of both momentum and the Hamiltonian, the Bunch-Davies vacuum\nexhibits a constant particle density per physical momentum. We explore particle\nproduction beyond this baseline, focusing on deviations from exact de Sitter\nconditions and non-gravitational interactions, such as slow-roll inflation or\ninteractions arising from the coupling of inflation to other fields. Using\nBogoliubov transformations, we calculate the number density of energy/momentum\neigenstates. In single-field inflation, this density captures the observed\nspectral index of the primordial power spectrum, while in two-field models, it\nreflects the non-gravitational coupling driving background trajectory turning.\nWe present analytical results applicable to various scenarios involving\nparticle production from non-adiabatic processes during inflation.",
            "pdf_url": "http://arxiv.org/pdf/2410.13843v1",
            "published": "2024-10-17 17:57:08+00:00",
            "updated": "2024-10-17 17:57:08+00:00"
        },
        {
            "title": "Analyzing Atomic Interactions in Molecules as Learned by Neural Networks",
            "authors": "Malte Esders, Thomas Schnake, Jonas Lederer, Adil Kabylda, Grégoire Montavon, Alexandre Tkatchenko, Klaus-Robert Müller",
            "summary": "While machine learning (ML) models have been able to achieve unprecedented\naccuracies across various prediction tasks in quantum chemistry, it is now\napparent that accuracy on a test set alone is not a guarantee for robust\nchemical modeling such as stable molecular dynamics (MD). To go beyond\naccuracy, we use explainable artificial intelligence (XAI) techniques to\ndevelop a general analysis framework for atomic interactions and apply it to\nthe SchNet and PaiNN neural network models. We compare these interactions with\na set of fundamental chemical principles to understand how well the models have\nlearned the underlying physicochemical concepts from the data. We focus on the\nstrength of the interactions for different atomic species, how predictions for\nintensive and extensive quantum molecular properties are made, and analyze the\ndecay and many-body nature of the interactions with interatomic distance.\nModels that deviate too far from known physical principles produce unstable MD\ntrajectories, even when they have very high energy and force prediction\naccuracy. We also suggest further improvements to the ML architectures to\nbetter account for the polynomial decay of atomic interactions.",
            "pdf_url": "http://arxiv.org/pdf/2410.13833v1",
            "published": "2024-10-17 17:53:31+00:00",
            "updated": "2024-10-17 17:53:31+00:00"
        },
        {
            "title": "Enhancing universal machine learning potentials with polarizable long-range interactions",
            "authors": "Rongzhi Gao, ChiYung Yam, Jianjun Mao, Shuguang Chen, GuanHua Chen, Ziyang Hu",
            "summary": "Long-range interactions are crucial in determining the behavior of chemical\nsystems in various environments. Accurate predictions of physical and chemical\nphenomena at the atomic level hinge on accurate modeling of these interactions.\nHere, we present a framework that substantially enhances the predictive power\nof machine learning interatomic potentials by incorporating explicit\npolarizable long-range interactions with an equivariant graph neural network\nshort-range potential. The pretrained universal model, applicable across the\nentire periodic table, can achieve first-principles accuracy. This versatile\nmodel has been further applied to diverse areas of research, including the\nstudy of mechanical properties, ionic diffusivity in solid-state electrolytes,\nferroelectricity, and interfacial reactions, demonstrating its broad\napplicability and robustness.",
            "pdf_url": "http://arxiv.org/pdf/2410.13820v1",
            "published": "2024-10-17 17:47:39+00:00",
            "updated": "2024-10-17 17:47:39+00:00"
        },
        {
            "title": "Moderate Physical Perspectivalism",
            "authors": "Emily Adlam",
            "summary": "Recent developments in foundations of physics have given rise to a class of\nviews suggesting that physically meaningful descriptions must always be\nrelativized to a physical perspective. In this article I distinguish between\nstrong physical perspectivalism, which maintains that all facts must be\nrelativized to a perspective, and moderate physical perspectivalism, which\nmaintains that all empirically meaningful descriptions must be relativized to a\nperspective. I argue that both scientific evidence and philosophical\nconsiderations support moderate physical perspectivalism over strong physical\nperspectivalism. In particular, motivations connected to epistemic humility and\nthe social nature of science are more compatible with the moderate approach.",
            "pdf_url": "http://arxiv.org/pdf/2410.13819v1",
            "published": "2024-10-17 17:47:14+00:00",
            "updated": "2024-10-17 17:47:14+00:00"
        },
        {
            "title": "Observation of string-breaking dynamics in a quantum simulator",
            "authors": "Arinjoy De, Alessio Lerose, De Luo, Federica M. Surace, Alexander Schuckert, Elizabeth R. Bennewitz, Brayden Ware, William Morong, Kate S. Collins, Zohreh Davoudi, Alexey V. Gorshkov, Or Katz, Christopher Monroe",
            "summary": "Spontaneous particle-pair formation is a fundamental phenomenon in nature. It\ncan, for example, appear when the potential energy between two particles\nincreases with separation, as if they were connected by a tense string. Beyond\na critical separation, new particle pairs can form, causing the string to\nbreak. String-breaking dynamics in quantum chromodynamics play a vital role in\nhigh-energy particle collisions and early universe evolution. Simulating string\nevolution and hadron formation is, therefore, a grand challenge in modern\nphysics. Quantum simulators, well-suited for studying dynamics, are expected to\noutperform classical computing methods. However, the required experimental\ncapabilities to simulate string-breaking dynamics have not yet been\ndemonstrated, even for simpler models of the strong force. We experimentally\nprobe, for the first time, the spatiotemporal dynamics of string-breaking in a\n(1+1)-dimensional $\\mathbb{Z}_2$ lattice gauge theory using a fully\nprogrammable trapped-ion quantum simulator. We emulate external static charges\nand strings via site-dependent magnetic-field control enabled by a dual array\nof tightly focused laser beams targeting individual ions. First, we study how\nconfinement affects isolated charges, finding that they freely spread without\nstring tension but exhibit localized oscillations when tension is increased.\nThen, we observe and characterize string-breaking dynamics of a string\nstretched between two static charges after an abrupt increase in string\ntension. Charge pairs appear near the string edges and spread into the bulk,\nrevealing a route to dynamical string-breaking distinct from the conventional\nSchwinger mechanism. Our work demonstrates that analog quantum simulators have\nachieved the necessary control to explore string-breaking dynamics, which may\nultimately be relevant to nuclear and high-energy physics.",
            "pdf_url": "http://arxiv.org/pdf/2410.13815v1",
            "published": "2024-10-17 17:46:07+00:00",
            "updated": "2024-10-17 17:46:07+00:00"
        },
        {
            "title": "A Pattern to Align Them All: Integrating Different Modalities to Define Multi-Modal Entities",
            "authors": "Gianluca Apriceno, Valentina Tamma, Tania Bailoni, Jacopo de Berardinis, Mauro Dragoni",
            "summary": "The ability to reason with and integrate different sensory inputs is the\nfoundation underpinning human intelligence and it is the reason for the growing\ninterest in modelling multi-modal information within Knowledge Graphs.\nMulti-Modal Knowledge Graphs extend traditional Knowledge Graphs by associating\nan entity with its possible modal representations, including text, images,\naudio, and videos, all of which are used to convey the semantics of the entity.\nDespite the increasing attention that Multi-Modal Knowledge Graphs have\nreceived, there is a lack of consensus about the definitions and modelling of\nmodalities, whose definition is often determined by application domains. In\nthis paper, we propose a novel ontology design pattern that captures the\nseparation of concerns between an entity (and the information it conveys),\nwhose semantics can have different manifestations across different media, and\nits realisation in terms of a physical information entity. By introducing this\nabstract model, we aim to facilitate the harmonisation and integration of\ndifferent existing multi-modal ontologies which is crucial for many intelligent\napplications across different domains spanning from medicine to digital\nhumanities.",
            "pdf_url": "http://arxiv.org/pdf/2410.13803v1",
            "published": "2024-10-17 17:41:04+00:00",
            "updated": "2024-10-17 17:41:04+00:00"
        },
        {
            "title": "Enabling a multifunctional telecommunications fiber optic network: Ultrastable optical frequency transfer and attosecond timing in deployed multicore fiber",
            "authors": "Nazanin Hoghooghi, Mikael Mazur, Nicolas Fontaine, Yifan Liu, Dahyeon Lee, Charles McLemore, Takuma Nakamura, Tetsuya Hayashi, Giammarco Di Sciullo, Divya Shaji, Antonio Mecozzi, Cristian Antonelli, Franklyn Quinlan",
            "summary": "The telecommunications industry's deployment of billions of kilometers of\noptical fiber has created a vast global network that can be exploited for\nadditional applications such as environmental sensing, quantum networking and\ninternational clock comparisons. However, for reasons such as the\nunidirectionality of long-haul fiber links, telecom fiber networks cannot\nalways be adapted for important applications beyond data transmission.\nFortunately, new multicore optical fibers create the opportunity for\napplication coexistence with data traffic, creating expansive multifunctional\nnetworks. Towards that end, we propose and demonstrate the faithful transfer of\nultrastable optical signals through multicore fiber in a way that is compatible\nwith the unidirectionality of long-haul fiber optic systems, demonstrating a\nfractional frequency instability of 3x10-19 at 10,000 seconds. This opens the\ndoor towards intercontinental optical clock comparisons, with applications in\nfundamental physics and the redefinition of the second.",
            "pdf_url": "http://arxiv.org/pdf/2410.13801v1",
            "published": "2024-10-17 17:39:26+00:00",
            "updated": "2024-10-17 17:39:26+00:00"
        },
        {
            "title": "Machine-Learning Analysis of Radiative Decays to Dark Matter at the LHC",
            "authors": "Ernesto Arganda, Marcela Carena, Martín de los Rios, Andres D. Perez, Duncan Rocha, Rosa M. Sandá Seoane, Carlos E. M. Wagner",
            "summary": "The search for weakly interacting matter particles (WIMPs) is one of the main\nobjectives of the High Luminosity Large Hadron Collider (HL-LHC). In this work\nwe use Machine Learning (ML) techniques to explore WIMP radiative decays into a\nDark Matter (DM) candidate in a supersymmetric framework. The minimal\nsupersymmetric WIMP sector includes the lightest neutralino that can provide\nthe observed DM relic density through its co-annihilation with the second\nlightest neutralino and lightest chargino. Moreover, the direct DM detection\ncross section rates fulfill current experimental bounds and provide discovery\ntargets for the same region of model parameters in which the radiative decay of\nthe second lightest neutralino into a photon and the lightest neutralino is\nenhanced. This strongly motivates the search for radiatively decaying\nneutralinos which, however, suffers from strong backgrounds. We investigate the\nLHC reach in the search for these radiatively decaying particles by means of\ncut-based and ML methods and estimate its discovery potential in this\nwell-motivated, new physics scenario.",
            "pdf_url": "http://arxiv.org/pdf/2410.13799v1",
            "published": "2024-10-17 17:38:44+00:00",
            "updated": "2024-10-17 17:38:44+00:00"
        },
        {
            "title": "Arbitrarily-Conditioned Multi-Functional Diffusion for Multi-Physics Emulation",
            "authors": "Da Long, Zhitong Xu, Guang Yang, Akil Narayan, Shandian Zhe",
            "summary": "Modern physics simulation often involves multiple functions of interests, and\ntraditional numerical approaches are known to be complex and computationally\ncostly. While machine learning-based surrogate models can offer significant\ncost reductions, most focus on a single task, such as forward prediction, and\ntypically lack uncertainty quantification -- an essential component in many\napplications. To overcome these limitations, we propose Arbitrarily-Conditioned\nMulti-Functional Diffusion (ACMFD), a versatile probabilistic surrogate model\nfor multi-physics emulation. ACMFD can perform a wide range of tasks within a\nsingle framework, including forward prediction, various inverse problems, and\nsimulating data for entire systems or subsets of quantities conditioned on\nothers. Specifically, we extend the standard Denoising Diffusion Probabilistic\nModel (DDPM) for multi-functional generation by modeling noise as Gaussian\nprocesses (GP). We then introduce an innovative denoising loss. The training\ninvolves randomly sampling the conditioned part and fitting the corresponding\npredicted noise to zero, enabling ACMFD to flexibly generate function values\nconditioned on any other functions or quantities. To enable efficient training\nand sampling, and to flexibly handle irregularly sampled data, we use GPs to\ninterpolate function samples onto a grid, inducing a Kronecker product\nstructure for efficient computation. We demonstrate the advantages of ACMFD\nacross several fundamental multi-physics systems.",
            "pdf_url": "http://arxiv.org/pdf/2410.13794v1",
            "published": "2024-10-17 17:34:06+00:00",
            "updated": "2024-10-17 17:34:06+00:00"
        },
        {
            "title": "Enhancement of Opto-Electro-Mechanical Entanglement through Three-Level Atoms",
            "authors": "Abebe Senbeto Kussia, Tewodros Yirgashewa Darge, Tesfay Gebremariam Tesfahannes, Abeba Teklie Bimeraw, Berihu Teklu",
            "summary": "We address the dynamical bipartite entanglement in an opto-electro-mechanical\nsystem that involves a three-level atom. The system consists of a degenerate\nthree-level atom, a mechanical resonator, an optical cavity, and a microwave\ncavity. By utilizing the linearization approximation and nonlinear\nquantum-Langevin equations, the dynamics of the system are analyzed, and the\nbipartite entanglement is evaluated using the logarithmic negativity. The\nresearch findings indicate that the entanglement between each subsystem\nincreases with the atom injection rate, suggesting that a higher atom injection\nrate leads to enhanced information transmission between the subsystems.\nAdditionally, it is observed that the correlation between subsystems increases\nwith an increase in the coupling rate. Moreover, the study demonstrates that\nthe correlation between each subsystem decreases as temperature rises. We also\nshow that the degree of tripartite entanglement diminishes with increasing\natomic decay rates. The results highlight the positive impact of three-level\natoms on the bipartite entanglement in an opto-electro-mechanical system.\nConsequently, such electro-optomechanical systems can offer a framework for\noptomechanical information transfer.",
            "pdf_url": "http://arxiv.org/pdf/2406.16682v2",
            "published": "2024-06-24 14:42:40+00:00",
            "updated": "2024-10-17 17:21:29+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Diffusing States and Matching Scores: A New Framework for Imitation Learning",
            "authors": "Runzhe Wu, Yiding Chen, Gokul Swamy, Kianté Brantley, Wen Sun",
            "summary": "Adversarial Imitation Learning is traditionally framed as a two-player\nzero-sum game between a learner and an adversarially chosen cost function, and\ncan therefore be thought of as the sequential generalization of a Generative\nAdversarial Network (GAN). A prominent example of this framework is Generative\nAdversarial Imitation Learning (GAIL). However, in recent years, diffusion\nmodels have emerged as a non-adversarial alternative to GANs that merely\nrequire training a score function via regression, yet produce generations of a\nhigher quality. In response, we investigate how to lift insights from diffusion\nmodeling to the sequential setting. We propose diffusing states and performing\nscore-matching along diffused states to measure the discrepancy between the\nexpert's and learner's states. Thus, our approach only requires training score\nfunctions to predict noises via standard regression, making it significantly\neasier and more stable to train than adversarial methods. Theoretically, we\nprove first- and second-order instance-dependent bounds with linear scaling in\nthe horizon, proving that our approach avoids the compounding errors that\nstymie offline approaches to imitation learning. Empirically, we show our\napproach outperforms GAN-style imitation learning baselines across various\ncontinuous control problems, including complex tasks like controlling humanoids\nto walk, sit, and crawl.",
            "pdf_url": "http://arxiv.org/pdf/2410.13855v1",
            "published": "2024-10-17 17:59:25+00:00",
            "updated": "2024-10-17 17:59:25+00:00"
        },
        {
            "title": "Influence Functions for Scalable Data Attribution in Diffusion Models",
            "authors": "Bruno Mlodozeniec, Runa Eschenhagen, Juhan Bae, Alexander Immer, David Krueger, Richard Turner",
            "summary": "Diffusion models have led to significant advancements in generative\nmodelling. Yet their widespread adoption poses challenges regarding data\nattribution and interpretability. In this paper, we aim to help address such\nchallenges in diffusion models by developing an \\textit{influence functions}\nframework. Influence function-based data attribution methods approximate how a\nmodel's output would have changed if some training data were removed. In\nsupervised learning, this is usually used for predicting how the loss on a\nparticular example would change. For diffusion models, we focus on predicting\nthe change in the probability of generating a particular example via several\nproxy measurements. We show how to formulate influence functions for such\nquantities and how previously proposed methods can be interpreted as particular\ndesign choices in our framework. To ensure scalability of the Hessian\ncomputations in influence functions, we systematically develop K-FAC\napproximations based on generalised Gauss-Newton matrices specifically tailored\nto diffusion models. We recast previously proposed methods as specific design\nchoices in our framework and show that our recommended method outperforms\nprevious data attribution approaches on common evaluations, such as the Linear\nData-modelling Score (LDS) or retraining without top influences, without the\nneed for method-specific hyperparameter tuning.",
            "pdf_url": "http://arxiv.org/pdf/2410.13850v1",
            "published": "2024-10-17 17:59:02+00:00",
            "updated": "2024-10-17 17:59:02+00:00"
        },
        {
            "title": "DPLM-2: A Multimodal Diffusion Protein Language Model",
            "authors": "Xinyou Wang, Zaixiang Zheng, Fei Ye, Dongyu Xue, Shujian Huang, Quanquan Gu",
            "summary": "Proteins are essential macromolecules defined by their amino acid sequences,\nwhich determine their three-dimensional structures and, consequently, their\nfunctions in all living organisms. Therefore, generative protein modeling\nnecessitates a multimodal approach to simultaneously model, understand, and\ngenerate both sequences and structures. However, existing methods typically use\nseparate models for each modality, limiting their ability to capture the\nintricate relationships between sequence and structure. This results in\nsuboptimal performance in tasks that requires joint understanding and\ngeneration of both modalities. In this paper, we introduce DPLM-2, a multimodal\nprotein foundation model that extends discrete diffusion protein language model\n(DPLM) to accommodate both sequences and structures. To enable structural\nlearning with the language model, 3D coordinates are converted to discrete\ntokens using a lookup-free quantization-based tokenizer. By training on both\nexperimental and high-quality synthetic structures, DPLM-2 learns the joint\ndistribution of sequence and structure, as well as their marginals and\nconditionals. We also implement an efficient warm-up strategy to exploit the\nconnection between large-scale evolutionary data and structural inductive\nbiases from pre-trained sequence-based protein language models. Empirical\nevaluation shows that DPLM-2 can simultaneously generate highly compatible\namino acid sequences and their corresponding 3D structures eliminating the need\nfor a two-stage generation approach. Moreover, DPLM-2 demonstrates competitive\nperformance in various conditional generation tasks, including folding, inverse\nfolding, and scaffolding with multimodal motif inputs, as well as providing\nstructure-aware representations for predictive tasks.",
            "pdf_url": "http://arxiv.org/pdf/2410.13782v1",
            "published": "2024-10-17 17:20:24+00:00",
            "updated": "2024-10-17 17:20:24+00:00"
        },
        {
            "title": "Probing the Latent Hierarchical Structure of Data via Diffusion Models",
            "authors": "Antonio Sclocchi, Alessandro Favero, Noam Itzhak Levi, Matthieu Wyart",
            "summary": "High-dimensional data must be highly structured to be learnable. Although the\ncompositional and hierarchical nature of data is often put forward to explain\nlearnability, quantitative measurements establishing these properties are\nscarce. Likewise, accessing the latent variables underlying such a data\nstructure remains a challenge. In this work, we show that forward-backward\nexperiments in diffusion-based models, where data is noised and then denoised\nto generate new samples, are a promising tool to probe the latent structure of\ndata. We predict in simple hierarchical models that, in this process, changes\nin data occur by correlated chunks, with a length scale that diverges at a\nnoise level where a phase transition is known to take place. Remarkably, we\nconfirm this prediction in both text and image datasets using state-of-the-art\ndiffusion models. Our results show how latent variable changes manifest in the\ndata and establish how to measure these effects in real data using diffusion\nmodels.",
            "pdf_url": "http://arxiv.org/pdf/2410.13770v1",
            "published": "2024-10-17 17:08:39+00:00",
            "updated": "2024-10-17 17:08:39+00:00"
        },
        {
            "title": "Guided Multi-objective Generative AI to Enhance Structure-based Drug Design",
            "authors": "Amit Kadan, Kevin Ryczko, Erika Lloyd, Adrian Roitberg, Takeshi Yamazaki",
            "summary": "Generative AI has the potential to revolutionize drug discovery. Yet, despite\nrecent advances in deep learning, existing models cannot generate molecules\nthat satisfy all desired physicochemical properties. Herein, we describe\nIDOLpro, a generative chemistry AI combining diffusion with multi-objective\noptimization for structure-based drug design. Differentiable scoring functions\nguide the latent variables of the diffusion model to explore uncharted chemical\nspace and generate novel ligands in silico, optimizing a plurality of target\nphysicochemical properties. We demonstrate our platform's effectiveness by\ngenerating ligands with optimized binding affinity and synthetic accessibility\non two benchmark sets. IDOLpro produces ligands with binding affinities over\n10%-20% better than the next best state-of-the-art method on each test set,\nproducing more drug-like molecules with generally better synthetic\naccessibility scores than other methods. We do a head-to-head comparison of\nIDOLpro against a classic virtual screen of a large database of drug-like\nmolecules. We show that IDOLpro can generate molecules for a range of important\ndisease-related targets with better binding affinity and synthetic\naccessibility than any molecule found in the virtual screen while being over\n100x faster and less expensive to run. On a test set of experimental complexes,\nIDOLpro is the first to produce molecules with better binding affinities than\nexperimentally observed ligands. IDOLpro can accommodate other scoring\nfunctions (e.g. ADME-Tox) to accelerate hit-finding, hit-to-lead, and lead\noptimization for drug discovery.",
            "pdf_url": "http://arxiv.org/pdf/2405.11785v2",
            "published": "2024-05-20 05:08:55+00:00",
            "updated": "2024-10-17 17:00:37+00:00"
        }
    ]
}