{
    "Physics": [
        {
            "title": "Hybrid Oscillator-Qubit Quantum Processors: Simulating Fermions, Bosons, and Gauge Fields",
            "authors": "Eleanor Crane, Kevin C. Smith, Teague Tomesh, Alec Eickbusch, John M. Martyn, Stefan Kühn, Lena Funcke, Michael Austin DeMarco, Isaac L. Chuang, Nathan Wiebe, Alexander Schuckert, Steven M. Girvin",
            "summary": "We develop a hybrid oscillator-qubit processor framework for quantum\nsimulation of strongly correlated fermions and bosons that avoids the\nboson-to-qubit mapping overhead encountered in qubit hardware. This framework\ngives exact decompositions of particle interactions such as density-density\nterms and gauge-invariant hopping, as well as approximate methods based on the\nBaker-Campbell Hausdorff formulas including the magnetic field term for the\n$U(1)$ quantum link model in $(2+1)$D. We use this framework to show how to\nsimulate dynamics using Trotterisation, perform ancilla-free partial error\ndetection using Gauss's law, measure non-local observables, estimate ground\nstate energies using a oscillator-qubit variational quantum eigensolver as well\nas quantum signal processing, and we numerically study the influence of\nhardware errors in circuit QED experiments. To show the advantages over\nall-qubit hardware, we perform an end-to-end comparison of the gate complexity\nfor the gauge-invariant hopping term and find an improvement of the asymptotic\nscaling with the boson number cutoff $S$ from $\\mathcal{O}(\\log(S)^2)$ to\n$\\mathcal{O}(1)$ in our framework as well as, for bosonic matter, a constant\nfactor improvement of better than $10^4$. We also find an improvement from\n$\\mathcal{O}(\\log(S))$ to $\\mathcal{O}(1)$ for the $U(1)$ magnetic field term.\nWhile our work focusses on an implementation in superconducting hardware, our\nframework can also be used in trapped ion, and neutral atom hardware. This work\nestablishes digital quantum simulation with hybrid oscillator-qubit hardware as\na viable and advantageous method for the study of qubit-boson models in\nmaterials science, chemistry, and high-energy physics.",
            "pdf_url": "http://arxiv.org/pdf/2409.03747v1",
            "published": "2024-09-05 17:58:20+00:00",
            "updated": "2024-09-05 17:58:20+00:00"
        },
        {
            "title": "Performance and tolerance study of the rectilinear cooling channel for a muon collider",
            "authors": "Ruihu Zhu, Chris Rogers, Jiancheng Yang, He Zhao, Cheng Guo, Jiangdong Li",
            "summary": "The muon collider has the potential to be a powerful tool for the exploration\nof frontiers in particle physics. In order to reach high luminosity, the 6D\nemittance of the muon beam needs to be reduced by several orders of magnitude.\nThe cooling process for a muon collider involves two parts; initial\nsix-dimensional cooling and final transverse cooling. This paper focuses on the\nformer and proposes a conceptual design of the rectilinear cooling channel with\nadditional dipole magnets. In this paper, we first introduce a general method\nfor designing the rectilinear cooling channel. Subsequently, we apply this\nmethod to develop two rectilinear cooling channels before and after a bunch\nmerging system. Furthermore, we investigate the impact on cooling performance\nby employing $\\pi$-mode RF cavities and considering the effect of errors in the\nmagnetic and RF fields.",
            "pdf_url": "http://arxiv.org/pdf/2409.02613v2",
            "published": "2024-09-04 11:05:57+00:00",
            "updated": "2024-09-05 17:37:22+00:00"
        },
        {
            "title": "Hardware-Assisted Parameterized Circuit Execution",
            "authors": "Abhi D. Rajagopala, Akel Hashim, Neelay Fruitwala, Gang Huang, Yilun Xu, Jordan Hines, Irfan Siddiqi, Katherine Klymko, Kasra Nowrouzi",
            "summary": "Standard compilers for quantum circuits decompose arbitrary single-qubit\ngates into a sequence of physical X(pi/2) pulses and virtual-Z phase gates.\nConsequently, many circuit classes implement different logic operations but\nhave an equivalent structure of physical pulses that only differ by changes in\nvirtual phases. When many structurally-equivalent circuits need to be measured,\ngenerating sequences for each circuit is unnecessary and cumbersome, since\ncompiling and loading sequences onto classical control hardware is a primary\nbottleneck in quantum circuit execution. In this work, we develop a\nhardware-assisted protocol for executing parameterized circuits on our\nFPGA-based control hardware, QubiC. This protocol relies on a hardware-software\nco-design technique in which software identifies structural equivalency in\ncircuits and \"peels\" off the relevant parameterized angles to reduce the\noverall waveform compilation time. The hardware architecture then performs\nreal-time \"stitching\" of the parameters in the circuit to measure circuits that\nimplement a different overall logical operation. This work demonstrates\nsignificant speed ups in the total execution time for several different classes\nof quantum circuits.",
            "pdf_url": "http://arxiv.org/pdf/2409.03725v1",
            "published": "2024-09-05 17:30:36+00:00",
            "updated": "2024-09-05 17:30:36+00:00"
        },
        {
            "title": "Investigating Quantum Spin-Textures Using Universal MJ Hamiltonians",
            "authors": "Manish Kumar Mohanta, Puru Jena",
            "summary": "This work introduces a pair of novel universal MJ spintronic models that\nprecisely mirror the complex spin textures observed in spintronic materials.\nThe spin-orbit coupled (SOC) Hamiltonians H_MJ1 and H_MJ2 reveal a range of\nnovel and intriguing spin phenomena by modulating spin-orbit interactions. The\nHamiltonian H_MJ1 reshapes the existing paradigm, providing a more robust and\nversatile framework than the Hamiltonian H_RD, with the potential to catalyze\nnew advancements in the study of quantum materials. H_MJ1 encapsulates two\ndistinct spin textures: a unidirectional, momentum-independent persistent spin\ntexture (PST), and a bidirectional (partial) PST. In contrast Hamiltonian H_MJ2\nportrays a spiral spin texture, drawing a conceptual link to the cosmological\nprocess of expansion and contraction, mirrored within a two-dimensional quantum\nframework. We also explore the fundamental aspects of earlier analytical models\nthat underpin the construction of the present MJ spintronic model. The physical\ninterpretations of these models are illustrated graphically, and the emerging\nspin phenomena resulting from complex SOC are elucidated using a simple vector\nmodel.",
            "pdf_url": "http://arxiv.org/pdf/2408.14571v2",
            "published": "2024-08-26 18:42:45+00:00",
            "updated": "2024-09-05 17:20:36+00:00"
        },
        {
            "title": "Physics case for quarkonium studies at the Electron Ion Collider",
            "authors": "Daniël Boer, Chris A. Flett, Carlo Flore, Daniel Kikoła, Jean-Philippe Lansberg, Maxim Nefedov, Charlotte Van Hulse, Shohini Bhattacharya, Jelle Bor, Mathias Butenschoen, Federico Ceccopieri, Longjie Chen, Vincent Cheung, Umberto D'Alesio, Miguel Echevarria, Yoshitaka Hatta, Charles E. Hyde, Raj Kishore, Leszek Kosarzewski, Cédric Lorcé, Wenliang Li, Xuan Li, Luca Maxia, Andreas Metz, Asmita Mukherjee, Carlos Muñoz Camacho, Francesco Murgia, Pawel Nadel-Turonski, Cristian Pisano, Jian-Wei Qiu, Sangem Rajesh, Matteo Rinaldi, Jennifer Rittenhouse West, Vladimir Saleev, Nathaly Santiesteban, Chalis Setyadi, Pieter Taels, Zhoudunmin Tu, Ivan Vitev, Ramona Vogt, Kazuhiro Watanabe, Xiaojun Yao, Yelyzaveta Yedelkina, Shinsuke Yoshida",
            "summary": "The physics case for quarkonium-production studies accessible at the US\nElectron Ion Collider is described.",
            "pdf_url": "http://arxiv.org/pdf/2409.03691v1",
            "published": "2024-09-05 16:44:36+00:00",
            "updated": "2024-09-05 16:44:36+00:00"
        },
        {
            "title": "Experimental evidence that a photon can spend a negative amount of time in an atom cloud",
            "authors": "Daniela Angulo, Kyle Thompson, Vida-Michelle Nixon, Andy Jiao, Howard M. Wiseman, Aephraim M. Steinberg",
            "summary": "When a pulse of light traverses a material, it incurs a time delay referred\nto as the group delay. Should the group delay experienced by photons be\nattributed to the time they spend as atomic excitations? However reasonable\nthis connection may seem, it appears problematic when the frequency of the\nlight is close to the atomic resonance, as the group delay becomes negative in\nthis regime. To address this question, we use the cross-Kerr effect to probe\nthe degree of atomic excitation caused by a resonant transmitted photon, by\nmeasuring the phase shift on a separate beam that is weak and off-resonant. Our\nresults, over a range of pulse durations and optical depths, are consistent\nwith the recent theoretical prediction that the mean atomic excitation time\ncaused by a transmitted photon (as measured via the time integral of the\nobserved phase shift) equals the group delay experienced by the light.\nSpecifically, we measure mean atomic excitation times ranging from $(-0.82\\pm\n0.31) \\tau_0$ for the most narrowband pulse to $(0.54\\pm 0.28) \\tau_0$ for the\nmost broadband pulse, where $\\tau_0$ is the non-post-selected excitation time,\ngiven by the scattering (absorption) probability multiplied by the atomic\nlifetime $\\tau_{\\rm sp}$. These results suggest that negative values taken by\ntimes such as the group delay have more physical significance than has\ngenerally been appreciated.",
            "pdf_url": "http://arxiv.org/pdf/2409.03680v1",
            "published": "2024-09-05 16:32:50+00:00",
            "updated": "2024-09-05 16:32:50+00:00"
        },
        {
            "title": "A Natural Introduction to Fine-Tuning",
            "authors": "Julian De Vuyst",
            "summary": "A well-known topic within the philosophy of physics is the problem of\nfine-tuning: the fact that the universal constants seem to take non-arbitrary\nvalues in order for live to thrive in our Universe. In this paper we will talk\nabout this problem in general, giving some examples from physics. We will\nreview some solutions like the design argument, logical probability,\ncosmological natural selection, etc. Moreover, we will also discuss why it's\ndangerous to uphold the Principle of Naturalness as a scientific principle.\nAfter going through this paper, the reader should have a general idea what this\nproblem exactly entails whenever it is mentioned in other sources and we\nrecommend the reader to think critically about these concepts.",
            "pdf_url": "http://arxiv.org/pdf/2012.05617v2",
            "published": "2020-12-10 12:08:33+00:00",
            "updated": "2024-09-05 16:23:38+00:00"
        },
        {
            "title": "Quantum complexity and localization in random quantum circuits",
            "authors": "Himanshu Sahu, Aranya Bhattacharya, Pingal Pratyush Nath",
            "summary": "Quantum complexity has emerged as a central concept in diverse areas of\nphysics, ranging from quantum computing to the theory of black holes. We\nperform a systematic study of complexity in random quantum circuits with and\nwithout measurements. We observe that complexity grows linearly before\nsaturating to a constant value. For $N$ qubits without measurements, the\nsaturation value scales as $2^{N-1}$, and the saturation time scales as $2^N$.\nThis behaviour remains identical in the presence of random measurements with\ndifferent probabilities, indicating that this notion of complexity is\ninsensitive to the rate of measurement. We also study the behaviour of\ncomplexity in two variants of the random unitary floquet circuit, where we\nobserve that complexity acts as a novel probe of Anderson localization and\nmany-body localization.",
            "pdf_url": "http://arxiv.org/pdf/2409.03656v1",
            "published": "2024-09-05 16:10:54+00:00",
            "updated": "2024-09-05 16:10:54+00:00"
        },
        {
            "title": "Benchmarking the integration of hexagonal boron nitride crystals and thin films into graphene-based van der Waals heterostructures",
            "authors": "Taoufiq Ouaj, Christophe Arnold, Jon Azpeitia, Sunaja Baltic, Julien Barjon, Jose Cascales, Huanyao Cun, David Esteban, Mar Garcia-Hernandez, Vincent Garnier, Subodh K. Gautam, Thomas Greber, Said Said Hassani, Adrian Hemmi, Ignacio Jimenéz, Catherine Journet, Paul Kögerler, Annick Loiseau, Camille Maestre, Marvin Metzelaars, Philipp Schmidt, Christoph Stampfer, Ingrid Stenger, Philippe Steyer, Takashi Taniguchi, Bérangère Toury, Kenji Watanabe, Bernd Beschoten",
            "summary": "We present a benchmarking protocol that combines the characterization of\nboron nitride (BN) crystals and films with the evaluation of the electronic\nproperties of graphene on these substrates. Our study includes hBN crystals\ngrown under different conditions and scalable BN films deposited by either\nchemical or physical vapor deposition (CVD or PVD). We explore the complete\nprocess from boron nitride growth, over its optical characterization by\ntime-resolved cathodoluminescence (TRCL), to the optical and electronic\ncharacterization of graphene by Raman spectroscopy after encapsulation and Hall\nbar processing. Within our benchmarking protocol we achieve a homogeneous\nelectronic performance within each Hall bar device through a fast and\nreproducible processing routine. We find that a free exciton lifetime of 1 ns\nmeasured on as-grown hBN crystals by TRCL is sufficient to achieve high\ngraphene room temperature charge carrier mobilities of 80,000 cm$^2$/(Vs) at a\ncarrier density of |n| = 10$^{12}$ cm$^{-2}$, while respective exciton\nlifetimes around 100 ps yield mobilities up to 30,000 cm$^2$/(Vs). For scalable\nPVD-grown BN films, we measure carrier mobilities exceeding 10,000 cm$^2$/(Vs)\nwhich correlates with a graphene Raman 2D peak linewidth of 22 cm$^{-1}$. Our\nwork highlights the importance of the Raman 2D linewidth of graphene as a\ncritical metric that effectively assesses the interface quality (i.e. surface\nroughness) to the BN substrate, which directly affects the charge carrier\nmobility of graphene. Graphene 2D linewidth analysis is suitable for all BN\nsubstrates and is particularly advantageous when TRCL or BN Raman spectroscopy\ncannot be applied to specific BN materials such as amorphous or thin films.\nThis underlines the superior role of spatially-resolved spectroscopy in the\nevaluation of BN crystals and films for the use of high-mobility graphene\ndevices.",
            "pdf_url": "http://arxiv.org/pdf/2409.03652v1",
            "published": "2024-09-05 16:08:33+00:00",
            "updated": "2024-09-05 16:08:33+00:00"
        },
        {
            "title": "QCD Masterclass Lectures on Jet Physics and Machine Learning",
            "authors": "Andrew J. Larkoski",
            "summary": "These lectures were presented at the 2024 QCD Masterclass in\nSaint-Jacut-de-la-Mer, France. They introduce and review fundamental theorems\nand principles of machine learning within the context of collider particle\nphysics, focused on application to jet identification and discrimination.\nNumerous examples of binary discrimination in jet physics are studied in\ndetail, including $H\\to b\\bar b$ identification in fixed-order perturbation\ntheory, generic one-versus two-prong discrimination with parametric power\ncounting techniques, and up versus down quark jet classification by assuming\nthe central limit theorem, isospin conservation, and a convergent moment\nexpansion of the single particle energy distribution. Quark versus gluon jet\ndiscrimination is considered in multiple contexts, from using additive,\ninfrared and collinear safe observables, to using hadronic multiplicity, and to\nincluding measurements of the jet charge. While many of the results presented\nhere are well known, some novel results are presented, the most prominent being\na parametrized expression for the likelihood ratio of quark versus gluon\ndiscrimination for jets on which hadronic multiplicity and jet charge are\nsimultaneously measured. End-of-lecture exercises are also provided.",
            "pdf_url": "http://arxiv.org/pdf/2407.04897v2",
            "published": "2024-07-06 00:01:09+00:00",
            "updated": "2024-09-05 16:06:29+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Lexicon3D: Probing Visual Foundation Models for Complex 3D Scene Understanding",
            "authors": "Yunze Man, Shuhong Zheng, Zhipeng Bao, Martial Hebert, Liang-Yan Gui, Yu-Xiong Wang",
            "summary": "Complex 3D scene understanding has gained increasing attention, with scene\nencoding strategies playing a crucial role in this success. However, the\noptimal scene encoding strategies for various scenarios remain unclear,\nparticularly compared to their image-based counterparts. To address this issue,\nwe present a comprehensive study that probes various visual encoding models for\n3D scene understanding, identifying the strengths and limitations of each model\nacross different scenarios. Our evaluation spans seven vision foundation\nencoders, including image-based, video-based, and 3D foundation models. We\nevaluate these models in four tasks: Vision-Language Scene Reasoning, Visual\nGrounding, Segmentation, and Registration, each focusing on different aspects\nof scene understanding. Our evaluations yield key findings: DINOv2 demonstrates\nsuperior performance, video models excel in object-level tasks, diffusion\nmodels benefit geometric tasks, and language-pretrained models show unexpected\nlimitations in language-related tasks. These insights challenge some\nconventional understandings, provide novel perspectives on leveraging visual\nfoundation models, and highlight the need for more flexible encoder selection\nin future vision-language and scene-understanding tasks.",
            "pdf_url": "http://arxiv.org/pdf/2409.03757v1",
            "published": "2024-09-05 17:59:56+00:00",
            "updated": "2024-09-05 17:59:56+00:00"
        },
        {
            "title": "Multimodal Laryngoscopic Video Analysis for Assisted Diagnosis of Vocal Cord Paralysis",
            "authors": "Yucong Zhang, Xin Zou, Jinshan Yang, Wenjun Chen, Faya Liang, Ming Li",
            "summary": "This paper presents the Multimodal Analyzing System for Laryngoscope (MASL),\na system that combines audio and video data to automatically extract key\nsegments and metrics from laryngeal videostroboscopic videos for clinical\nassessment. MASL integrates glottis detection with keyword spotting to analyze\npatient vocalizations and refine video highlights for better inspection of\nvocal cord movements. The system includes a strobing video extraction module\nthat identifies frames by analyzing hue, saturation, and value fluctuations.\nMASL also provides effective metrics for vocal cord paralysis detection,\nemploying a two-stage glottis segmentation process using U-Net followed by\ndiffusion-based refinement to reduce false positives. Instead of glottal area\nwaveforms, MASL estimates anterior glottic angle waveforms (AGAW) from glottis\nmasks, evaluating both left and right vocal cords to detect unilateral vocal\ncord paralysis (UVFP). By comparing AGAW variances, MASL distinguishes between\nleft and right paralysis. Ablation studies and experiments on public and\nreal-world datasets validate MASL's segmentation module and demonstrate its\nability to provide reliable metrics for UVFP diagnosis.",
            "pdf_url": "http://arxiv.org/pdf/2409.03597v1",
            "published": "2024-09-05 14:56:38+00:00",
            "updated": "2024-09-05 14:56:38+00:00"
        },
        {
            "title": "DKDM: Data-Free Knowledge Distillation for Diffusion Models with Any Architecture",
            "authors": "Qianlong Xiang, Miao Zhang, Yuzhang Shang, Jianlong Wu, Yan Yan, Liqiang Nie",
            "summary": "Diffusion models (DMs) have demonstrated exceptional generative capabilities\nacross various areas, while they are hindered by slow inference speeds and high\ncomputational demands during deployment. The most common way to accelerate DMs\ninvolves reducing the number of denoising steps during generation, achieved\nthrough faster sampling solvers or knowledge distillation (KD). In contrast to\nprior approaches, we propose a novel method that transfers the capability of\nlarge pretrained DMs to faster architectures. Specifically, we employ KD in a\ndistinct manner to compress DMs by distilling their generative ability into\nmore rapid variants. Furthermore, considering that the source data is either\nunaccessible or too enormous to store for current generative models, we\nintroduce a new paradigm for their distillation without source data, termed\nData-Free Knowledge Distillation for Diffusion Models (DKDM). Generally, our\nestablished DKDM framework comprises two main components: 1) a DKDM objective\nthat uses synthetic denoising data produced by pretrained DMs to optimize\nfaster DMs without source data, and 2) a dynamic iterative distillation method\nthat flexibly organizes the synthesis of denoising data, preventing it from\nslowing down the optimization process as the generation is slow. To our\nknowledge, this is the first attempt at using KD to distill DMs into any\narchitecture in a data-free manner. Importantly, our DKDM is orthogonal to most\nexisting acceleration methods, such as denoising step reduction, quantization\nand pruning. Experiments show that our DKDM is capable of deriving 2x faster\nDMs with performance remaining on par with the baseline. Notably, our DKDM\nenables pretrained DMs to function as \"datasets\" for training new DMs.",
            "pdf_url": "http://arxiv.org/pdf/2409.03550v1",
            "published": "2024-09-05 14:12:22+00:00",
            "updated": "2024-09-05 14:12:22+00:00"
        },
        {
            "title": "KAN See In the Dark",
            "authors": "Aoxiang Ning, Minglong Xue, Jinhong He, Chengyun Song",
            "summary": "Existing low-light image enhancement methods are difficult to fit the complex\nnonlinear relationship between normal and low-light images due to uneven\nillumination and noise effects. The recently proposed Kolmogorov-Arnold\nnetworks (KANs) feature spline-based convolutional layers and learnable\nactivation functions, which can effectively capture nonlinear dependencies. In\nthis paper, we design a KAN-Block based on KANs and innovatively apply it to\nlow-light image enhancement. This method effectively alleviates the limitations\nof current methods constrained by linear network structures and lack of\ninterpretability, further demonstrating the potential of KANs in low-level\nvision tasks. Given the poor perception of current low-light image enhancement\nmethods and the stochastic nature of the inverse diffusion process, we further\nintroduce frequency-domain perception for visually oriented enhancement.\nExtensive experiments demonstrate the competitive performance of our method on\nbenchmark datasets. The code will be available at:\nhttps://github.com/AXNing/KSID}{https://github.com/AXNing/KSID.",
            "pdf_url": "http://arxiv.org/pdf/2409.03404v1",
            "published": "2024-09-05 10:41:17+00:00",
            "updated": "2024-09-05 10:41:17+00:00"
        },
        {
            "title": "LinFusion: 1 GPU, 1 Minute, 16K Image",
            "authors": "Songhua Liu, Weihao Yu, Zhenxiong Tan, Xinchao Wang",
            "summary": "Modern diffusion models, particularly those utilizing a Transformer-based\nUNet for denoising, rely heavily on self-attention operations to manage complex\nspatial relationships, thus achieving impressive generation performance.\nHowever, this existing paradigm faces significant challenges in generating\nhigh-resolution visual content due to its quadratic time and memory complexity\nwith respect to the number of spatial tokens. To address this limitation, we\naim at a novel linear attention mechanism as an alternative in this paper.\nSpecifically, we begin our exploration from recently introduced models with\nlinear complexity, e.g., Mamba2, RWKV6, Gated Linear Attention, etc, and\nidentify two key features-attention normalization and non-causal inference-that\nenhance high-resolution visual generation performance. Building on these\ninsights, we introduce a generalized linear attention paradigm, which serves as\na low-rank approximation of a wide spectrum of popular linear token mixers. To\nsave the training cost and better leverage pre-trained models, we initialize\nour models and distill the knowledge from pre-trained StableDiffusion (SD). We\nfind that the distilled model, termed LinFusion, achieves performance on par\nwith or superior to the original SD after only modest training, while\nsignificantly reducing time and memory complexity. Extensive experiments on\nSD-v1.5, SD-v2.1, and SD-XL demonstrate that LinFusion delivers satisfactory\nzero-shot cross-resolution generation performance, generating high-resolution\nimages like 16K resolution. Moreover, it is highly compatible with pre-trained\nSD components, such as ControlNet and IP-Adapter, requiring no adaptation\nefforts. Codes are available at https://github.com/Huage001/LinFusion.",
            "pdf_url": "http://arxiv.org/pdf/2409.02097v2",
            "published": "2024-09-03 17:54:39+00:00",
            "updated": "2024-09-05 04:53:37+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Epistemic Limits of Empirical Finance: Causal Reductionism and Self-Reference",
            "authors": "Daniel Polakow, Tim Gebbie, Emlyn Flint",
            "summary": "The clarion call for causal reduction in the study of capital markets is\nintensifying. However, in self-referencing and open systems such as capital\nmarkets, the idea of unidirectional causation (if applicable) may be limiting\nat best, and unstable or fallacious at worst. In this work, we critically\nassess the use of scientific deduction and causal inference within the study of\nempirical finance and financial econometrics. We then demonstrate the idea of\ncompeting causal chains using a toy model adapted from ecological predator/prey\nrelationships. From this, we develop the alternative view that the study of\nempirical finance, and the risks contained therein, may be better appreciated\nonce we admit that our current arsenal of quantitative finance tools may be\nlimited to ex post causal inference under popular assumptions. Where these\nassumptions are challenged, for example in a recognizable reflexive context,\nthe prescription of unidirectional causation proves deeply problematic.",
            "pdf_url": "http://arxiv.org/pdf/2311.16570v5",
            "published": "2023-11-28 07:28:08+00:00",
            "updated": "2024-09-05 06:47:18+00:00"
        },
        {
            "title": "Pricing American Options using Machine Learning Algorithms",
            "authors": "Prudence Djagba, Callixte Ndizihiwe",
            "summary": "This study investigates the application of machine learning algorithms,\nparticularly in the context of pricing American options using Monte Carlo\nsimulations. Traditional models, such as the Black-Scholes-Merton framework,\noften fail to adequately address the complexities of American options, which\ninclude the ability for early exercise and non-linear payoff structures. By\nleveraging Monte Carlo methods in conjunction Least Square Method machine\nlearning was used. This research aims to improve the accuracy and efficiency of\noption pricing. The study evaluates several machine learning models, including\nneural networks and decision trees, highlighting their potential to outperform\ntraditional approaches. The results from applying machine learning algorithm in\nLSM indicate that integrating machine learning with Monte Carlo simulations can\nenhance pricing accuracy and provide more robust predictions, offering\nsignificant insights into quantitative finance by merging classical financial\ntheories with modern computational techniques. The dataset was split into\nfeatures and the target variable representing bid prices, with an 80-20\ntrain-validation split. LSTM and GRU models were constructed using TensorFlow's\nKeras API, each with four hidden layers of 200 neurons and an output layer for\nbid price prediction, optimized with the Adam optimizer and MSE loss function.\nThe GRU model outperformed the LSTM model across all evaluated metrics,\ndemonstrating lower mean absolute error, mean squared error, and root mean\nsquared error, along with greater stability and efficiency in training.",
            "pdf_url": "http://arxiv.org/pdf/2409.03204v1",
            "published": "2024-09-05 02:52:11+00:00",
            "updated": "2024-09-05 02:52:11+00:00"
        }
    ]
}