{
    "Physics": [
        {
            "title": "Quantum and Classical Dynamics with Random Permutation Circuits",
            "authors": "Bruno Bertini, Katja Klobas, Pavel Kos, Daniel Malz",
            "summary": "Understanding thermalisation in quantum many-body systems is among the most\nenduring problems in modern physics. A particularly interesting question\nconcerns the role played by quantum mechanics in this process, i.e. whether\nthermalisation in quantum many-body systems is fundamentally different from\nthat in classical many-body systems and, if so, which of its features are\ngenuinely quantum. Here we study this question in minimally structured\nmany-body systems which are only constrained to have local interactions, i.e.\nlocal random circuits. We introduce a class of random permutation circuits\n(RPCs), where the gates locally permute basis states modelling generic\nmicroscopic classical dynamics, and compare them to random unitary circuits\n(RUCs), a standard toy model for generic quantum dynamics. We show that, like\nRUCs, RPCs permit the analytical computation of several key quantities such as\nout-of-time order correlators (OTOCs), or entanglement entropies. RPCs can be\ninterpreted both as quantum or classical dynamics, which we use to find\nsimilarities and differences between the two. Performing the average over all\nrandom circuits, we discover a series of exact relations, connecting quantities\nin RUC and (quantum) RPCs. In the classical setting, we obtain similar exact\nresults relating (quantum) purity to (classical) growth of mutual information\nand (quantum) OTOCs to (classical) decorrelators. Our results indicate that\ndespite of the fundamental differences between quantum and classical systems,\ntheir dynamics exhibits qualitatively similar behaviours.",
            "pdf_url": "http://arxiv.org/pdf/2407.11960v1",
            "published": "2024-07-16 17:58:03+00:00",
            "updated": "2024-07-16 17:58:03+00:00"
        },
        {
            "title": "On the statistical theory of self-gravitating collisionless dark matter flow: high order kinematic and dynamic relations",
            "authors": "Zhijie Xu",
            "summary": "To better understand the collisionless dark matter flow on different scales,\nstatistical theory involving kinematic and dynamic relations must be developed\nfor different types of flow, e.g. incompressible, constant divergence, and\nirrotational flow. This paper extends our previous work on the second-order\nstatistics (Phys. Fluids 35, 077105) to high order statistics. Kinematic and\ndynamic relations were developed for dark matter flow on different scales. The\nresults were validated by N-body simulations. On large scales, we found i)\nthird-order velocity correlations can be related to density correlation or\npairwise velocity; ii) the $p$th-order velocity correlations follow $\\propto\na^{(p+2)/2}$ for odd $p$ and $\\propto a^{p/2}$ for even $p$, where $a$ is the\nscale factor; iii) the overdensity $\\delta$ is proportional to density\ncorrelation on the same scale; iv) velocity dispersion on a given scale $r$ is\nproportional to the overdensity on the same scale. On small scales, i) a\nself-closed velocity evolution is developed by decomposing the velocity into\nmotion in haloes and motion of haloes; ii) the evolution of vorticity and\nenstrophy are derived from the evolution of velocity; iii) dynamic relations\nare derived to relate second- and third-order correlations; iv) while the first\nmoment of pairwise velocity follows $\\langle\\Delta u_L\\rangle=-Har$ ($H$ is the\nHubble parameter), the third moment follows $\\langle(\\Delta\nu_L)^3\\rangle\\propto\\varepsilon_uar$ that can be directly compared with\nsimulations and observations, where $\\varepsilon_u\\approx10^{-7}$m$^2$/s$^3$ is\nthe constant rate for energy cascade; v) the $p$th order velocity correlations\nfollow $\\propto a^{(3p-5)/4}$ for odd $p$ and $\\propto a^{3p/4}$ for even $p$.\nFinally, the combined kinematic and dynamic relations lead to exponential and\none-fourth power-law velocity correlations on large and small scales,\nrespectively.",
            "pdf_url": "http://arxiv.org/pdf/2202.02991v3",
            "published": "2022-02-07 08:19:26+00:00",
            "updated": "2024-07-16 17:56:58+00:00"
        },
        {
            "title": "Stable infinite-temperature eigenstates in SU(2)-symmetric nonintegrable models",
            "authors": "Christopher J. Turner, Marcin Szyniszewski, Bhaskar Mukherjee, Ronald Melendrez, Hitesh J. Changlani, Arijeet Pal",
            "summary": "Nonintegrable many-body quantum systems typically thermalize at long times\nthrough the mechanism of quantum chaos. However, some exceptional systems, such\nas those harboring quantum scars, break thermalization, serving as testbeds for\nfoundational problems of quantum statistical physics. Here, we investigate a\nclass of nonintegrable bond-staggered models that is endowed with a large\nnumber of zero-energy eigenstates and possesses a non-Abelian internal\nsymmetry. We use character theory to give a lower bound on the zero-energy\ndegeneracy, which matches exact diagonalization results, and is found to grow\nexponentially with the system size. We also show that few-magnon zero-energy\nstates have an exact analytical description, allowing us to build a basis of\nlow-entangled fixed-separation states, which is stable to most perturbations\nfound in experiments. This remarkable dynamical stability of special states\nelucidates our understanding of nonequilibrium processes in non-Abelian chaotic\nquantum models.",
            "pdf_url": "http://arxiv.org/pdf/2407.11956v1",
            "published": "2024-07-16 17:48:47+00:00",
            "updated": "2024-07-16 17:48:47+00:00"
        },
        {
            "title": "Minimally Entangled Typical Thermal States for Classical and Quantum Simulation of Gauge Theories at Finite Temperature and Density",
            "authors": "I-Chi Chen, João C. Getelina, Klée Pollock, Srimoyee Sen, Yong-Xin Yao, Thomas Iadecola",
            "summary": "Simulating strongly coupled gauge theories at finite temperature and density\nis a longstanding challenge in nuclear and high-energy physics that also has\nfundamental implications for condensed matter physics. In this work, we\ninvestigate the utility of minimally entangled typical thermal state (METTS)\napproaches to facilitate both classical and quantum computational studies of\nsuch systems. METTS techniques combine classical random sampling with imaginary\ntime evolution, which can be performed on either a classical or a quantum\ncomputer, to estimate thermal averages of observables. We study the simplest\nmodel of a confining gauge theory, namely $\\mathbb{Z}_2$ gauge theory coupled\nto spinless fermionic matter in 1+1 dimensions, which can be directly mapped to\na local quantum spin chain with two- and three-body interactions. We benchmark\nboth a classical matrix-product-state implementation of METTS and a recently\nproposed adaptive variational approach to METTS that is a promising candidate\nfor implementation on near-term quantum devices, focusing on the equation of\nstate as well as on various measures of fermion confinement. Of particular\nimportance is the choice of basis for obtaining new METTS samples, which\nimpacts both the classical sampling complexity (a key factor in both classical\nand quantum simulation applications) and complexity of circuits used in the\nquantum computing approach. Our work sets the stage for future studies of\nstrongly coupled gauge theories with both classical and quantum hardware.",
            "pdf_url": "http://arxiv.org/pdf/2407.11949v1",
            "published": "2024-07-16 17:44:01+00:00",
            "updated": "2024-07-16 17:44:01+00:00"
        },
        {
            "title": "Model for bubble nucleation efficiency of low-energy nuclear recoils in bubble chambers for dark matter detection",
            "authors": "Xiang Li, Marie-Cécile Piro",
            "summary": "Bubble chambers are promising technologies for detecting low-energy nuclear\nrecoils from the elastic scattering of dark matter particle candidates. Bubble\nnucleation occurs when the energy deposition exceeds a specific threshold\ndefined traditionally by the \"heat-spike\" Seitz threshold. In this paper, we\nreport on a physical model that can account for observed discrepancies between\nthe current Seitz model and the measured nucleation efficiency of low-energy\nnuclear recoils, which is necessary for interpreting dark matter signals. In\nour work, we combine molecular dynamics and Monte Carlo simulations together\nwith the Lindhard model to predict bubble nucleation efficiency and energy\nthresholds for C$_3$F$_8$, CF$_3$I, and xenon with enhanced accuracy over the\nSeitz model when compared to existing experimental data. We use our model to\ndetermine the effect on cross-section limits for spin-dependent and\nspin-independent interactions and compare it to the current PICO dark matter\nexperiment. Our technique can also be applied to estimate the efficiency of\nfuture target fluids where no experimental data are available. As an example,\nwe predict the nucleation efficiency, the energy threshold and the\ncross-section limits in the spin-independent channel for the Scintillating\nBubble Chamber experiment filled with superheated liquid argon.",
            "pdf_url": "http://arxiv.org/pdf/2401.15531v2",
            "published": "2024-01-28 00:40:31+00:00",
            "updated": "2024-07-16 17:41:46+00:00"
        },
        {
            "title": "Backpropagation through space, time, and the brain",
            "authors": "Benjamin Ellenberger, Paul Haider, Jakob Jordan, Kevin Max, Ismael Jaras, Laura Kriener, Federico Benitez, Mihai A. Petrovici",
            "summary": "How physical networks of neurons, bound by spatio-temporal locality\nconstraints, can perform efficient credit assignment, remains, to a large\nextent, an open question. In machine learning, the answer is almost universally\ngiven by the error backpropagation algorithm, through both space and time.\nHowever, this algorithm is well-known to rely on biologically implausible\nassumptions, in particular with respect to spatio-temporal (non-)locality.\nAlternative forward-propagation models such as real-time recurrent learning\nonly partially solve the locality problem, but only at the cost of scaling, due\nto prohibitive storage requirements.\n  We introduce Generalized Latent Equilibrium (GLE), a computational framework\nfor fully local spatio-temporal credit assignment in physical, dynamical\nnetworks of neurons. We start by defining an energy based on neuron-local\nmismatches, from which we derive both neuronal dynamics via stationarity and\nparameter dynamics via gradient descent. The resulting dynamics can be\ninterpreted as a real-time, biologically plausible approximation of\nbackpropagation through space and time in deep cortical networks with\ncontinuous-time neuronal dynamics and continuously active, local synaptic\nplasticity. In particular, GLE exploits the morphology of dendritic trees to\nenable more complex information storage and processing in single neurons, as\nwell as the ability of biological neurons to phase-shift their output rate with\nrespect to their membrane potential, which is essential in both directions of\ninformation propagation. For the forward computation, it enables the mapping of\ntime-continuous inputs to neuronal space, effectively performing a\nspatio-temporal convolution. For the backward computation, it permits the\ntemporal inversion of feedback signals, which consequently approximate the\nadjoint variables necessary for useful parameter updates.",
            "pdf_url": "http://arxiv.org/pdf/2403.16933v2",
            "published": "2024-03-25 16:57:02+00:00",
            "updated": "2024-07-16 17:37:05+00:00"
        },
        {
            "title": "Calibration and simulation of ionization signal and electronics noise in the ICARUS liquid argon time projection chamber",
            "authors": "ICARUS collaboration, P. Abratenko, N. Abrego-Martinez, A. Aduszkiewicz, F. Akbar, L. Aliaga Soplin, M. Artero Pons, J. Asaadi, W. F. Badgett, B. Baibussinov, B. Behera, V. Bellini, R. Benocci, S. Berkman, S. Bertolucci, M. Betancourt, M. Bonesini, T. Boone, B. Bottino, A. Braggiotti, D. Brailsford, S. J. Brice, V. Brio, C. Brizzolari, H. S. Budd A. Campani, A. Campos, D. Carber, M. Carneiro, I. Caro Terrazas, H. Carranza, F. Castillo Fernandez, A. Castro, S. Centro, G. Cerati, A. Chatterjee, D. Cherdack, S. Cherubini, N. Chitirasreemadam, M. Cicerchia, T. Coan, A. Cocco, M. R. Convery, L. Cooper-Troendle, S. Copello, A. A. Dange, A. De Roeck, L. Di Noto, C. Di Stefano, D. DiFerdinando, M. Diwan, S. Dolan, L. Domine, S. Donati, F. Drielsma, J. Dyer, S. Dytman, A. Falcone, C. Farnese, A. Fava, A. Ferrari, N. Gallice, F. G. Garcia, C. Gatto, D. Gibin, A. Gioiosa, W. Gu, A. Guglielmi, G. Gurung, H. Hausner, A. Heggestuen, B. Howard, R. Howell, I. Ingratta, C. James, W. Jang, Y. -J. Jwa, L. Kashur, W. Ketchum, J. S. Kim, D. -H. Koh, J. Larkin, Y. Li, C. Mariani, C. M. Marshall, S. Martynenko, N. Mauri, K. S. McFarland, D. P. Méndez1 A. Menegolli, G. Meng, O. G. Miranda, A. Mogan, N. Moggi, E. Montagna, C. Montanari, A. Montanari, M. Mooney, G. Moreno-Granados, J. Mueller, M. Murphy, D. Naples, V. C. L. Nguyen, S. Palestini, M. Pallavicini, V. Paolone, R. Papaleo, L. Pasqualini, L. Patrizii, L. Paudel, G. Petrillo, C. Petta, V. Pia, F. Pietropaolo, F. Poppi, M. Pozzato, G. Putnam, X. Qian, A. Rappoldi, G. L. Raselli, S. Repetto, F. Resnati, A. M. Ricci, G. Riccobene, E. Richards, M. Rosenberg, M. Rossella, P. Roy, C. Rubbia, M. Saad, S. Saha, P. Sala, S. Samanta, P. Sapienza, A. Scaramelli, A. Scarpelli, D. Schmitz, A. Schukraft, D. Senadheera, S-H. Seo, F. Sergiampietri, G. Sirri, J. S. Smedley, J. Smith, L. Stanco, J. Stewart, H. A. Tanaka, F. Tapia, M. Tenti, K. Terao, F. Terranova, V. Togo, D. Torretta, M. Torti, F. Tortorici, R. Triozzi, Y. -T. Tsai, S. Tufanli, T. Usher, F. Varanini, S. Ventura, M. Vicenzi, C. Vignoli, B. Viren, Z. Williams, R. J. Wilson, P. Wilson, J. Wolfs, T. Wongjirad, A. Wood, E. Worcester, M. Worcester, M. Wospakrik, H. Yu, J. Yu, A. Zani, J. Zennamo, J. C. Zettlemoyer, C. Zhang, S. Zucchelli",
            "summary": "The ICARUS liquid argon time projection chamber (LArTPC) neutrino detector\nhas been taking physics data since 2022 as part of the Short-Baseline Neutrino\n(SBN) Program. This paper details the equalization of the response to charge in\nthe ICARUS time projection chamber (TPC), as well as data-driven tuning of the\nsimulation of ionization charge signals and electronics noise. The equalization\nprocedure removes non-uniformities in the ICARUS TPC response to charge in\nspace and time. This work leverages the copious number of cosmic ray muons\navailable to ICARUS at the surface. The ionization signal shape simulation\napplies a novel procedure that tunes the simulation to match what is measured\nin data. The end result of the equalization procedure and simulation tuning\nallows for a comparison of charge measurements in ICARUS between Monte Carlo\nsimulation and data, showing good performance with minimal residual bias\nbetween the two.",
            "pdf_url": "http://arxiv.org/pdf/2407.11925v1",
            "published": "2024-07-16 17:15:33+00:00",
            "updated": "2024-07-16 17:15:33+00:00"
        },
        {
            "title": "Importance of accounting for student identities and intersectionality for creating equitable and inclusive physics learning environments",
            "authors": "Lisabeth Marie Santana, Chandralekha Singh",
            "summary": "This research focuses on the experiences of seven undergraduate women who\nwere majoring in physics in a medium-size physics department at a small liberal\narts college. In the semi-structured, empathetic interviews we conducted, the\nwomen discussed how they decided to major in physics, their interactions with\ntheir peers and instructors, who supported them during their physics\ntrajectory, and suggestions that would improve their experiences in physics. We\nused Standpoint theory and focused on the experiences of undergraduate women to\nget a holistic perspective of how they became interested in physics, how they\nhave been supported in their physics journey as well as identify any challenges\nthat they faced in their undergraduate physics program due to their identity.\nUsing synergistic frameworks such as the Domains of Power and the Holistic\nEcosystem for Learning Physics in an Inclusive and Equitable Environment\n(HELPIEE), we analyzed how those in the position of power, e.g., instructors,\ncan play important roles in establishing and maintaining safe, equitable, and\ninclusive environments for students, which is especially important for\nhistorically marginalized students such as women and ethnic and racial minority\nstudents in physics. We also discuss the suggestions provided by the\nundergraduate women to implement in the future to support current and future\nundergraduate women in physics and astronomy. Their suggestions are separated\nas personal advice for peers and suggestions for physics instructors.",
            "pdf_url": "http://arxiv.org/pdf/2403.13621v2",
            "published": "2024-03-20 14:14:17+00:00",
            "updated": "2024-07-16 17:15:23+00:00"
        },
        {
            "title": "The CONUS+ experiment",
            "authors": "The CONUS+ Collaboration, :, N. Ackermann, S. Armbruster, H. Bonet, C. Buck, K. Fulber, J. Hakenmuller, J. Hempfling, G. Heusser, M. Lindner, W. Maneschg, K. Ni, M. Rank, T. Rink, E. Sanchez Garcia, I. Stalder, H. Strecker, R. Wink, J. Woenckhaus",
            "summary": "The CONUS+ experiment aims to detect coherent elastic neutrino-nucleus\nscattering (CEvNS) of reactor antineutrinos on germanium nuclei in the fully\ncoherent regime, continuing on this way the CONUS physics program started at\nthe Brokdorf nuclear power plant, Germany. The CONUS+ setup is installed in the\nnuclear power plant in Leibstadt, Switzerland, at a distance of 20.7 m from the\n3.6 GW thermal power reactor core. The CEvNS signature will be measured with\nthe same four point-contact high-purity germanium (HPGe) detectors produced for\nthe former experiment, however refurbished and with optimized low energy\nthresholds. To suppress the background in the CONUS+ detectors, the passive and\nactive layers of the original CONUS shield were modified such to fit better to\nthe significantly changed background conditions at the new experimental\nlocation. New data acquisition and monitoring systems were developed. A direct\nnetwork connection between the experiment and the Max-Planck-Institut fur\nKernphysik (MPIK) makes it possible to control and monitor data acquisition in\nreal time. The impact of all these modifications is discussed with particular\nemphasis on the resulting CEvNS signal prediction for the first data collection\nphase of CONUS+. Prospects of the planned upgrade in a second phase integrating\nnew larger HPGe detectors are also discussed.",
            "pdf_url": "http://arxiv.org/pdf/2407.11912v1",
            "published": "2024-07-16 17:05:05+00:00",
            "updated": "2024-07-16 17:05:05+00:00"
        },
        {
            "title": "Cumulative Advantage of Brokerage in Academia",
            "authors": "Jan Bachmann, Lisette Espín-Noboa, Gerardo Iñiguez, Fariba Karimi",
            "summary": "Science is a collaborative endeavor in which \"who collaborates with whom\"\nprofoundly influences scientists' career trajectories and success. Despite its\nrelevance, little is known about how scholars facilitate new collaborations\namong their peers. In this study, we quantify brokerage in academia and study\nits effect on the careers of physicists worldwide. We find that early-career\nparticipation in brokerage increases later-stage involvement for all\nresearchers, with increasing participation rates and greater career impact\namong more successful scientists. This cumulative advantage process suggests\nthat brokerage contributes to the unequal distribution of success in academia.\nSurprisingly, this affects both women and men equally, despite women being more\njunior in all brokerage roles and lagging behind men's participation due to\ntheir late and slow arrival to physics. Because of its cumulative nature,\npromoting brokerage opportunities to early career scientists might help reduce\nthe inequalities in academic success.",
            "pdf_url": "http://arxiv.org/pdf/2407.11909v1",
            "published": "2024-07-16 16:59:27+00:00",
            "updated": "2024-07-16 16:59:27+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Efficient Training with Denoised Neural Weights",
            "authors": "Yifan Gong, Zheng Zhan, Yanyu Li, Yerlan Idelbayev, Andrey Zharkov, Kfir Aberman, Sergey Tulyakov, Yanzhi Wang, Jian Ren",
            "summary": "Good weight initialization serves as an effective measure to reduce the\ntraining cost of a deep neural network (DNN) model. The choice of how to\ninitialize parameters is challenging and may require manual tuning, which can\nbe time-consuming and prone to human error. To overcome such limitations, this\nwork takes a novel step towards building a weight generator to synthesize the\nneural weights for initialization. We use the image-to-image translation task\nwith generative adversarial networks (GANs) as an example due to the ease of\ncollecting model weights spanning a wide range. Specifically, we first collect\na dataset with various image editing concepts and their corresponding trained\nweights, which are later used for the training of the weight generator. To\naddress the different characteristics among layers and the substantial number\nof weights to be predicted, we divide the weights into equal-sized blocks and\nassign each block an index. Subsequently, a diffusion model is trained with\nsuch a dataset using both text conditions of the concept and the block indexes.\nBy initializing the image translation model with the denoised weights predicted\nby our diffusion model, the training requires only 43.3 seconds. Compared to\ntraining from scratch (i.e., Pix2pix), we achieve a 15x training time\nacceleration for a new concept while obtaining even better image generation\nquality.",
            "pdf_url": "http://arxiv.org/pdf/2407.11966v1",
            "published": "2024-07-16 17:59:42+00:00",
            "updated": "2024-07-16 17:59:42+00:00"
        },
        {
            "title": "Context-Guided Diffusion for Out-of-Distribution Molecular and Protein Design",
            "authors": "Leo Klarner, Tim G. J. Rudner, Garrett M. Morris, Charlotte M. Deane, Yee Whye Teh",
            "summary": "Generative models have the potential to accelerate key steps in the discovery\nof novel molecular therapeutics and materials. Diffusion models have recently\nemerged as a powerful approach, excelling at unconditional sample generation\nand, with data-driven guidance, conditional generation within their training\ndomain. Reliably sampling from high-value regions beyond the training data,\nhowever, remains an open challenge -- with current methods predominantly\nfocusing on modifying the diffusion process itself. In this paper, we develop\ncontext-guided diffusion (CGD), a simple plug-and-play method that leverages\nunlabeled data and smoothness constraints to improve the out-of-distribution\ngeneralization of guided diffusion models. We demonstrate that this approach\nleads to substantial performance gains across various settings, including\ncontinuous, discrete, and graph-structured diffusion processes with\napplications across drug discovery, materials science, and protein design.",
            "pdf_url": "http://arxiv.org/pdf/2407.11942v1",
            "published": "2024-07-16 17:34:00+00:00",
            "updated": "2024-07-16 17:34:00+00:00"
        },
        {
            "title": "Enhanced Safety in Autonomous Driving: Integrating Latent State Diffusion Model for End-to-End Navigation",
            "authors": "Detian Chu, Linyuan Bai, Jianuo Huang, Zhenlong Fang, Peng Zhang, Wei Kang",
            "summary": "With the advancement of autonomous driving, ensuring safety during motion\nplanning and navigation is becoming more and more important. However, most\nend-to-end planning methods suffer from a lack of safety. This research\naddresses the safety issue in the control optimization problem of autonomous\ndriving, formulated as Constrained Markov Decision Processes (CMDPs). We\npropose a novel, model-based approach for policy optimization, utilizing a\nconditional Value-at-Risk based Soft Actor Critic to manage constraints in\ncomplex, high-dimensional state spaces effectively. Our method introduces a\nworst-case actor to guide safe exploration, ensuring rigorous adherence to\nsafety requirements even in unpredictable scenarios. The policy optimization\nemploys the Augmented Lagrangian method and leverages latent diffusion models\nto predict and simulate future trajectories. This dual approach not only aids\nin navigating environments safely but also refines the policy's performance by\nintegrating distribution modeling to account for environmental uncertainties.\nEmpirical evaluations conducted in both simulated and real environment\ndemonstrate that our approach outperforms existing methods in terms of safety,\nefficiency, and decision-making capabilities.",
            "pdf_url": "http://arxiv.org/pdf/2407.06317v3",
            "published": "2024-07-08 18:32:40+00:00",
            "updated": "2024-07-16 17:07:34+00:00"
        },
        {
            "title": "A Simple Latent Diffusion Approach for Panoptic Segmentation and Mask Inpainting",
            "authors": "Wouter Van Gansbeke, Bert De Brabandere",
            "summary": "Panoptic and instance segmentation networks are often trained with\nspecialized object detection modules, complex loss functions, and ad-hoc\npost-processing steps to manage the permutation-invariance of the instance\nmasks. This work builds upon Stable Diffusion and proposes a latent diffusion\napproach for panoptic segmentation, resulting in a simple architecture that\nomits these complexities. Our training consists of two steps: (1) training a\nshallow autoencoder to project the segmentation masks to latent space; (2)\ntraining a diffusion model to allow image-conditioned sampling in latent space.\nThis generative approach unlocks the exploration of mask completion or\ninpainting. The experimental validation on COCO and ADE20k yields strong\nsegmentation results. Finally, we demonstrate our model's adaptability to\nmulti-tasking by introducing learnable task embeddings.",
            "pdf_url": "http://arxiv.org/pdf/2401.10227v2",
            "published": "2024-01-18 18:59:19+00:00",
            "updated": "2024-07-16 15:52:54+00:00"
        },
        {
            "title": "Single Layer Single Gradient Unlearning",
            "authors": "Zikui Cai, Yaoteng Tan, M. Salman Asif",
            "summary": "Machine unlearning methods seek to revise pretrained models such that effects\nof certain training samples can be removed. In addition to effective erasure,\nlow computational cost and general utility retention are also highly desirable.\nExisting unlearning methods usually involve iterative updates over the model\nparameters, which incurs a high computational cost. In this work, we propose an\nefficient method that only requires a one-time gradient computation, with which\nwe modify only a single layer of model parameters. Specifically, we first\nidentify a small number of model layers that lie on the Pareto front of high\nforget importance and low retain influence as critical layers. Then we search\nfor a suitable step size and take a step along the gradient direction of a\nsingle critical layer while keeping other layers frozen. This method is highly\nmodular and can be used to unlearn multiple concepts simultaneously in a\ncontrollable manner. We demonstrate the effectiveness and efficiency of this\nmethod on various models including CLIP, stable diffusion, and VLMs, surpassing\nother state-of-the-art methods.",
            "pdf_url": "http://arxiv.org/pdf/2407.11867v1",
            "published": "2024-07-16 15:52:36+00:00",
            "updated": "2024-07-16 15:52:36+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Hedging Beyond the Mean: A Distributional Reinforcement Learning Perspective for Hedging Portfolios with Structured Products",
            "authors": "Anil Sharma, Freeman Chen, Jaesun Noh, Julio DeJesus, Mario Schlener",
            "summary": "Research in quantitative finance has demonstrated that reinforcement learning\n(RL) methods have delivered promising outcomes in the context of hedging\nfinancial portfolios. For example, hedging a portfolio of European options\nusing RL achieves better $PnL$ distribution than the trading hedging strategies\nlike Delta neutral and Delta-Gamma neutral [Cao et. al. 2020]. There is great\nattention given to the hedging of vanilla options, however, very little is\nmentioned on hedging a portfolio of structured products such as Autocallable\nnotes. Hedging structured products is much more complex and the traditional RL\napproaches tend to fail in this context due to the underlying complexity of\nthese products. These are more complicated due to presence of several barriers\nand coupon payments, and having a longer maturity date (from $7$ years to a\ndecade), etc. In this direction, we propose a distributional RL based method to\nhedge a portfolio containing an Autocallable structured note. We will\ndemonstrate our RL hedging strategy using American and Digital options as\nhedging instruments. Through several empirical analysis, we will show that\ndistributional RL provides better $PnL$ distribution than traditional\napproaches and learns a better policy depicting lower value-at-risk ($VaR$) and\nconditional value-at-risk ($CVaR$), showcasing the potential for enhanced risk\nmanagement.",
            "pdf_url": "http://arxiv.org/pdf/2407.10903v1",
            "published": "2024-07-15 16:54:43+00:00",
            "updated": "2024-07-15 16:54:43+00:00"
        },
        {
            "title": "Numbers Matter! Bringing Quantity-awareness to Retrieval Systems",
            "authors": "Satya Almasian, Milena Bruseva, Michael Gertz",
            "summary": "Quantitative information plays a crucial role in understanding and\ninterpreting the content of documents. Many user queries contain quantities and\ncannot be resolved without understanding their semantics, e.g., ``car that\ncosts less than $10k''. Yet, modern search engines apply the same ranking\nmechanisms for both words and quantities, overlooking magnitude and unit\ninformation. In this paper, we introduce two quantity-aware ranking techniques\ndesigned to rank both the quantity and textual content either jointly or\nindependently. These techniques incorporate quantity information in available\nretrieval systems and can address queries with numerical conditions equal,\ngreater than, and less than. To evaluate the effectiveness of our proposed\nmodels, we introduce two novel quantity-aware benchmark datasets in the domains\nof finance and medicine and compare our method against various lexical and\nneural models. The code and data are available under\nhttps://github.com/satya77/QuantityAwareRankers.",
            "pdf_url": "http://arxiv.org/pdf/2407.10283v1",
            "published": "2024-07-14 17:56:11+00:00",
            "updated": "2024-07-14 17:56:11+00:00"
        }
    ]
}