{
    "Physics": [
        {
            "title": "GyroSwin: 5D Surrogates for Gyrokinetic Plasma Turbulence Simulations",
            "authors": "Fabian Paischer, Gianluca Galletti, William Hornsby, Paul Setinek, Lorenzo Zanisi, Naomi Carey, Stanislas Pamela, Johannes Brandstetter",
            "summary": "Nuclear fusion plays a pivotal role in the quest for reliable and sustainable\nenergy production. A major roadblock to viable fusion power is understanding\nplasma turbulence, which significantly impairs plasma confinement, and is vital\nfor next-generation reactor design. Plasma turbulence is governed by the\nnonlinear gyrokinetic equation, which evolves a 5D distribution function over\ntime. Due to its high computational cost, reduced-order models are often\nemployed in practice to approximate turbulent transport of energy. However,\nthey omit nonlinear effects unique to the full 5D dynamics. To tackle this, we\nintroduce GyroSwin, the first scalable 5D neural surrogate that can model 5D\nnonlinear gyrokinetic simulations, thereby capturing the physical phenomena\nneglected by reduced models, while providing accurate estimates of turbulent\nheat transport.GyroSwin (i) extends hierarchical Vision Transformers to 5D,\n(ii) introduces cross-attention and integration modules for latent\n3D$\\leftrightarrow$5D interactions between electrostatic potential fields and\nthe distribution function, and (iii) performs channelwise mode separation\ninspired by nonlinear physics. We demonstrate that GyroSwin outperforms widely\nused reduced numerics on heat flux prediction, captures the turbulent energy\ncascade, and reduces the cost of fully resolved nonlinear gyrokinetics by three\norders of magnitude while remaining physically verifiable. GyroSwin shows\npromising scaling laws, tested up to one billion parameters, paving the way for\nscalable neural surrogates for gyrokinetic simulations of plasma turbulence.",
            "pdf_url": "http://arxiv.org/pdf/2510.07314v1",
            "published": "2025-10-08 17:59:10+00:00",
            "updated": "2025-10-08 17:59:10+00:00"
        },
        {
            "title": "Is it Gaussian? Testing bosonic quantum states",
            "authors": "Filippo Girardi, Freek Witteveen, Francesco Anna Mele, Lennart Bittel, Salvatore F. E. Oliviero, David Gross, Michael Walter",
            "summary": "Gaussian states are widely regarded as one of the most relevant classes of\ncontinuous-variable (CV) quantum states, as they naturally arise in physical\nsystems and play a key role in quantum technologies. This motivates a\nfundamental question: given copies of an unknown CV state, how can we\nefficiently test whether it is Gaussian? We address this problem from the\nperspective of representation theory and quantum learning theory,\ncharacterizing the sample complexity of Gaussianity testing as a function of\nthe number of modes. For pure states, we prove that just a constant number of\ncopies is sufficient to decide whether the state is exactly Gaussian. We then\nextend this to the tolerant setting, showing that a polynomial number of copies\nsuffices to distinguish states that are close to Gaussian from those that are\nfar. In contrast, we establish that testing Gaussianity of general mixed states\nnecessarily requires exponentially many copies, thereby identifying a\nfundamental limitation in testing CV systems. Our approach relies on\nrotation-invariant symmetries of Gaussian states together with the recently\nintroduced toolbox of CV trace-distance bounds.",
            "pdf_url": "http://arxiv.org/pdf/2510.07305v1",
            "published": "2025-10-08 17:56:34+00:00",
            "updated": "2025-10-08 17:56:34+00:00"
        },
        {
            "title": "Effects of Wall Roughness on Coupled Flow and Heat Transport in Fractured Media",
            "authors": "Alessandro Lenci, Yves Méheust, Maria Klepikova, Vittorio Di Federico, Daniel M. Tartakovsky",
            "summary": "Heat transfer in fractured media is governed by the interplay between\nadvective transport along rough-walled fractures and conductive transport, both\nwithin the fractures and in the surrounding low-permeability matrix. Flow\nlocalization induced by aperture heterogeneity, combined with matrix\nconduction, gives rise to anomalous thermal behavior. To capture these effects,\nwe develop a stochastic modeling framework that couples a time-domain random\nwalk (TDRW) representation of advective and conductive transport in the\nfractures with a semi-analytical model of conductive heat exchange with the\nmatrix. Matrix trapping times follow a L\\'evy-Smirnov distribution derived from\nfirst-passage theory, capturing the heavy-tailed dynamics typical of fractured\nsystems. Heat flux at the fracture-matrix interface is computed via a nonlocal\nconvolution integral based on Duhamel's principle, accounting for thermal\nmemory effects. The model is validated against analytical benchmarks and\nfinite-element simulations. Monte Carlo simulations over stochastic aperture\nfields quantify the influence of fracture closure, correlation length, and\nP\\'eclet number. Results reveal a transition from superdiffusive to\nsubdiffusive regimes, driven by the competition between advective transport\nalong preferential paths, dispersion induced by aperture variability, and\nmatrix-driven heat conduction. In the long-time regime, heat exchange exhibits\na characteristic $t^{-1/2}$ decay. At early times, limited thermal penetration\ninto the matrix leads to weaker interfacial fluxes, underscoring the role of\nmatrix thermal inertia. The proposed framework enables physically consistent\nand computationally efficient simulations of thermal transport in complex\nfractured systems, with implications for geothermal energy, subsurface thermal\nstorage, and engineered heat exchange in low-permeability environments.",
            "pdf_url": "http://arxiv.org/pdf/2510.07294v1",
            "published": "2025-10-08 17:50:37+00:00",
            "updated": "2025-10-08 17:50:37+00:00"
        },
        {
            "title": "Quantum Replica Exchange",
            "authors": "Zherui Chen, Joao Basso, Zhiyan Ding, Lin Lin",
            "summary": "The presence of energy barriers in the state space of a physical system can\nlead to exponentially slow convergence for sampling algorithms like Markov\nchain Monte Carlo (MCMC). In the classical setting, replica exchange (or\nparallel tempering) is a powerful heuristic to accelerate mixing in these\nscenarios. In the quantum realm, preparing Gibbs states of Hamiltonians faces a\nsimilar challenge, where bottlenecks can dramatically increase the mixing time\nof quantum dynamical semigroups. In this work, we introduce a quantum analogue\nof the replica exchange method. We define a Lindbladian on a joint system of\ntwo replicas and prove that it can accelerate mixing for a class of\nHamiltonians with local energy barriers. Our main result provides a rigorous\nlower bound on the spectral gap of the combined system's Lindbladian, which\nleads to an exponential improvement in spectral gap with respect to the barrier\nheight. We showcase the applicability of our method with several examples,\nincluding the defected 1D Ising model at arbitrary constant temperature, and\ndefected non-commuting local Hamiltonians at high temperature. Our work\nprovides a rigorous acceleration mechanism for quantum Gibbs preparation.",
            "pdf_url": "http://arxiv.org/pdf/2510.07291v1",
            "published": "2025-10-08 17:47:17+00:00",
            "updated": "2025-10-08 17:47:17+00:00"
        },
        {
            "title": "Muonium HFS Uncertainty Revisited",
            "authors": "Michael I. Eides",
            "summary": "Uncertainty of the quantum electrodynamics theoretical prediction for the\nhyperfine splitting in the ground state of muonium is considered. It is\ncompared with the respective discussion in the two most recent CODATA\nadjustments of the fundamental physical constants.",
            "pdf_url": "http://arxiv.org/pdf/2510.07281v1",
            "published": "2025-10-08 17:43:10+00:00",
            "updated": "2025-10-08 17:43:10+00:00"
        },
        {
            "title": "Dual Natural Gradient Descent for Scalable Training of Physics-Informed Neural Networks",
            "authors": "Anas Jnini, Flavio Vella",
            "summary": "Natural-gradient methods markedly accelerate the training of Physics-Informed\nNeural Networks (PINNs), yet their Gauss--Newton update must be solved in the\nparameter space, incurring a prohibitive $O(n^3)$ time complexity, where $n$ is\nthe number of network trainable weights. We show that exactly the same step can\ninstead be formulated in a generally smaller residual space of size $m =\n\\sum_{\\gamma} N_{\\gamma} d_{\\gamma}$, where each residual class $\\gamma$ (e.g.\nPDE interior, boundary, initial data) contributes $N_{\\gamma}$ collocation\npoints of output dimension $d_{\\gamma}$.\n  Building on this insight, we introduce \\textit{Dual Natural Gradient Descent}\n(D-NGD). D-NGD computes the Gauss--Newton step in residual space, augments it\nwith a geodesic-acceleration correction at negligible extra cost, and provides\nboth a dense direct solver for modest $m$ and a Nystrom-preconditioned\nconjugate-gradient solver for larger $m$.\n  Experimentally, D-NGD scales second-order PINN optimization to networks with\nup to 12.8 million parameters, delivers one- to three-order-of-magnitude lower\nfinal error $L^2$ than first-order methods (Adam, SGD) and quasi-Newton\nmethods, and -- crucially -- enables natural-gradient training of PINNs at this\nscale on a single GPU.",
            "pdf_url": "http://arxiv.org/pdf/2505.21404v2",
            "published": "2025-05-27 16:27:23+00:00",
            "updated": "2025-10-08 17:39:20+00:00"
        },
        {
            "title": "On quantum to classical comparison for Davies generators",
            "authors": "Joao Basso, Shirshendu Ganguly, Alistair Sinclair, Nikhil Srivastava, Zachary Stier, Thuy-Duong Vuong",
            "summary": "Despite extensive study, our understanding of quantum Markov chains remains\nfar less complete than that of their classical counterparts. [Temme'13]\nobserved that the Davies Lindbladian, a well-studied model of quantum Markov\ndynamics, contains an embedded classical Markov generator, raising the natural\nquestion of how the convergence properties of the quantum and classical\ndynamics are related. While [Temme'13] showed that the spectral gap of the\nDavies Lindbladian can be much smaller than that of the embedded classical\ngenerator for certain highly structured Hamiltonians, we show that if the\nspectrum of the Hamiltonian does not contain long arithmetic progressions, then\nthe two spectral gaps must be comparable. As a consequence, we prove that for a\nlarge class of Hamiltonians, including those obtained by perturbing a fixed\nHamiltonian with a generic external field, the quantum spectral gap remains\nwithin a constant factor of the classical spectral gap. Our result aligns with\nphysical intuition and enables the application of classical Markov chain\ntechniques to the quantum setting.\n  The proof is based on showing that any ``off-diagonal'' eigenvector of the\nDavies generator can be used to construct an observable which commutes with the\nHamiltonian and has a Lindbladian Rayleigh quotient which can be upper bounded\nin terms of that of the original eigenvector's Lindbladian Rayleigh quotient.\nThus, a spectral gap for such observables implies a spectral gap for the full\nDavies generator.",
            "pdf_url": "http://arxiv.org/pdf/2510.07267v1",
            "published": "2025-10-08 17:33:23+00:00",
            "updated": "2025-10-08 17:33:23+00:00"
        },
        {
            "title": "Statistical Estimates for 2D stochastic Navier-Stokes Equations",
            "authors": "Anuj Kumar, Ali Pakzad",
            "summary": "The statistical features of homogeneous, isotropic, two-dimensional\nstochastic turbulence are discussed. We derive some rigorous bounds for the\nmean value of the bulk energy dissipation rate $\\mathbb{E} [\\varepsilon ]$ and\nenstrophy dissipation rates $\\mathbb{E} [\\chi] $ for 2D flows sustained by a\nvariety of stochastic driving forces. We show that $$\\mathbb{E} [ \\varepsilon ]\n\\rightarrow 0 \\hspace{0.5cm}\\mbox{and} \\hspace{0.5cm} \\mathbb{E} [ \\chi ]\n\\lesssim \\mathcal{O}(1)$$ in the inviscid limit, consistent with the\ndual-cascade in 2D turbulence.",
            "pdf_url": "http://arxiv.org/pdf/2501.18213v2",
            "published": "2025-01-30 09:09:26+00:00",
            "updated": "2025-10-08 16:43:18+00:00"
        },
        {
            "title": "Structure-Preserving MHD-Driftkinetic Discretization for Wave-Particle Interactions",
            "authors": "Byung Kyu Na, Stefan Possanner, Xin Wang",
            "summary": "We present a structure-preserving discretization of the hybrid\nmagnetohydrodynamics (MHD)-driftkinetic system for simulations of low-frequency\nwave-particle interactions. The model equations are derived from a variational\nprinciple, assuring energetically consistent couplings between MHD fluids and\ndriftkinetic particles. The spatial discretization is based on a\nfinite-element-exterior-calculus (FEEC) framework for the MHD and a\nparticle-in-cell (PIC) method for the driftkinetic. A key feature of the scheme\nis the inclusion of the non-quadratic particle magnetic moment energy term in\nthe Hamiltonian, which is introduced by the guiding-center approximation. The\nresulting discrete Hamiltonian structure naturally organizes the dynamics into\nskew-symmetric subsystems, enabling balanced energy exchange. To handle the\nnon-quadratic energy term, we develop energy-preserving time integrators based\non discrete gradient methods. The algorithm is implemented in the open-source\nPython package $\\texttt{STRUPHY}$. Numerical experiments confirm the\nenergy-conserving property of the scheme and demonstrate the capability to\nsimulate energetic particles (EP) induced excitation of toroidal Alfv\\'en\neigenmodes (TAE) without artificial dissipation or mode filtering. This\ncapability highlights the potential of structure-preserving schemes for\nhigh-fidelity simulations of hybrid systems.",
            "pdf_url": "http://arxiv.org/pdf/2510.04385v2",
            "published": "2025-10-05 22:34:28+00:00",
            "updated": "2025-10-08 16:41:00+00:00"
        },
        {
            "title": "Diffusion Codes: Self-Correction from Small(er)-Set Expansion with Tunable Non-locality",
            "authors": "Adithya Sriram, Vedika Khemani, Benedikt Placke",
            "summary": "Optimal constructions of classical LDPC codes can be obtained by choosing the\nTanner graph uniformly at random among biregular graphs. We introduce a class\nof codes that we call ``diffusion codes'', defined by placing each edge\nconnecting bits and checks on some graph, and acting on that graph with a\nrandom SWAP network. By tuning the depth of the SWAP network, we can tune a\ntradeoff between the amount of randomness -- and hence the optimality of code\nparameters -- and locality with respect to the underlying graph. For diffusion\ncodes defined on the cycle graph, if the SWAP network has depth $\\sim Tn$ with\n$T> n^{2\\beta}$ for arbitrary $\\beta>0$, then we prove that almost surely the\nTanner graph is a lossless ``smaller set'' vertex expander for small sets up\nsize $\\delta \\sim \\sqrt T \\sim n^{\\beta}$, with bounded bit and check degree.\nAt the same time, the geometric size of the largest stabilizer is bounded by\n$\\sqrt T$ in graph distance. We argue, based on physical intuition, that this\nresult should hold more generally on arbitrary graphs. By taking hypergraph\nproducts of these classical codes we obtain quantum LDPC codes defined on the\ntorus with smaller-set boundary and co-boundary expansion and the same\nexpansion/locality tradeoffs as for the classical codes. These codes are\nself-correcting and admit single-shot decoding, while having the geometric size\nof the stabilizer growing as an arbitrarily small power law. Our proof\ntechnique establishes mixing of a random SWAP network on small subsystems at\ntimes scaling with only the subsystem size, which may be of independent\ninterest.",
            "pdf_url": "http://arxiv.org/pdf/2510.07179v1",
            "published": "2025-10-08 16:17:34+00:00",
            "updated": "2025-10-08 16:17:34+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Bit-Level Discrete Diffusion with Markov Probabilistic Models: An Improved Framework with Sharp Convergence Bounds under Minimal Assumptions",
            "authors": "Le-Tuyet-Nhi Pham, Dario Shariatian, Antonio Ocello, Giovanni Conforti, Alain Durmus",
            "summary": "This paper introduces Discrete Markov Probabilistic Models (DMPMs), a novel\ndiscrete diffusion algorithm for discrete data generation. The algorithm\noperates in discrete bit space, where the noising process is a continuous-time\nMarkov chain that flips labels uniformly at random. The time-reversal process,\nlike the forward noise process, is a jump process with its intensity governed\nby a discrete analogue of the classical score function. Crucially, this\nintensity is proven to be the conditional expectation of a function of the\nforward process, underlining theoretical alignment with score-based generative\nmodels. We establish convergence bounds for the algorithm under minimal\nassumptions, ensuring robustness and efficiency, which we demonstrate through\nexperiments on low-dimensional Bernoulli-distributed datasets and\nhigh-dimensional binary MNIST data. The results highlight competitive\nperformance in generating discrete structures compared to the state-of-the-art.\nThis work bridges theoretical foundations and practical applications, advancing\nthe development of effective and theoretically grounded discrete generative\nmodeling.",
            "pdf_url": "http://arxiv.org/pdf/2502.07939v2",
            "published": "2025-02-11 20:36:23+00:00",
            "updated": "2025-10-08 16:55:19+00:00"
        },
        {
            "title": "Generative AI for Cel-Animation: A Survey",
            "authors": "Yolo Yunlong Tang, Junjia Guo, Pinxin Liu, Zhiyuan Wang, Hang Hua, Jia-Xing Zhong, Yunzhong Xiao, Chao Huang, Luchuan Song, Susan Liang, Yizhi Song, Liu He, Jing Bi, Mingqian Feng, Xinyang Li, Zeliang Zhang, Chenliang Xu",
            "summary": "Traditional Celluloid (Cel) Animation production pipeline encompasses\nmultiple essential steps, including storyboarding, layout design, keyframe\nanimation, inbetweening, and colorization, which demand substantial manual\neffort, technical expertise, and significant time investment. These challenges\nhave historically impeded the efficiency and scalability of Cel-Animation\nproduction. The rise of generative artificial intelligence (GenAI),\nencompassing large language models, multimodal models, and diffusion models,\noffers innovative solutions by automating tasks such as inbetween frame\ngeneration, colorization, and storyboard creation. This survey explores how\nGenAI integration is revolutionizing traditional animation workflows by\nlowering technical barriers, broadening accessibility for a wider range of\ncreators through tools like AniDoc, ToonCrafter, and AniSora, and enabling\nartists to focus more on creative expression and artistic innovation. Despite\nits potential, challenges like visual consistency, stylistic coherence, and\nethical considerations persist. Additionally, this paper explores future\ndirections and advancements in AI-assisted animation. For further exploration\nand resources, please visit our GitHub repository:\nhttps://github.com/yunlong10/Awesome-AI4Animation",
            "pdf_url": "http://arxiv.org/pdf/2501.06250v4",
            "published": "2025-01-08 20:57:39+00:00",
            "updated": "2025-10-08 16:45:46+00:00"
        },
        {
            "title": "A Digital Twin Framework for Metamorphic Testing of Autonomous Driving Systems Using Generative Model",
            "authors": "Tony Zhang, Burak Kantarci, Umair Siddique",
            "summary": "Ensuring the safety of self-driving cars remains a major challenge due to the\ncomplexity and unpredictability of real-world driving environments. Traditional\ntesting methods face significant limitations, such as the oracle problem, which\nmakes it difficult to determine whether a system's behavior is correct, and the\ninability to cover the full range of scenarios an autonomous vehicle may\nencounter. In this paper, we introduce a digital twin-driven metamorphic\ntesting framework that addresses these challenges by creating a virtual replica\nof the self-driving system and its operating environment. By combining digital\ntwin technology with AI-based image generative models such as Stable Diffusion,\nour approach enables the systematic generation of realistic and diverse driving\nscenes. This includes variations in weather, road topology, and environmental\nfeatures, all while maintaining the core semantics of the original scenario.\nThe digital twin provides a synchronized simulation environment where changes\ncan be tested in a controlled and repeatable manner. Within this environment,\nwe define three metamorphic relations inspired by real-world traffic rules and\nvehicle behavior. We validate our framework in the Udacity self-driving\nsimulator and demonstrate that it significantly enhances test coverage and\neffectiveness. Our method achieves the highest true positive rate (0.719), F1\nscore (0.689), and precision (0.662) compared to baseline approaches. This\npaper highlights the value of integrating digital twins with AI-powered\nscenario generation to create a scalable, automated, and high-fidelity testing\nsolution for autonomous vehicle safety.",
            "pdf_url": "http://arxiv.org/pdf/2510.07133v1",
            "published": "2025-10-08 15:27:39+00:00",
            "updated": "2025-10-08 15:27:39+00:00"
        },
        {
            "title": "Graph Conditioned Diffusion for Controllable Histopathology Image Generation",
            "authors": "Sarah Cechnicka, Matthew Baugh, Weitong Zhang, Mischa Dombrowski, Zhe Li, Johannes C. Paetzold, Candice Roufosse, Bernhard Kainz",
            "summary": "Recent advances in Diffusion Probabilistic Models (DPMs) have set new\nstandards in high-quality image synthesis. Yet, controlled generation remains\nchallenging, particularly in sensitive areas such as medical imaging. Medical\nimages feature inherent structure such as consistent spatial arrangement, shape\nor texture, all of which are critical for diagnosis. However, existing DPMs\noperate in noisy latent spaces that lack semantic structure and strong priors,\nmaking it difficult to ensure meaningful control over generated content. To\naddress this, we propose graph-based object-level representations for\nGraph-Conditioned-Diffusion. Our approach generates graph nodes corresponding\nto each major structure in the image, encapsulating their individual features\nand relationships. These graph representations are processed by a transformer\nmodule and integrated into a diffusion model via the text-conditioning\nmechanism, enabling fine-grained control over generation. We evaluate this\napproach using a real-world histopathology use case, demonstrating that our\ngenerated data can reliably substitute for annotated patient data in downstream\nsegmentation tasks. The code is available here.",
            "pdf_url": "http://arxiv.org/pdf/2510.07129v1",
            "published": "2025-10-08 15:26:08+00:00",
            "updated": "2025-10-08 15:26:08+00:00"
        },
        {
            "title": "Diffusion-Augmented Reinforcement Learning for Robust Portfolio Optimization under Stress Scenarios",
            "authors": "Himanshu Choudhary, Arishi Orra, Manoj Thakur",
            "summary": "In the ever-changing and intricate landscape of financial markets, portfolio\noptimisation remains a formidable challenge for investors and asset managers.\nConventional methods often struggle to capture the complex dynamics of market\nbehaviour and align with diverse investor preferences. To address this, we\npropose an innovative framework, termed Diffusion-Augmented Reinforcement\nLearning (DARL), which synergistically integrates Denoising Diffusion\nProbabilistic Models (DDPMs) with Deep Reinforcement Learning (DRL) for\nportfolio management. By leveraging DDPMs to generate synthetic market crash\nscenarios conditioned on varying stress intensities, our approach significantly\nenhances the robustness of training data. Empirical evaluations demonstrate\nthat DARL outperforms traditional baselines, delivering superior risk-adjusted\nreturns and resilience against unforeseen crises, such as the 2025 Tariff\nCrisis. This work offers a robust and practical methodology to bolster stress\nresilience in DRL-driven financial applications.",
            "pdf_url": "http://arxiv.org/pdf/2510.07099v1",
            "published": "2025-10-08 14:56:50+00:00",
            "updated": "2025-10-08 14:56:50+00:00"
        }
    ]
}