{
    "Physics": [
        {
            "title": "String Breaking Dynamics and Glueball Formation in a $2+1$D Lattice Gauge Theory",
            "authors": "Kaidi Xu, Umberto Borla, Sergej Moroz, Jad C. Halimeh",
            "summary": "With the advent of advanced quantum processors capable of probing lattice\ngauge theories (LGTs) in higher spatial dimensions, it is crucial to understand\nstring dynamics in such models to guide upcoming experiments and to make\nconnections to high-energy physics (HEP). Using tensor network methods, we\nstudy the far-from-equilibrium quench dynamics of electric flux strings between\ntwo static charges in the $2+1$D $\\mathbb{Z}_2$ LGT with dynamical matter. We\ncalculate the probabilities of finding the time-evolved wave function in string\nconfigurations of the same length as the initial string. At resonances\ndetermined by the the electric field strength and the mass, we identify various\nstring breaking processes accompanied with matter creation. Away from resonance\nstrings exhibit intriguing confined dynamics which, for strong electric fields,\nwe fully characterize through effective perturbative models. Starting in\nmaximal-length strings, we find that the wave function enters a dynamical\nregime where it splits into shorter strings and disconnected loops, with the\nlatter bearing qualitative resemblance to glueballs in quantum chromodynamics\n(QCD). Our findings can be probed on state-of-the-art superconducting-qubit and\ntrapped-ion quantum processors.",
            "pdf_url": "http://arxiv.org/pdf/2507.01950v1",
            "published": "2025-07-02 17:57:52+00:00",
            "updated": "2025-07-02 17:57:52+00:00"
        },
        {
            "title": "SpecCLIP: Aligning and Translating Spectroscopic Measurements for Stars",
            "authors": "Xiaosheng Zhao, Yang Huang, Guirong Xue, Xiao Kong, Jifeng Liu, Xiaoyu Tang, Timothy C. Beers, Yuan-Sen Ting, A-Li Luo",
            "summary": "In recent years, large language models (LLMs) have transformed natural\nlanguage understanding through vast datasets and large-scale parameterization.\nInspired by this success, we present SpecCLIP, a foundation model framework\nthat extends LLM-inspired methodologies to stellar spectral analysis. Stellar\nspectra, akin to structured language, encode rich physical and chemical\ninformation about stars. By training foundation models on large-scale spectral\ndatasets, our goal is to learn robust and informative embeddings that support\ndiverse downstream applications. As a proof of concept, SpecCLIP involves\npre-training on two spectral types--LAMOST low-resolution and Gaia XP--followed\nby contrastive alignment using the CLIP (Contrastive Language-Image\nPre-training) framework, adapted to associate spectra from different\ninstruments. This alignment is complemented by auxiliary decoders that preserve\nspectrum-specific information and enable translation (prediction) between\nspectral types, with the former achieved by maximizing mutual information\nbetween embeddings and input spectra. The result is a cross-spectrum framework\nenabling intrinsic calibration and flexible applications across instruments. We\ndemonstrate that fine-tuning these models on moderate-sized labeled datasets\nimproves adaptability to tasks such as stellar-parameter estimation and\nchemical-abundance determination. SpecCLIP also enhances the accuracy and\nprecision of parameter estimates benchmarked against external survey data.\nAdditionally, its similarity search and cross-spectrum prediction capabilities\noffer potential for anomaly detection. Our results suggest that contrastively\ntrained foundation models enriched with spectrum-aware decoders can advance\nprecision stellar spectroscopy.",
            "pdf_url": "http://arxiv.org/pdf/2507.01939v1",
            "published": "2025-07-02 17:49:52+00:00",
            "updated": "2025-07-02 17:49:52+00:00"
        },
        {
            "title": "Relational Supersymmetry via the Dressing Field Method and Matter-Interaction Supergeometric Framework",
            "authors": "J. François, L. Ravera",
            "summary": "Relationality is the paradigmatic conceptual core of general-relativistic\ngauge field theory. It can be made manifest via the Dressing Field Method (DFM)\nof symmetry reduction, a systematic tool to achieve gauge-invariance by\nextracting the physical degrees of freedom representing relations among field\nvariables. We review and further expand on some applications of the DFM to the\nvery foundations of the supersymmetric framework, where it allows to build\nrelational supersymmetric field theory and (dis)solves crucial issues.\nFurthermore, we elaborate on a novel approach within the relational\nsupersymmetric field theory framework giving a unified description of fermionic\nmatter fields and bosonic gauge fields, and thus close to Berezin's original\nmotivation for the introduction of supergeometry in fundamental physics: a\nMatter-Interaction Supergeometric Unification (MISU). This new approach stands\nirrespective from the ultimate empirical status of standard supersymmetric\nfield theory, about which it is agnostic.",
            "pdf_url": "http://arxiv.org/pdf/2503.19077v2",
            "published": "2025-03-24 19:04:34+00:00",
            "updated": "2025-07-02 17:26:27+00:00"
        },
        {
            "title": "Attosecond Control and Measurement of Chiral Photoionisation Dynamics",
            "authors": "Meng Han, Jia-Bao Ji, Alexander Blech, R. Esteban Goetz, Corbin Allison, Loren Greenman, Christiane P. Koch, Hans Jakob Wörner",
            "summary": "Many chirality-sensitive light-matter interactions are governed by chiral\nelectron dynamics. Therefore, the development of advanced technologies\nharnessing chiral phenomena would critically benefit from measuring and\ncontrolling chiral electron dynamics on their natural attosecond time scales.\nSuch endeavors have so far been hampered by the lack of characterized\ncircularly polarized attosecond pulses, an obstacle that has recently been\novercome (Han et al. Optica 10 (2023) 1044-1052, Han et al. Nature Physics 19\n(2023) 230-236). In this article, we introduce chiroptical spectroscopy with\nattosecond pulses and demonstrate attosecond coherent control over\nphotoelectron circular dichroism (PECD) (Goetz et al. Physical Review Letters\n122 (2019) 013204, Goetz et al. arXiv:2104.07522), as well as the measurement\nof chiral asymmetries in the forward-backward and angle-resolved\nphotoionisation delays of chiral molecules. We show that co-rotating attosecond\nand near-infrared pulses can nearly double the PECD and even change its sign\ncompared to single-photon ionisation. We demonstrate that chiral\nphotoionisation delays depend on both polar and azimuthal angles of\nphotoemission in the light-propagation frame, requiring three-dimensional\nmomentum resolution. We measure forward-backward chiral-sensitive delays of up\nto 120 as and polar-angle-resolved photoionisation delays up to 240 as, which\ninclude an asymmmetry of $\\sim$60 as originating from chirality in the\ncontinuum-continuum transitions. Attosecond chiroptical spectroscopy opens the\ndoor to quantitatively understanding and controlling the dynamics of chiral\nmolecules on the electronic time scale.",
            "pdf_url": "http://arxiv.org/pdf/2507.01906v1",
            "published": "2025-07-02 17:21:41+00:00",
            "updated": "2025-07-02 17:21:41+00:00"
        },
        {
            "title": "Simulation and analysis of turbulent flame and its effect on the wall of aero engine combustor",
            "authors": "A. Mokhtari, A. Abdallah-elhirtsi, F. Larbi, R. Renane, R. Allouche",
            "summary": "The main objective of this study is to simulate the behavior of the reactive\nflow of the turbulent flame in aeronautical combustion chamber of the\nALLISON-T56 turboprop, and contribute to the analysis of flame structure and\ndetermine for given pressure and temperature of fresh gas the behavior of the\nthermodynamic parameters of combustion. The numerical approach is based on the\nresolution of basic equations of turbulent combustion using Ansys-Fluent code\nwhere the turbulence model K-e is chosen, the geometry of the combustion\nchamber is made using Ansys-workbench software. Thereafter, we simulate the\ntransient temperature field through the wall of a tubular combustion chamber,\nand the characterization of the thermal expansion, the thermoelastic stresses\nand strains with the physical properties of refractory materials. The obtained\nresults are then compared with the results of the scientific literature",
            "pdf_url": "http://arxiv.org/pdf/2507.01892v1",
            "published": "2025-07-02 17:04:49+00:00",
            "updated": "2025-07-02 17:04:49+00:00"
        },
        {
            "title": "Circuit compression for 2D quantum dynamics",
            "authors": "Matteo D'Anna, Yuxuan Zhang, Roeland Wiersema, Manuel S. Rudolph, Juan Carrasquilla",
            "summary": "The study of out-of-equilibrium quantum many-body dynamics remains one of the\nmost exciting research frontiers of physics, standing at the crossroads of our\nunderstanding of complex quantum phenomena and the realization of quantum\nadvantage. Quantum algorithms for the dynamics of quantum systems typically\nrequire deep quantum circuits whose accuracy is compromised by noise and\nimperfections in near-term hardware. Thus, reducing the depth of such quantum\ncircuits to shallower ones while retaining high accuracy is critical for\nquantum simulation. Variational quantum compilation methods offer a promising\npath forward, yet a core difficulty persists: ensuring that a variational\nansatz $V$ faithfully approximates a target unitary $U$. Here we leverage Pauli\npropagation techniques to develop a strategy for compressing circuits that\nimplement the dynamics of large two-dimensional (2D) quantum systems and\nbeyond. As a concrete demonstration, we compress the dynamics of systems up to\n$30 \\times 30$ qubits and achieve accuracies that surpass standard\nTrotterization methods by orders of magnitude at identical circuit depths. To\nexperimentally validate our approach, we execute the compiled ansatz on\nQuantinuum's H1 quantum processor and observe that it tracks the system's\ndynamics with significantly higher fidelity than Trotterized circuits without\noptimization. Our circuit compression scheme brings us one step closer to a\npractical quantum advantage by allowing longer simulation times at reduced\nquantum resources and unlocks the exploration of large families of\nhardware-friendly ans\\\"atze.",
            "pdf_url": "http://arxiv.org/pdf/2507.01883v1",
            "published": "2025-07-02 16:52:21+00:00",
            "updated": "2025-07-02 16:52:21+00:00"
        },
        {
            "title": "Transient dispersion in oscillatory flows: auxiliary-time extension method for concentration moments",
            "authors": "Weiquan Jiang, Guoqian Chen",
            "summary": "The dispersion phenomenon of mass and heat transport in oscillatory flows has\nwide applications in environmental, physiological and microfluidic flows. The\nmethod of concentration moments is a powerful theoretical tool for analyzing\ntransport characteristics and is well-developed for steady flows. However, the\ngeneral solutions of moments derived by Barton (J. Fluid Mech., vol. 126, 1983,\npp. 205-218) cannot be applied directly to unsteady flows. Prior studies needed\nto re-solve the governing equations of moments from scratch, encountering the\ncomplication induced by the time-periodic velocity, leaving higher-order\nstatistics like skewness and kurtosis analytically intractable except for\nspecific cases. This work proposes a novel approach based on a\ntwo-time-variable extension to tackle these challenges. By introducing an\nauxiliary time variable, referred to as oscillation time to characterize the\ninherent oscillation in the dispersion due to the oscillating flow, the\ntransport problem is extended to a two-time-variable system with a \"steady\"\nflow term. This enables the direct use of Barton's expressions and thus avoids\nthe prior complication. This approach not only offers an intuitive physical\nperspective for the influence of the velocity oscillation but also clarifies\nthe solution structure of concentration moments. As a preliminary verification,\nwe examine the transport problem in an oscillatory Couette flow. The analytical\nsolution agrees well with the numerical result by Brownian dynamics\nsimulations. The effects of the point-source release and the phase shift of\nvelocity on the transport characteristics are investigated. By extending the\nclassic steady-flow solution to the time-dependent flows, this work provides a\nversatile framework for transient dispersion analysis, enhancing predictions in\noscillatory transport problems.",
            "pdf_url": "http://arxiv.org/pdf/2507.01870v1",
            "published": "2025-07-02 16:36:45+00:00",
            "updated": "2025-07-02 16:36:45+00:00"
        },
        {
            "title": "Direct Vertex Reconstruction of $Λ$ Baryons from Hits in CLAS12 using Graph Neural Networks",
            "authors": "Keegan Menkce, Matthew McEneaney, Anselm Vossen",
            "summary": "Machine learning techniques, including Graph Neural Networks (GNNs), have\nbeen used extensively for data analysis in high energy and nuclear physics.\nHere we report on the use of a GNN to reconstruct decay vertices of $\\Lambda$\nhyperons directly from hits in the tracking detector at the CLAS12 experiment\nat Jefferson Laboratory (JLab). We show that we can improve the vertex\nreconstruction in simulation compared to the standard, track based, algorithm.\nWe believe this warrants further study. The current study is limited by\navailable training resources but points to an interesting possibility to forgo\nvertex reconstruction by track fitting in a complicated magnetic field for a\nmore direct approach where the hit to vertex mapping is encoded in a neural\nnetwork.",
            "pdf_url": "http://arxiv.org/pdf/2507.01868v1",
            "published": "2025-07-02 16:35:11+00:00",
            "updated": "2025-07-02 16:35:11+00:00"
        },
        {
            "title": "Generalized Parton Distributions from Symbolic Regression",
            "authors": "Andrew Dotson, Zaki Panjsheeri, Anusha Reddy Singireddy, Douglas Q. Adams, Emmanuel Ortiz-Pacheco, Marija Cuic, Yaohang Li, Huey-Wen Lin, Simonetta Liuti, Matthew D. Sievert, Marie Boer, Gia-Wei Chern, Michael Engelhardt, Gary R. Goldstein",
            "summary": "AI/ML informed Symbolic Regression is the next stage of scientific modeling.\nWe utilize a highly customizable symbolic regression package ``PySR\" to model\nthe $x$ and $t$ dependence of the flavor isovector combination\n$H_{u-d}(x,t,\\xi)$ at $\\xi=0$. These PySR models were trained on GPD results\nprovided by both Lattice QCD and phenomenological sources GGL, GK, and VGG. We\ndemonstrate, for the first time, the consistency and systematic convergence of\nSymbolic Regression by quantifying the disparate models through their Taylor\nexpansion coefficients. In addition to PySR penalizing models with higher\ncomplexity and mean-squared error, we implement schemes that test specific\nphysics hypotheses, including force-factorized $x$ and $t$ dependence and Regge\nbehavior in PySR GPDs. We show that PySR can identify factorizing GPD sources\nbased on their response to the Force-Factorized model. Knowing the precise\nbehavior of the GPDs, and their uncertainties in a wide range in $x$ and $t$,\ncrucially impacts our ability to concretely and quantitatively predict hadronic\nspatial distributions and their derived quantities.",
            "pdf_url": "http://arxiv.org/pdf/2504.13289v3",
            "published": "2025-04-17 18:59:47+00:00",
            "updated": "2025-07-02 16:34:38+00:00"
        },
        {
            "title": "Spin hydrodynamics -- recent developments",
            "authors": "Samapan Bhadury, Zbigniew Drogosz, Wojciech Florkowski, Valeriya Mykhaylova",
            "summary": "After briefly touching on relativistic hydrodynamics, we provide a detailed\ndescription of recent developments in spin hydrodynamics. We discuss the theory\nof perfect spin hydrodynamics within two different approaches, which lead to\nidentical generalized thermodynamic relations. We also indicate the\napplicability range of the theory, finding it compatible with the conditions\nexisting in the late stages of heavy-ion collisions. Finally, we discuss the\nnear-equilibrium dynamics.",
            "pdf_url": "http://arxiv.org/pdf/2507.01864v1",
            "published": "2025-07-02 16:26:26+00:00",
            "updated": "2025-07-02 16:26:26+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "AC-DiT: Adaptive Coordination Diffusion Transformer for Mobile Manipulation",
            "authors": "Sixiang Chen, Jiaming Liu, Siyuan Qian, Han Jiang, Lily Li, Renrui Zhang, Zhuoyang Liu, Chenyang Gu, Chengkai Hou, Pengwei Wang, Zhongyuan Wang, Shanghang Zhang",
            "summary": "Recently, mobile manipulation has attracted increasing attention for enabling\nlanguage-conditioned robotic control in household tasks. However, existing\nmethods still face challenges in coordinating mobile base and manipulator,\nprimarily due to two limitations. On the one hand, they fail to explicitly\nmodel the influence of the mobile base on manipulator control, which easily\nleads to error accumulation under high degrees of freedom. On the other hand,\nthey treat the entire mobile manipulation process with the same visual\nobservation modality (e.g., either all 2D or all 3D), overlooking the distinct\nmultimodal perception requirements at different stages during mobile\nmanipulation. To address this, we propose the Adaptive Coordination Diffusion\nTransformer (AC-DiT), which enhances mobile base and manipulator coordination\nfor end-to-end mobile manipulation. First, since the motion of the mobile base\ndirectly influences the manipulator's actions, we introduce a mobility-to-body\nconditioning mechanism that guides the model to first extract base motion\nrepresentations, which are then used as context prior for predicting whole-body\nactions. This enables whole-body control that accounts for the potential impact\nof the mobile base's motion. Second, to meet the perception requirements at\ndifferent stages of mobile manipulation, we design a perception-aware\nmultimodal conditioning strategy that dynamically adjusts the fusion weights\nbetween various 2D visual images and 3D point clouds, yielding visual features\ntailored to the current perceptual needs. This allows the model to, for\nexample, adaptively rely more on 2D inputs when semantic information is crucial\nfor action prediction, while placing greater emphasis on 3D geometric\ninformation when precise spatial understanding is required. We validate AC-DiT\nthrough extensive experiments on both simulated and real-world mobile\nmanipulation tasks.",
            "pdf_url": "http://arxiv.org/pdf/2507.01961v1",
            "published": "2025-07-02 17:59:54+00:00",
            "updated": "2025-07-02 17:59:54+00:00"
        },
        {
            "title": "Improving Consistency Models with Generator-Augmented Flows",
            "authors": "Thibaut Issenhuth, Sangchul Lee, Ludovic Dos Santos, Jean-Yves Franceschi, Chansoo Kim, Alain Rakotomamonjy",
            "summary": "Consistency models imitate the multi-step sampling of score-based diffusion\nin a single forward pass of a neural network. They can be learned in two ways:\nconsistency distillation and consistency training. The former relies on the\ntrue velocity field of the corresponding differential equation, approximated by\na pre-trained neural network. In contrast, the latter uses a single-sample\nMonte Carlo estimate of this velocity field. The related estimation error\ninduces a discrepancy between consistency distillation and training that, we\nshow, still holds in the continuous-time limit. To alleviate this issue, we\npropose a novel flow that transports noisy data towards their corresponding\noutputs derived from a consistency model. We prove that this flow reduces the\npreviously identified discrepancy and the noise-data transport cost.\nConsequently, our method not only accelerates consistency training convergence\nbut also enhances its overall performance. The code is available at:\nhttps://github.com/thibautissenhuth/consistency_GC.",
            "pdf_url": "http://arxiv.org/pdf/2406.09570v4",
            "published": "2024-06-13 20:22:38+00:00",
            "updated": "2025-07-02 14:42:54+00:00"
        },
        {
            "title": "There and Back Again: On the relation between Noise and Image Inversions in Diffusion Models",
            "authors": "Łukasz Staniszewski, Łukasz Kuciński, Kamil Deja",
            "summary": "Diffusion Models achieve state-of-the-art performance in generating new\nsamples but lack a low-dimensional latent space that encodes the data into\nmeaningful features. Inversion-based methods address this by reversing the\ndenoising trajectory, mapping each image back to its approximated starting\nnoise. In this work, we thoroughly analyze this procedure and focus on the\nrelation between the initial Gaussian noise, the generated samples, and their\ncorresponding latent encodings obtained through the DDIM inversion. First, we\nshow that latents exhibit structural patterns in the form of less diverse noise\npredicted for smooth image regions. As a consequence of this divergence, we\npresent that the space of image inversions is notably less manipulative than\nthe original Gaussian noise. Next, we explain the origin of the phenomenon,\ndemonstrating that, during the first inversion steps, the noise prediction\nerror is much more significant for the plain areas than for the rest of the\nimage. As a surprisingly simple solution, we propose to replace the first DDIM\nInversion steps with a forward diffusion process, which successfully\ndecorrelates latent encodings, leading to higher quality editions and\ninterpolations. The code is available at https://github.com/luk-st/taba.",
            "pdf_url": "http://arxiv.org/pdf/2410.23530v3",
            "published": "2024-10-31 00:30:35+00:00",
            "updated": "2025-07-02 13:27:19+00:00"
        },
        {
            "title": "EP-Diffuser: An Efficient Diffusion Model for Traffic Scene Generation and Prediction via Polynomial Representations",
            "authors": "Yue Yao, Mohamed-Khalil Bouzidi, Daniel Goehring, Joerg Reichardt",
            "summary": "As the prediction horizon increases, predicting the future evolution of\ntraffic scenes becomes increasingly difficult due to the multi-modal nature of\nagent motion. Most state-of-the-art (SotA) prediction models primarily focus on\nforecasting the most likely future. However, for the safe operation of\nautonomous vehicles, it is equally important to cover the distribution for\nplausible motion alternatives. To address this, we introduce EP-Diffuser, a\nnovel parameter-efficient diffusion-based generative model designed to capture\nthe distribution of possible traffic scene evolutions. Conditioned on road\nlayout and agent history, our model acts as a predictor and generates diverse,\nplausible scene continuations. We benchmark EP-Diffuser against two SotA models\nin terms of accuracy and plausibility of predictions on the Argoverse 2\ndataset. Despite its significantly smaller model size, our approach achieves\nboth highly accurate and plausible traffic scene predictions. We further\nevaluate model generalization ability in an out-of-distribution (OoD) test\nsetting using Waymo Open dataset and show superior robustness of our approach.",
            "pdf_url": "http://arxiv.org/pdf/2504.05422v2",
            "published": "2025-04-07 18:45:49+00:00",
            "updated": "2025-07-02 13:21:07+00:00"
        },
        {
            "title": "Loss Functions in Diffusion Models: A Comparative Study",
            "authors": "Dibyanshu Kumar, Philipp Vaeth, Magda Gregorová",
            "summary": "Diffusion models have emerged as powerful generative models, inspiring\nextensive research into their underlying mechanisms. One of the key questions\nin this area is the loss functions these models shall train with. Multiple\nformulations have been introduced in the literature over the past several years\nwith some links and some critical differences stemming from various initial\nconsiderations. In this paper, we explore the different target objectives and\ncorresponding loss functions in detail. We present a systematic overview of\ntheir relationships, unifying them under the framework of the variational lower\nbound objective. We complement this theoretical analysis with an empirical\nstudy providing insights into the conditions under which these objectives\ndiverge in performance and the underlying factors contributing to such\ndeviations. Additionally, we evaluate how the choice of objective impacts the\nmodel ability to achieve specific goals, such as generating high-quality\nsamples or accurately estimating likelihoods. This study offers a unified\nunderstanding of loss functions in diffusion models, contributing to more\nefficient and goal-oriented model designs in future research.",
            "pdf_url": "http://arxiv.org/pdf/2507.01516v1",
            "published": "2025-07-02 09:23:34+00:00",
            "updated": "2025-07-02 09:23:34+00:00"
        }
    ]
}