{
    "Physics": [
        {
            "title": "Mean-field Modelling of Moiré Materials: A User's Guide with Selected Applications to Twisted Bilayer Graphene",
            "authors": "Yves H. Kwan, Ziwei Wang, Glenn Wagner, Nick Bultinck, Steven H. Simon, Siddharth A. Parameswaran",
            "summary": "We review the theoretical modelling of moiré materials, focusing on various aspects of magic-angle twisted bilayer graphene (MA-TBG) viewed through the lens of Hartree-Fock mean-field theory. We first provide an elementary introduction to the continuum modelling of moiré bandstructures, and explain how interactions are incorporated to study correlated states. We then discuss how to implement mean-field simulations of ground state structure and collective excitations in this setting. With this background established, we rationalize the power of mean-field approximations in MA-TBG, by discussing the idealized \"chiral-flat\" strong-coupling limit, in which ground states at electron densities commensurate with the moiré superlattice are exactly captured by mean-field ansätze. We then illustrate the phenomenological shortcomings of this limit, leading us naturally into a discussion of the intermediate-coupling incommensurate Kekulé spiral (IKS) order and its origins in ever-present heterostrain. IKS and its placement within an expanded Hartree-Fock manifold form our first \"case study\". Our second case study involves time-dependence, and focuses on the collective modes of various broken-symmetry insulators in MA-TBG. As a third and final case study, we return to the strong-coupling picture, which can be stabilized by aligning MA-TBG to an hBN substrate. In this limit, we show how mean field theory can be adapted to the translationally non-invariant setting in order to quantitatively study the energetics of domain walls in orbital Chern insulating states. We close with a discussion of extensions and further applications. Used either as a standalone reference or alongside the accompanying open-source code, this review should enable readers with a basic knowledge of band theory and many-body physics to systematically build and analyze detailed models of generic moiré systems.",
            "pdf_url": "https://arxiv.org/pdf/2511.21683v1",
            "published": "2025-11-26 18:57:22+00:00",
            "updated": "2025-11-26 18:57:22+00:00"
        },
        {
            "title": "On Evolution-Based Models for Experimentation Under Interference",
            "authors": "Sadegh Shirani, Mohsen Bayati",
            "summary": "Causal effect estimation in networked systems is central to data-driven decision making. In such settings, interventions on one unit can spill over to others, and in complex physical or social systems, the interaction pathways driving these interference structures remain largely unobserved. We argue that for identifying population-level causal effects, it is not necessary to recover the exact network structure; instead, it suffices to characterize how those interactions contribute to the evolution of outcomes. Building on this principle, we study an evolution-based approach that investigates how outcomes change across observation rounds in response to interventions, hence compensating for missing network information. Using an exposure-mapping perspective, we give an axiomatic characterization of when the empirical distribution of outcomes follows a low-dimensional recursive equation, and identify minimal structural conditions under which such evolution mappings exist. We frame this as a distributional counterpart to difference-in-differences. Rather than assuming parallel paths for individual units, it exploits parallel evolution patterns across treatment scenarios to estimate counterfactual trajectories. A key insight is that treatment randomization plays a role beyond eliminating latent confounding; it induces an implicit sampling from hidden interference channels, enabling consistent learning about heterogeneous spillover effects. We highlight causal message passing as an instantiation of this method in dense networks while extending to more general interference structures, including influencer networks where a small set of units drives most spillovers. Finally, we discuss the limits of this approach, showing that strong temporal trends or endogenous interference can undermine identification.",
            "pdf_url": "https://arxiv.org/pdf/2511.21675v1",
            "published": "2025-11-26 18:53:46+00:00",
            "updated": "2025-11-26 18:53:46+00:00"
        },
        {
            "title": "Worldline Localization",
            "authors": "Changha Choi, Leon A. Takhtajan",
            "summary": "We show that two elementary worldline path integrals-the thermal partition function of the harmonic oscillator and the one-loop effective action of scalar QED in a constant field strength-exhibit a natural form of supersymmetric localization. The mechanism relies on hidden fermionic symmetries of the worldline BRST formulation, rather than on standard BRST structure or physical supersymmetry. These symmetries localize the target-space trajectory. For the harmonic oscillator this yields an alternative localization derivation of the Jacobi-Poisson formula. Moreover, after the trajectory is localized, the remaining proper-time integral exhibits an emergent zero-dimensional supersymmetry generated by modular invariance, allowing the modulus T itself to be localized. For scalar QED the same structure provides a controlled computation of both the real and imaginary parts of the Euler-Heisenberg effective action. In particular, the imaginary part arises from a moduli space of circular worldline instantons, offering a localization perspective on the semiclassical exactness of the Schwinger pair-production result observed by Affleck-Alvarez-Manton.",
            "pdf_url": "https://arxiv.org/pdf/2511.16663v2",
            "published": "2025-11-20 18:59:07+00:00",
            "updated": "2025-11-26 18:38:22+00:00"
        },
        {
            "title": "Gauge theories from scattering amplitudes with minimal assumptions",
            "authors": "Renato M. Fonseca, Clara Hernandez-Garcia, Javier M. Lizana, Manuel Perez-Victoria",
            "summary": "We revisit the emergence of a Yang-Mills symmetry in theories with massless spin 1 particles from fundamental physical properties of scattering amplitudes. In the standard proofs, some symmetry and reality properties of the coupling constants in three-point amplitudes are assumed. These properties cannot be justified using only three-point amplitudes but we show that they arise as consequences of the consistent factorization of four-particle amplitudes, for particular choices of the particle basis. This applies to self-interactions of massless spin 1 particles and also to their interactions with spin 0 and 1/2 particles. CP invariance is a derived property, not an additional assumption. The situation for gravity interactions is analogous and it is dealt with in the same fashion.",
            "pdf_url": "https://arxiv.org/pdf/2511.21664v1",
            "published": "2025-11-26 18:38:16+00:00",
            "updated": "2025-11-26 18:38:16+00:00"
        },
        {
            "title": "Rapid ground state energy estimation with a Sparse Pauli Dynamics-enabled Variational Double Bracket Flow",
            "authors": "Chinmay Shrikhande, Arnab Bachhar, Aaron Rodriguez Jimenez, Nicholas J. Mayhall",
            "summary": "Ground state energy estimation for strongly correlated quantum systems remains a central challenge in computational physics and chemistry. While tensor network methods like DMRG provide efficient solutions for one-dimensional systems, higher-dimensional problems remain difficult. Here we present a variational double bracket flow (vDBF) algorithm that leverages Sparse Pauli Dynamics, a technique originally developed for classical simulation of quantum circuits, to efficiently approximate ground state energies. By combining greedy operator selection with coefficient truncation and energy-variance extrapolation, the method achieves less than 1% error relative to DMRG benchmarks for both Heisenberg and Hubbard models in one and two dimensions. For a 10x10 Heisenberg lattice (100 qubits), vDBF obtains accurate results in approximately 10 minutes on a single CPU thread, compared to over 50 hours on 64 threads for DMRG. For an 8x8 Hubbard model (128 qubits), the speedup is even more pronounced. These results demonstrate that classical simulation techniques developed in the context of quantum advantage benchmarking can provide practical tools for many-body physics.",
            "pdf_url": "https://arxiv.org/pdf/2511.21651v1",
            "published": "2025-11-26 18:22:13+00:00",
            "updated": "2025-11-26 18:22:13+00:00"
        },
        {
            "title": "Updated bounds on the (1,2) neutrino oscillation parameters after first JUNO results",
            "authors": "Francesco Capozzi, Eligio Lisi, Francesco Marcone, Antonio Marrone, Antonio Palazzo",
            "summary": "Within the standard $3ν$ framework, we discuss updated bounds on the leading oscillation parameters related to the $(ν_1,\\,ν_2)$ states, namely, the squared mass difference $δm^2=m^2_2-m^2_1$ and the mixing parameter $\\sin^2θ_{12}$. A previous global analysis of 2024 oscillation data estimated $δm^2$ and $\\sin^2θ_{12}$ with fractional $1σ$ errors of about $2.3\\%$ and $4.5\\%$, respectively. First we update the analysis by applying the latest SNO+ constraints, that slightly shift the $(δm^2,\\,\\sin^2θ_{12})$ best fits. Then we apply the constraints placed by the first JUNO results, that significantly reduce the uncertainties of both parameters. Our updated global bounds (as of 2025) can be summarized as: $δm^2/10^{-5}{\\rm eV}^2 = 7.48\\pm 0.10$ and $\\sin^2θ_{12}=0.3085\\pm0.0073$ (with correlation $ρ=-0.20$), corresponding to $1σ$ uncertainties as small as $1.3\\%$ and $2.4\\%$, respectively. We also comment on minor physical and statistical effects that, in the future, may contribute to lift the current mass-ordering degeneracy of $(δm^2,\\,θ_{12})$ estimates.",
            "pdf_url": "https://arxiv.org/pdf/2511.21650v1",
            "published": "2025-11-26 18:20:07+00:00",
            "updated": "2025-11-26 18:20:07+00:00"
        },
        {
            "title": "Factorisation conditions and causality for local measurements in QFT",
            "authors": "Robin Simmons, Maria Papageorgiou, Marios Christodoulou, Časlav Brukner",
            "summary": "Quantum operations that are perfectly admissible in non-relativistic quantum theory can enable signalling between spacelike separated regions when naively imported into quantum field theory (QFT). Prominent examples of such \"impossible measurements\", in the sense of Sorkin, include certain unitary kicks and projective measurements. It is generally accepted that only those quantum operations whose physical implementation arises from a fully relativistically covariant interaction, between the quantum field and a suitable probe, should be regarded as admissible. While this idea has been realised at the level of abstract algebraic QFT, or via particular measurement models, there is still no general set of operational criteria characterising which measurements are physically implementable. In this work we adopt the local S-matrix formalism, and make use of a hierarchy of factorisation conditions that exclude both superluminal signalling and retrocausality, thereby providing such a criterion. Realising the local S-matrices through explicit interactions between smeared field operators and a pointer degree of freedom, we further derive local causality conditions for the induced Kraus operators, which guarantee the absence of signalling in \"impossible measurement\" scenarios. Finally, we show that the accuracy with which local field observables can be measured is fundamentally limited by the retarded propagator of the field, which also plays an essential role in a factorisation identity we prove for the field Kraus operators.",
            "pdf_url": "https://arxiv.org/pdf/2511.21644v1",
            "published": "2025-11-26 18:15:21+00:00",
            "updated": "2025-11-26 18:15:21+00:00"
        },
        {
            "title": "Dynamics of generalized abcd Boussinesq solitary waves under a slowly variable bottom",
            "authors": "André de Laire, Olivier Goubet, María Eugenia Martínez, Claudio Muñoz, Felipe Poblete",
            "summary": "The Boussinesq $abcd$ system is a 4-parameter set of equations posed in $\\mathbb R_t\\times\\mathbb R_x$, originally derived by Bona, Chen and Saut as first-order 2-wave approximations of the incompressible and irrotational, two-dimensional water wave equations in the shallow water wave regime, in the spirit of the original Boussinesq derivation. Among the various particular regimes, each determined by the values of the parameters $(a, b, c, d)$ appearing in the equations, the \\emph{generic} regime is characterized by the conditions $b, d > 0$ and $a, c < 0$. If additionally $b=d$, the $abcd$ system is Hamiltonian.\n  In this paper, we investigate the existence of generalized solitary waves and the corresponding collision problem in the physically relevant \\emph{variable bottom regime}, introduced by M.\\ Chen. More precisely, the bottom is represented by a smooth space-time dependent function $h=\\varepsilon h_0(\\varepsilon t,\\varepsilon x)$, where $\\varepsilon$ is a small parameter and $h_0$ is a fixed smooth profile. This formulation allows for a detailed description of weak long-range interactions and the evolution of the solitary wave without its destruction. We establish this result by constructing a new approximate solution that captures the interaction between the solitary wave and the slowly varying bottom.",
            "pdf_url": "https://arxiv.org/pdf/2511.21632v1",
            "published": "2025-11-26 18:00:12+00:00",
            "updated": "2025-11-26 18:00:12+00:00"
        },
        {
            "title": "The derivation of the Liouville equation from the Schrodinger equation and its implications",
            "authors": "A. P. Meilakhs",
            "summary": "We present a new way of deriving classical mechanics from quantum mechanics. A key feature of the method is its compatibility with the standard approach used to derive transition rates between quantum states due to interactions. We apply the developed method to derive the main formulas of physical kinetics. We observe that, through the Liouville equation, we can deduce the non-collision part of the Boltzmann equation, and that, through the matrix of transition rates, we can deduce the collision integral. As a final result of the manuscript, we derive the Boltzmann equation from the Schrödinger equation as a single piece of formal mathematical manipulation, without any non-rigorous plausible reasoning used to glue together its different parts.",
            "pdf_url": "https://arxiv.org/pdf/2511.21601v1",
            "published": "2025-11-26 17:16:53+00:00",
            "updated": "2025-11-26 17:16:53+00:00"
        },
        {
            "title": "Dichroism from Thermoelectric Chiral Drives: Generalized Sum Rules for Orbital and Heat Magnetizations",
            "authors": "Baptiste Bermond, Lucila Peralta Gavensky, Anaïs Defossez, Nathan Goldman",
            "summary": "We introduce a unified framework that relates orbital and heat magnetizations to experimentally accessible excitation spectra, through thermoelectric probes and generalized sum rules. By analyzing zero-temperature transport coefficients and applying Kramers-Kronig relations, we derive spectral representations of magnetization densities from thermoelectric correlation functions. Excitation rates under thermoelectric chiral drives then naturally emerge as direct probes of these Kubo-type correlators, placing orbital and heat magnetizations on equal footing with the topological Chern number. As a direct consequence of our formalism, we introduce a hierarchical construction that organizes orbital and heat magnetizations into distinct physical contributions accessible through sum rules, and also derive real-space markers of these magnetizations. From an experimental standpoint, we propose concrete implementations of thermoelectric dichroic measurements in quantum-engineered platforms based on modulated strain fields. These results establish thermoelectric dichroic measurements as a versatile route to access and disentangle fundamental ground-state properties.",
            "pdf_url": "https://arxiv.org/pdf/2511.21599v1",
            "published": "2025-11-26 17:14:50+00:00",
            "updated": "2025-11-26 17:14:50+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Mechanisms of Non-Monotonic Scaling in Vision Transformers",
            "authors": "Anantha Padmanaban Krishna Kumar",
            "summary": "Deeper Vision Transformers often perform worse than shallower ones, which challenges common scaling assumptions. Through a systematic empirical analysis of ViT-S, ViT-B, and ViT-L on ImageNet, we identify a consistent three-phase Cliff-Plateau-Climb pattern that governs how representations evolve with depth. We observe that better performance is associated with progressive marginalization of the [CLS] token, originally designed as a global aggregation hub, in favor of distributed consensus among patch tokens. We quantify patterns of information mixing with an Information Scrambling Index, and show that in ViT-L the information-task tradeoff emerges roughly 10 layers later than in ViT-B, and that these additional layers correlate with increased information diffusion rather than improved task performance. Taken together, these results suggest that transformer architectures in this regime may benefit more from carefully calibrated depth that executes clean phase transitions than from simply increasing parameter count. The Information Scrambling Index provides a useful diagnostic for existing models and suggests a potential design target for future architectures. All code is available at: https://github.com/AnanthaPadmanaban-KrishnaKumar/Cliff-Plateau-Climb.",
            "pdf_url": "https://arxiv.org/pdf/2511.21635v1",
            "published": "2025-11-26 18:07:14+00:00",
            "updated": "2025-11-26 18:07:14+00:00"
        },
        {
            "title": "Diffusion Models at the Drug Discovery Frontier: A Review on Generating Small Molecules versus Therapeutic Peptides",
            "authors": "Yiquan Wang, Yahui Ma, Yuhan Chang, Jiayao Yan, Jialin Zhang, Minnuo Cai, Kai Wei",
            "summary": "Diffusion models have emerged as a leading framework in generative modeling, poised to transform the traditionally slow and costly process of drug discovery. This review provides a systematic comparison of their application in designing two principal therapeutic modalities: small molecules and therapeutic peptides. We dissect how the unified framework of iterative denoising is adapted to the distinct molecular representations, chemical spaces, and design objectives of each modality. For small molecules, these models excel at structure-based design, generating novel, pocket-fitting ligands with desired physicochemical properties, yet face the critical hurdle of ensuring chemical synthesizability. Conversely, for therapeutic peptides, the focus shifts to generating functional sequences and designing de novo structures, where the primary challenges are achieving biological stability against proteolysis, ensuring proper folding, and minimizing immunogenicity. Despite these distinct challenges, both domains face shared hurdles: the scarcity of high-quality experimental data, the reliance on inaccurate scoring functions for validation, and the crucial need for experimental validation. We conclude that the full potential of diffusion models will be unlocked by bridging these modality-specific gaps and integrating them into automated, closed-loop Design-Build-Test-Learn (DBTL) platforms, thereby shifting the paradigm from mere chemical exploration to the on-demand engineering of novel~therapeutics.",
            "pdf_url": "https://arxiv.org/pdf/2511.00209v2",
            "published": "2025-10-31 19:11:41+00:00",
            "updated": "2025-11-26 17:21:10+00:00"
        },
        {
            "title": "TAB-DRW: A DFT-based Robust Watermark for Generative Tabular Data",
            "authors": "Yizhou Zhao, Xiang Li, Peter Song, Qi Long, Weijie Su",
            "summary": "The rise of generative AI has enabled the production of high-fidelity synthetic tabular data across fields such as healthcare, finance, and public policy, raising growing concerns about data provenance and misuse. Watermarking offers a promising solution to address these concerns by ensuring the traceability of synthetic data, but existing methods face many limitations: they are computationally expensive due to reliance on large diffusion models, struggle with mixed discrete-continuous data, or lack robustness to post-modifications. To address them, we propose TAB-DRW, an efficient and robust post-editing watermarking scheme for generative tabular data. TAB-DRW embeds watermark signals in the frequency domain: it normalizes heterogeneous features via the Yeo-Johnson transformation and standardization, applies the discrete Fourier transform (DFT), and adjusts the imaginary parts of adaptively selected entries according to precomputed pseudorandom bits. To further enhance robustness and efficiency, we introduce a novel rank-based pseudorandom bit generation method that enables row-wise retrieval without incurring storage overhead. Experiments on five benchmark tabular datasets show that TAB-DRW achieves strong detectability and robustness against common post-processing attacks, while preserving high data fidelity and fully supporting mixed-type features.",
            "pdf_url": "https://arxiv.org/pdf/2511.21600v1",
            "published": "2025-11-26 17:16:14+00:00",
            "updated": "2025-11-26 17:16:14+00:00"
        },
        {
            "title": "Model-Based Policy Adaptation for Closed-Loop End-to-End Autonomous Driving",
            "authors": "Haohong Lin, Yunzhi Zhang, Wenhao Ding, Jiajun Wu, Ding Zhao",
            "summary": "End-to-end (E2E) autonomous driving models have demonstrated strong performance in open-loop evaluations but often suffer from cascading errors and poor generalization in closed-loop settings. To address this gap, we propose Model-based Policy Adaptation (MPA), a general framework that enhances the robustness and safety of pretrained E2E driving agents during deployment. MPA first generates diverse counterfactual trajectories using a geometry-consistent simulation engine, exposing the agent to scenarios beyond the original dataset. Based on this generated data, MPA trains a diffusion-based policy adapter to refine the base policy's predictions and a multi-step Q value model to evaluate long-term outcomes. At inference time, the adapter proposes multiple trajectory candidates, and the Q value model selects the one with the highest expected utility. Experiments on the nuScenes benchmark using a photorealistic closed-loop simulator demonstrate that MPA significantly improves performance across in-domain, out-of-domain, and safety-critical scenarios. We further investigate how the scale of counterfactual data and inference-time guidance strategies affect overall effectiveness.",
            "pdf_url": "https://arxiv.org/pdf/2511.21584v1",
            "published": "2025-11-26 17:01:41+00:00",
            "updated": "2025-11-26 17:01:41+00:00"
        },
        {
            "title": "Flow Matching Meets PDEs: A Unified Framework for Physics-Constrained Generation",
            "authors": "Giacomo Baldan, Qiang Liu, Alberto Guardone, Nils Thuerey",
            "summary": "Generative machine learning methods, such as diffusion models and flow matching, have shown great potential in modeling complex system behaviors and building efficient surrogate models. However, these methods typically learn the underlying physics implicitly from data. We propose Physics-Based Flow Matching (PBFM), a novel generative framework that explicitly embeds physical constraints, both PDE residuals and algebraic relations, into the flow matching objective. We also introduce temporal unrolling at training time that improves the accuracy of the final, noise-free sample prediction. Our method jointly minimizes the flow matching loss and the physics-based residual loss without requiring hyperparameter tuning of their relative weights. Additionally, we analyze the role of the minimum noise level, $σ_{\\min}$, in the context of physical constraints and evaluate a stochastic sampling strategy that helps to reduce physical residuals. Through extensive benchmarks on three representative PDE problems, we show that our approach yields up to an $8\\times$ more accurate physical residuals compared to FM, while clearly outperforming existing algorithms in terms of distributional accuracy. PBFM thus provides a principled and efficient framework for surrogate modeling, uncertainty quantification, and accelerated simulation in physics and engineering applications.",
            "pdf_url": "https://arxiv.org/pdf/2506.08604v2",
            "published": "2025-06-10 09:13:37+00:00",
            "updated": "2025-11-26 15:56:35+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Constrained deep learning for pricing and hedging european options in incomplete markets",
            "authors": "Nicolas Baradel",
            "summary": "In incomplete financial markets, pricing and hedging European options lack a unique no-arbitrage solution due to unhedgeable risks. This paper introduces a constrained deep learning approach to determine option prices and hedging strategies that minimize the Profit and Loss (P&L) distribution around zero. We employ a single neural network to represent the option price function, with its gradient serving as the hedging strategy, optimized via a loss function enforcing the self-financing portfolio condition. A key challenge arises from the non-smooth nature of option payoffs (e.g., vanilla calls are non-differentiable at-the-money, while digital options are discontinuous), which conflicts with the inherent smoothness of standard neural networks. To address this, we compare unconstrained networks against constrained architectures that explicitly embed the terminal payoff condition, drawing inspiration from PDE-solving techniques. Our framework assumes two tradable assets: the underlying and a liquid call option capturing volatility dynamics. Numerical experiments evaluate the method on simple options with varying non-smoothness, the exotic Equinox option, and scenarios with market jumps for robustness. Results demonstrate superior P&L distributions, highlighting the efficacy of constrained networks in handling realistic payoffs. This work advances machine learning applications in quantitative finance by integrating boundary constraints, offering a practical tool for pricing and hedging in incomplete markets.",
            "pdf_url": "https://arxiv.org/pdf/2511.20837v1",
            "published": "2025-11-25 20:40:01+00:00",
            "updated": "2025-11-25 20:40:01+00:00"
        }
    ]
}