{
    "Physics": [
        {
            "title": "Whole-Body Conditioned Egocentric Video Prediction",
            "authors": "Yutong Bai, Danny Tran, Amir Bar, Yann LeCun, Trevor Darrell, Jitendra Malik",
            "summary": "We train models to Predict Ego-centric Video from human Actions (PEVA), given\nthe past video and an action represented by the relative 3D body pose. By\nconditioning on kinematic pose trajectories, structured by the joint hierarchy\nof the body, our model learns to simulate how physical human actions shape the\nenvironment from a first-person point of view. We train an auto-regressive\nconditional diffusion transformer on Nymeria, a large-scale dataset of\nreal-world egocentric video and body pose capture. We further design a\nhierarchical evaluation protocol with increasingly challenging tasks, enabling\na comprehensive analysis of the model's embodied prediction and control\nabilities. Our work represents an initial attempt to tackle the challenges of\nmodeling complex real-world environments and embodied agent behaviors with\nvideo prediction from the perspective of a human.",
            "pdf_url": "http://arxiv.org/pdf/2506.21552v1",
            "published": "2025-06-26 17:59:59+00:00",
            "updated": "2025-06-26 17:59:59+00:00"
        },
        {
            "title": "Quintessence and phantoms in light of DESI 2025",
            "authors": "Ioannis D. Gialamas, Gert Hütsi, Martti Raidal, Juan Urrutia, Martin Vasar, Hardi Veermäe",
            "summary": "We analyse DESI BAO, CMB, and supernova data to explore the physical origin\nof the DESI indication for dynamical dark energy. Beyond the standard CPL\nparametrization, we explore truncated alternatives and quintessence models. We\nconclude that there is compelling evidence for dark energy to be decaying in\nthe late universe, but the evidence for a phantom behaviour is less\nsignificant. Models without phantom behaviour are compatible with the data at\nthe $2\\sigma$ CL. Furthermore, we examine a concrete quintessence scenario with\na Higgs-like potential, allowing for a direct comparison with parametrized\napproaches and testing its consistency with current observations. This\nframework enables a broader investigation of late-time cosmic evolution and\nreveals a $93.8\\%$ preference for a future transition into an anti-de Sitter\nspace, which may ultimately lead to a cosmological collapse of our Universe.",
            "pdf_url": "http://arxiv.org/pdf/2506.21542v1",
            "published": "2025-06-26 17:58:18+00:00",
            "updated": "2025-06-26 17:58:18+00:00"
        },
        {
            "title": "WorldVLA: Towards Autoregressive Action World Model",
            "authors": "Jun Cen, Chaohui Yu, Hangjie Yuan, Yuming Jiang, Siteng Huang, Jiayan Guo, Xin Li, Yibing Song, Hao Luo, Fan Wang, Deli Zhao, Hao Chen",
            "summary": "We present WorldVLA, an autoregressive action world model that unifies action\nand image understanding and generation. Our WorldVLA intergrates\nVision-Language-Action (VLA) model and world model in one single framework. The\nworld model predicts future images by leveraging both action and image\nunderstanding, with the purpose of learning the underlying physics of the\nenvironment to improve action generation. Meanwhile, the action model generates\nthe subsequent actions based on image observations, aiding in visual\nunderstanding and in turn helps visual generation of the world model. We\ndemonstrate that WorldVLA outperforms standalone action and world models,\nhighlighting the mutual enhancement between the world model and the action\nmodel. In addition, we find that the performance of the action model\ndeteriorates when generating sequences of actions in an autoregressive manner.\nThis phenomenon can be attributed to the model's limited generalization\ncapability for action prediction, leading to the propagation of errors from\nearlier actions to subsequent ones. To address this issue, we propose an\nattention mask strategy that selectively masks prior actions during the\ngeneration of the current action, which shows significant performance\nimprovement in the action chunk generation task.",
            "pdf_url": "http://arxiv.org/pdf/2506.21539v1",
            "published": "2025-06-26 17:55:40+00:00",
            "updated": "2025-06-26 17:55:40+00:00"
        },
        {
            "title": "Rashba spin-orbit coupling and artificially engineered topological superconductors",
            "authors": "Sankar Das Sarma, Katharina Laubscher, Haining Pan, Jay D. Sau, Tudor D. Stanescu",
            "summary": "One of the most important physical effects in condensed matter physics is the\nRashba spin-orbit coupling (RSOC), introduced in seminal works by Emmanuel\nRashba. In this article, we discuss, describe, and review (providing critical\nperspectives on) the crucial role of RSOC in the currently active research area\nof topological quantum computation. Most, if not all, of the current\nexperimental topological quantum computing platforms use the idea of Majorana\nzero modes as the qubit ingredient because of their non-Abelian anyonic\nproperty of having an intrinsic quantum degeneracy, which enables nonlocal\nencoding protected by a topological energy gap. It turns out that RSOC is a\ncrucial ingredient in producing a low-dimensional topological superconductor in\nthe laboratory, and such topological superconductors naturally have isolated\nlocalized midgap Majorana zero modes. In addition, increasing the RSOC strength\nenhances the topological gap, thus enhancing the topological immunity of the\nqubits to decoherence. Thus, Rashba's classic work on SOC may lead not only to\nthe realization of localized non-Abelian anyons, but also fault tolerant\nquantum computation.",
            "pdf_url": "http://arxiv.org/pdf/2506.21534v1",
            "published": "2025-06-26 17:53:14+00:00",
            "updated": "2025-06-26 17:53:14+00:00"
        },
        {
            "title": "Process mining-driven modeling and simulation to enhance fault diagnosis in cyber-physical systems",
            "authors": "Francesco Vitale, Nicola Dall'Ora, Sebastiano Gaiardelli, Enrico Fraccaroli, Nicola Mazzocca, Franco Fummi",
            "summary": "Fault diagnosis in Cyber-Physical Systems (CPSs) is essential for ensuring\nsystem dependability and operational efficiency by accurately detecting\nanomalies and identifying their root causes. However, the manual modeling of\nfaulty behaviors often demands extensive domain expertise and produces models\nthat are complex, error-prone, and difficult to interpret. To address this\nchallenge, we present a novel unsupervised fault diagnosis methodology that\nintegrates collective anomaly detection in multivariate time series, process\nmining, and stochastic simulation. Initially, collective anomalies are detected\nfrom low-level sensor data using multivariate time-series analysis. These\nanomalies are then transformed into structured event logs, enabling the\ndiscovery of interpretable process models through process mining. By\nincorporating timing distributions into the extracted Petri nets, the approach\nsupports stochastic simulation of faulty behaviors, thereby enhancing root\ncause analysis and behavioral understanding. The methodology is validated using\nthe Robotic Arm Dataset (RoAD), a widely recognized benchmark in smart\nmanufacturing. Experimental results demonstrate its effectiveness in modeling,\nsimulating, and classifying faulty behaviors in CPSs. This enables the creation\nof comprehensive fault dictionaries that support predictive maintenance and the\ndevelopment of digital twins for industrial environments.",
            "pdf_url": "http://arxiv.org/pdf/2506.21502v1",
            "published": "2025-06-26 17:29:37+00:00",
            "updated": "2025-06-26 17:29:37+00:00"
        },
        {
            "title": "Scaling solutions for current-carrying cosmic string networks. II. Biased solutions",
            "authors": "F. C. N. Q. Pimenta, C. J. A. P. Martins",
            "summary": "The charge-velocity-dependent one-scale model is an extension of the\ncanonical velocity-dependent one-scale model which explicitly incorporates\nadditional degrees of freedom on the string worldsheet, such as arbitrary\ncurrents and charges, expected in physically realistic models. A previous paper\n[Pimenta and Martins, Phys. Rev. D 110, 023540 (2024)] started an in-depth\nclassification of its possible asymptotic scaling solutions, with the goal of\nidentifying distinguishing features which may be tested against numerical\nsimulations or future observations. This earlier analysis restricted itself to\nunbiased solutions; in the present one we relax this assumption, allowing for\nthe possibility of energy loss biases between the bare string and the\ncharge/current, or between the charge and the current themselves. We find\nadditional scaling solutions, some of which are parametric extensions of the\nunbiased ones while others are new scaling branches which do not exist in the\nunbiased case. Overall it remains the case that there are three broad classes\nof solutions, mainly depending on the balance between the expansion rate and\nthe available energy loss mechanisms. Our results enable a quantitative\ncalibration of the model, using forthcoming high-resolution numerical\nsimulations.",
            "pdf_url": "http://arxiv.org/pdf/2506.21494v1",
            "published": "2025-06-26 17:22:47+00:00",
            "updated": "2025-06-26 17:22:47+00:00"
        },
        {
            "title": "Observers and Timekeepers: From the Page-Wootters Mechanism to the Gravitational Path Integral",
            "authors": "Zixia Wei",
            "summary": "Quantum gravity in a closed universe faces two a priori distinct yet\nseemingly related issues: the problem of time and the fact that its Hilbert\nspace dimension is one. Both have been argued to be resolvable by formulating\nphysics relative to an observer. Using a simple gravitational path integral\nmodel, we explain that the two issues arise from two distinct non-perturbative\neffects: the former from summing over metrics and the latter from summing over\ntopologies. We then revisit the Page-Wootters mechanism, one of the earliest\nframeworks for formulating quantum mechanics relative to an observer, see how\nit applies to both issues, and introduce some new ingredients. In particular,\nwe emphasize a hierarchy between an observer and a timekeeper. An observer is a\nsubsystem of the universe whose specification results in a nontrivial Hilbert\nspace, while a timekeeper is an observer with a specified history that can be\nused as a reference for the time of the environment and experiences a\nnontrivial time evolution. Finally, we propose a method for incorporating\nobservers and timekeepers into the gravitational path integral and show that\nimplementing a timekeeper in this way furnishes an observer-dependent\ngeneralization of holography.",
            "pdf_url": "http://arxiv.org/pdf/2506.21489v1",
            "published": "2025-06-26 17:18:50+00:00",
            "updated": "2025-06-26 17:18:50+00:00"
        },
        {
            "title": "Elastic Planetoids",
            "authors": "Bartosz Żbik, Andrzej Odrzywołek",
            "summary": "Modeling the internal structure of self-gravitating solid and liquid bodies\npresents a challenge, as existing approaches are often limited to either overly\nsimplistic constant-density approximations or more complex numerical equations\nof state. We present a detailed analysis of a tractable and physically\nmotivated model for perfectly elastic, spherically symmetric self-gravitating\nbodies in hydrostatic equilibrium. The model employs a logarithmic equation of\nstate (logotropic EOS) with a non-zero initial density and constant bulk\nmodulus. Importantly, scaling properties of the model allow all solutions to be\nderived from a single, universal solution of an ordinary differential equation,\nresembling the Lane-Emden and Chandrasekhar models. The model provides new\ninsights into stability issues and reveals oscillatory asymptotic behavior in\nthe mass-radius relation, including the existence of both a maximum mass and a\nmaximum radius. We derive useful, simple analytical approximations for key\nproperties, such as central overdensity, moment of inertia, binding energy, and\ngravitational potential, applicable to small, metallic bodies like asteroids\nand moons. These new approximations could aid future research, including space\nmining and the scientific characterization of small Solar System bodies.",
            "pdf_url": "http://arxiv.org/pdf/2504.10279v2",
            "published": "2025-04-14 14:45:38+00:00",
            "updated": "2025-06-26 17:10:22+00:00"
        },
        {
            "title": "Possible consequences for physics of the negative resolution of Tsirelson's problem",
            "authors": "Adán Cabello, Marco Túlio Quintino, Matthias Kleinmann",
            "summary": "In 2020, Ji et al. [arXiv:2001.04383 and Comm.~ACM 64}, 131 (2021)] provided\na proof that the complexity classes $\\text{MIP}^\\ast$ and $\\text{RE}$ are\nequivalent. This result implies a negative resolution of Tsirelson's problem,\nthat is, $C_{qa}$ (the closure of the set of tensor product correlations) and\n$C_{qc}$ (the set of commuting correlations) can be separated by a hyperplane\n(that is, a Bell-like inequality). In particular, there are correlations\nproduced by commuting measurements (a finite number of them and with a finite\nnumber of outcomes) on an infinite-dimensional quantum system which cannot be\napproximated by sequences of finite-dimensional tensor product correlations.\nHere, we point out that there are four logical possibilities of this result.\nEach possibility is interesting because it fundamentally challenges the nature\nof spacially separated systems in different ways. We list open problems for\nmaking progress for deciding which of the possibilities is correct.",
            "pdf_url": "http://arxiv.org/pdf/2307.02920v2",
            "published": "2023-07-06 11:17:46+00:00",
            "updated": "2025-06-26 17:04:03+00:00"
        },
        {
            "title": "NLO QCD effects on angular observables in $e^-p \\to e^-(ν_e)Hj$ in presence of non-standard $HVV$ couplings",
            "authors": "Biswajit Das, Pramod Sharma, Ambresh Shivaji",
            "summary": "The single Higgs production in neutral-current (NC) and charged-current (CC)\nprocesses at an electron-proton ($ep$) collider is a useful channel to probe\nnew physics effects in the Higgs coupling to vector boson ($HVV$). In this\ncontext, observables sensitive to non-standard couplings previously studied at\nleading order require improved theoretical precision through the inclusion of\nradiative corrections. In this work, we present a fully differential Higgs plus\none jet production at next-to-leading-order (NLO) accuracy in QCD for both the\nNC and CC processes. For the proposed Large Hadron electron Collider (LHeC)\nconfiguration, with a 60~GeV electron beam and a 7~TeV proton beam, the total\ncross sections receive modest corrections with significantly reduced scale\nuncertainties. We find that in several kinematic distributions which are\nrelevant to the analysis of $HVV$ couplings, the NLO K-factors are not flat.\nWithin the Standard Model, the polar angle of the electron (for NC) and the\nazimuthal angular correlation (for both NC and CC processes) receive maximum\ncorrections in the range of 3-4\\% in certain bins. We also compute NLO QCD\ncorrections in the presence of non-standard $HVV$ interactions. The corrections\nin the azimuthal angular correlations are similar to the standard model\npredictions. For the polar angle of the electron, the corrections are sensitive\nto the nature of the $HVV$ coupling.",
            "pdf_url": "http://arxiv.org/pdf/2506.21472v1",
            "published": "2025-06-26 17:00:33+00:00",
            "updated": "2025-06-26 17:00:33+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "SmoothSinger: A Conditional Diffusion Model for Singing Voice Synthesis with Multi-Resolution Architecture",
            "authors": "Kehan Sui, Jinxu Xiang, Fang Jin",
            "summary": "Singing voice synthesis (SVS) aims to generate expressive and high-quality\nvocals from musical scores, requiring precise modeling of pitch, duration, and\narticulation. While diffusion-based models have achieved remarkable success in\nimage and video generation, their application to SVS remains challenging due to\nthe complex acoustic and musical characteristics of singing, often resulting in\nartifacts that degrade naturalness. In this work, we propose SmoothSinger, a\nconditional diffusion model designed to synthesize high quality and natural\nsinging voices. Unlike prior methods that depend on vocoders as a final stage\nand often introduce distortion, SmoothSinger refines low-quality synthesized\naudio directly in a unified framework, mitigating the degradation associated\nwith two-stage pipelines. The model adopts a reference-guided dual-branch\narchitecture, using low-quality audio from any baseline system as a reference\nto guide the denoising process, enabling more expressive and context-aware\nsynthesis. Furthermore, it enhances the conventional U-Net with a parallel\nlow-frequency upsampling path, allowing the model to better capture pitch\ncontours and long term spectral dependencies. To improve alignment during\ntraining, we replace reference audio with degraded ground truth audio,\naddressing temporal mismatch between reference and target signals. Experiments\non the Opencpop dataset, a large-scale Chinese singing corpus, demonstrate that\nSmoothSinger achieves state-of-the-art results in both objective and subjective\nevaluations. Extensive ablation studies confirm its effectiveness in reducing\nartifacts and improving the naturalness of synthesized voices.",
            "pdf_url": "http://arxiv.org/pdf/2506.21478v1",
            "published": "2025-06-26 17:07:45+00:00",
            "updated": "2025-06-26 17:07:45+00:00"
        },
        {
            "title": "Flow-Based Single-Step Completion for Efficient and Expressive Policy Learning",
            "authors": "Prajwal Koirala, Cody Fleming",
            "summary": "Generative models such as diffusion and flow-matching offer expressive\npolicies for offline reinforcement learning (RL) by capturing rich, multimodal\naction distributions, but their iterative sampling introduces high inference\ncosts and training instability due to gradient propagation across sampling\nsteps. We propose the \\textit{Single-Step Completion Policy} (SSCP), a\ngenerative policy trained with an augmented flow-matching objective to predict\ndirect completion vectors from intermediate flow samples, enabling accurate,\none-shot action generation. In an off-policy actor-critic framework, SSCP\ncombines the expressiveness of generative models with the training and\ninference efficiency of unimodal policies, without requiring long\nbackpropagation chains. Our method scales effectively to offline,\noffline-to-online, and online RL settings, offering substantial gains in speed\nand adaptability over diffusion-based baselines. We further extend SSCP to\ngoal-conditioned RL, enabling flat policies to exploit subgoal structures\nwithout explicit hierarchical inference. SSCP achieves strong results across\nstandard offline RL and behavior cloning benchmarks, positioning it as a\nversatile, expressive, and efficient framework for deep RL and sequential\ndecision-making.",
            "pdf_url": "http://arxiv.org/pdf/2506.21427v1",
            "published": "2025-06-26 16:09:53+00:00",
            "updated": "2025-06-26 16:09:53+00:00"
        },
        {
            "title": "Latent Diffusion Model Based Denoising Receiver for 6G Semantic Communication: From Stochastic Differential Theory to Application",
            "authors": "Xiucheng Wang, Honggang Jia, Nan Cheng, Dusit Niyato",
            "summary": "In this paper, a novel semantic communication framework empowered by\ngenerative artificial intelligence (GAI) is proposed, to enhance the robustness\nagainst both channel noise and transmission data distribution shifts. A\ntheoretical foundation is established using stochastic differential equations\n(SDEs), from which a closed-form mapping between any signal-to-noise ratio\n(SNR) and the optimal denoising timestep is derived. Moreover, to address\ndistribution mismatch, a mathematical scaling method is introduced to align\nreceived semantic features with the training distribution of the GAI. Built on\nthis theoretical foundation, a latent diffusion model (LDM)-based semantic\ncommunication framework is proposed that combines a variational autoencoder for\nsemantic features extraction, where a pretrained diffusion model is used for\ndenoising. The proposed system is a training-free framework that supports\nzero-shot generalization, and achieves superior performance under low-SNR and\nout-of-distribution conditions, offering a scalable and robust solution for\nfuture 6G semantic communication systems. Experimental results demonstrate that\nthe proposed semantic communication framework achieves state-of-the-art\nperformance in both pixel-level accuracy and semantic perceptual quality,\nconsistently outperforming baselines across a wide range of SNRs and data\ndistributions without any fine-tuning or post-training.",
            "pdf_url": "http://arxiv.org/pdf/2506.05710v2",
            "published": "2025-06-06 03:20:32+00:00",
            "updated": "2025-06-26 15:21:59+00:00"
        },
        {
            "title": "Exploring Adapter Design Tradeoffs for Low Resource Music Generation",
            "authors": "Atharva Mehta, Shivam Chauhan, Monojit Choudhury",
            "summary": "Fine-tuning large-scale music generation models, such as MusicGen and\nMustango, is a computationally expensive process, often requiring updates to\nbillions of parameters and, therefore, significant hardware resources.\nParameter-Efficient Fine-Tuning (PEFT) techniques, particularly adapter-based\nmethods, have emerged as a promising alternative, enabling adaptation with\nminimal trainable parameters while preserving model performance. However, the\ndesign choices for adapters, including their architecture, placement, and size,\nare numerous, and it is unclear which of these combinations would produce\noptimal adapters and why, for a given case of low-resource music genre. In this\npaper, we attempt to answer this question by studying various adapter\nconfigurations for two AI music models, MusicGen and Mustango, on two genres:\nHindustani Classical and Turkish Makam music.\n  Our findings reveal distinct trade-offs: convolution-based adapters excel in\ncapturing fine-grained local musical details such as ornamentations and short\nmelodic phrases, while transformer-based adapters better preserve long-range\ndependencies crucial for structured improvisation. Additionally, we analyze\ncomputational resource requirements across different adapter scales,\ndemonstrating how mid-sized adapters (40M parameters) achieve an optimal\nbalance between expressivity and quality. Furthermore, we find that Mustango, a\ndiffusion-based model, generates more diverse outputs with better adherence to\nthe description in the input prompt while lacking in providing stability in\nnotes, rhythm alignment, and aesthetics. Also, it is computationally intensive\nand requires significantly more time to train. In contrast, autoregressive\nmodels like MusicGen offer faster training and are more efficient, and can\nproduce better quality output in comparison, but have slightly higher\nredundancy in their generations.",
            "pdf_url": "http://arxiv.org/pdf/2506.21298v1",
            "published": "2025-06-26 14:18:39+00:00",
            "updated": "2025-06-26 14:18:39+00:00"
        }
    ]
}