{
    "Physics": [
        {
            "title": "Simulating high-temperature superconductivity in moiré WSe2",
            "authors": "Yiyu Xia, Zhongdong Han, Jiacheng Zhu, Yichi Zhang, Patrick Knüppel, Kenji Watanabe, Takashi Taniguchi, Kin Fai Mak, Jie Shan",
            "summary": "The emergence of high transition temperature (Tc) superconductivity in\nstrongly correlated materials remains a major unsolved problem in physics.\nHigh-Tc materials, such as cuprates, are generally complex and not easily\ntunable, making theoretical modelling difficult. Although the Hubbard model--a\nsimple theoretical model of interacting electrons on a lattice--is believed to\ncapture the essential physics of high-Tc materials, obtaining accurate\nsolutions of the model, especially in the relevant regime of moderate\ncorrelation, is challenging. The recent demonstration of robust\nsuperconductivity in moir\\'e WSe2, whose low-energy electronic bands can be\ndescribed by the Hubbard model and are highly tunable, presents a new platform\nfor tackling the high-Tc problem. Here, we tune moir\\'e WSe2 bilayers to the\nmoderate correlation regime through the twist angle and map the phase diagram\naround one hole per moir\\'e unit cell (v = 1) by electrostatic gating and\nelectrical transport and magneto-optical measurements. We observe a range of\nhigh-Tc phenomenology, including an antiferromagnetic insulator at v = 1,\nsuperconducting domes upon electron and hole doping, and unusual metallic\nstates at elevated temperatures including strange metallicity. The highest Tc\noccurs adjacent to the Mott transition, reaching about 6% of the effective\nFermi temperature. Our results establish a new material system based on\ntransition metal dichalcogenide (TMD) moir\\'e superlattices that can be used to\nstudy high-Tc superconductivity in a highly controllable manner and beyond.",
            "pdf_url": "http://arxiv.org/pdf/2508.02662v1",
            "published": "2025-08-04 17:51:34+00:00",
            "updated": "2025-08-04 17:51:34+00:00"
        },
        {
            "title": "Classification of Average Crystalline Topological Superconductors through a Generalized Real-Space Construction",
            "authors": "Sarvesh Srinivasan, Jian-Hao Zhang, Yang Qi, Zhen Bi",
            "summary": "We investigate a novel class of topological superconducting phases protected\nby exact fermion-parity symmetry and average crystalline symmetries. These\nphases belong to the broader class of average crystalline symmetry-protected\ntopological (ACSPT) states and include numerous examples of intrinsic ACSPTs --\ntopological phases that arise only in the presence of disorder or decoherence.\nUnlike conventional symmetry-protected topological (SPT) phases, which require\nexact symmetry protection, average SPT (ASPT) phases remain robust as long as\nthe symmetry is restored on average across disorder realizations or mixed-state\nensembles. To classify these phases, we extend the real-space block state\nconstruction framework to account for average crystalline symmetries. In this\ngeneralized setting, lower-dimensional cells are decorated with ASPT phases,\nand the obstruction-free conditions are reformulated to incorporate the\nconstraints imposed by average symmetry at block intersections. This provides a\nphysically transparent and systematic method for classifying ASPTs with spatial\nsymmetries that are only preserved statistically. We further validate our\nclassification using a generalized spectral sequence analysis, which serves as\nan independent consistency check. Our results demonstrate that many crystalline\ntopological superconductors remain well defined under realistic imperfections,\nand they uncover a rich landscape of intrinsically average-symmetry-protected\nphases that have no analog in clean systems.",
            "pdf_url": "http://arxiv.org/pdf/2508.02661v1",
            "published": "2025-08-04 17:51:02+00:00",
            "updated": "2025-08-04 17:51:02+00:00"
        },
        {
            "title": "PSR J0614-3329: A NICER case for Strange Quark Stars",
            "authors": "Swarnim Shirke, Rajesh Maiti, Debarati Chatterjee",
            "summary": "Precise measurements of neutron star masses and radii by the NICER mission\nimpose important constraints on the nuclear equation of state. The most recent\nNICER measurement of PSR J0614-3329 reported an equatorial radius of $R_{eq} =\n10.29^{+1.01}_{-0.86}$ km for a mass of $M = 1.44^{+0.06}_{-0.07} M_{\\odot}$.\nConsidering all the NICER measurements to date, we demonstrate using Bayesian\nhypothesis ranking that strange quark stars are preferred over all the\nphysically motivated models of neutron stars compatible with this low radius.\nThis provides a strong case for the possible existence of strange quark stars,\nsuggesting that they should be considered among the population of compact stars\nduring analyses of astrophysical data. Using a wide sample of equations of\nstate, we report the nucleonic equations of state that best fit current\nobservations and rule out one model of strange quark matter.",
            "pdf_url": "http://arxiv.org/pdf/2508.02652v1",
            "published": "2025-08-04 17:43:35+00:00",
            "updated": "2025-08-04 17:43:35+00:00"
        },
        {
            "title": "Greedy Emulators for Nuclear Two-Body Scattering",
            "authors": "J. M. Maldonado, C. Drischler, R. J. Furnstahl, P. Mlinarić",
            "summary": "Applications of reduced basis method emulators are increasing in low-energy\nnuclear physics because they enable fast and accurate sampling of high-fidelity\ncalculations, enabling robust uncertainty quantification. In this paper, we\ndevelop, implement, and test two model-driven emulators based on\n(Petrov-)Galerkin projection using the prototypical test case of two-body\nscattering with the Minnesota potential and a more realistic local chiral\npotential. The high-fidelity scattering equations are solved with the matrix\nNumerov method, a reformulation of the popular Numerov recurrence relation for\nsolving special second-order differential equations as a linear system of\ncoupled equations. A novel error estimator based on reduced-space residuals is\napplied to an active learning approach (a greedy algorithm) to choosing\ntraining samples (\"snapshots\") for the emulator and contrasted with a proper\northogonal decomposition (POD) approach. Both approaches allow for\ncomputationally efficient offline-online decompositions, but the greedy\napproach requires much fewer snapshot calculations. These developments set the\ngroundwork for emulating scattering observables based on chiral nucleon-nucleon\nand three-nucleon interactions and optical models, where computational\nspeed-ups are necessary for Bayesian uncertainty quantification. Our emulators\nand error estimators are widely applicable to linear systems.",
            "pdf_url": "http://arxiv.org/pdf/2504.06092v2",
            "published": "2025-04-08 14:34:51+00:00",
            "updated": "2025-08-04 17:30:23+00:00"
        },
        {
            "title": "Noosemia: toward a Cognitive and Phenomenological Account of Intentionality Attribution in Human-Generative AI Interaction",
            "authors": "Enrico De Santis, Antonello Rizzi",
            "summary": "This paper introduces and formalizes Noosemia, a novel\ncognitive-phenomenological phenomenon emerging from human interaction with\ngenerative AI systems, particularly those enabling dialogic or multimodal\nexchanges. We propose a multidisciplinary framework to explain how, under\ncertain conditions, users attribute intentionality, agency, and even\ninteriority to these systems - a process grounded not in physical resemblance,\nbut in linguistic performance, epistemic opacity, and emergent technological\ncomplexity. By linking an LLM declination of meaning holism to our technical\nnotion of the LLM Contextual Cognitive Field, we clarify how LLMs construct\nmeaning relationally and how coherence and a simulacrum of agency arise at the\nhuman-AI interface. The analysis situates noosemia alongside pareidolia,\nanimism, the intentional stance and the uncanny valley, distinguishing its\nunique characteristics. We also introduce a-noosemia to describe the\nphenomenological withdrawal of such projections. The paper concludes with\nreflections on the broader philosophical, epistemological, and social\nimplications of noosemic dynamics and directions for future research.",
            "pdf_url": "http://arxiv.org/pdf/2508.02622v1",
            "published": "2025-08-04 17:10:08+00:00",
            "updated": "2025-08-04 17:10:08+00:00"
        },
        {
            "title": "Trustworthy scientific inference for inverse problems with generative models",
            "authors": "James Carzon, Luca Masserano, Joshua D. Ingram, Alex Shen, Antonio Carlos Herling Ribeiro Junior, Tommaso Dorigo, Michele Doro, Joshua S. Speagle, Rafael Izbicki, Ann B. Lee",
            "summary": "Generative artificial intelligence (AI) excels at producing complex data\nstructures (text, images, videos) by learning patterns from training examples.\nAcross scientific disciplines, researchers are now applying generative models\nto ``inverse problems'' to infer hidden parameters from observed data. While\nthese methods can handle intractable models and large-scale studies, they can\nalso produce biased or overconfident conclusions. We present a solution with\nFrequentist-Bayes (FreB), a mathematically rigorous protocol that reshapes\nAI-generated probability distributions into confidence regions that\nconsistently include true parameters with the expected probability, while\nachieving minimum size when training and target data align. We demonstrate\nFreB's effectiveness by tackling diverse case studies in the physical sciences:\nidentifying unknown sources under dataset shift, reconciling competing\ntheoretical models, and mitigating selection bias and systematics in\nobservational studies. By providing validity guarantees with interpretable\ndiagnostics, FreB enables trustworthy scientific inference across fields where\ndirect likelihood evaluation remains impossible or prohibitively expensive.",
            "pdf_url": "http://arxiv.org/pdf/2508.02602v1",
            "published": "2025-08-04 16:56:11+00:00",
            "updated": "2025-08-04 16:56:11+00:00"
        },
        {
            "title": "Molecular Processes as Quantum Information Resources",
            "authors": "Saikat Sur, Pritam Chattopadhyay, Gershon Kurizki",
            "summary": "In this contribution to Abraham Nitzan's Festschrift, we present a\nperspective of theoretical research over the years that has pointed to the\npotential of molecular processes to act as quantum information resources. Under\nappropriate control, homonuclear dimer (diatom) dissociation (half-collision)\nand the inverse process of atom-pair collisions are shown to reveal\ntranslational (EPR-like) entanglement that enables molecular wavepacket\nteleportation. When such processes involve electronic-state excitation of the\ndiatom, the fluorescence following dissociation can serve as an entanglement\nwitness that unravels the molecular-state characteristics and evolution. Such\nentangling processes can also exhibit anomalous quantum thermodynamic features,\nparticularly temperature enhancement of a cavity field that interacts with\ndissociated entangled diatoms.",
            "pdf_url": "http://arxiv.org/pdf/2508.02597v1",
            "published": "2025-08-04 16:53:33+00:00",
            "updated": "2025-08-04 16:53:33+00:00"
        },
        {
            "title": "The multi-physics analysis, design and testing of CUSP, a CubeSat mission for space weather and solar flares x-ray polarimetry",
            "authors": "Giovanni Lombardi, Sergio Fabiani, Ettore Del Monte, Andrea Alimenti, Riccardo Campana, Mauro Centrone, Enrico Costa, Nicolas De Angelis, Giovanni De Cesare, Sergio Di Cosimo, Giuseppe Di Persio, Abhay Kumar, Alessandro Lacerenza, Pasqualino Loffredo, Gabriele Minervini, Fabio Muleri, Paolo Romano, Alda Rubini, Emanuele Scalise, Enrico Silva, Paolo Soffitta, Davide Albanesi, Ilaria Baffo, Daniele Brienza, Valerio Campamaggiore, Giovanni Cucinella, Andrea Curatolo, Giulia de Iulis, Andrea Del Re, Vito Di Bari, Simone Di Filippo, Immacolata Donnarumma, Pierluigi Fanelli, Nicolas Gagliardi, Paolo Leonetti, Matteo Merge, Dario Modenini, Andrea Negri, Daniele Pecorella, Massimo Perelli, Alice Ponti, Francesca Sbop, Paolo Tortora, Alessandro Turchi, Valerio Vagelli, Emanuele Zaccagnino, Alessandro Zambardi, Costantino Zazza",
            "summary": "The space-based CUbesat Solar Polarimeter (CUSP) mission aims to measure the\nlinear polarization of solar flares in the hard X-ray band by means of a\nCompton scattering polarimeter. CUSP is a project in the framework of the Alcor\nProgram of the Italian Space Agency aimed at developing new CubeSat missions.\nAs part of CUSP's Phase B study, which began in December 2024 and will last one\nyear, we present the current development status of the design solutions adopted\nfor the mission's most critical multi-physics design drivers. These solutions\nhave been formulated and applied to demonstrate compliance with system\nrequirements at both the spacecraft and platform levels. In particular, we\ndescribe the mechanical design of each structural component, the results of\nstatic, dynamic finite element analyses, and a proposal for topological\noptimization of the interface between the platform and payload and some fixture\nfor test, and the preliminary environmental testing campaign (e.g., vibration,\nshock) that will be carried out on a mechanical demonstrator.",
            "pdf_url": "http://arxiv.org/pdf/2508.02594v1",
            "published": "2025-08-04 16:52:41+00:00",
            "updated": "2025-08-04 16:52:41+00:00"
        },
        {
            "title": "Supersymmetry-breaking compactifications on Riemann-flat manifolds",
            "authors": "Gianguido Dall'Agata, Fabio Zwirner",
            "summary": "We consider compactifications of higher-dimensional supergravities on\nRiemann-flat manifolds of dimension d ($3 \\le d \\le 7$) that fully break\nsupersymmetry at the classical level on a resulting D-dimensional Minkowski\nspace. We systematically discuss consistency conditions, the Kaluza-Klein (KK)\nspectrum and harmonics, and the resulting one-loop effective potential $V_1$,\nfocusing for illustration on maximal supergravity and d=3, in particular on the\n$T^3/Z_3$ and on the Hantzsche-Wendt manifolds. We show how the KK spectrum is\norganized in multiplets of the broken supersymmetry, derive new universal\nsupertrace mass relations valid at each KK level and obtain an analytic finite\nexpression for $V_1$ after resumming the contributions of all KK levels. In all\nexamples $V_1$ is negative definite and scales with inverse powers of some\ninternal radii. We extensively comment, when applicable, on the relation with\nthe Scherk-Schwarz mechanism and with supersymmetry-breaking string\ncompactifications on freely acting symmetric orbifolds. We also finally clarify\nthe assumptions and constraints for Scherk-Schwarz reductions to correspond to\ntwisted tori compactifications.",
            "pdf_url": "http://arxiv.org/pdf/2507.02339v2",
            "published": "2025-07-03 06:05:02+00:00",
            "updated": "2025-08-04 16:38:07+00:00"
        },
        {
            "title": "Density functional theory of renormalization group in nuclear matter",
            "authors": "Yong-rui Chen, Wei-jie Fu, Yang-yang Tan",
            "summary": "The density functional renormalization group (density-fRG) is proposed to\ninvestigate the density fluctuations within the functional renormalization\ngroup approach, which allows us to quantify the medium effect and study physics\nof high densities. This method is applied to the nucleon-meson effective field\ntheory, also known as the Walecka model, to study the properties of nuclear\nmatter at high baryon densities. It is found that both the attractive and\nrepulsive nucleon meson interactions are screened by the high density medium,\nwhich results in a stiffer equation of state (EoS) of nuclear matter in the\nregime of $\\rho_0 \\lesssim \\rho \\lesssim 2.5 \\rho_0$, then a softer EoS when\n$\\rho \\gtrsim 2.5 \\rho_0$. Here $\\rho_0$ denotes the saturation baryon density\nof symmetric nuclear matter. Furthermore, a new phenomenon called the locking\nof Fermi surface is found. In the locking of Fermi surface the effective energy\nof quasi-nucleon is always close to the Fermi surface, which are both running\nwith the renormalization group scale.",
            "pdf_url": "http://arxiv.org/pdf/2508.02575v1",
            "published": "2025-08-04 16:28:58+00:00",
            "updated": "2025-08-04 16:28:58+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "D2PPO: Diffusion Policy Policy Optimization with Dispersive Loss",
            "authors": "Guowei Zou, Weibing Li, Hejun Wu, Yukun Qian, Yuhang Wang, Haitao Wang",
            "summary": "Diffusion policies excel at robotic manipulation by naturally modeling\nmultimodal action distributions in high-dimensional spaces. Nevertheless,\ndiffusion policies suffer from diffusion representation collapse: semantically\nsimilar observations are mapped to indistinguishable features, ultimately\nimpairing their ability to handle subtle but critical variations required for\ncomplex robotic manipulation. To address this problem, we propose D2PPO\n(Diffusion Policy Policy Optimization with Dispersive Loss). D2PPO introduces\ndispersive loss regularization that combats representation collapse by treating\nall hidden representations within each batch as negative pairs. D2PPO compels\nthe network to learn discriminative representations of similar observations,\nthereby enabling the policy to identify subtle yet crucial differences\nnecessary for precise manipulation. In evaluation, we find that early-layer\nregularization benefits simple tasks, while late-layer regularization sharply\nenhances performance on complex manipulation tasks. On RoboMimic benchmarks,\nD2PPO achieves an average improvement of 22.7% in pre-training and 26.1% after\nfine-tuning, setting new SOTA results. In comparison with SOTA, results of\nreal-world experiments on a Franka Emika Panda robot show the excitingly high\nsuccess rate of our method. The superiority of our method is especially evident\nin complex tasks. Project page: https://guowei-zou.github.io/d2ppo/",
            "pdf_url": "http://arxiv.org/pdf/2508.02644v1",
            "published": "2025-08-04 17:33:41+00:00",
            "updated": "2025-08-04 17:33:41+00:00"
        },
        {
            "title": "SEAL: Semantic Aware Image Watermarking",
            "authors": "Kasra Arabi, R. Teal Witter, Chinmay Hegde, Niv Cohen",
            "summary": "Generative models have rapidly evolved to generate realistic outputs.\nHowever, their synthetic outputs increasingly challenge the clear distinction\nbetween natural and AI-generated content, necessitating robust watermarking\ntechniques. Watermarks are typically expected to preserve the integrity of the\ntarget image, withstand removal attempts, and prevent unauthorized replication\nonto unrelated images. To address this need, recent methods embed persistent\nwatermarks into images produced by diffusion models using the initial noise.\nYet, to do so, they either distort the distribution of generated images or rely\non searching through a long dictionary of used keys for detection.\n  In this paper, we propose a novel watermarking method that embeds semantic\ninformation about the generated image directly into the watermark, enabling a\ndistortion-free watermark that can be verified without requiring a database of\nkey patterns. Instead, the key pattern can be inferred from the semantic\nembedding of the image using locality-sensitive hashing. Furthermore,\nconditioning the watermark detection on the original image content improves\nrobustness against forgery attacks. To demonstrate that, we consider two\nlargely overlooked attack strategies: (i) an attacker extracting the initial\nnoise and generating a novel image with the same pattern; (ii) an attacker\ninserting an unrelated (potentially harmful) object into a watermarked image,\npossibly while preserving the watermark. We empirically validate our method's\nincreased robustness to these attacks. Taken together, our results suggest that\ncontent-aware watermarks can mitigate risks arising from image-generative\nmodels.",
            "pdf_url": "http://arxiv.org/pdf/2503.12172v3",
            "published": "2025-03-15 15:29:05+00:00",
            "updated": "2025-08-04 15:15:16+00:00"
        },
        {
            "title": "Toward Using Machine Learning as a Shape Quality Metric for Liver Point Cloud Generation",
            "authors": "Khoa Tuan Nguyen, Gaeun Oh, Ho-min Park, Francesca Tozzi, Wouter Willaert, Joris Vankerschaver, Niki Rashidian, Wesley De Neve",
            "summary": "While 3D medical shape generative models such as diffusion models have shown\npromise in synthesizing diverse and anatomically plausible structures, the\nabsence of ground truth makes quality evaluation challenging. Existing\nevaluation metrics commonly measure distributional distances between training\nand generated sets, while the medical field requires assessing quality at the\nindividual level for each generated shape, which demands labor-intensive expert\nreview.\n  In this paper, we investigate the use of classical machine learning (ML)\nmethods and PointNet as an alternative, interpretable approach for assessing\nthe quality of generated liver shapes. We sample point clouds from the surfaces\nof the generated liver shapes, extract handcrafted geometric features, and\ntrain a group of supervised ML and PointNet models to classify liver shapes as\ngood or bad. These trained models are then used as proxy discriminators to\nassess the quality of synthetic liver shapes produced by generative models.\n  Our results show that ML-based shape classifiers provide not only\ninterpretable feedback but also complementary insights compared to expert\nevaluation. This suggests that ML classifiers can serve as lightweight,\ntask-relevant quality metrics in 3D organ shape generation, supporting more\ntransparent and clinically aligned evaluation protocols in medical shape\nmodeling.",
            "pdf_url": "http://arxiv.org/pdf/2508.02482v1",
            "published": "2025-08-04 14:50:44+00:00",
            "updated": "2025-08-04 14:50:44+00:00"
        },
        {
            "title": "Enhancing OOD Detection Using Latent Diffusion",
            "authors": "Heng Gao, Jun Li",
            "summary": "Out-of-distribution (OOD) detection is crucial for the reliable deployment of\nmachine learning models in real-world scenarios, enabling the identification of\nunknown samples or objects. A prominent approach to enhance OOD detection\nperformance involves leveraging auxiliary datasets for training. Recent efforts\nhave explored using generative models, such as Stable Diffusion (SD), to\nsynthesize outlier data in the pixel space. However, synthesizing OOD data in\nthe pixel space can lead to reduced robustness due to over-generation. To\naddress this challenge, we propose Outlier-Aware Learning (OAL), a novel\nframework that generates synthetic OOD training data within the latent space,\ntaking a further step to study how to utilize Stable Diffusion for developing a\nlatent-based outlier synthesis approach. This improvement facilitates network\ntraining with fewer outliers and less computational cost. Besides, to\nregularize the model's decision boundary, we develop a mutual information-based\ncontrastive learning module (MICL) that amplifies the distinction between\nIn-Distribution (ID) and collected OOD data. Moreover, we develop a knowledge\ndistillation module to prevent the degradation of ID classification accuracy\nwhen training with OOD data. The superior performance of our method on several\nbenchmark datasets demonstrates its efficiency and effectiveness. Source code\nis available in https://github.com/HengGao12/OAL.",
            "pdf_url": "http://arxiv.org/pdf/2406.16525v4",
            "published": "2024-06-24 11:01:43+00:00",
            "updated": "2025-08-04 14:28:05+00:00"
        },
        {
            "title": "A Comprehensive Review of Diffusion Models in Smart Agriculture: Progress, Applications, and Challenges",
            "authors": "Xing Hu, Haodong Chen, Choon Ki Ahn, Danfeng Hong, Qianqian Duan, Huiliang Shang, Guoxiang Li, Linhua Jiang, Dawei Zhang Zhang",
            "summary": "With the global population increasing and arable land resources becoming\nincreasingly limited, smart and precision agriculture have emerged as essential\ndirections for sustainable agricultural development. Artificial intelligence\n(AI), particularly deep learning models, has been widely adopted in\napplications such as crop monitoring, pest detection, and yield prediction.\nAmong recent generative models, diffusion models have demonstrated considerable\npotential in agricultural image processing, data augmentation, and remote\nsensing analysis. Compared to traditional generative adversarial networks\n(GANs), diffusion models exhibit greater training stability and superior image\ngeneration quality, effectively addressing challenges such as limited annotated\ndatasets and imbalanced sample distributions in agricultural scenarios. This\npaper reviews recent advancements in the application of diffusion models within\nagriculture, focusing on their roles in crop disease and pest detection, remote\nsensing image enhancement, crop growth prediction, and agricultural resource\nmanagement. Empirical studies show that diffusion models significantly enhance\nthe performance of downstream models by improving accuracy, robustness, and\ngeneralization in tasks involving image synthesis, augmentation, and denoising\nunder complex environmental conditions. Despite ongoing challenges in\ncomputational efficiency and domain generalization, diffusion models are\nexpected to play an increasingly important role in the future of intelligent\nagriculture. As the technology continues to evolve, it holds substantial\npromise for addressing pressing global issues in food security and\nenvironmental sustainability.",
            "pdf_url": "http://arxiv.org/pdf/2507.18376v3",
            "published": "2025-07-24 12:52:32+00:00",
            "updated": "2025-08-04 14:25:00+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "FinWorld: An All-in-One Open-Source Platform for End-to-End Financial AI Research and Deployment",
            "authors": "Wentao Zhang, Yilei Zhao, Chuqiao Zong, Xinrun Wang, Bo An",
            "summary": "Financial AI holds great promise for transforming modern finance, with the\npotential to support a wide range of tasks such as market forecasting,\nportfolio management, quantitative trading, and automated analysis. However,\nexisting platforms remain limited in task coverage, lack robust multimodal data\nintegration, and offer insufficient support for the training and deployment of\nlarge language models (LLMs). In response to these limitations, we present\nFinWorld, an all-in-one open-source platform that provides end-to-end support\nfor the entire financial AI workflow, from data acquisition to experimentation\nand deployment. FinWorld distinguishes itself through native integration of\nheterogeneous financial data, unified support for diverse AI paradigms, and\nadvanced agent automation, enabling seamless development and deployment.\nLeveraging data from 2 representative markets, 4 stock pools, and over 800\nmillion financial data points, we conduct comprehensive experiments on 4 key\nfinancial AI tasks. These experiments systematically evaluate deep learning and\nreinforcement learning algorithms, with particular emphasis on RL-based\nfinetuning for LLMs and LLM Agents. The empirical results demonstrate that\nFinWorld significantly enhances reproducibility, supports transparent\nbenchmarking, and streamlines deployment, thereby providing a strong foundation\nfor future research and real-world applications. Code is available at\nGithub~\\footnote{https://github.com/DVampire/FinWorld}.",
            "pdf_url": "http://arxiv.org/pdf/2508.02292v1",
            "published": "2025-08-04 11:02:34+00:00",
            "updated": "2025-08-04 11:02:34+00:00"
        },
        {
            "title": "ByteGen: A Tokenizer-Free Generative Model for Orderbook Events in Byte Space",
            "authors": "Yang Li, Zhi Chen",
            "summary": "Generative modeling of high-frequency limit order book (LOB) dynamics is a\ncritical yet unsolved challenge in quantitative finance, essential for robust\nmarket simulation and strategy backtesting. Existing approaches are often\nconstrained by simplifying stochastic assumptions or, in the case of modern\ndeep learning models like Transformers, rely on tokenization schemes that\naffect the high-precision, numerical nature of financial data through\ndiscretization and binning. To address these limitations, we introduce ByteGen,\na novel generative model that operates directly on the raw byte streams of LOB\nevents. Our approach treats the problem as an autoregressive next-byte\nprediction task, for which we design a compact and efficient 32-byte packed\nbinary format to represent market messages without information loss. The core\nnovelty of our work is the complete elimination of feature engineering and\ntokenization, enabling the model to learn market dynamics from its most\nfundamental representation. We achieve this by adapting the H-Net architecture,\na hybrid Mamba-Transformer model that uses a dynamic chunking mechanism to\ndiscover the inherent structure of market messages without predefined rules.\nOur primary contributions are: 1) the first end-to-end, byte-level framework\nfor LOB modeling; 2) an efficient packed data representation; and 3) a\ncomprehensive evaluation on high-frequency data. Trained on over 34 million\nevents from CME Bitcoin futures, ByteGen successfully reproduces key stylized\nfacts of financial markets, generating realistic price distributions,\nheavy-tailed returns, and bursty event timing. Our findings demonstrate that\nlearning directly from byte space is a promising and highly flexible paradigm\nfor modeling complex financial systems, achieving competitive performance on\nstandard market quality metrics without the biases of tokenization.",
            "pdf_url": "http://arxiv.org/pdf/2508.02247v1",
            "published": "2025-08-04 09:48:42+00:00",
            "updated": "2025-08-04 09:48:42+00:00"
        },
        {
            "title": "Is Causality Necessary for Efficient Portfolios? A Computational Perspective on Predictive Validity and Model Misspecification",
            "authors": "Alejandro Rodriguez Dominguez",
            "summary": "Recent claims in financial modeling argue that causal identifiability is\nnecessary for valid portfolio optimization, asserting that misspecified models\nlead to signal inversion and degraded performance. This paper challenges that\nassertion by showing that structurally misspecified predictive models, those\nomitting confounders or misrepresenting functional relationships, can still\nsupport robust and efficient portfolio construction. We develop a theoretical\nframework linking optimization performance to the directional alignment between\npredictive signals and true expected returns, independent of structural\ncorrectness. We derive sufficient conditions under which even non-causal\nsignals yield valid, convex efficient frontiers, and we show that the Sharpe\nratio scales linearly with alignment. Analytical results are supported by\nsimulation studies demonstrating robustness to confounding and miscalibration,\nincluding cases of approximate bias cancellation. Empirical experiments using\nstock returns confirm that associational signals can produce viable frontiers\nunder classical mean-variance optimization. These findings reframe the role of\ncausal modeling in quantitative finance: while causality may offer\ninterpretability and robustness in specific contexts, it is directional\ninformativeness, not structural fidelity, that is essential for effective\nsignal-based portfolio design.",
            "pdf_url": "http://arxiv.org/pdf/2507.23138v2",
            "published": "2025-07-30 22:37:09+00:00",
            "updated": "2025-08-04 08:28:52+00:00"
        },
        {
            "title": "The Financial Connectome: A Brain-Inspired Framework for Modeling Latent Market Dynamics",
            "authors": "Yuda Bi, Vince D Calhoun",
            "summary": "We propose the Financial Connectome, a new scientific discipline that models\nfinancial markets through the lens of brain functional architecture. Inspired\nby the foundational work of group independent component analysis (groupICA) in\nneuroscience, we reimagine markets not as collections of assets, but as\nhigh-dimensional dynamic systems composed of latent market modules. Treating\nstocks as functional nodes and their co-fluctuations as expressions of\ncollective cognition, we introduce dynamic Market Network Connectivity (dMNC),\nthe financial analogue of dynamic functional connectivity (dFNC). This\nbiologically inspired framework reveals structurally persistent market\nsubnetworks, captures regime shifts, and uncovers systemic early warning\nsignals all without reliance on predictive labels. Our results suggest that\nmarkets, like brains, exhibit modular, self-organizing, and temporally evolving\narchitectures. This work inaugurates the field of financial connectomics, a\nprincipled synthesis of systems neuroscience and quantitative finance aimed at\nuncovering the hidden logic of complex economies.",
            "pdf_url": "http://arxiv.org/pdf/2508.02012v1",
            "published": "2025-08-04 03:14:29+00:00",
            "updated": "2025-08-04 03:14:29+00:00"
        }
    ]
}