{
    "Physics": [
        {
            "title": "A nonstabilizerness monotone from stabilizerness asymmetry",
            "authors": "Poetri Sonya Tarabunga, Martina Frau, Tobias Haug, Emanuele Tirrito, Lorenzo Piroli",
            "summary": "We introduce a nonstabilizerness monotone which we name basis-minimised\nstabilizerness asymmetry (BMSA). It is based on the notion of $G$-asymmetry, a\nmeasure of how much a certain state deviates from being symmetric with respect\nto a symmetry group $G$. For pure states, we show that the BMSA is a strong\nmonotone for magic-state resource theory, while it can be extended to mixed\nstates via the convex roof construction. We discuss its relation with other\nmagic monotones, first showing that the BMSA coincides with the recently\nintroduced basis-minimized measurement entropy, thereby establishing the strong\nmonotonicity of the latter. Next, we provide inequalities between the BMSA and\nother nonstabilizerness measures known in the literature. Finally, we present\nnumerical methods to compute the BMSA, highlighting its advantages and\ndrawbacks compared to other nonstabilizerness measures in the context of pure\nmany-body quantum states. We also discuss the importance of additivity and\nstrong monotonicity for measures of nonstabilizerness in many-body physics,\nmotivating the search for additional computable nonstabilizerness monotones.",
            "pdf_url": "http://arxiv.org/pdf/2411.05766v1",
            "published": "2024-11-08 18:26:40+00:00",
            "updated": "2024-11-08 18:26:40+00:00"
        },
        {
            "title": "Physics-Aware Combinatorial Assembly Sequence Planning using Data-free Action Masking",
            "authors": "Ruixuan Liu, Alan Chen, Weiye Zhao, Changliu Liu",
            "summary": "Combinatorial assembly uses standardized unit primitives to build objects\nthat satisfy user specifications. This paper studies assembly sequence planning\n(ASP) for physical combinatorial assembly. Given the shape of the desired\nobject, the goal is to find a sequence of actions for placing unit primitives\nto build the target object. In particular, we aim to ensure the planned\nassembly sequence is physically executable. However, ASP for combinatorial\nassembly is particularly challenging due to its combinatorial nature. To\naddress the challenge, we employ deep reinforcement learning to learn a\nconstruction policy for placing unit primitives sequentially to build the\ndesired object. Specifically, we design an online physics-aware action mask\nthat filters out invalid actions, which effectively guides policy learning and\nensures violation-free deployment. In the end, we apply the proposed method to\nLego assembly with more than 250 3D structures. The experiment results\ndemonstrate that the proposed method plans physically valid assembly sequences\nto build all structures, achieving a $100\\%$ success rate, whereas the best\ncomparable baseline fails more than $40$ structures. Our implementation is\navailable at\n\\url{https://github.com/intelligent-control-lab/PhysicsAwareCombinatorialASP}.",
            "pdf_url": "http://arxiv.org/pdf/2408.10162v2",
            "published": "2024-08-19 17:16:35+00:00",
            "updated": "2024-11-08 18:22:46+00:00"
        },
        {
            "title": "Advantages of the adoption of a generalized flame displacement velocity as a central element of flamelet theory",
            "authors": "Hernan Olguin, Pascale Domingo, Luc Vervisch, Christian Hasse, Arne Scholtissek",
            "summary": "In combustion theory, flames are usually described in terms of the dynamics\nof iso-surfaces of a specific scalar. The flame displacement speed is then\nintroduced as a local variable quantifying the progression of these\niso-surfaces relative to the flow field. While formally defined as a scalar,\nthe physical meaning of this quantity allows relating it with a vector pointing\nalong the normal direction of the scalar iso-surface. In this work, this\none-dimensional concept is extended by the introduction of a generalized flame\ndisplacement velocity vector, which is associated with the dynamics of\niso-surfaces of two generic scalars, $\\alpha$ and $\\beta$. It is then shown how\na new flamelet paradigm can be built around this velocity vector, which leads\nto a very compact and generic set of two-dimensional flamelet equations for\nthermochemical quantities and the conditioning scalar gradients, $g_{\\alpha} =\n\\lvert \\nabla \\alpha \\rvert$ and $g_{\\beta} = \\lvert \\nabla \\beta \\rvert$. The\nmost important features of the developed framework are discussed in the context\nof partially-premixed flames, which provides significant insights into several\naspects of the theory, including the nature of the different contributions to\nthe flamelet equations for the conditioning scalar gradients and the fact that\ndifferent flamelet coordinate systems (orthogonal and non-orthogonal) can be\ncharacterized by the same flame displacement velocity vector. This approach\nopens an entire spectrum of possibilities for the definition of new\ntwo-dimensional composition spaces, which represents a very promising basis for\nthe development of new variants of flamelet theory.",
            "pdf_url": "http://arxiv.org/pdf/2411.05756v1",
            "published": "2024-11-08 18:17:44+00:00",
            "updated": "2024-11-08 18:17:44+00:00"
        },
        {
            "title": "Magnetic monopoles -- theory overview",
            "authors": "Arttu Rajantie",
            "summary": "I give a theoretical overview of magnetic monopoles, focusing on the physical\nperspective of monopoles as hypothetical particles rather than as mathematical\nobjects. I argue that monopoles are exceptionally interesting hypothetical\nparticles and discuss the prospects of addressing the question of their\nexistence, and possibly producing them, in particle physics experiments.",
            "pdf_url": "http://arxiv.org/pdf/2411.05753v1",
            "published": "2024-11-08 18:11:23+00:00",
            "updated": "2024-11-08 18:11:23+00:00"
        },
        {
            "title": "Latest progress on the reduced-order particle-in-cell scheme: I. refining the underlying formulation",
            "authors": "Maryam Reza, Farbod Faraji, Aaron Knoll",
            "summary": "The particle-in-cell (PIC) method is a well-established and widely used\nkinetic plasma modelling approach that provides a hybrid Lagrangian-Eulerian\napproach to solve the plasma kinetic equation. Despite its power in capturing\ndetails of the underlying physics of plasmas, conventional PIC implementations\nare associated with a significant computational cost, rendering their\napplications for real-world plasma science and engineering challenges\nimpractical. The acceleration of the PIC method has thus become a topic of high\ninterest, with several approaches having been pursued to this end. Among these,\nthe concept of reduced-order (RO) PIC simulations, first introduced in 2023,\nprovides a uniquely flexible and computationally efficient framework for\nkinetic plasma modelling - characteristics verified extensively in various\nplasma configurations. In this two-part article, we report the latest progress\nachieved on RO-PIC. Part I article revisits the original RO-PIC formulation and\nintroduces refinements that substantially enhance the cost-efficiency and\naccuracy of the method. We discuss these refinements in comparison against the\noriginal formulation, illustrating the progression to a \"first-order\"\nimplementation from the baseline \"zeroth-order\" one. In a detailed step-by-step\nverification, we first test the newly updated reduced-dimension Poisson solver\n(RDPS) in the first-order RO-PIC against its zeroth-order counterpart using\ntest-case Poisson problems. Next, comparing against the zeroth-order version,\nwe examine the performance of the complete first-order RO-PIC code in\ntwo-dimensional plasma problems. The detailed verifications demonstrate that\nthe improvements in the RO-PIC formulation enable the approach to provide\nfull-2D-equivalent results at a substantially lower (up to an order of\nmagnitude) computational cost compared to the zeroth-order RO-PIC.",
            "pdf_url": "http://arxiv.org/pdf/2411.05751v1",
            "published": "2024-11-08 18:10:32+00:00",
            "updated": "2024-11-08 18:10:32+00:00"
        },
        {
            "title": "Multi-Dimensional Reconfigurable, Physically Composable Hybrid Diffractive Optical Neural Network",
            "authors": "Ziang Yin, Yu Yao, Jeff Zhang, Jiaqi Gu",
            "summary": "Diffractive optical neural networks (DONNs), leveraging free-space light wave\npropagation for ultra-parallel, high-efficiency computing, have emerged as\npromising artificial intelligence (AI) accelerators. However, their inherent\nlack of reconfigurability due to fixed optical structures post-fabrication\nhinders practical deployment in the face of dynamic AI workloads and evolving\napplications. To overcome this challenge, we introduce, for the first time, a\nmulti-dimensional reconfigurable hybrid diffractive ONN system (MDR-HDONN), a\nphysically composable architecture that unlocks a new degree of freedom and\nunprecedented versatility in DONNs. By leveraging full-system learnability,\nMDR-HDONN repurposes fixed fabricated optical hardware, achieving exponentially\nexpanded functionality and superior task adaptability through the\ndifferentiable learning of system variables. Furthermore, MDR-HDONN adopts a\nhybrid optical/photonic design, combining the reconfigurability of integrated\nphotonics with the ultra-parallelism of free-space diffractive systems.\nExtensive evaluations demonstrate that MDR-HDONN has digital-comparable\naccuracy on various task adaptations with 74x faster speed and 194x lower\nenergy. Compared to prior DONNs, MDR-HDONN shows exponentially larger\nfunctional space with 5x faster training speed, paving the way for a new\nparadigm of versatile, composable, hybrid optical/photonic AI computing. We\nwill open-source our codes.",
            "pdf_url": "http://arxiv.org/pdf/2411.05748v1",
            "published": "2024-11-08 18:08:49+00:00",
            "updated": "2024-11-08 18:08:49+00:00"
        },
        {
            "title": "Learning Subsystem Dynamics in Nonlinear Systems via Port-Hamiltonian Neural Networks",
            "authors": "G. J. E. van Otterdijk, S. Moradi, S. Weiland, R. Tóth, N. O. Jaensson, M. Schoukens",
            "summary": "Port-Hamiltonian neural networks (pHNNs) are emerging as a powerful modeling\ntool that integrates physical laws with deep learning techniques. While most\nresearch has focused on modeling the entire dynamics of interconnected systems,\nthe potential for identifying and modeling individual subsystems while\noperating as part of a larger system has been overlooked. This study addresses\nthis gap by introducing a novel method for using pHNNs to identify such\nsubsystems based solely on input-output measurements. By utilizing the inherent\ncompositional property of the port-Hamiltonian systems, we developed an\nalgorithm that learns the dynamics of individual subsystems, without requiring\ndirect access to their internal states. On top of that, by choosing an output\nerror (OE) model structure, we have been able to handle measurement noise\neffectively. The effectiveness of the proposed approach is demonstrated through\ntests on interconnected systems, including multi-physics scenarios,\ndemonstrating its potential for identifying subsystem dynamics and facilitating\ntheir integration into new interconnected models.",
            "pdf_url": "http://arxiv.org/pdf/2411.05730v1",
            "published": "2024-11-08 17:41:51+00:00",
            "updated": "2024-11-08 17:41:51+00:00"
        },
        {
            "title": "Quantum hyperspins: Highly nonclassical collective behavior in quantum optical parametric oscillators",
            "authors": "Marcello Calvanese Strinati, Claudio Conti",
            "summary": "We report on the emergence of a highly non-classical collective behavior in\nquantum parametric oscillators, which we name quantum hyperspin, induced by a\ntailored nonlinear interaction. This is the second quantized version of\nclassical multidimensional spherical spins, as XY spins in two dimensions, and\nHeisenberg spins in three dimensions. In the phase space, the quantum\nhyperspins are represented as spherical shells whose radius scales with the\nnumber of particles in a way such that it cannot be factorized even in the\nlimit of large particle number. We show that the nonlinearly coupled quantum\noscillators form a high-dimensional entangled state that is surprisingly robust\nwith respect to the coupling with the environment. Such a behavior results from\na properly engineered reservoir. Networks of entangled quantum hyperspins are a\nnew approach to quantum simulations for applications in computing, Ising\nmachines, and high-energy physics models. We analyze from first principles\nthrough ab initio numerical simulations the properties of quantum hyperspins,\nincluding the interplay of entanglement and coupling frustration.",
            "pdf_url": "http://arxiv.org/pdf/2411.05728v1",
            "published": "2024-11-08 17:38:43+00:00",
            "updated": "2024-11-08 17:38:43+00:00"
        },
        {
            "title": "Process tensor distinguishability measures",
            "authors": "Guilherme Zambon",
            "summary": "Process tensors are quantum combs describing the evolution of open quantum\nsystems through multiple steps of a quantum dynamics. While there is more than\none way to measure how different two processes are, special care must be taken\nto ensure quantifiers obey physically desirable conditions such as data\nprocessing inequalities. Here, we analyze two classes of distinguishability\nmeasures commonly used in general applications of quantum combs. We show that\nthe first class, called Choi divergences, does not satisfy an important data\nprocessing inequality, while the second one, which we call generalized\ndivergences, does. We also extend to quantum combs some other relevant results\nof generalized divergences of quantum channels. Finally, given the properties\nwe proved, we argue that generalized divergences may be more adequate than Choi\ndivergences for distinguishing quantum combs in most of their applications.\nParticularly, this is crucial for defining monotones for resource theories\nwhose states have a comb structure, such as resource theories of quantum\nprocesses and resource theories of quantum strategies.",
            "pdf_url": "http://arxiv.org/pdf/2407.15712v2",
            "published": "2024-07-22 15:19:36+00:00",
            "updated": "2024-11-08 17:13:00+00:00"
        },
        {
            "title": "Data-driven Energy Consumption Modelling for Electric Micromobility using an Open Dataset",
            "authors": "Yue Ding, Sen Yan, Maqsood Hussain Shah, Hongyuan Fang, Ji Li, Mingming Liu",
            "summary": "The escalating challenges of traffic congestion and environmental degradation\nunderscore the critical importance of embracing E-Mobility solutions in urban\nspaces. In particular, micro E-Mobility tools such as E-scooters and E-bikes,\nplay a pivotal role in this transition, offering sustainable alternatives for\nurban commuters. However, the energy consumption patterns for these tools are a\ncritical aspect that impacts their effectiveness in real-world scenarios and is\nessential for trip planning and boosting user confidence in using these. To\nthis effect, recent studies have utilised physical models customised for\nspecific mobility tools and conditions, but these models struggle with\ngeneralization and effectiveness in real-world scenarios due to a notable\nabsence of open datasets for thorough model evaluation and verification. To\nfill this gap, our work presents an open dataset, collected in Dublin, Ireland,\nspecifically designed for energy modelling research related to E-Scooters and\nE-Bikes. Furthermore, we provide a comprehensive analysis of energy consumption\nmodelling based on the dataset using a set of representative machine learning\nalgorithms and compare their performance against the contemporary mathematical\nmodels as a baseline. Our results demonstrate a notable advantage for\ndata-driven models in comparison to the corresponding mathematical models for\nestimating energy consumption. Specifically, data-driven models outperform\nphysical models in accuracy by up to 83.83% for E-Bikes and 82.16% for\nE-Scooters based on an in-depth analysis of the dataset under certain\nassumptions.",
            "pdf_url": "http://arxiv.org/pdf/2403.17632v3",
            "published": "2024-03-26 12:08:05+00:00",
            "updated": "2024-11-08 17:01:49+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Tract-RLFormer: A Tract-Specific RL policy based Decoder-only Transformer Network",
            "authors": "Ankita Joshi, Ashutosh Sharma, Anoushkrit Goel, Ranjeet Ranjan Jha, Chirag Ahuja, Arnav Bhavsar, Aditya Nigam",
            "summary": "Fiber tractography is a cornerstone of neuroimaging, enabling the detailed\nmapping of the brain's white matter pathways through diffusion MRI. This is\ncrucial for understanding brain connectivity and function, making it a valuable\ntool in neurological applications. Despite its importance, tractography faces\nchallenges due to its complexity and susceptibility to false positives,\nmisrepresenting vital pathways. To address these issues, recent strategies have\nshifted towards deep learning, utilizing supervised learning, which depends on\nprecise ground truth, or reinforcement learning, which operates without it. In\nthis work, we propose Tract-RLFormer, a network utilizing both supervised and\nreinforcement learning, in a two-stage policy refinement process that markedly\nimproves the accuracy and generalizability across various data-sets. By\nemploying a tract-specific approach, our network directly delineates the tracts\nof interest, bypassing the traditional segmentation process. Through rigorous\nvalidation on datasets such as TractoInferno, HCP, and ISMRM-2015, our\nmethodology demonstrates a leap forward in tractography, showcasing its ability\nto accurately map the brain's white matter tracts.",
            "pdf_url": "http://arxiv.org/pdf/2411.05757v1",
            "published": "2024-11-08 18:18:18+00:00",
            "updated": "2024-11-08 18:18:18+00:00"
        },
        {
            "title": "Improving Molecular Graph Generation with Flow Matching and Optimal Transport",
            "authors": "Xiaoyang Hou, Tian Zhu, Milong Ren, Dongbo Bu, Xin Gao, Chunming Zhang, Shiwei Sun",
            "summary": "Generating molecular graphs is crucial in drug design and discovery but\nremains challenging due to the complex interdependencies between nodes and\nedges. While diffusion models have demonstrated their potentiality in molecular\ngraph design, they often suffer from unstable training and inefficient\nsampling. To enhance generation performance and training stability, we propose\nGGFlow, a discrete flow matching generative model incorporating optimal\ntransport for molecular graphs and it incorporates an edge-augmented graph\ntransformer to enable the direct communications among chemical bounds.\nAdditionally, GGFlow introduces a novel goal-guided generation framework to\ncontrol the generative trajectory of our model, aiming to design novel\nmolecular structures with the desired properties. GGFlow demonstrates superior\nperformance on both unconditional and conditional molecule generation tasks,\noutperforming existing baselines and underscoring its effectiveness and\npotential for wider application.",
            "pdf_url": "http://arxiv.org/pdf/2411.05676v1",
            "published": "2024-11-08 16:27:27+00:00",
            "updated": "2024-11-08 16:27:27+00:00"
        },
        {
            "title": "DiffBatt: A Diffusion Model for Battery Degradation Prediction and Synthesis",
            "authors": "Hamidreza Eivazi, André Hebenbrock, Raphael Ginster, Steffen Blömeke, Stefan Wittek, Christoph Herrmann, Thomas S. Spengler, Thomas Turek, Andreas Rausch",
            "summary": "Battery degradation remains a critical challenge in the pursuit of green\ntechnologies and sustainable energy solutions. Despite significant research\nefforts, predicting battery capacity loss accurately remains a formidable task\ndue to its complex nature, influenced by both aging and cycling behaviors. To\naddress this challenge, we introduce a novel general-purpose model for battery\ndegradation prediction and synthesis, DiffBatt. Leveraging an innovative\ncombination of conditional and unconditional diffusion models with\nclassifier-free guidance and transformer architecture, DiffBatt achieves high\nexpressivity and scalability. DiffBatt operates as a probabilistic model to\ncapture uncertainty in aging behaviors and a generative model to simulate\nbattery degradation. The performance of the model excels in prediction tasks\nwhile also enabling the generation of synthetic degradation curves,\nfacilitating enhanced model training by data augmentation. In the remaining\nuseful life prediction task, DiffBatt provides accurate results with a mean\nRMSE of 196 cycles across all datasets, outperforming all other models and\ndemonstrating superior generalizability. This work represents an important step\ntowards developing foundational models for battery degradation.",
            "pdf_url": "http://arxiv.org/pdf/2410.23893v3",
            "published": "2024-10-31 12:53:53+00:00",
            "updated": "2024-11-08 16:21:02+00:00"
        },
        {
            "title": "A Wireless AI-Generated Content (AIGC) Provisioning Framework Empowered by Semantic Communication",
            "authors": "Runze Cheng, Yao Sun, Dusit Niyato, Lan Zhang, Lei Zhang, Muhammad Ali Imran",
            "summary": "With the significant advances in AI-generated content (AIGC) and the\nproliferation of mobile devices, providing high-quality AIGC services via\nwireless networks is becoming the future direction. However, the primary\nchallenges of AIGC services provisioning in wireless networks lie in unstable\nchannels, limited bandwidth resources, and unevenly distributed computational\nresources. To this end, this paper proposes a semantic communication\n(SemCom)-empowered AIGC (SemAIGC) generation and transmission framework, where\nonly semantic information of the content rather than all the binary bits should\nbe generated and transmitted by using SemCom. Specifically, SemAIGC integrates\ndiffusion models within the semantic encoder and decoder to design a\nworkload-adjustable transceiver thereby allowing adjustment of computational\nresource utilization in edge and local. In addition, a Resource-aware wOrklOad\nTrade-off (ROOT) scheme is devised to intelligently make workload adaptation\ndecisions for the transceiver, thus efficiently generating, transmitting, and\nfine-tuning content as per dynamic wireless channel conditions and service\nrequirements. Simulations verify the superiority of our proposed SemAIGC\nframework in terms of latency and content quality compared to conventional\napproaches.",
            "pdf_url": "http://arxiv.org/pdf/2310.17705v3",
            "published": "2023-10-26 18:05:22+00:00",
            "updated": "2024-11-08 13:31:57+00:00"
        },
        {
            "title": "Towards Lifelong Few-Shot Customization of Text-to-Image Diffusion",
            "authors": "Nan Song, Xiaofeng Yang, Ze Yang, Guosheng Lin",
            "summary": "Lifelong few-shot customization for text-to-image diffusion aims to\ncontinually generalize existing models for new tasks with minimal data while\npreserving old knowledge. Current customization diffusion models excel in\nfew-shot tasks but struggle with catastrophic forgetting problems in lifelong\ngenerations. In this study, we identify and categorize the catastrophic\nforgetting problems into two folds: relevant concepts forgetting and previous\nconcepts forgetting. To address these challenges, we first devise a data-free\nknowledge distillation strategy to tackle relevant concepts forgetting. Unlike\nexisting methods that rely on additional real data or offline replay of\noriginal concept data, our approach enables on-the-fly knowledge distillation\nto retain the previous concepts while learning new ones, without accessing any\nprevious data. Second, we develop an In-Context Generation (ICGen) paradigm\nthat allows the diffusion model to be conditioned upon the input vision\ncontext, which facilitates the few-shot generation and mitigates the issue of\nprevious concepts forgetting. Extensive experiments show that the proposed\nLifelong Few-Shot Diffusion (LFS-Diffusion) method can produce high-quality and\naccurate images while maintaining previously learned knowledge.",
            "pdf_url": "http://arxiv.org/pdf/2411.05544v1",
            "published": "2024-11-08 12:58:48+00:00",
            "updated": "2024-11-08 12:58:48+00:00"
        }
    ]
}