{
    "Physics": [
        {
            "title": "Bit symmetry entails the symmetry of the quantum transition probability",
            "authors": "Gerd Niestegge",
            "summary": "It is quite common to use the generalized probabilistic theories (GPTs) as\ngeneric models to reconstruct quantum theory from a few basic principles and to\ngain a better understanding of the probabilistic or information theoretic\nfoundations of quantum physics and quantum computing. A variety of symmetry\npostulates was introduced and studied in this framework, including the\ntransitivity of the automorphism group (1) on the pure states, (2) on the pairs\nof orthogonal pure states [these pairs are called 2-frames] and (3) on any\nframes of the same size. The second postulate is M\\\"uller and Ududec's bit\nsymmetry, which they motivate by quantum computational needs. Here we explore\nthese three postulates in the transition probability framework, which is more\nspecific than the GPTs since the existence of the transition probabilities for\nthe quantum logical atoms is presupposed either directly or indirectly via a\ncertain geometric property of the state space. This property for compact convex\nsets was introduced by the author in a recent paper. We show that bit symmetry\nimplicates the symmetry of the transition probabilities between the atoms.\nUsing a result by Barnum and Hilgert, we can then conclude that the third\nrather strong symmetry postulate rules out all models but the classical cases\nand in the simple Euclidean Jordan algebras.",
            "pdf_url": "http://arxiv.org/pdf/2411.18589v1",
            "published": "2024-11-27 18:31:45+00:00",
            "updated": "2024-11-27 18:31:45+00:00"
        },
        {
            "title": "DexDiffuser: Interaction-aware Diffusion Planning for Adaptive Dexterous Manipulation",
            "authors": "Zhixuan Liang, Yao Mu, Yixiao Wang, Fei Ni, Tianxing Chen, Wenqi Shao, Wei Zhan, Masayoshi Tomizuka, Ping Luo, Mingyu Ding",
            "summary": "Dexterous manipulation with contact-rich interactions is crucial for advanced\nrobotics. While recent diffusion-based planning approaches show promise for\nsimpler manipulation tasks, they often produce unrealistic ghost states (e.g.,\nthe object automatically moves without hand contact) or lack adaptability when\nhandling complex sequential interactions. In this work, we introduce\nDexDiffuser, an interaction-aware diffusion planning framework for adaptive\ndexterous manipulation. DexDiffuser models joint state-action dynamics through\na dual-phase diffusion process which consists of pre-interaction contact\nalignment and post-contact goal-directed control, enabling goal-adaptive\ngeneralizable dexterous manipulation. Additionally, we incorporate dynamics\nmodel-based dual guidance and leverage large language models for automated\nguidance function generation, enhancing generalizability for physical\ninteractions and facilitating diverse goal adaptation through language cues.\nExperiments on physical interaction tasks such as door opening, pen and block\nre-orientation, and hammer striking demonstrate DexDiffuser's effectiveness on\ngoals outside training distributions, achieving over twice the average success\nrate (59.2% vs. 29.5%) compared to existing methods. Our framework achieves\n70.0% success on 30-degree door opening, 40.0% and 36.7% on pen and block\nhalf-side re-orientation respectively, and 46.7% on hammer nail half drive,\nhighlighting its robustness and flexibility in contact-rich manipulation.",
            "pdf_url": "http://arxiv.org/pdf/2411.18562v1",
            "published": "2024-11-27 18:03:26+00:00",
            "updated": "2024-11-27 18:03:26+00:00"
        },
        {
            "title": "A tale of Bethe logarithms: leptonic widths of $χ_{cJ}$ and Lamb shift",
            "authors": "Yu Jia, Jichen Pan",
            "summary": "The rare annihilation decays of $P$-wave spin-triplet quarkonia into lepton\npair have to proceed via two-photon intermediate state, which are plagued with\nthe infrared divergence symptom. We recognize that the physical root of the IR\ndivergence and its remedy is the same as the Lamb shift in QED. In this work we\nprovide a complete solution to this IR problem by including the effect of the\nhigher Fock component of the $\\chi_{cJ}$ state, {\\it viz.}, the\n$c\\bar{c}(^3S_1^{(1)})$ pair accompanied with a very long wavelength photon.\nAdding the contributions from the leading and next-to-leading order Fock\ncomponents together, we arrive at the IR finite and factorization scale\nindependent predictions for leptonic widths of $\\chi_{cJ}(nP)$. The Bethe\nlogarithms associated with these exclusive reactions are found to have rather\ndifferent traits from those associated with Lamb shift. We present numerical\npredictions by employing several influential quark potential models. The\npredicted leptonic widths of $\\chi_{cJ}(nP)$ are sizable and the observation\nprospect for $e^+e^-\\to \\chi_{cJ}(1P,2P)$ at BESIII looks bright. The future\nobservation of $e^+e^-\\to X(3872)$ will shed important light on the $c\\bar{c}$\ncontent of the $X(3872)$ meson.",
            "pdf_url": "http://arxiv.org/pdf/2411.18560v1",
            "published": "2024-11-27 17:57:46+00:00",
            "updated": "2024-11-27 17:57:46+00:00"
        },
        {
            "title": "Bilayer construction for mixed state phenomena with strong, weak symmetries and symmetry breakings",
            "authors": "Shuangyuan Lu, Penghao Zhu, Yuan-Ming Lu",
            "summary": "We introduce the bilayer construction, as a specific purification scheme for\na general mixed state, where each mixed state has a one-to-one correspondence\nwith a bilayer pure state with two constraints: non-negativity of the bilayer\nwavefunction; and the presence of an anti-unitary layer-exchange symmetry T.\nDifferent from the Choi-Jamio{\\l}kowski isomorphism, any mixed state can be\nrealized as the monolayer reduced density matrix of a bilayer pure state, and\nits physical properties can be experimentally realized and detected in\nnon-magnetic bilayer 2D materials with a layer-exchange mirror symmetry. We\nstudy a variety of mixed state phenomena in the bilayer construction: (1)\nstrong and weak symmetries, their explicit and spontaneous breakings in mixed\nstates can be understood as usual Landau-type symmetry breakings in the bilayer\npure state, and their criteria can be derived accordingly; (2) decoherence of a\npure state by local errors can be mapped to quantum quench dynamics of the\nbilayer pure states; (3) mixed symmetry protected topological (SPT) states and\nmixed state topological orders can be classified, characterized and realized as\npure state SPTs and topological orders in the bilayer. We further study\nexamples of strong-to-weak spontaneous symmetry breaking (SWSSB) and their\ncritical scalings at the SWSSB transition in the bilayer construction.",
            "pdf_url": "http://arxiv.org/pdf/2411.07174v2",
            "published": "2024-11-11 17:54:47+00:00",
            "updated": "2024-11-27 17:33:41+00:00"
        },
        {
            "title": "Shape Switching and Tunable Oscillations of Adaptive Droplets",
            "authors": "Tim Dullweber, Roman Belousov, Camilla Autorino, Nicoletta Petridou, Anna Erzberger",
            "summary": "Living materials adapt their shape to signals from the environment, yet the\nimpact of shape changes on signal processing and associated feedback dynamics\nremain unclear. We find that droplets with signal-responsive interfacial\ntensions exhibit shape bistability, excitable dynamics, and oscillations. The\nunderlying critical points reveal novel mechanisms for physical signal\nprocessing through shape adaptation in soft active materials. We recover\nsignatures of one such critical point in experimental data from zebrafish\nembryos, where it supports boundary formation.",
            "pdf_url": "http://arxiv.org/pdf/2402.08664v3",
            "published": "2024-02-13 18:47:02+00:00",
            "updated": "2024-11-27 17:20:25+00:00"
        },
        {
            "title": "Complexity of Quantum-Mechanical Evolutions from Probability Amplitudes",
            "authors": "Carlo Cafaro, Leonardo Rossetti, Paul M. Alsing",
            "summary": "We study the complexity of both time-optimal and time sub-optimal quantum\nHamiltonian evolutions connecting arbitrary source and a target states on the\nBloch sphere equipped with the Fubini-Study metric. This investigation is\nperformed in a number of steps. First, we describe each unitary Schr\\\"odinger\nquantum evolution by means of the path length, the geodesic efficiency, the\nspeed efficiency, and the curvature coefficient of its corresponding dynamical\ntrajectory linking the source state to the target state. Second, starting from\na classical probabilistic setting where the so-called information geometric\ncomplexity can be employed to describe the complexity of entropic motion on\ncurved statistical manifolds underlying the physics of systems when only\npartial knowledge about them is available, we transition into a deterministic\nquantum setting. In this context, after proposing a definition of the\ncomplexity of a quantum evolution, we present a notion of quantum complexity\nlength scale. In particular, we discuss the physical significance of both\nquantities in terms of the accessed (i.e., partial) and accessible (i.e.,\ntotal) parametric volumes of the regions on the Bloch sphere that specify the\nquantum mechanical evolution from the source to the target states. Third, after\ncalculating the complexity measure and the complexity length scale for each one\nof the two quantum evolutions, we compare the behavior of our measures with\nthat of the path length, the geodesic efficiency, the speed efficiency, and the\ncurvature coefficient. We find that, in general, efficient quantum evolutions\nare less complex than inefficient evolutions. However, we also observe that\ncomplexity is more than length. Indeed, longer paths that are sufficiently bent\ncan exhibit a behavior that is less complex than that of shorter paths with a\nsmaller curvature coefficient.",
            "pdf_url": "http://arxiv.org/pdf/2408.14241v2",
            "published": "2024-08-26 12:54:51+00:00",
            "updated": "2024-11-27 17:16:57+00:00"
        },
        {
            "title": "The Solvay Councils, de Broglie's brothers, and the development of wave-particle duality",
            "authors": "Alessio Rocci, Franklin J. Lambert",
            "summary": "The meeting patronized by Ernest Solvay in 1911, the first Solvay Council,\nmarked the beginning of what can be called the first quantum revolution.\nMaurice de Broglie was one of the secretaries of the Council. He participated\nin the two following conferences and contributed to the third Council with his\nwork. Louis de Broglie collaborated and discussed with his elder brother.\nDeparting from Maurice's achievements, Louis developed his approach to the\nwave-particle duality of light and extended it to other particles. He presented\nit at the fifth meeting in 1927. This paper investigates the connection between\nthe two scientists and the Solvay Councils, arguing that this link was\nessential in developing the first quantum revolution, a process that ended,\naccording to Werner Heisenberg, at the fifth Solvay Physics Council.",
            "pdf_url": "http://arxiv.org/pdf/2411.18524v1",
            "published": "2024-11-27 17:15:37+00:00",
            "updated": "2024-11-27 17:15:37+00:00"
        },
        {
            "title": "Scaling SU(2) to 1000 GPUs using HiRep",
            "authors": "Sofie Martins, Erik Kjellgren, Emiliano Molinaro, Claudio Pica, Antonio Rago",
            "summary": "HiRep allows flexible simulations of higher representations of Wilson\nFermions with various actions and gauge groups and a range of inverters and\nintegrators. This is particularly important for enabling evaluations of\nobservables relevant to phenomenological inputs for Beyond-the-Standard-Model\nphysics from lattice field theory. We present progress on the GPU porting of\navailable features, especially in terms of scaling to large jobs on AMD GPUs.",
            "pdf_url": "http://arxiv.org/pdf/2411.18511v1",
            "published": "2024-11-27 16:59:39+00:00",
            "updated": "2024-11-27 16:59:39+00:00"
        },
        {
            "title": "Quantifying the Chirality of Vibrational Modes in Helical Molecular Chains",
            "authors": "Ethan Abraham, Abraham Nitzan",
            "summary": "The lack of quantitative methods for studying chirality has stunted our\ntheoretical understanding of chirality-induced physical phenomena. The chiral\nphonon has been proposed to be involved in various physical phenomena, but it\nis not yet well defined mathematically. Here we examine two approaches for\nassigning and quantifying the chirality of molecular normal modes in\ndouble-helical molecular wires with various levels of twist. First, associating\nwith each normal mode a structure obtained by imposing the corresponding motion\non a common atomic origin, we apply the Continuous Chirality Measure (CCM) to\nquantitatively assess the relationship between the chirality-weighted normal\nmode spectrum and the chirality of the underlying molecular structure. We find\nthat increasing the amount of twist in the double helix shifts the mean normal\nmode CCM to drastically higher values, implying that the chirality of molecular\nnormal modes is strongly correlated with that of the underlying molecular\nstructure. Second, we assign to each normal mode a pseudoscaler defined as the\nproduct of atomic linear and angular momentum summed over all atoms, and we\nanalyze the handedness of the normal mode spectrum with respect to this\nquantity. We find that twisting the double-chain structure introduces asymmetry\nbetween right and left-handed normal modes so that in twisted structures\ndifferent frequency bands are characterized by distinct handedness. This may\ngive rise to global phenomena such as thermal chirality.",
            "pdf_url": "http://arxiv.org/pdf/2310.16352v5",
            "published": "2023-10-25 04:29:45+00:00",
            "updated": "2024-11-27 16:52:28+00:00"
        },
        {
            "title": "Unveiling the optimization process of Physics Informed Neural Networks: How accurate and competitive can PINNs be?",
            "authors": "Jorge F. Urbán, Petros Stefanou, José A. Pons",
            "summary": "This study investigates the potential accuracy boundaries of physics-informed\nneural networks, contrasting their approach with previous similar works and\ntraditional numerical methods. We find that selecting improved optimization\nalgorithms significantly enhances the accuracy of the results. Simple\nmodifications to the loss function may also improve precision, offering an\nadditional avenue for enhancement. Despite optimization algorithms having a\ngreater impact on convergence than adjustments to the loss function, practical\nconsiderations often favor tweaking the latter due to ease of implementation.\nOn a global scale, the integration of an enhanced optimizer and a marginally\nadjusted loss function enables a reduction in the loss function by several\norders of magnitude across diverse physical problems. Consequently, our results\nobtained using compact networks (typically comprising 2 or 3 layers of 20-30\nneurons) achieve accuracies comparable to finite difference schemes employing\nthousands of grid points. This study encourages the continued advancement of\nPINNs and associated optimization techniques for broader applications across\nvarious fields.",
            "pdf_url": "http://arxiv.org/pdf/2405.04230v2",
            "published": "2024-05-07 11:50:25+00:00",
            "updated": "2024-11-27 16:46:13+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Diffusion Self-Distillation for Zero-Shot Customized Image Generation",
            "authors": "Shengqu Cai, Eric Chan, Yunzhi Zhang, Leonidas Guibas, Jiajun Wu, Gordon Wetzstein",
            "summary": "Text-to-image diffusion models produce impressive results but are frustrating\ntools for artists who desire fine-grained control. For example, a common use\ncase is to create images of a specific instance in novel contexts, i.e.,\n\"identity-preserving generation\". This setting, along with many other tasks\n(e.g., relighting), is a natural fit for image+text-conditional generative\nmodels. However, there is insufficient high-quality paired data to train such a\nmodel directly. We propose Diffusion Self-Distillation, a method for using a\npre-trained text-to-image model to generate its own dataset for\ntext-conditioned image-to-image tasks. We first leverage a text-to-image\ndiffusion model's in-context generation ability to create grids of images and\ncurate a large paired dataset with the help of a Visual-Language Model. We then\nfine-tune the text-to-image model into a text+image-to-image model using the\ncurated paired dataset. We demonstrate that Diffusion Self-Distillation\noutperforms existing zero-shot methods and is competitive with per-instance\ntuning techniques on a wide range of identity-preservation generation tasks,\nwithout requiring test-time optimization.",
            "pdf_url": "http://arxiv.org/pdf/2411.18616v1",
            "published": "2024-11-27 18:58:52+00:00",
            "updated": "2024-11-27 18:58:52+00:00"
        },
        {
            "title": "Synthetic ECG Generation for Data Augmentation and Transfer Learning in Arrhythmia Classification",
            "authors": "José Fernando Núñez, Jamie Arjona, Javier Béjar",
            "summary": "Deep learning models need a sufficient amount of data in order to be able to\nfind the hidden patterns in it. It is the purpose of generative modeling to\nlearn the data distribution, thus allowing us to sample more data and augment\nthe original dataset. In the context of physiological data, and more\nspecifically electrocardiogram (ECG) data, given its sensitive nature and\nexpensive data collection, we can exploit the benefits of generative models in\norder to enlarge existing datasets and improve downstream tasks, in our case,\nclassification of heart rhythm.\n  In this work, we explore the usefulness of synthetic data generated with\ndifferent generative models from Deep Learning namely Diffweave, Time-Diffusion\nand Time-VQVAE in order to obtain better classification results for two open\nsource multivariate ECG datasets. Moreover, we also investigate the effects of\ntransfer learning, by fine-tuning a synthetically pre-trained model and then\nprogressively adding increasing proportions of real data. We conclude that\nalthough the synthetic samples resemble the real ones, the classification\nimprovement when simply augmenting the real dataset is barely noticeable on\nindividual datasets, but when both datasets are merged the results show an\nincrease across all metrics for the classifiers when using synthetic samples as\naugmented data. From the fine-tuning results the Time-VQVAE generative model\nhas shown to be superior to the others but not powerful enough to achieve\nresults close to a classifier trained with real data only. In addition, methods\nand metrics for measuring closeness between synthetic data and the real one\nhave been explored as a side effect of the main research questions of this\nstudy.",
            "pdf_url": "http://arxiv.org/pdf/2411.18456v1",
            "published": "2024-11-27 15:46:34+00:00",
            "updated": "2024-11-27 15:46:34+00:00"
        },
        {
            "title": "Multiscale Hodge Scattering Networks for Data Analysis",
            "authors": "Naoki Saito, Stefan C. Schonsheck, Eugene Shvarts",
            "summary": "We propose new scattering networks for signals measured on simplicial\ncomplexes, which we call \\emph{Multiscale Hodge Scattering Networks} (MHSNs).\nOur construction is based on multiscale basis dictionaries on simplicial\ncomplexes, i.e., the $\\kappa$-GHWT and $\\kappa$-HGLET, which we recently\ndeveloped for simplices of dimension $\\kappa \\in \\mathbb{N}$ in a given\nsimplicial complex by generalizing the node-based Generalized Haar-Walsh\nTransform (GHWT) and Hierarchical Graph Laplacian Eigen Transform (HGLET). The\n$\\kappa$-GHWT and the $\\kappa$-HGLET both form redundant sets (i.e.,\ndictionaries) of multiscale basis vectors and the corresponding expansion\ncoefficients of a given signal. Our MHSNs use a layered structure analogous to\na convolutional neural network (CNN) to cascade the moments of the modulus of\nthe dictionary coefficients. The resulting features are invariant to reordering\nof the simplices (i.e., node permutation of the underlying graphs).\nImportantly, the use of multiscale basis dictionaries in our MHSNs admits a\nnatural pooling operation that is akin to local pooling in CNNs, and which may\nbe performed either locally or per-scale. These pooling operations are harder\nto define in both traditional scattering networks based on Morlet wavelets, and\ngeometric scattering networks based on Diffusion Wavelets. As a result, we are\nable to extract a rich set of descriptive yet robust features that can be used\nalong with very simple machine learning methods (i.e., logistic regression or\nsupport vector machines) to achieve high-accuracy classification systems with\nfar fewer parameters to train than most modern graph neural networks. Finally,\nwe demonstrate the usefulness of our MHSNs in three distinct types of problems:\nsignal classification, domain (i.e., graph/simplex) classification, and\nmolecular dynamics prediction.",
            "pdf_url": "http://arxiv.org/pdf/2311.10270v5",
            "published": "2023-11-17 01:30:43+00:00",
            "updated": "2024-11-27 15:32:51+00:00"
        },
        {
            "title": "G3Flow: Generative 3D Semantic Flow for Pose-aware and Generalizable Object Manipulation",
            "authors": "Tianxing Chen, Yao Mu, Zhixuan Liang, Zanxin Chen, Shijia Peng, Qiangyu Chen, Mingkun Xu, Ruizhen Hu, Hongyuan Zhang, Xuelong Li, Ping Luo",
            "summary": "Recent advances in imitation learning for 3D robotic manipulation have shown\npromising results with diffusion-based policies. However, achieving human-level\ndexterity requires seamless integration of geometric precision and semantic\nunderstanding. We present G3Flow, a novel framework that constructs real-time\nsemantic flow, a dynamic, object-centric 3D semantic representation by\nleveraging foundation models. Our approach uniquely combines 3D generative\nmodels for digital twin creation, vision foundation models for semantic feature\nextraction, and robust pose tracking for continuous semantic flow updates. This\nintegration enables complete semantic understanding even under occlusions while\neliminating manual annotation requirements. By incorporating semantic flow into\ndiffusion policies, we demonstrate significant improvements in both\nterminal-constrained manipulation and cross-object generalization. Extensive\nexperiments across five simulation tasks show that G3Flow consistently\noutperforms existing approaches, achieving up to 68.3% and 50.1% average\nsuccess rates on terminal-constrained manipulation and cross-object\ngeneralization tasks respectively. Our results demonstrate the effectiveness of\nG3Flow in enhancing real-time dynamic semantic feature understanding for\nrobotic manipulation policies.",
            "pdf_url": "http://arxiv.org/pdf/2411.18369v1",
            "published": "2024-11-27 14:17:43+00:00",
            "updated": "2024-11-27 14:17:43+00:00"
        }
    ]
}