{
    "Physics": [
        {
            "title": "Initial PIP-II Beam Current Monitor Fault Case Analyses & Beam Position Monitor Linearity Studies in CST Studio Suite",
            "authors": "A. Rouzky, N. Eddy, M. A. Ibrahim",
            "summary": "The use of non-invasive sensors & systems to measure particle beam\ncharacteristics is a crucial part of modern accelerator control systems due to\ntheir ability to return real time passive measurements without impacting the\nbeam quality. Simulations, which can predict these sensors' behaviour and\nperformance under anticipated accelerator conditions, are valuable tools to\nensure confidence in the sensors' functionality prior to a physical bench test.\nThis paper details the design, testing, and results of two sensor models\ndeveloped using CST Studio Suite software. One model is an elliptical,\nlarge-aperture beam position monitor (BPM) for which vertical & horizontal\nposition signal linearity was analyzed. The second model is an AC current\ntransformer (ACCT) beam current monitor (BCM), which was used to search for\npotential fault cases within the BCM and beam pipe flange gaps. Fermilab Proton\nImprovement Plan II (PIP-II) accelerator beam conditions were applied, and\nspecial focus is given to the discovery of linearity variations within the BPM\nas well as the use of frequency domain techniques in the BCM fault case\nanalyses.",
            "pdf_url": "http://arxiv.org/pdf/2410.18951v1",
            "published": "2024-10-24 17:50:20+00:00",
            "updated": "2024-10-24 17:50:20+00:00"
        },
        {
            "title": "Internal structure of gauge-invariant Projected Entangled Pair States",
            "authors": "David Blanik, José Garre-Rubio, András Molnár, Erez Zohar",
            "summary": "Projected entangled pair states (PEPS) are very useful in the description of\nstrongly correlated systems, partly because they allow encoding symmetries,\neither global or local (gauge), naturally. In recent years, PEPS with local\nsymmetries have increasingly been used in the study of non-perturbative regimes\nof lattice gauge theories, most prominently as a way to construct variational\nansatz states depending only on a small number of parameters and yet capturing\nthe relevant physical properties. For the case of one-dimensional PEPS (Matrix\nProduct States - MPS) a bidirectional connection was established between the\ninternal structure of the tensor network, i.e. the mathematical properties of\nthe constituent tensors, and the symmetry. In higher dimensions this has only\nbeen done for global symmetries, where in the local (gauge) case it is known\nonly how to construct gauge-invariant states, but not what the symmetry implies\non the internal structure of the PEPS. In the present work we complete this\nmissing piece and study the internal structure of projected entangled pair\nstates with a gauge symmetry. The PEPS we consider consist of matter and gauge\nfield tensors placed on the vertices and edges, respectively, of arbitrary\ngraphs.",
            "pdf_url": "http://arxiv.org/pdf/2410.18947v1",
            "published": "2024-10-24 17:37:37+00:00",
            "updated": "2024-10-24 17:37:37+00:00"
        },
        {
            "title": "Exact solutions for topological surface states of three-dimensional lattice models",
            "authors": "Matias Mustonen, Teemu Ojanen, Ali G. Moghaddam",
            "summary": "In this work, we establish a generalized transfer matrix method that provides\nexact analytical and numerical solutions for lattice versions of topological\nmodels with surface termination in one direction. We construct a generalized\neigenvalue equation, equivalent to the conventional transfer matrix, which\nneither suffers from nor requires singular (non-invertible) inter-layer hopping\nmatrices, in contrast to previous works. We then apply this formalism to\nderive, with exactness, the topological surface states and Fermi arc states in\ntwo prototypical topological models: the 3D Bernevig-Hughes-Zhang model and a\nlattice model exhibiting Weyl semimetal behavior. Our results show that the\nsurface states and bulk bands, across the projected 2D Brillouin zone, agree\nperfectly with those obtained through direct numerical diagonalization of the\ncorresponding Hamiltonians in a slab geometry. This highlights that the\ngeneralized transfer matrix method is not only a powerful tool but also a\nhighly efficient alternative to fully numerical methods for investigating\nsurface physics and interfaces in topological systems, particularly when it is\nrequired to go beyond low-energy effective descriptions.",
            "pdf_url": "http://arxiv.org/pdf/2410.18934v1",
            "published": "2024-10-24 17:21:23+00:00",
            "updated": "2024-10-24 17:21:23+00:00"
        },
        {
            "title": "Using Parametric PINNs for Predicting Internal and External Turbulent Flows",
            "authors": "Shinjan Ghosh, Amit Chakraborty, Georgia Olympia Brikis, Biswadip Dey",
            "summary": "Computational fluid dynamics (CFD) solvers employing two-equation eddy\nviscosity models are the industry standard for simulating turbulent flows using\nthe Reynolds-averaged Navier-Stokes (RANS) formulation. While these methods are\ncomputationally less expensive than direct numerical simulations, they can\nstill incur significant computational costs to achieve the desired accuracy. In\nthis context, physics-informed neural networks (PINNs) offer a promising\napproach for developing parametric surrogate models that leverage both\nexisting, but limited CFD solutions and the governing differential equations to\npredict simulation outcomes in a computationally efficient, differentiable, and\nnear real-time manner. In this work, we build upon the previously proposed\nRANS-PINN framework, which only focused on predicting flow over a cylinder. To\ninvestigate the efficacy of RANS-PINN as a viable approach to building\nparametric surrogate models, we investigate its accuracy in predicting relevant\nturbulent flow variables for both internal and external flows. To ensure\ntraining convergence with a more complex loss function, we adopt a novel\nsampling approach that exploits the domain geometry to ensure a proper balance\namong the contributions from various regions within the solution domain. The\neffectiveness of this framework is then demonstrated for two scenarios that\nrepresent a broad class of internal and external flow problems.",
            "pdf_url": "http://arxiv.org/pdf/2410.18917v1",
            "published": "2024-10-24 17:08:20+00:00",
            "updated": "2024-10-24 17:08:20+00:00"
        },
        {
            "title": "Quantum Many-Body Scars beyond the PXP model in Rydberg simulators",
            "authors": "Aron Kerschbaumer, Marko Ljubotina, Maksym Serbyn, Jean-Yves Desaules",
            "summary": "Persistent revivals recently observed in Rydberg atom simulators have\nchallenged our understanding of thermalization and attracted much interest to\nthe concept of quantum many-body scars (QMBSs). QMBSs are non-thermal highly\nexcited eigenstates that coexist with typical eigenstates in the spectrum of\nmany-body Hamiltonians, and have since been reported in multiple theoretical\nmodels, including the so-called PXP model, approximately realized by Rydberg\nsimulators. At the same time, questions of how common QMBSs are and in what\nmodels they are physically realized remain open. In this Letter, we demonstrate\nthat QMBSs exist in a broader family of models that includes and generalizes\nPXP to longer-range constraints and states with different periodicity. We show\nthat in each model, multiple QMBS families can be found. Each of them relies on\na different approximate $\\mathfrak{su}(2)$ algebra, leading to oscillatory\ndynamics in all cases. However, in contrast to the PXP model, their observation\nrequires launching dynamics from weakly entangled initial states rather than\nfrom a product state. QMBSs reported here may be experimentally probed using\nRydberg atom simulator in the regime of longer-range Rydberg blockades.",
            "pdf_url": "http://arxiv.org/pdf/2410.18913v1",
            "published": "2024-10-24 17:04:42+00:00",
            "updated": "2024-10-24 17:04:42+00:00"
        },
        {
            "title": "Modulated Adaptive Fourier Neural Operators for Temporal Interpolation of Weather Forecasts",
            "authors": "Jussi Leinonen, Boris Bonev, Thorsten Kurth, Yair Cohen",
            "summary": "Weather and climate data are often available at limited temporal resolution,\neither due to storage limitations, or in the case of weather forecast models\nbased on deep learning, their inherently long time steps. The coarse temporal\nresolution makes it difficult to capture rapidly evolving weather events. To\naddress this limitation, we introduce an interpolation model that reconstructs\nthe atmospheric state between two points in time for which the state is known.\nThe model makes use of a novel network layer that modifies the adaptive Fourier\nneural operator (AFNO), which has been previously used in weather prediction\nand other applications of machine learning to physics problems. The modulated\nAFNO (ModAFNO) layer takes an embedding, here computed from the interpolation\ntarget time, as an additional input and applies a learned shift-scale operation\ninside the AFNO layers to adapt them to the target time. Thus, one model can be\nused to produce all intermediate time steps. Trained to interpolate between two\ntime steps 6 h apart, the ModAFNO-based interpolation model produces 1 h\nresolution intermediate time steps that are visually nearly indistinguishable\nfrom the actual corresponding 1 h resolution data. The model reduces the RMSE\nloss of reconstructing the intermediate steps by approximately 50% compared to\nlinear interpolation. We also demonstrate its ability to reproduce the\nstatistics of extreme weather events such as hurricanes and heat waves better\nthan 6 h resolution data. The ModAFNO layer is generic and is expected to be\napplicable to other problems, including weather forecasting with tunable lead\ntime.",
            "pdf_url": "http://arxiv.org/pdf/2410.18904v1",
            "published": "2024-10-24 16:48:32+00:00",
            "updated": "2024-10-24 16:48:32+00:00"
        },
        {
            "title": "Finite-Time Processes In Quantum Thermodynamics: The Limits Of Irreversibility",
            "authors": "Alberto Rolandi",
            "summary": "The emergence of irreversibility in physical processes, despite the\nfundamentally reversible nature of quantum mechanics, remains an open question\nin physics. This thesis explores the intricate relationship between quantum\nmechanics and thermodynamics, with a particular focus on minimizing entropy\nproduction in finite-time processes. By employing tools from quantum\ninformation theory and geometric thermodynamics, we tackle the challenge of\nderiving irreversible thermodynamic behavior from the reversible microscopic\nframework of quantum mechanics. We begin with a comprehensive review of the\nlaws of thermodynamics, setting the stage for the subsequent analyses. We\nintroduce novel developments in quantum thermodynamics through a generalized\nframework for geometric thermodynamics, which enables the derivation of\nfinite-time corrections beyond the Markovian regime. Building on this\nfoundation, we extend Landauer's principle by incorporating a finite-time\ncorrection that highlights the necessity of strong coupling for optimal\ninformation erasure processes. This result underscores the emergence of\nPlanckian time as a fundamental speed limit to thermalization. Additionally, we\nexplore how collective effects can be harnessed to reduce energy dissipation in\nthermodynamic operations, revealing that classical correlations between systems\ncan significantly mitigate dissipation, though this may pose new questions\nregarding the third law of thermodynamics. Finally, we optimize thermodynamic\nprocesses in mesoscopic systems, including quantum dot engines and information\nengines. These findings not only enhance our understanding of the fundamental\nlimits of irreversibility but also open new avenues for research. Future works\nwill focus on fully exploiting collective effects, aligning these with the\nthird law of thermodynamics, and understanding the thermodynamic consistency of\nmaster equations.",
            "pdf_url": "http://arxiv.org/pdf/2410.18903v1",
            "published": "2024-10-24 16:48:24+00:00",
            "updated": "2024-10-24 16:48:24+00:00"
        },
        {
            "title": "Simulating 2D lattice gauge theories on a qudit quantum computer",
            "authors": "Michael Meth, Jan F. Haase, Jinglei Zhang, Claire Edmunds, Lukas Postler, Alex Steiner, Andrew J. Jena, Luca Dellantonio, Rainer Blatt, Peter Zoller, Thomas Monz, Philipp Schindler, Christine Muschik, Martin Ringbauer",
            "summary": "Particle physics underpins our understanding of the world at a fundamental\nlevel by describing the interplay of matter and forces through gauge theories.\nYet, despite their unmatched success, the intrinsic quantum mechanical nature\nof gauge theories makes important problem classes notoriously difficult to\naddress with classical computational techniques. A promising way to overcome\nthese roadblocks is offered by quantum computers, which are based on the same\nlaws that make the classical computations so difficult. Here, we present a\nquantum computation of the properties of the basic building block of\ntwo-dimensional lattice quantum electrodynamics, involving both gauge fields\nand matter. This computation is made possible by the use of a trapped-ion qudit\nquantum processor, where quantum information is encoded in $d$ different states\nper ion, rather than in two states as in qubits. Qudits are ideally suited for\ndescribing gauge fields, which are naturally high-dimensional, leading to a\ndramatic reduction in the quantum register size and circuit complexity. Using a\nvariational quantum eigensolver, we find the ground state of the model and\nobserve the interplay between virtual pair creation and quantized magnetic\nfield effects. The qudit approach further allows us to seamlessly observe the\neffect of different gauge field truncations by controlling the qudit dimension.\nOur results open the door for hardware-efficient quantum simulations with\nqudits in near-term quantum devices.",
            "pdf_url": "http://arxiv.org/pdf/2310.12110v3",
            "published": "2023-10-18 17:06:35+00:00",
            "updated": "2024-10-24 16:31:40+00:00"
        },
        {
            "title": "Exactly solvable models for 2+1D topological phases derived from crossed modules of semisimple Hopf algebras",
            "authors": "Vincent Koppen, João Faria Martins, Paul Purdon Martin",
            "summary": "We define an exactly solvable model for 2+1D topological phases of matter on\na triangulated surface derived from a crossed module of semisimple\nfinite-dimensional Hopf algebras, the `Hopf-algebraic higher Kitaev model'.\nThis model generalizes both the Kitaev quantum double model for a semisimple\nHopf algebra and the full higher Kitaev model derived from a 2-group, and can\nhence be interpreted as a Hopf-algebraic discrete higher gauge theory.\n  We construct a family of crossed modules of semisimple Hopf algebras,\n$(\\mathscr{F}_{\\mathbb{C}}(X) \\otimes \\mathbb{C}E \\xrightarrow{\\partial}\n\\mathscr{F}_{\\mathbb{C}}(Y) \\rtimes \\mathbb{C} G, \\triangleright)$, that\ndepends on four finite groups, $E,G,X$ and $Y$. We calculate the ground-state\nspaces of the resulting model on a triangulated surface when $G=E=\\{1\\}$ and\nwhen $Y=\\{1\\}$, prove that those ground-state spaces are canonically\nindependent of the triangulations, and so depend only on the underlying\nsurface; and moreover we find a 2+1D TQFT whose state spaces on surfaces give\nthe ground-state spaces. These TQFTs are particular cases of Quinn's finite\ntotal homotopy TQFT and hence the state spaces assigned to surfaces are free\nvector spaces on sets of homotopy classes of maps from a surface to homotopy\nfinite spaces, in this case obtained as classifying spaces of finite groupoids\nand finite crossed modules of groupoids.\n  We leave it as an open problem whether the ground-state space of the\nHopf-algebraic higher Kitaev model on a triangulated surface is independent of\nthe triangulation for general crossed modules of semisimple Hopf algebras,\nwhether a TQFT always exists whose state space on a surface gives the\nground-state space of the model, and whether the ground-state space of the\nmodel obtained from $E,G,X,Y$ can always be given a homotopical explanation.",
            "pdf_url": "http://arxiv.org/pdf/2104.02766v3",
            "published": "2021-04-06 20:11:43+00:00",
            "updated": "2024-10-24 16:29:37+00:00"
        },
        {
            "title": "Phase-space integrals through Mellin-Barnes representation",
            "authors": "Taushif Ahmed, Syed Mehedi Hasan, Andreas Rapakoulias",
            "summary": "This letter introduces a novel analytical approach to calculating phase-space\nintegrals, crucial for precision in particle physics. We develop a method to\ncompute angular components using multifold Mellin-Barnes integrals, yielding\nresults in terms of Goncharov polylogarithms for integrals involving three\ndenominators. Our results include expressions for massless momenta up to\n$\\cal{O}(\\epsilon^2)$ and for one massive momentum up to $\\cal{O}(\\epsilon)$.\nAdditionally, we derive recursion relations that reduce integrals with higher\npowers of denominators to simpler ones. We detail how to combine the angular\npart with the radial one which requires a careful handling of singularities.",
            "pdf_url": "http://arxiv.org/pdf/2410.18886v1",
            "published": "2024-10-24 16:22:30+00:00",
            "updated": "2024-10-24 16:22:30+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "3D-Adapter: Geometry-Consistent Multi-View Diffusion for High-Quality 3D Generation",
            "authors": "Hansheng Chen, Bokui Shen, Yulin Liu, Ruoxi Shi, Linqi Zhou, Connor Z. Lin, Jiayuan Gu, Hao Su, Gordon Wetzstein, Leonidas Guibas",
            "summary": "Multi-view image diffusion models have significantly advanced open-domain 3D\nobject generation. However, most existing models rely on 2D network\narchitectures that lack inherent 3D biases, resulting in compromised geometric\nconsistency. To address this challenge, we introduce 3D-Adapter, a plug-in\nmodule designed to infuse 3D geometry awareness into pretrained image diffusion\nmodels. Central to our approach is the idea of 3D feedback augmentation: for\neach denoising step in the sampling loop, 3D-Adapter decodes intermediate\nmulti-view features into a coherent 3D representation, then re-encodes the\nrendered RGBD views to augment the pretrained base model through feature\naddition. We study two variants of 3D-Adapter: a fast feed-forward version\nbased on Gaussian splatting and a versatile training-free version utilizing\nneural fields and meshes. Our extensive experiments demonstrate that 3D-Adapter\nnot only greatly enhances the geometry quality of text-to-multi-view models\nsuch as Instant3D and Zero123++, but also enables high-quality 3D generation\nusing the plain text-to-image Stable Diffusion. Furthermore, we showcase the\nbroad application potential of 3D-Adapter by presenting high quality results in\ntext-to-3D, image-to-3D, text-to-texture, and text-to-avatar tasks.",
            "pdf_url": "http://arxiv.org/pdf/2410.18974v1",
            "published": "2024-10-24 17:59:30+00:00",
            "updated": "2024-10-24 17:59:30+00:00"
        },
        {
            "title": "On the Crucial Role of Initialization for Matrix Factorization",
            "authors": "Bingcong Li, Liang Zhang, Aryan Mokhtari, Niao He",
            "summary": "This work revisits the classical low-rank matrix factorization problem and\nunveils the critical role of initialization in shaping convergence rates for\nsuch nonconvex and nonsmooth optimization. We introduce Nystrom initialization,\nwhich significantly improves the global convergence of Scaled Gradient Descent\n(ScaledGD) in both symmetric and asymmetric matrix factorization tasks.\nSpecifically, we prove that ScaledGD with Nystrom initialization achieves\nquadratic convergence in cases where only linear rates were previously known.\nFurthermore, we extend this initialization to low-rank adapters (LoRA) commonly\nused for finetuning foundation models. Our approach, NoRA, i.e., LoRA with\nNystrom initialization, demonstrates superior performance across various\ndownstream tasks and model scales, from 1B to 7B parameters, in large language\nand diffusion models.",
            "pdf_url": "http://arxiv.org/pdf/2410.18965v1",
            "published": "2024-10-24 17:58:21+00:00",
            "updated": "2024-10-24 17:58:21+00:00"
        },
        {
            "title": "Stable Consistency Tuning: Understanding and Improving Consistency Models",
            "authors": "Fu-Yun Wang, Zhengyang Geng, Hongsheng Li",
            "summary": "Diffusion models achieve superior generation quality but suffer from slow\ngeneration speed due to the iterative nature of denoising. In contrast,\nconsistency models, a new generative family, achieve competitive performance\nwith significantly faster sampling. These models are trained either through\nconsistency distillation, which leverages pretrained diffusion models, or\nconsistency training/tuning directly from raw data. In this work, we propose a\nnovel framework for understanding consistency models by modeling the denoising\nprocess of the diffusion model as a Markov Decision Process (MDP) and framing\nconsistency model training as the value estimation through Temporal\nDifference~(TD) Learning. More importantly, this framework allows us to analyze\nthe limitations of current consistency training/tuning strategies. Built upon\nEasy Consistency Tuning (ECT), we propose Stable Consistency Tuning (SCT),\nwhich incorporates variance-reduced learning using the score identity. SCT\nleads to significant performance improvements on benchmarks such as CIFAR-10\nand ImageNet-64. On ImageNet-64, SCT achieves 1-step FID 2.42 and 2-step FID\n1.55, a new SoTA for consistency models.",
            "pdf_url": "http://arxiv.org/pdf/2410.18958v1",
            "published": "2024-10-24 17:55:52+00:00",
            "updated": "2024-10-24 17:55:52+00:00"
        },
        {
            "title": "Diff-Instruct++: Training One-step Text-to-image Generator Model to Align with Human Preferences",
            "authors": "Weijian Luo",
            "summary": "One-step text-to-image generator models offer advantages such as swift\ninference efficiency, flexible architectures, and state-of-the-art generation\nperformance. In this paper, we study the problem of aligning one-step generator\nmodels with human preferences for the first time. Inspired by the success of\nreinforcement learning using human feedback (RLHF), we formulate the alignment\nproblem as maximizing expected human reward functions while adding an Integral\nKullback-Leibler divergence term to prevent the generator from diverging. By\novercoming technical challenges, we introduce Diff-Instruct++ (DI++), the\nfirst, fast-converging and image data-free human preference alignment method\nfor one-step text-to-image generators. We also introduce novel theoretical\ninsights, showing that using CFG for diffusion distillation is secretly doing\nRLHF with DI++. Such an interesting finding brings understanding and potential\ncontributions to future research involving CFG. In the experiment sections, we\nalign both UNet-based and DiT-based one-step generators using DI++, which use\nthe Stable Diffusion 1.5 and the PixelArt-$\\alpha$ as the reference diffusion\nprocesses. The resulting DiT-based one-step text-to-image model achieves a\nstrong Aesthetic Score of 6.19 and an Image Reward of 1.24 on the COCO\nvalidation prompt dataset. It also achieves a leading Human preference Score\n(HPSv2.0) of 28.48, outperforming other open-sourced models such as Stable\nDiffusion XL, DMD2, SD-Turbo, as well as PixelArt-$\\alpha$. Both theoretical\ncontributions and empirical evidence indicate that DI++ is a strong\nhuman-preference alignment approach for one-step text-to-image models.",
            "pdf_url": "http://arxiv.org/pdf/2410.18881v1",
            "published": "2024-10-24 16:17:18+00:00",
            "updated": "2024-10-24 16:17:18+00:00"
        },
        {
            "title": "The Cat and Mouse Game: The Ongoing Arms Race Between Diffusion Models and Detection Methods",
            "authors": "Linda Laurier, Ave Giulietta, Arlo Octavia, Meade Cleti",
            "summary": "The emergence of diffusion models has transformed synthetic media generation,\noffering unmatched realism and control over content creation. These\nadvancements have driven innovation across fields such as art, design, and\nscientific visualization. However, they also introduce significant ethical and\nsocietal challenges, particularly through the creation of hyper-realistic\nimages that can facilitate deepfakes, misinformation, and unauthorized\nreproduction of copyrighted material. In response, the need for effective\ndetection mechanisms has become increasingly urgent. This review examines the\nevolving adversarial relationship between diffusion model development and the\nadvancement of detection methods. We present a thorough analysis of\ncontemporary detection strategies, including frequency and spatial domain\ntechniques, deep learning-based approaches, and hybrid models that combine\nmultiple methodologies. We also highlight the importance of diverse datasets\nand standardized evaluation metrics in improving detection accuracy and\ngeneralizability. Our discussion explores the practical applications of these\ndetection systems in copyright protection, misinformation prevention, and\nforensic analysis, while also addressing the ethical implications of synthetic\nmedia. Finally, we identify key research gaps and propose future directions to\nenhance the robustness and adaptability of detection methods in line with the\nrapid advancements of diffusion models. This review emphasizes the necessity of\na comprehensive approach to mitigating the risks associated with AI-generated\ncontent in an increasingly digital world.",
            "pdf_url": "http://arxiv.org/pdf/2410.18866v1",
            "published": "2024-10-24 15:51:04+00:00",
            "updated": "2024-10-24 15:51:04+00:00"
        }
    ]
}