{
    "Physics": [
        {
            "title": "Real-is-Sim: Bridging the Sim-to-Real Gap with a Dynamic Digital Twin for Real-World Robot Policy Evaluation",
            "authors": "Jad Abou-Chakra, Lingfeng Sun, Krishan Rana, Brandon May, Karl Schmeckpeper, Maria Vittoria Minniti, Laura Herlant",
            "summary": "Recent advancements in behavior cloning have enabled robots to perform\ncomplex manipulation tasks. However, accurately assessing training performance\nremains challenging, particularly for real-world applications, as behavior\ncloning losses often correlate poorly with actual task success. Consequently,\nresearchers resort to success rate metrics derived from costly and\ntime-consuming real-world evaluations, making the identification of optimal\npolicies and detection of overfitting or underfitting impractical. To address\nthese issues, we propose real-is-sim, a novel behavior cloning framework that\nincorporates a dynamic digital twin (based on Embodied Gaussians) throughout\nthe entire policy development pipeline: data collection, training, and\ndeployment. By continuously aligning the simulated world with the physical\nworld, demonstrations can be collected in the real world with states extracted\nfrom the simulator. The simulator enables flexible state representations by\nrendering image inputs from any viewpoint or extracting low-level state\ninformation from objects embodied within the scene. During training, policies\ncan be directly evaluated within the simulator in an offline and highly\nparallelizable manner. Finally, during deployment, policies are run within the\nsimulator where the real robot directly tracks the simulated robot's joints,\neffectively decoupling policy execution from real hardware and mitigating\ntraditional domain-transfer challenges. We validate real-is-sim on the PushT\nmanipulation task, demonstrating strong correlation between success rates\nobtained in the simulator and real-world evaluations. Videos of our system can\nbe found at https://realissim.rai-inst.com.",
            "pdf_url": "http://arxiv.org/pdf/2504.03597v1",
            "published": "2025-04-04 17:05:56+00:00",
            "updated": "2025-04-04 17:05:56+00:00"
        },
        {
            "title": "On the Atomki nuclear anomaly after the MEG-II result",
            "authors": "Daniele Barducci, Davide Germani, Marco Nardecchia, Stefano Scacco, Claudio Toni",
            "summary": "Recent experimental results from the Atomki collaboration have reported the\nobservation of anomalous effects in Beryllium, Helium and Carbon nuclear\ntransitions that could hint at physics beyond the Standard Model. However, the\nMEG-II experiment has recently found no significant anomalous signal in the\nBeryllium transition ${^8}\\text{Be}^\\star\\to{^8}\\text{Be}+e^+e^-$. In view of\nthis result, we critically re-examine the possible theoretical interpretations\nof the anomalies observed by the Atomki experiment in terms of a new boson $X$\nwith mass around $17\\;$MeV. The present work aims to study the phenomenology of\na spin-2 state and revisit the possibility of a pure CP-even scalar, which was\ninitially dismissed due to its inability to explain the Beryllium anomalous\nsignal. Our analysis shows that a spin-2 state is highly disfavoured by the\nSINDRUM constraint while a scalar boson could explain the Helium and Carbon\nanomalies while being compatible with other experimental constraints.",
            "pdf_url": "http://arxiv.org/pdf/2501.05507v2",
            "published": "2025-01-09 19:00:00+00:00",
            "updated": "2025-04-04 16:48:26+00:00"
        },
        {
            "title": "Cloning Games, Black Holes and Cryptography",
            "authors": "Alexander Poremba, Seyoon Ragavan, Vinod Vaikuntanathan",
            "summary": "Quantum no-cloning is one of the most fundamental properties of quantum\ninformation. In this work, we introduce a new toolkit for analyzing cloning\ngames; these games capture more quantitative versions of no-cloning and are\ncentral to unclonable cryptography. Previous works rely on the framework laid\nout by Tomamichel, Fehr, Kaniewski and Wehner to analyze both the $n$-qubit\nBB84 game and the subspace coset game. Their constructions and analysis face\nthe following inherent limitations:\n  - The existing bounds on the values of these games are at least $2^{-0.25n}$;\non the other hand, the trivial adversarial strategy wins with probability\n$2^{-n}$. Not only that, the BB84 game does in fact admit a highly nontrivial\nwinning strategy. This raises the natural question: are there cloning games\nwhich admit no non-trivial winning strategies?\n  - The existing constructions are not multi-copy secure; the BB84 game is not\neven $2 \\mapsto 3$ secure, and the subspace coset game is not $t \\mapsto t+1$\nsecure for a polynomially large $t$. Moreover, we provide evidence that the\nexisting technical tools do not suffice to prove multi-copy security of even\ncompletely different constructions. This raises the natural question: can we\ndesign new cloning games that achieve multi-copy security, possibly by\ndeveloping a new analytic toolkit?\n  We study a new cloning game based on binary phase states and show that it is\n$t$-copy secure when $t=o(n/\\log n)$. Moreover, for constant $t$, we obtain the\nfirst asymptotically optimal bounds of $O(2^{-n})$. We also show a worst-case\nto average-case reduction for a large class of cloning games, which allows us\nto show the same quantitative results for Haar cloning games. These technical\ningredients together enable two new applications which have previously been out\nof reach; one in black hole physics, and one in unclonable cryptography.",
            "pdf_url": "http://arxiv.org/pdf/2411.04730v2",
            "published": "2024-11-07 14:09:32+00:00",
            "updated": "2025-04-04 16:48:23+00:00"
        },
        {
            "title": "Microcavity-Enhanced Exciton Dynamics in Light-Harvesting Complexes: Insights from Redfield Theory",
            "authors": "Ilmari Rosenkampff, Tõnu Pullerits",
            "summary": "We investigated the exciton transfer dynamics in photosynthetic\nlight-harvesting complex 2 (LH2) coupled to an optical microcavity. Using\ncomputational simulations based on Redfield theory, we analyzed how microcavity\ncoupling influences energy relaxation and transfer within and between LH2\naggregates. Our results show that the exciton transfer rate between B850 rings\nfollows a square dependence on the light-matter coupling strength, in agreement\nwith Fermi's golden rule. Interestingly, the energy transfer rate remains\nalmost independent of the number of LH2 complexes. This behavior is explained\nby the molecular components of the polaritonic wavefunction overlaps. These\nfindings highlight the crucial role of cavity-induced polaritonic states in\nmediating energy transport and provide a theoretical framework for optimizing\nmicrocavity environments to enhance exciton mobility in light-harvesting\nsystems and related photonic applications.",
            "pdf_url": "http://arxiv.org/pdf/2504.02066v2",
            "published": "2025-04-02 18:58:17+00:00",
            "updated": "2025-04-04 16:37:12+00:00"
        },
        {
            "title": "String theory in twistor space and minimal tension holography",
            "authors": "N. M. McStay, R. A. Reid-Edwards",
            "summary": "Explicit examples of the AdS/CFT correspondence where both bulk and boundary\ntheories are tractable are hard to come by, but the minimal tension string on\n$AdS_3 \\times S^3 \\times T^4$ is one notable example. In this paper, we discuss\nhow one can construct sigma models on twistor space, with a particular focus on\napplying these techniques to the aforementioned string theory. We derive novel\nincidence relations, which allow us to understand to what extent the minimal\ntension string encodes information about the bulk. We identify vertex operators\nin terms of bulk twistor variables and a map from twistor space to spacetime is\npresented. We also demonstrate the presence of a partially broken global\nsupersymmetry algebra in the minimal tension string and we argue that this\nimplies that there exists an $\\mathcal{N} = 2$ formulation of the theory. The\nimplications of this are studied and we demonstrate the presence of an\nadditional constraint on physical states.",
            "pdf_url": "http://arxiv.org/pdf/2411.08836v2",
            "published": "2024-11-13 18:17:12+00:00",
            "updated": "2025-04-04 15:58:52+00:00"
        },
        {
            "title": "A gas-surface interaction algorithm for discrete velocity methods in predicting rarefied and multi-scale flows: For Maxwell boundary model",
            "authors": "Jianfeng Chen, Sha Liu, Yong Wang, Congshan Zhuo, Yanguang Yang, Chengwen Zhong",
            "summary": "The rarefied flow and multi-scale flow are crucial for the aerodynamic design\nof spacecraft, ultra-low orbital vehicles and plumes. By introducing a discrete\nvelocity space, the discrete velocity method (DVM) and unified methods can\ncapture complex and non-equilibrium distribution functions and describe flow\nbehaviors exactly. The unified methods predict flows from continuum to rarefied\nregimes by adopting unified modeling, and they can be further applied to other\nmulti-scale physics such as radiation heat transfer, phonon heat transfer and\nplasma. In the flow field, the concrete dynamic process needs to describe the\ngas-gas interaction and gas-surface interaction (GSI). However, in both DVM and\nunified methods, only a simple but not accurate GSI is used, which can be\nregarded as a Maxwell GSI with a fixed accommodation coefficient of 1 (full\naccommodation) at the present stage. To overcome the bottleneck in extending\nDVM and unified methods to the numerical experiment and investigate real\nmulti-scale flow physics, this paper realizes precise GSI in the DVM framework\nby constructing the boundary conditions of a concrete Maxwell GSI with an\nadjustable accommodation coefficient. In the constructing process, the problems\nof macro-conservation and micro-consistency in the DVS at the boundary are well\nsolved by reflected macroscopic flux and interpolation distribution function\nand interpolation error correction, respectively. Meanwhile, considering that\nthe multi-scale flows in the background of aeronautics and aerospace are often\nat supersonic and hypersonic speeds, the unstructured velocity space (UVS) is\nessential. From the perspective of generality, the GSI is forced on UVS.\nBesides, by combined with the unified method (the unified gas-kinetic scheme in\nthe paper), the effectiveness and validity of the present GSI on the DVM\nframework are verified by a series of simulations.",
            "pdf_url": "http://arxiv.org/pdf/2208.13992v4",
            "published": "2022-08-30 05:13:46+00:00",
            "updated": "2025-04-04 15:50:58+00:00"
        },
        {
            "title": "A novel Cercignani-Lampis boundary model for discrete velocity methods in predicting rarefied and multi-scale flows",
            "authors": "Jianfeng Chen, Sha Liu, Rui Zhang, Hao Jin, Congshan Zhuo, Ming Fang, Yanguang Yang, Chengwen Zhong",
            "summary": "To extend the discrete velocity method (DVM) and unified methods to more\nrealistic boundary conditions, a Cercignani-Lampis (CL) boundary with different\nmomentum and thermal energy accommodations is proposed and integrated into the\nDVM framework. By giving the macroscopic flux from the numerical quadrature of\nthe incident molecular distribution, the reflected macroscopic flux can be\nobtained for the given accommodation coefficients. Then, an anisotropic\nGaussian distribution can be found for the reflected molecules, whose\nparameters are determined by the calculated reflected macroscopic flux. These\nmacroscopic flux and microscopic Gaussian distribution form a complete physical\nprocess for the reflected molecules. Furthermore, the CL boundary is integrated\ninto the unified gas-kinetic scheme (UGKS), making it suitable for the\nsimulation of both monatomic and diatomic gas flows, and it accommodates both\nthe conventional Cartesian velocity space and the recently developed efficient\nunstructured velocity space. Moreover, this new GSI boundary is suitable for\nboth explicit and implicit schemes, offering better performance for flow\nprediction. Finally, the performance of the new boundary is validated through a\nseries of numerical tests covering a wide range of Knudsen and Mach numbers.",
            "pdf_url": "http://arxiv.org/pdf/2406.09636v4",
            "published": "2024-06-13 23:59:16+00:00",
            "updated": "2025-04-04 15:33:40+00:00"
        },
        {
            "title": "IR finite correlation functions in de Sitter space, a smooth massless limit, and an autonomous equation",
            "authors": "Alexander Kamenshchik, Polina Petriakova",
            "summary": "We explore two-point and four-point correlation functions of a massive scalar\nfield on the flat de Sitter background in the long-wavelength approximation. By\nemploying the Yang-Feldman-type equation, we compute the two-point correlation\nfunction up to the $\\lambda^3$ order and the four-point correlation function up\nto the $\\lambda^2$ one. In contrast to the standard theory of a massive scalar\nfield based on the de Sitter-invariant vacuum, we develop the\nvacuum-independent reasoning that may not possess de Sitter invariance but\nresults in a smooth massless limit of the correlation function's infrared part.\nOur elaboration affords to calculate correlation functions of a free massive\nscalar field and to proceed with quantum corrections, relying only on the known\ntwo-point correlation function's infrared part of a free massless one.\nRemarkably, the two-point correlation function of a free massive scalar field\ncoincides with the Ornstein-Uhlenbeck stochastic process's one and has a clear\nphysical interpretation. We compared our results with those obtained with the\nSchwinger-Keldysh diagrammatic technique, Starobinsky's stochastic approach,\nand the Hartree-Fock approximation. At last, we have constructed a\nrenormalization group-inspired autonomous equation for the two-point\ncorrelation function. Integrating its approximate version, one obtains the\nnon-analytic expression with respect to a self-interaction coupling constant\n$\\lambda$. That solution reproduces the correct perturbative series up to the\ntwo-loop level. At the late-time limit, it almost coincides with the result of\nStarobinsky's stochastic approach in the whole interval of a new dimensionless\nparameter $0 \\leq \\tfrac{\\pi^2 m^4}{3\\lambda H^4} < \\infty$.",
            "pdf_url": "http://arxiv.org/pdf/2410.16226v3",
            "published": "2024-10-21 17:30:15+00:00",
            "updated": "2025-04-04 15:30:02+00:00"
        },
        {
            "title": "Observation of Temperature Effects in False Vacuum Decay",
            "authors": "Riccardo Cominotti, Cosetta Baroni, Chiara Rogora, Diego Andreoni, Giacomo Guarda, Giacomo Lamporesi, Gabriele Ferrari, Alessandro Zenesini",
            "summary": "Metastability is a phenomenon encountered in many different physical systems,\nranging from chemical reactions to magnetic structures. The characteristic\ndecay timescale from a metastable to a stable state is not always\nstraightforward to estimate since it depends on the microscopic details of the\nsystem. A paradigmatic example in quantum field theories is the decay of the\nfalse vacuum, manifested via the nucleation of bubbles. In this paper, we\nmeasure the temperature dependence of the timescale for the false vacuum decay\nmechanism in an ultracold atomic quantum spin mixture which exhibits\nferromagnetic properties. Our results show that the false vacuum decay rate\nscales with temperature as predicted by the finite-temperature extension of the\ninstanton theory, and confirm atomic systems as an ideal platform where to\nstudy out-of-equilibrium field theories.",
            "pdf_url": "http://arxiv.org/pdf/2504.03528v1",
            "published": "2025-04-04 15:28:41+00:00",
            "updated": "2025-04-04 15:28:41+00:00"
        },
        {
            "title": "Dynamic Training Enhances Machine Learning Potentials for Long-Lasting Molecular Dynamics",
            "authors": "Ivan Žugec, Tin Hadži Veljković, Maite Alducin, J. Iñaki Juaristi",
            "summary": "Molecular Dynamics (MD) simulations are vital for exploring complex systems\nin computational physics and chemistry. While machine learning methods\ndramatically reduce computational costs relative to ab initio methods, their\naccuracy in long-lasting simulations remains limited. Here we propose dynamic\ntraining (DT), a method designed to enhance model performance over extended MD\nsimulations. Applying DT to an equivariant graph neural network (EGNN) on the\nchallenging system of a hydrogen molecule interacting with a palladium cluster\nanchored to a graphene vacancy demonstrates a superior prediction accuracy\ncompared to conventional approaches. Crucially, the DT architecture-independent\ndesign ensures its applicability across diverse machine learning potentials,\nmaking it a practical tool for advancing MD simulations.",
            "pdf_url": "http://arxiv.org/pdf/2504.03521v1",
            "published": "2025-04-04 15:18:48+00:00",
            "updated": "2025-04-04 15:18:48+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Diffusion Active Learning: Towards Data-Driven Experimental Design in Computed Tomography",
            "authors": "Luis Barba, Johannes Kirschner, Tomas Aidukas, Manuel Guizar-Sicairos, Benjamín Béjar",
            "summary": "We introduce Diffusion Active Learning, a novel approach that combines\ngenerative diffusion modeling with data-driven sequential experimental design\nto adaptively acquire data for inverse problems. Although broadly applicable,\nwe focus on scientific computed tomography (CT) for experimental validation,\nwhere structured prior datasets are available, and reducing data requirements\ndirectly translates to shorter measurement times and lower X-ray doses. We\nfirst pre-train an unconditional diffusion model on domain-specific CT\nreconstructions. The diffusion model acts as a learned prior that is\ndata-dependent and captures the structure of the underlying data distribution,\nwhich is then used in two ways: It drives the active learning process and also\nimproves the quality of the reconstructions. During the active learning loop,\nwe employ a variant of diffusion posterior sampling to generate conditional\ndata samples from the posterior distribution, ensuring consistency with the\ncurrent measurements. Using these samples, we quantify the uncertainty in the\ncurrent estimate to select the most informative next measurement. Our results\nshow substantial reductions in data acquisition requirements, corresponding to\nlower X-ray doses, while simultaneously improving image reconstruction quality\nacross multiple real-world tomography datasets.",
            "pdf_url": "http://arxiv.org/pdf/2504.03491v1",
            "published": "2025-04-04 14:46:48+00:00",
            "updated": "2025-04-04 14:46:48+00:00"
        },
        {
            "title": "BUFF: Bayesian Uncertainty Guided Diffusion Probabilistic Model for Single Image Super-Resolution",
            "authors": "Zihao He, Shengchuan Zhang, Runze Hu, Yunhang Shen, Yan Zhang",
            "summary": "Super-resolution (SR) techniques are critical for enhancing image quality,\nparticularly in scenarios where high-resolution imagery is essential yet\nlimited by hardware constraints. Existing diffusion models for SR have relied\npredominantly on Gaussian models for noise generation, which often fall short\nwhen dealing with the complex and variable texture inherent in natural scenes.\nTo address these deficiencies, we introduce the Bayesian Uncertainty Guided\nDiffusion Probabilistic Model (BUFF). BUFF distinguishes itself by\nincorporating a Bayesian network to generate high-resolution uncertainty masks.\nThese masks guide the diffusion process, allowing for the adjustment of noise\nintensity in a manner that is both context-aware and adaptive. This novel\napproach not only enhances the fidelity of super-resolved images to their\noriginal high-resolution counterparts but also significantly mitigates\nartifacts and blurring in areas characterized by complex textures and fine\ndetails. The model demonstrates exceptional robustness against complex noise\npatterns and showcases superior adaptability in handling textures and edges\nwithin images. Empirical evidence, supported by visual results, illustrates the\nmodel's robustness, especially in challenging scenarios, and its effectiveness\nin addressing common SR issues such as blurring. Experimental evaluations\nconducted on the DIV2K dataset reveal that BUFF achieves a notable improvement,\nwith a +0.61 increase compared to baseline in SSIM on BSD100, surpassing\ntraditional diffusion approaches by an average additional +0.20dB PSNR gain.\nThese findings underscore the potential of Bayesian methods in enhancing\ndiffusion processes for SR, paving the way for future advancements in the\nfield.",
            "pdf_url": "http://arxiv.org/pdf/2504.03490v1",
            "published": "2025-04-04 14:43:45+00:00",
            "updated": "2025-04-04 14:43:45+00:00"
        },
        {
            "title": "Conditioning Diffusions Using Malliavin Calculus",
            "authors": "Jakiw Pidstrigach, Elizabeth Baker, Carles Domingo-Enrich, George Deligiannidis, Nikolas Nüsken",
            "summary": "In stochastic optimal control and conditional generative modelling, a central\ncomputational task is to modify a reference diffusion process to maximise a\ngiven terminal-time reward. Most existing methods require this reward to be\ndifferentiable, using gradients to steer the diffusion towards favourable\noutcomes. However, in many practical settings, like diffusion bridges, the\nreward is singular, taking an infinite value if the target is hit and zero\notherwise. We introduce a novel framework, based on Malliavin calculus and\npath-space integration by parts, that enables the development of methods robust\nto such singular rewards. This allows our approach to handle a broad range of\napplications, including classification, diffusion bridges, and conditioning\nwithout the need for artificial observational noise. We demonstrate that our\napproach offers stable and reliable training, outperforming existing\ntechniques.",
            "pdf_url": "http://arxiv.org/pdf/2504.03461v1",
            "published": "2025-04-04 14:10:21+00:00",
            "updated": "2025-04-04 14:10:21+00:00"
        },
        {
            "title": "End-to-end Learning of Sparse Interventions on Activations to Steer Generation",
            "authors": "Pau Rodriguez, Michal Klein, Eleonora Gualdoni, Arno Blaas, Luca Zappella, Marco Cuturi, Xavier Suau",
            "summary": "The growing use of generative models in daily life calls for efficient\nmechanisms to control their generation, to e.g., produce safe content or\nprovide users with tools to explore style changes. Ideally, such mechanisms\nshould be cheap, both at train and inference time, while preserving output\nquality. Recent research has shown that such mechanisms can be obtained by\nintervening exclusively on model activations, with the goal of correcting\ndistributional differences between activations seen when using prompts from a\nsource vs. a target set (e.g., toxic and non-toxic sentences). While cheap,\nthese fast methods are inherently crude: their maps are tuned locally, not\naccounting for their impact on downstream layers, resulting in interventions\nthat cause unintended shifts when used out-of-sample. We propose in this work\nlinear end-to-end activation steering (LinEAS), an approach trained with a\nglobal loss that accounts simultaneously for all layerwise distributional\nshifts. In addition to being more robust, the loss used to train LinEAS can be\nregularized with sparsifying norms, which can automatically carry out neuron\nand layer selection. Empirically, LinEAS only requires a handful of samples to\nbe effective, and beats similar baselines on toxicity mitigation, while\nperforming on par with far more involved finetuning approaches. We show that\nLinEAS interventions can be composed, study the impact of sparsity on their\nperformance, and showcase applications in text-to-image diffusions.",
            "pdf_url": "http://arxiv.org/pdf/2503.10679v2",
            "published": "2025-03-11 14:09:04+00:00",
            "updated": "2025-04-04 11:17:20+00:00"
        },
        {
            "title": "Minority-Focused Text-to-Image Generation via Prompt Optimization",
            "authors": "Soobin Um, Jong Chul Ye",
            "summary": "We investigate the generation of minority samples using pretrained\ntext-to-image (T2I) latent diffusion models. Minority instances, in the context\nof T2I generation, can be defined as ones living on low-density regions of\ntext-conditional data distributions. They are valuable for various applications\nof modern T2I generators, such as data augmentation and creative AI.\nUnfortunately, existing pretrained T2I diffusion models primarily focus on\nhigh-density regions, largely due to the influence of guided samplers (like\nCFG) that are essential for high-quality generation. To address this, we\npresent a novel framework to counter the high-density-focus of T2I diffusion\nmodels. Specifically, we first develop an online prompt optimization framework\nthat encourages emergence of desired properties during inference while\npreserving semantic contents of user-provided prompts. We subsequently tailor\nthis generic prompt optimizer into a specialized solver that promotes\ngeneration of minority features by incorporating a carefully-crafted likelihood\nobjective. Extensive experiments conducted across various types of T2I models\ndemonstrate that our approach significantly enhances the capability to produce\nhigh-quality minority instances compared to existing samplers. Code is\navailable at https://github.com/soobin-um/MinorityPrompt.",
            "pdf_url": "http://arxiv.org/pdf/2410.07838v3",
            "published": "2024-10-10 11:56:09+00:00",
            "updated": "2025-04-04 10:37:36+00:00"
        }
    ]
}