{
    "Physics": [
        {
            "title": "Hyperbolic sine-Gordon model beyond the first threshold",
            "authors": "Tadahiro Oh, Younes Zine",
            "summary": "We study the hyperbolic sine-Gordon model, with a parameter $\\beta^2 > 0$,\nand its associated Gibbs dynamics on the two-dimensional torus. By introducing\na physical space approach to the Fourier restriction norm method and\nestablishing nonlinear dispersive smoothing for the imaginary multiplicative\nGaussian chaos, we construct invariant Gibbs dynamics for the hyperbolic\nsine-Gordon model beyond the first threshold $\\beta^2 = 2\\pi$. The\ndeterministic step of our argument hinges on establishing key bilinear\nestimates, featuring weighted bounds for a cone multiplier. Moreover, the\nprobabilistic component involves a careful analysis of the imaginary Gaussian\nmultiplicative chaos and reduces to integrating singularities along space-time\nlight cones. As a by-product of our proof, we identify $\\beta^2 = 6\\pi$ as a\ncritical threshold for the hyperbolic sine-Gordon model, which is quite\nsurprising given that the associated parabolic model has a critical threshold\nat $\\beta^2 =8\\pi$.",
            "pdf_url": "http://arxiv.org/pdf/2504.07944v1",
            "published": "2025-04-10 17:53:59+00:00",
            "updated": "2025-04-10 17:53:59+00:00"
        },
        {
            "title": "Riemann zeros and the KKR determinant",
            "authors": "Zongrui Pei",
            "summary": "We transform the counting function for the Riemann zeros into a\nKorringa-Kohn-Rostoker (KKR) determinant, assisted by Krein's theorem. This is\nbased on our observation that the function derived from a few methods can all\nbe recast into two terms: one corresponds to the scattering phase, and the\nother is similar to structure constants related to the Green function. We also\ndiscuss the possible physical realizations. Our method provides a new physical\npathway towards the solution of the Riemann hypothesis.",
            "pdf_url": "http://arxiv.org/pdf/2504.07928v1",
            "published": "2025-04-10 17:43:43+00:00",
            "updated": "2025-04-10 17:43:43+00:00"
        },
        {
            "title": "SKK groups of manifolds and non-unitary invertible TQFTs",
            "authors": "Renee S. Hoekzema, Luuk Stehouwer, Simona Veselá",
            "summary": "This work considers the computation of controllable cut-and-paste groups\n$\\mathrm{SKK}^{\\xi}_n$ of manifolds with tangential structure $\\xi:B_n\\to\nBO_n$. To this end, we apply the work of Galatius-Madsen-Tillman-Weiss, Genauer\nand Schommer-Pries, who showed that for a wide range of structures $\\xi$ these\ngroups fit into a short exact sequence that relates them to bordism groups of\n$\\xi$-manifolds with kernel generated by the disc-bounding $\\xi$-sphere. The\norder of this sphere can be computed by knowing the possible values of the\nEuler characteristic of $\\xi$-manifolds. We are thus led to address two key\nquestions: the existence of $\\xi$-manifolds with odd Euler characteristic of a\ngiven dimension and conditions for the exact sequence to admit a splitting. We\nresolve these questions in a wide range of cases.\n  $\\mathrm{SKK}$ groups are of interest in physics as they play a role in the\nclassification of non-unitary invertible topological quantum field theories,\nwhich classify anomalies and symmetry protected topological (SPT) phases of\nmatter. Applying our topological results, we give a complete classification of\nnon-unitary invertible topological quantum field theories in the tenfold way in\ndimensions 1-5.",
            "pdf_url": "http://arxiv.org/pdf/2504.07917v1",
            "published": "2025-04-10 17:32:26+00:00",
            "updated": "2025-04-10 17:32:26+00:00"
        },
        {
            "title": "Quantum Rods and Clock in a Gravitational Universe",
            "authors": "Hao Geng",
            "summary": "Local operators are the basic observables in quantum field theory which\nencode the physics observed by a local experimentalist. However, when gravity\nis dynamical, diffeomorphism symmetries are gauged which apparently obstructs a\nsensible definition of local operators, as different locations in spacetime are\nconnected by these gauged symmetries. This consideration brings in the puzzle\nof reconciling our empirical world with quantum gravity. Intuitively, this\npuzzle can be avoided using relatively defined observables when there exists a\nnatural reference system such as a distribution of galaxies in our universe.\nNevertheless, this intuition is classical as the rods and clock defined in this\nway may also have quantum fluctuations so it is not a priori clear if it can be\nrealized in the quantum regime. In this letter, we provide an affirmative\nanswer to this question. Interestingly, we notice that the quantum fluctuations\nof the reference system are in fact essential for the realization of the above\nintuition in the quantum regime.",
            "pdf_url": "http://arxiv.org/pdf/2412.03636v3",
            "published": "2024-12-04 19:00:00+00:00",
            "updated": "2025-04-10 17:23:36+00:00"
        },
        {
            "title": "Temporal Tensors and Quantum Shortcut Dynamics in a Supermaze of Multidimensional Time",
            "authors": "Koffka Khan",
            "summary": "We develop a theoretical framework that unifies concepts of multiple time\ndimensions, quantum shortcut dynamics, and complex topological structures\n('supermazes') to explore novel phenomena in quantum and classical systems. In\nparticular, we introduce a Temporal Tensor Formalism to describe\nmultidimensional time, define Quantum Shortcut Operators that enact\nnear-instantaneous state transitions, and incorporate these into a supermaze\ntopological model inspired by labyrinthine geometry and network complexity. We\nshow how this framework can give rise to surprising effects such as anomalous\nthermodynamic relaxation (analogous to the Mpemba effect) in quantum systems.\nTheoretical implications for quantum computing (including quantum cloud\nnetworks) are discussed, and connections are drawn to established mathematical\nparadoxes and physical principles.",
            "pdf_url": "http://arxiv.org/pdf/2504.07900v1",
            "published": "2025-04-10 16:19:56+00:00",
            "updated": "2025-04-10 16:19:56+00:00"
        },
        {
            "title": "The Constituent Quark Model",
            "authors": "D. R. Entem, F. Fernández, P. G. Ortega, J. Segovia",
            "summary": "In this chapter we give a pedagogical introduction to the constituent quark\nmodel. The explanation of magnetic moments of the nucleons was crucial to\nintroduce an effective quark mass for light quarks that nowadays are understood\nas an effect of Spontaneous Chiral Symmetry Breaking in QCD. We give an\noverview of the first applications of the model and an introduction to the most\nmodern developments studying states beyond the naive quark model as tetraquarks\nand pentaquarks.",
            "pdf_url": "http://arxiv.org/pdf/2504.07897v1",
            "published": "2025-04-10 16:14:37+00:00",
            "updated": "2025-04-10 16:14:37+00:00"
        },
        {
            "title": "Doubly Quantum Mechanics",
            "authors": "Vittorio D'Esposito, Giuseppe Fabiano, Domenico Frattulillo, Flavio Mercati",
            "summary": "Motivated by the expectation that relativistic symmetries might acquire\nquantum features in Quantum Gravity, we take the first steps towards a theory\nof ''Doubly'' Quantum Mechanics, a modification of Quantum Mechanics in which\nthe geometrical configurations of physical systems, measurement apparata, and\nreference frame transformations are themselves quantized and described by\n''geometry'' states in a Hilbert space. We develop the formalism for\nspin-$\\frac{1}{2}$ measurements by promoting the group of spatial rotations\n$SU(2)$ to the quantum group $SU_q(2)$ and generalizing the axioms of Quantum\nTheory in a covariant way. As a consequence of our axioms, the notion of\nprobability becomes a self-adjoint operator acting on the Hilbert space of\ngeometry states, hence acquiring novel non-classical features. After\nintroducing a suitable class of semi-classical geometry states, which describe\nnear-to-classical geometrical configurations of physical systems, we find that\nprobability measurements are affected, in these configurations, by intrinsic\nuncertainties stemming from the quantum properties of $SU_q(2)$. This feature\ntranslates into an unavoidable fuzziness for observers attempting to align\ntheir reference frames by exchanging qubits, even when the number of exchanged\nqubits approaches infinity, contrary to the standard $SU(2)$ case.",
            "pdf_url": "http://arxiv.org/pdf/2412.05997v3",
            "published": "2024-12-08 17:10:35+00:00",
            "updated": "2025-04-10 16:11:16+00:00"
        },
        {
            "title": "The Role of Buffer Gas in Shaping the D1 Line Spectrum of Potassium Vapour",
            "authors": "Sharaa A. Alqarni, Danielle Pizzey, Steven A Wrathmall, Ifan G Hughes",
            "summary": "In this study, we investigate the effect of buffer gas and magnetic field on\nthe spectral line shapes of the potassium D1 transition using sealed vapour\ncells filled with varying amounts of neon as a buffer gas. Employing a\ndual-temperature control system, we independently manipulate the cell body and\nstem temperatures to explore Doppler and collisional effects on the spectrum.\nOur results show how the Voigt spectral profile changes from Gaussian- to\nLorentzian-dominated forms due to pressure broadening and shifts caused by\ncollisions between potassium atoms and neon. Our measurements are in excellent\nagreement with the literature values for potassium-neon collisions. For the\nfirst time we were able to incorporate the buffer-gas shift and broadening into\nthe modified Voigt profile via the ElecSus code, and found excellent agreement\nbetween the predicted and measured line profiles. We also analyse the potassium\nD1 spectral lines in the hyperfine Paschen-Back regime using strong magnetic\nfields, demonstrating how Zeeman splitting modifies the pressure-broadened line\nshape. This work provides valuable insights into collision-induced broadening\nand shifts, enhancing our understanding of potassium spectroscopy and its\napplication in the development of advanced magneto-optical filters for solar\nphysics and other applications.",
            "pdf_url": "http://arxiv.org/pdf/2504.07888v1",
            "published": "2025-04-10 16:01:57+00:00",
            "updated": "2025-04-10 16:01:57+00:00"
        },
        {
            "title": "Self-Evaluated Expertise in experimental physics: a measure of students' physics self-recognition",
            "authors": "Michael F. J. Fox, Taylor O. Pomfret",
            "summary": "We introduce and theoretically justify a new measure of the self-recognition\ncomponent of student physics identity called Self-Evaluated Expertise (SEE).\nThis measure is constructed such that it can be extracted from existing\nresponses to the E-CLASS. In this work, we compare scores from SEE with the\ntraditional measure calculated from the E-CLASS, which probes student views\nabout experimental physics, to show that the SEE score is a quantitatively\ndifferent measure. Consequently, we show that student self-recognition\ndecreases from pre-instruction administration of the E-CLASS to the\npost-instruction administration when averaged across data from 494 courses\nhaving taken place between 2016--2019.",
            "pdf_url": "http://arxiv.org/pdf/2504.07885v1",
            "published": "2025-04-10 15:59:27+00:00",
            "updated": "2025-04-10 15:59:27+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "GenEAva: Generating Cartoon Avatars with Fine-Grained Facial Expressions from Realistic Diffusion-based Faces",
            "authors": "Hao Yu, Rupayan Mallick, Margrit Betke, Sarah Adel Bargal",
            "summary": "Cartoon avatars have been widely used in various applications, including\nsocial media, online tutoring, and gaming. However, existing cartoon avatar\ndatasets and generation methods struggle to present highly expressive avatars\nwith fine-grained facial expressions and are often inspired from real-world\nidentities, raising privacy concerns. To address these challenges, we propose a\nnovel framework, GenEAva, for generating high-quality cartoon avatars with\nfine-grained facial expressions. Our approach fine-tunes a state-of-the-art\ntext-to-image diffusion model to synthesize highly detailed and expressive\nfacial expressions. We then incorporate a stylization model that transforms\nthese realistic faces into cartoon avatars while preserving both identity and\nexpression. Leveraging this framework, we introduce the first expressive\ncartoon avatar dataset, GenEAva 1.0, specifically designed to capture 135\nfine-grained facial expressions, featuring 13,230 expressive cartoon avatars\nwith a balanced distribution across genders, racial groups, and age ranges. We\ndemonstrate that our fine-tuned model generates more expressive faces than the\nstate-of-the-art text-to-image diffusion model SDXL. We also verify that the\ncartoon avatars generated by our framework do not include memorized identities\nfrom fine-tuning data. The proposed framework and dataset provide a diverse and\nexpressive benchmark for future research in cartoon avatar generation.",
            "pdf_url": "http://arxiv.org/pdf/2504.07945v1",
            "published": "2025-04-10 17:54:02+00:00",
            "updated": "2025-04-10 17:54:02+00:00"
        },
        {
            "title": "Hodge Laplacians and Hodge Diffusion Maps",
            "authors": "Alvaro Almeida Gomez, Jorge Duque Franco",
            "summary": "We introduce Hodge Diffusion Maps, a novel manifold learning algorithm\ndesigned to analyze and extract topological information from high-dimensional\ndata-sets. This method approximates the exterior derivative acting on\ndifferential forms, thereby providing an approximation of the Hodge Laplacian\noperator. Hodge Diffusion Maps extend existing non-linear dimensionality\nreduction techniques, including vector diffusion maps, as well as the theories\nbehind diffusion maps and Laplacian Eigenmaps. Our approach captures\nhigher-order topological features of the data-set by projecting it into\nlower-dimensional Euclidean spaces using the Hodge Laplacian. We develop a\ntheoretical framework to estimate the approximation error of the exterior\nderivative, based on sample points distributed over a real manifold. Numerical\nexperiments support and validate the proposed methodology.",
            "pdf_url": "http://arxiv.org/pdf/2504.07910v1",
            "published": "2025-04-10 16:30:13+00:00",
            "updated": "2025-04-10 16:30:13+00:00"
        },
        {
            "title": "Revisiting Likelihood-Based Out-of-Distribution Detection by Modeling Representations",
            "authors": "Yifan Ding, Arturas Aleksandrauskas, Amirhossein Ahmadian, Jonas Unger, Fredrik Lindsten, Gabriel Eilertsen",
            "summary": "Out-of-distribution (OOD) detection is critical for ensuring the reliability\nof deep learning systems, particularly in safety-critical applications.\nLikelihood-based deep generative models have historically faced criticism for\ntheir unsatisfactory performance in OOD detection, often assigning higher\nlikelihood to OOD data than in-distribution samples when applied to image data.\nIn this work, we demonstrate that likelihood is not inherently flawed. Rather,\nseveral properties in the images space prohibit likelihood as a valid detection\nscore. Given a sufficiently good likelihood estimator, specifically using the\nprobability flow formulation of a diffusion model, we show that\nlikelihood-based methods can still perform on par with state-of-the-art methods\nwhen applied in the representation space of pre-trained encoders. The code of\nour work can be found at\n$\\href{https://github.com/limchaos/Likelihood-OOD.git}{\\texttt{https://github.com/limchaos/Likelihood-OOD.git}}$.",
            "pdf_url": "http://arxiv.org/pdf/2504.07793v1",
            "published": "2025-04-10 14:30:41+00:00",
            "updated": "2025-04-10 14:30:41+00:00"
        },
        {
            "title": "Diffusion-LAM: Probabilistic Limited Area Weather Forecasting with Diffusion",
            "authors": "Erik Larsson, Joel Oskarsson, Tomas Landelius, Fredrik Lindsten",
            "summary": "Machine learning methods have been shown to be effective for weather\nforecasting, based on the speed and accuracy compared to traditional numerical\nmodels. While early efforts primarily concentrated on deterministic\npredictions, the field has increasingly shifted toward probabilistic\nforecasting to better capture the forecast uncertainty. Most machine\nlearning-based models have been designed for global-scale predictions, with\nonly limited work targeting regional or limited area forecasting, which allows\nmore specialized and flexible modeling for specific locations. This work\nintroduces Diffusion-LAM, a probabilistic limited area weather model leveraging\nconditional diffusion. By conditioning on boundary data from surrounding\nregions, our approach generates forecasts within a defined area. Experimental\nresults on the MEPS limited area dataset demonstrate the potential of\nDiffusion-LAM to deliver accurate probabilistic forecasts, highlighting its\npromise for limited-area weather prediction.",
            "pdf_url": "http://arxiv.org/pdf/2502.07532v3",
            "published": "2025-02-11 13:15:16+00:00",
            "updated": "2025-04-10 12:10:33+00:00"
        },
        {
            "title": "GOLD: Graph Out-of-Distribution Detection via Implicit Adversarial Latent Generation",
            "authors": "Danny Wang, Ruihong Qiu, Guangdong Bai, Zi Huang",
            "summary": "Despite graph neural networks' (GNNs) great success in modelling\ngraph-structured data, out-of-distribution (OOD) test instances still pose a\ngreat challenge for current GNNs. One of the most effective techniques to\ndetect OOD nodes is to expose the detector model with an additional OOD\nnode-set, yet the extra OOD instances are often difficult to obtain in\npractice. Recent methods for image data address this problem using OOD data\nsynthesis, typically relying on pre-trained generative models like Stable\nDiffusion. However, these approaches require vast amounts of additional data,\nas well as one-for-all pre-trained generative models, which are not available\nfor graph data. Therefore, we propose the GOLD framework for graph OOD\ndetection, an implicit adversarial learning pipeline with synthetic OOD\nexposure without pre-trained models. The implicit adversarial training process\nemploys a novel alternating optimisation framework by training: (1) a latent\ngenerative model to regularly imitate the in-distribution (ID) embeddings from\nan evolving GNN, and (2) a GNN encoder and an OOD detector to accurately\nclassify ID data while increasing the energy divergence between the ID\nembeddings and the generative model's synthetic embeddings. This novel approach\nimplicitly transforms the synthetic embeddings into pseudo-OOD instances\nrelative to the ID data, effectively simulating exposure to OOD scenarios\nwithout auxiliary data. Extensive OOD detection experiments are conducted on\nfive benchmark graph datasets, verifying the superior performance of GOLD\nwithout using real OOD data compared with the state-of-the-art OOD exposure and\nnon-exposure baselines.",
            "pdf_url": "http://arxiv.org/pdf/2502.05780v2",
            "published": "2025-02-09 05:19:53+00:00",
            "updated": "2025-04-10 11:41:23+00:00"
        }
    ]
}