{
    "Physics": [
        {
            "title": "Suppression of errors in collectively coded information",
            "authors": "Martin J. Falk, Leon Zhou, Yoshiya J. Matsubara, Kabir Husain, Jack W. Szostak, Arvind Murugan",
            "summary": "Modern life largely transmits genetic information from mother to daughter\nthrough the duplication of single physically intact molecules that encode\ninformation. However, copying an extended molecule requires highly processive\ncopying machinery and high fidelity that scales with the genome size to avoid\nthe error catastrophe. Here, we explore these fidelity requirements in an\nalternative architecture, the virtual circular genome, in which no one physical\nmolecule encodes the full genetic information. Instead, information is encoded\nand transmitted in a collective of overlapping and interacting segments. Using\na model experimental system of a complex mixture of DNA oligos that can partly\nanneal and extend off each other, we find that mutant oligomers are suppressed\nrelative to a model without collective encoding. Through simulations and\ntheory, we show that this suppression of mutants can be explained by\ncompetition for productive binding partners. As a consequence, information can\nbe propagated robustly in a virtual circular genome even if the mutation rate\nis above the error catastrophe for a physically intact genome.",
            "pdf_url": "http://arxiv.org/pdf/2508.21806v1",
            "published": "2025-08-29 17:39:29+00:00",
            "updated": "2025-08-29 17:39:29+00:00"
        },
        {
            "title": "DynaMark: A Reinforcement Learning Framework for Dynamic Watermarking in Industrial Machine Tool Controllers",
            "authors": "Navid Aftabi, Abhishek Hanchate, Satish Bukkapatnam, Dan Li",
            "summary": "Industry 4.0's highly networked Machine Tool Controllers (MTCs) are prime\ntargets for replay attacks that use outdated sensor data to manipulate\nactuators. Dynamic watermarking can reveal such tampering, but current schemes\nassume linear-Gaussian dynamics and use constant watermark statistics, making\nthem vulnerable to the time-varying, partly proprietary behavior of MTCs. We\nclose this gap with DynaMark, a reinforcement learning framework that models\ndynamic watermarking as a Markov decision process (MDP). It learns an adaptive\npolicy online that dynamically adapts the covariance of a zero-mean Gaussian\nwatermark using available measurements and detector feedback, without needing\nsystem knowledge. DynaMark maximizes a unique reward function balancing control\nperformance, energy consumption, and detection confidence dynamically. We\ndevelop a Bayesian belief updating mechanism for real-time detection confidence\nin linear systems. This approach, independent of specific system assumptions,\nunderpins the MDP for systems with linear dynamics. On a Siemens Sinumerik 828D\ncontroller digital twin, DynaMark achieves a reduction in watermark energy by\n70% while preserving the nominal trajectory, compared to constant variance\nbaselines. It also maintains an average detection delay equivalent to one\nsampling interval. A physical stepper-motor testbed validates these findings,\nrapidly triggering alarms with less control performance decline and exceeding\nexisting benchmarks.",
            "pdf_url": "http://arxiv.org/pdf/2508.21797v1",
            "published": "2025-08-29 17:24:00+00:00",
            "updated": "2025-08-29 17:24:00+00:00"
        },
        {
            "title": "Road map for the tuning of hadronic interaction models with accelerator-based and astroparticle data",
            "authors": "Johannes Albrecht, Julia Becker Tjus, Noah Behling, Jiří Blažek, Marcus Bleicher, Julian Boelhauve, Lorenzo Cazon, Ruben Conceição, Hans Dembinski, Luca Dietrich, Jan Ebr, Jan Ellbracht, Ralph Engel, Anatoli Fedynitch, Max Fieg, Maria Garzelli, Chloé Gaudu, Giacomo Graziani, Pascal Gutjahr, Andreas Haungs, Tim Huege, Karolin Hymon, Karl-Heinz Kampert, Leonora Kardum, Lars Kolk, Natalia Korneeva, Kevin Kröninger, Antonin Maire, Hiroaki Menjo, Leonel Morejon, Sergey Ostapchenko, Petja Paakkinen, Tanguy Pierog, Pavlo Plotko, Anton Prosekin, Lilly Pyras, Thomas Pöschl, Maximilian Reininghaus, Wolfgang Rhode, Felix Riehn, Markus Roth, Alexander Sandrock, Ina Sarcevic, Michael Schmelling, Günter Sigl, Torbjorn Sjöstrand, Dennis Soldin, Michael Unger, Marius Utheim, Jakub Vícha, Klaus Werner, Michael Windau, Valery Zhukov",
            "summary": "In high-energy and astroparticle physics, event generators play an essential\nrole, even in the simplest data analyses. As analysis techniques become more\nsophisticated, e.g. based on deep neural networks, their correct description of\nthe observed event characteristics becomes even more important. Physical\nprocesses occurring in hadronic collisions are simulated within a Monte Carlo\nframework. A major challenge is the modeling of hadron dynamics at low momentum\ntransfer, which includes the initial and final phases of every hadronic\ncollision. Phenomenological models inspired by Quantum Chromodynamics used for\nthese phases cannot guarantee completeness or correctness over the full phase\nspace. These models usually include parameters which must be tuned to suitable\nexperimental data. Until now, event generators have primarily been developed\nand tuned based on data from high-energy physics experiments at accelerators.\nHowever, in many cases they have been found to not satisfactorily describe data\nfrom astroparticle experiments, which provide sensitivity especially to hadrons\nproduced nearly parallel to the collision axis and cover center-of-mass\nenergies up to several hundred TeV, well beyond those reached at colliders so\nfar. In this report, we address the complementarity of these two sets of data\nand present a road map for exploiting, for the first time, their\ncomplementarity by enabling a unified tuning of event generators with\naccelerator-based and astroparticle data.",
            "pdf_url": "http://arxiv.org/pdf/2508.21796v1",
            "published": "2025-08-29 17:22:49+00:00",
            "updated": "2025-08-29 17:22:49+00:00"
        },
        {
            "title": "Experimental measurement of quantum-first-passage-time distributions",
            "authors": "Joseph M. Ryan, Simon Gorbaty, Thomas J. Kessler, Mitchell G. Peaks, Stephen W. Teitsworth, Crystal Noel",
            "summary": "Classical First-Passage-Time Distributions (FPTDs) have been extensively\nstudied both theoretically and experimentally. Their quantum counterparts,\nQuantum First-Passage-Time Distributions (QFPTDs), remain largely unexplored\nand have deep implications for both fundamental physics and the development of\nemerging quantum technologies. We measure the first QFPTDs using a motional\nmode of a single trapped ion. We develop a novel composite-phase laser pulse\nsequence to perform tunable stroboscopic projective measurements of the\nmotional state of a trapped ion. We measure QFPTDs of the ion energy when\ncoupled to electric-field noise and establish a clear connection with its\nclassical counterpart. The measurement protocol developed here is broadly\napplicable to other quantum systems and provides a powerful method for\nexploring a broad range of QFPTD phenomena. With these results we open a new\nfield of experimental investigations of QFPT processes with potential future\nrelevance to quantum search algorithms, unraveling connections between\nclassical and quantum dynamics, and study of the quantum measurement problem.",
            "pdf_url": "http://arxiv.org/pdf/2508.21790v1",
            "published": "2025-08-29 17:09:45+00:00",
            "updated": "2025-08-29 17:09:45+00:00"
        },
        {
            "title": "The Spontaneous Cascading Mechanism Behind Critical Phenomena in Self-Coupled Lasers",
            "authors": "Jiaoqing Wang, Yael Kfir-Cohen, Chenni Xu, Bnaya Gross, Aswathy Sundaresan, Shlomo Havlin, Patrick Sebbah",
            "summary": "The basic physics of lasers is characterized by a second-order continuous\nphase transition at the critical lasing threshold. Nevertheless, laser\nbistability with abrupt transitions has been reported in some laser systems,\nbut its underlying mechanism has never been explored. Here we study\nexperimentally and theoretically a novel nonlinearly self-coupled laser system.\nWe show both experimentally and theoretically that this system experiences\nspontaneous cascading that yields an abrupt mixed-order transition. At the\ncritical point, a long-lived cascading plateau is observed, characterized by a\ncritical branching factor equal to one. When deviating from criticality, the\nbranching factor departs monotonically from one. The critical scaling close to\nand at the critical point resembles similar phenomena observed recently in\nother interdependent systems, suggesting a common universal cascading origin\nfor abrupt transitions. Our results shed light on the cascading mechanism of\nabrupt transitions in laser systems, which can be utilized for future research\nand applications.",
            "pdf_url": "http://arxiv.org/pdf/2508.21786v1",
            "published": "2025-08-29 17:03:06+00:00",
            "updated": "2025-08-29 17:03:06+00:00"
        },
        {
            "title": "Implications of computer science theory for the simulation hypothesis",
            "authors": "David H. Wolpert",
            "summary": "The simulation hypothesis has recently excited renewed interest in the\nphysics and philosophy communities. However, the hypothesis specifically\nconcerns {\\textit{computers}} that simulate physical universes. So to formally\ninvestigate the hypothesis, we need to understand it in terms of computer\nscience (CS) theory. In addition we need a formal way to couple CS theory with\nphysics. Here I couple those fields by using the physical Church-Turing thesis.\nThis allow me to exploit Kleene's second recursion, to prove that not only is\nit possible for {us} to be a simulation being run on a computer, but that we\nmight be in a simulation being run a computer \\emph{by us}. In such a\n``self-simulation'', there would be two identical instances of us, both equally\n``real''. I then use Rice's theorem to derive impossibility results concerning\nsimulation and self-simulation; derive implications for (self-)simulation if we\nare being simulated in a program using fully homomorphic encryption; and\nbriefly investigate the graphical structure of universes simulating other\nuniverses which contain computers running their own simulations. I end by\ndescribing some of the possible avenues for future research. While motivated in\nterms of the simulation hypothesis, the results in this paper are direct\nconsequences of the Church-Turing thesis. So they apply far more broadly than\nthe simulation hypothesis.",
            "pdf_url": "http://arxiv.org/pdf/2404.16050v3",
            "published": "2024-04-09 18:39:46+00:00",
            "updated": "2025-08-29 17:00:16+00:00"
        },
        {
            "title": "Probing $a_0(1450)$-meson leading-twist distribution amplitude and its effects to $D\\to a_0(1450)\\ell ν_{\\ell}$",
            "authors": "Ya-Lin Song, Yin-Long Yang, Ye Cao, Xue Zheng, Hai-Bing Fu",
            "summary": "In this paper, we investigate the semileptonic decay $D \\to a_0(1450)\\ell\n\\nu_{\\ell}$ with $\\ell=(e, \\mu)$ using QCD light-cone sum rules. For the scalar\nmeson $a_0(1450)$, we treat it as a $q\\bar{q}$ state and construct two\ndistributed distribution schemes based on the light-cone harmonic oscillator\nmodel, then present their moments $\\langle\\xi^{n}_{2;a_0}\\rangle |_{\\mu}$ and\nGegenbauer moments $a_{n;a_0}(\\mu)$ at $\\mu_0=1~\\mathrm{GeV}$ and $\\mu_k=\n1.4~\\mathrm{GeV}$ for $n=(1,3,5)$. In the large recoil region, we obtain the\ntransition form factors (TFFs): $f_+^{D\\to a_0({\\rm\nS1})}(0)=0.769_{-0.114}^{+0.103}$, $f_+^{D \\to a_0 ({\\rm\nS2})}(0)=0.738_{-0.108}^{+0.106}$ and $f_{-}^{D \\to\na_0}(0)=0.688_{-0.086}^{+0.081}$. A simplified $z(q^2, t)$-series expansion\nparametrization is used to extrapolate the TFFs to the full physical\n$q^2$-region. By taking $q^2=10^{-5} ~\\mathrm{GeV}^2$, we calculate the angular\ndistribution of the differential decay width ${d\\Gamma}/{d\\cos\\theta}$ over the\nrange $\\cos\\theta_{\\ell}\\in [-1,1]$. Subsequently, we obtained differential\ndecay widths and branching ratios for $D^0 \\to a_0(1450)^- \\ell^+ \\nu_{\\ell}$\nand $D^- \\to a_0(1450)^0 \\ell^- \\bar{\\nu}_{\\ell}$, with the branching ratios\nbeing of order $10^{-6}$. Finally, we analyze the three angular observables for\nthe semileptonic decay process $D^- \\to a_0(1450)^0 \\ell^- \\bar{\\nu}_{\\ell}$\nwith $\\ell=(e,\\mu)$, the forward-backward asymmetry $\\mathcal{A}_{\\rm{FB}}$,\nlepton polarization asymmetry $\\mathcal{A}_{\\lambda_\\ell}$ and the\n$q^2$-differential flat term $\\mathcal{F}_{\\mathrm{H}}$.",
            "pdf_url": "http://arxiv.org/pdf/2508.21750v1",
            "published": "2025-08-29 16:25:11+00:00",
            "updated": "2025-08-29 16:25:11+00:00"
        },
        {
            "title": "Factorization for Collider Dataspace Correlators",
            "authors": "Andrew J. Larkoski",
            "summary": "A metric on the space of collider physics data enables analysis of its\ngeometrical properties, like dimensionality or curvature, as well as\nquantifying the density with which a finite, discrete ensemble of data samples\nthe space. We provide the first systematically-improvable precision\ncalculations on this dataspace, presenting predictions resummed to\nnext-to-leading logarithmic accuracy, using the Spectral Energy Mover's\nDistance (SEMD) as its metric. This is accomplished by demonstration of\nfactorization of soft and collinear contributions to the metric at leading\npower and renormalization group evolution of the single-scale functions that\nare present in the factorization theorem. As applications of this general\nframework, we calculate the two-point correlator between pairs of jets on the\ndataspace, and the measure of the non-Gaussian fluctuations in a finite\ndataset. For the non-Gaussianities, our calculations validate the existence of\na universal structure that had been previously observed in simulated data. As\nbyproducts of this analysis, we also calculate the two-loop anomalous dimension\nof the SEMD metric and show that the original Energy Mover's Distance metric is\nidentical to the SEMD through next-to-next-to-leading logarithmic accuracy.",
            "pdf_url": "http://arxiv.org/pdf/2504.12380v3",
            "published": "2025-04-16 18:00:01+00:00",
            "updated": "2025-08-29 16:23:16+00:00"
        },
        {
            "title": "A lattice study of two dimensional SU(2) gauge theories with a single massless Majorana fermion",
            "authors": "Rajamani Narayanan, Ray Romero",
            "summary": "Massless overlap fermions in the real representation of two dimensional\n$SU(N_c)$ gauge theories exhibit a mod($2$) index due to the rigidity of its\nspectrum when viewed as a function of the background gauge field - lattice\ngauge fields on a periodic torus come under two classes; ones that have one set\nof chirally paired zero modes and ones that do not. Focusing on $SU(2)$ and a\nsingle Majorana fermion in an integer representation, $J$; we present numerical\nevidence that shows only one of these classes survives the continuum limit and\nthis depends on the boundary conditions of the fermion and the gauge field. As\nsuch, two of the four possible partition functions are zero in the continuum\nlimit. By defining modified partition functions which do not include the zero\nmodes of the overlap fermions in the fermion determinant, we are able to define\nan expectation value for a fermion bilinear as ratios of two mixed partition\nfunctions. This observable is referred to as the topological condensate and has\na non-zero expectation value on any finite physical torus and also has a\nnon-zero limit as the size of the torus is taken to infinity. We study the\nspectral density of fermions and the scaling of the lowest eigenvalue with the\nsize of the torus to show the absence of any spontaneous symmetry breaking but\nthe emergence of zero modes in the infinite volume limit where it is prohibited\nin finite volume. These results remain the same for $J = 1, 2, 3, 4$. These\nresults motivate us to propose an independent plaquette model which reproduces\nthe correct physics in the infinite volume limit using a single partition\nfunction.",
            "pdf_url": "http://arxiv.org/pdf/2508.05967v2",
            "published": "2025-08-08 02:59:33+00:00",
            "updated": "2025-08-29 16:15:04+00:00"
        },
        {
            "title": "Topological Magnon Frequency Combs",
            "authors": "Zhixiong Li, Xuejuan Liu, Zhejunyu Jin, Guanghua Guo, Xingen Zheng, Peng Yan",
            "summary": "Exploring the synergy between topological physics and nonlinear dynamics\nunveils profound insights into emergent states of matter. Inspired by recent\nexperimental demonstrations of topological frequency combs in photonics, we\ntheoretically introduce topological magnon frequency combs (MFCs) in a\ntwo-dimensional triangular skyrmion lattice. Computing the Chern numbers of\nmagnon bands reveals robust chiral edge states. Strikingly, these topological\nMFCs originate from nonlinear four-magnon scattering among the chiral edge\nmodes, activated by dual-frequency driving without an amplitude threshold. Comb\nspacings are readily tunable through excitation frequency detuning.\nMicromagnetic simulations validate our predictions with good concordance. This\nwork paves the way for defect-immune magnonic devices exploiting MFCs and\nsparks investigations into topological-nonlinear phenomena in magnetic systems.",
            "pdf_url": "http://arxiv.org/pdf/2508.21743v1",
            "published": "2025-08-29 16:11:49+00:00",
            "updated": "2025-08-29 16:11:49+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Achieving Hilbert-Schmidt Independence Under Rényi Differential Privacy for Fair and Private Data Generation",
            "authors": "Tobias Hyrup, Emmanouil Panagiotou, Arjun Roy, Arthur Zimek, Eirini Ntoutsi, Peter Schneider-Kamp",
            "summary": "As privacy regulations such as the GDPR and HIPAA and responsibility\nframeworks for artificial intelligence such as the AI Act gain traction, the\nethical and responsible use of real-world data faces increasing constraints.\nSynthetic data generation has emerged as a promising solution to risk-aware\ndata sharing and model development, particularly for tabular datasets that are\nfoundational to sensitive domains such as healthcare. To address both privacy\nand fairness concerns in this setting, we propose FLIP (Fair Latent\nIntervention under Privacy guarantees), a transformer-based variational\nautoencoder augmented with latent diffusion to generate heterogeneous tabular\ndata. Unlike the typical setup in fairness-aware data generation, we assume a\ntask-agnostic setup, not reliant on a fixed, defined downstream task, thus\noffering broader applicability. To ensure privacy, FLIP employs R\\'enyi\ndifferential privacy (RDP) constraints during training and addresses fairness\nin the input space with RDP-compatible balanced sampling that accounts for\ngroup-specific noise levels across multiple sampling rates. In the latent\nspace, we promote fairness by aligning neuron activation patterns across\nprotected groups using Centered Kernel Alignment (CKA), a similarity measure\nextending the Hilbert-Schmidt Independence Criterion (HSIC). This alignment\nencourages statistical independence between latent representations and the\nprotected feature. Empirical results demonstrate that FLIP effectively provides\nsignificant fairness improvements for task-agnostic fairness and across diverse\ndownstream tasks under differential privacy constraints.",
            "pdf_url": "http://arxiv.org/pdf/2508.21815v1",
            "published": "2025-08-29 17:51:42+00:00",
            "updated": "2025-08-29 17:51:42+00:00"
        },
        {
            "title": "Tree-Guided Diffusion Planner",
            "authors": "Hyeonseong Jeon, Cheolhong Min, Jaesik Park",
            "summary": "Planning with pretrained diffusion models has emerged as a promising approach\nfor solving test-time guided control problems. However, standard gradient\nguidance typically performs optimally under convex and differentiable reward\nlandscapes, showing substantially reduced effectiveness in real-world scenarios\ninvolving non-convex objectives, non-differentiable constraints, and\nmulti-reward structures. Furthermore, recent supervised planning approaches\nrequire task-specific training or value estimators, which limits test-time\nflexibility and zero-shot generalization. We propose a Tree-guided Diffusion\nPlanner (TDP), a zero-shot test-time planning framework that balances\nexploration and exploitation through structured trajectory generation. We frame\ntest-time planning as a tree search problem using a bi-level sampling process:\n(1) diverse parent trajectories are produced via training-free particle\nguidance to encourage broad exploration, and (2) sub-trajectories are refined\nthrough fast conditional denoising guided by task objectives. TDP addresses the\nlimitations of gradient guidance by exploring diverse trajectory regions and\nharnessing gradient information across this expanded solution space using only\npretrained models and test-time reward signals. We evaluate TDP on three\ndiverse tasks: maze gold-picking, robot arm block manipulation, and AntMaze\nmulti-goal exploration. TDP consistently outperforms state-of-the-art\napproaches on all tasks. The project page can be found at:\ntree-diffusion-planner.github.io.",
            "pdf_url": "http://arxiv.org/pdf/2508.21800v1",
            "published": "2025-08-29 17:27:44+00:00",
            "updated": "2025-08-29 17:27:44+00:00"
        },
        {
            "title": "OptMark: Robust Multi-bit Diffusion Watermarking via Inference Time Optimization",
            "authors": "Jiazheng Xing, Hai Ci, Hongbin Xu, Hangjie Yuan, Yong Liu, Mike Zheng Shou",
            "summary": "Watermarking diffusion-generated images is crucial for copyright protection\nand user tracking. However, current diffusion watermarking methods face\nsignificant limitations: zero-bit watermarking systems lack the capacity for\nlarge-scale user tracking, while multi-bit methods are highly sensitive to\ncertain image transformations or generative attacks, resulting in a lack of\ncomprehensive robustness. In this paper, we propose OptMark, an\noptimization-based approach that embeds a robust multi-bit watermark into the\nintermediate latents of the diffusion denoising process. OptMark strategically\ninserts a structural watermark early to resist generative attacks and a detail\nwatermark late to withstand image transformations, with tailored regularization\nterms to preserve image quality and ensure imperceptibility. To address the\nchallenge of memory consumption growing linearly with the number of denoising\nsteps during optimization, OptMark incorporates adjoint gradient methods,\nreducing memory usage from O(N) to O(1). Experimental results demonstrate that\nOptMark achieves invisible multi-bit watermarking while ensuring robust\nresilience against valuemetric transformations, geometric transformations,\nediting, and regeneration attacks.",
            "pdf_url": "http://arxiv.org/pdf/2508.21727v1",
            "published": "2025-08-29 15:50:59+00:00",
            "updated": "2025-08-29 15:50:59+00:00"
        },
        {
            "title": "From stability of Langevin diffusion to convergence of proximal MCMC for non-log-concave sampling",
            "authors": "Marien Renaud, Valentin De Bortoli, Arthur Leclaire, Nicolas Papadakis",
            "summary": "We consider the problem of sampling distributions stemming from non-convex\npotentials with Unadjusted Langevin Algorithm (ULA). We prove the stability of\nthe discrete-time ULA to drift approximations under the assumption that the\npotential is strongly convex at infinity. In many context, e.g. imaging inverse\nproblems, potentials are non-convex and non-smooth. Proximal Stochastic\nGradient Langevin Algorithm (PSGLA) is a popular algorithm to handle such\npotentials. It combines the forward-backward optimization algorithm with a ULA\nstep. Our main stability result combined with properties of the Moreau envelope\nallows us to derive the first proof of convergence of the PSGLA for non-convex\npotentials. We empirically validate our methodology on synthetic data and in\nthe context of imaging inverse problems. In particular, we observe that PSGLA\nexhibits faster convergence rates than Stochastic Gradient Langevin Algorithm\nfor posterior sampling while preserving its restoration properties.",
            "pdf_url": "http://arxiv.org/pdf/2505.14177v2",
            "published": "2025-05-20 10:29:57+00:00",
            "updated": "2025-08-29 14:17:23+00:00"
        }
    ]
}