{
    "Physics": [
        {
            "title": "WGAST: Weakly-Supervised Generative Network for Daily 10 m Land Surface Temperature Estimation via Spatio-Temporal Fusion",
            "authors": "Sofiane Bouaziz, Adel Hafiane, Raphael Canals, Rachid Nedjai",
            "summary": "Urbanization, climate change, and agricultural stress are increasing the\ndemand for precise and timely environmental monitoring. Land Surface\nTemperature (LST) is a key variable in this context and is retrieved from\nremote sensing satellites. However, these systems face a trade-off between\nspatial and temporal resolution. While spatio-temporal fusion methods offer\npromising solutions, few have addressed the estimation of daily LST at 10 m\nresolution. In this study, we present WGAST, a Weakly-Supervised Generative\nNetwork for Daily 10 m LST Estimation via Spatio-Temporal Fusion of Terra\nMODIS, Landsat 8, and Sentinel-2. WGAST is the first end-to-end deep learning\nframework designed for this task. It adopts a conditional generative\nadversarial architecture, with a generator composed of four stages: feature\nextraction, fusion, LST reconstruction, and noise suppression. The first stage\nemploys a set of encoders to extract multi-level latent representations from\nthe inputs, which are then fused in the second stage using cosine similarity,\nnormalization, and temporal attention mechanisms. The third stage decodes the\nfused features into high-resolution LST, followed by a Gaussian filter to\nsuppress high-frequency noise. Training follows a weakly supervised strategy\nbased on physical averaging principles and reinforced by a PatchGAN\ndiscriminator. Experiments demonstrate that WGAST outperforms existing methods\nin both quantitative and qualitative evaluations. Compared to the\nbest-performing baseline, on average, WGAST reduces RMSE by 17.18% and improves\nSSIM by 11.00%. Furthermore, WGAST is robust to cloud-induced LST and\neffectively captures fine-scale thermal patterns, as validated against 33\nground-based sensors. The code is available at\nhttps://github.com/Sofianebouaziz1/WGAST.git.",
            "pdf_url": "http://arxiv.org/pdf/2508.06485v1",
            "published": "2025-08-08 17:49:46+00:00",
            "updated": "2025-08-08 17:49:46+00:00"
        },
        {
            "title": "Intuition emerges in Maximum Caliber models at criticality",
            "authors": "Lluís Arola-Fernández",
            "summary": "Whether large predictive models merely parrot their training data or produce\ngenuine insight lacks a physical explanation. This work reports a primitive\nform of intuition that emerges as a metastable phase of learning that\ncritically balances next-token prediction against future path-entropy. The\nintuition mechanism is discovered via mind-tuning, the minimal principle that\nimposes Maximum Caliber in predictive models with a control temperature-like\nparameter $\\lambda$. Training on random walks in deterministic mazes reveals a\nrich phase diagram: imitation (low $\\lambda$), rule-breaking hallucination\n(high $\\lambda$), and a fragile in-between window exhibiting strong\nprotocol-dependence (hysteresis) and multistability, where models spontaneously\ndiscover novel goal-directed strategies. These results are captured by an\neffective low-dimensional theory and frame intuition as an emergent property at\nthe critical balance between memorizing what is and wondering what could be.",
            "pdf_url": "http://arxiv.org/pdf/2508.06477v1",
            "published": "2025-08-08 17:27:41+00:00",
            "updated": "2025-08-08 17:27:41+00:00"
        },
        {
            "title": "Characterization and automated optimization of laser-driven proton beams from converging liquid sheet jet targets",
            "authors": "G. D. Glenn, F. Treffert, H. Ahmed, S. Astbury, M. Borghesi, N. Bourgeois, C. B. Curry, S. J. D. Dann, S. DiIorio, N. P. Dover, T. Dzelzainis, O. Ettlinger, M. Gauthier, L. Giuffrida, R. J. Gray, J. S. Green, G. S. Hicks, C. Hyland, V. Istokskaia, M. King, B. Loughran, D. Margarone, O. McCusker, P. McKenna, Z. Najmudin, C. Parisuaña, P. Parsons, C. Spindloe, M. J. V. Streeter, D. R. Symes, A. G. R. Thomas, N. Xu, S. H. Glenzer, C. A. J. Palmer",
            "summary": "Compact, stable, and versatile laser-driven ion sources hold great promise\nfor applications ranging from medicine to materials science and fundamental\nphysics. While single-shot sources have demonstrated favorable beam properties,\nincluding the peak fluxes necessary for several applications, high repetition\nrate operation will be necessary to generate and sustain the high average flux\nneeded for many of the most exciting applications of laser-driven ion sources.\nFurther, to navigate through the high-dimensional space of laser and target\nparameters towards experimental optima, it is essential to develop ion\nacceleration platforms compatible with machine learning learning techniques and\ncapable of autonomous real-time optimization. Here we present a multi-Hz ion\nacceleration platform employing a liquid sheet jet target. We characterize the\nlaser-plasma interaction and the laser-driven proton beam across a variety of\nkey parameters governing the interaction using an extensive suite of online\ndiagnostics. We also demonstrate real-time, closed-loop optimization of the ion\nbeam maximum energy by tuning the laser wavefront using a Bayesian optimization\nscheme. This approach increased the maximum proton energy by 11% compared to a\nmanually-optimized wavefront by enhancing the energy concentration within the\nlaser focal spot, demonstrating the potential for closed-loop optimization\nschemes to tune future ion accelerators for robust high repetition rate\noperation.",
            "pdf_url": "http://arxiv.org/pdf/2508.06462v1",
            "published": "2025-08-08 17:11:00+00:00",
            "updated": "2025-08-08 17:11:00+00:00"
        },
        {
            "title": "Entanglement-Based Artificial Topology: Neighboring Remote Network Nodes",
            "authors": "SiYi Chen, Jessica Illiano, Angela Sara Cacciapuoti, Marcello Caleffi",
            "summary": "Entanglement is unanimously recognized as the key communication resource of\nthe Quantum Internet. Yet, the possibility of implementing novel network\nfunctionalities by exploiting the marvels of entanglement has been poorly\ninvestigated so far, by mainly restricting the attention to bipartite\nentanglement. Conversely, in this paper, we aim at exploiting multipartite\nentanglement as inter-network resource. Specifically, we consider the\ninterconnection of different Quantum Local Area Networks (QLANs), and we show\nthat multipartite entanglement allows to dynamically generate an inter-QLAN\nartificial topology, by means of local operations only, that overcomes the\nlimitations of the physical QLAN topologies. To this aim, we first design the\nmultipartite entangled state to be distributed within each QLAN. Then, we show\nhow such a state can be engineered to: i) interconnect nodes belonging to\ndifferent QLANs, and ii) dynamically adapt to different inter-QLAN traffic\npatterns. Our contribution aims at providing the network engineering community\nwith a hands-on guideline towards the concept of artificial topology and\nartificial neighborhood.",
            "pdf_url": "http://arxiv.org/pdf/2404.16204v4",
            "published": "2024-04-24 20:58:50+00:00",
            "updated": "2025-08-08 17:08:29+00:00"
        },
        {
            "title": "Learning interactions between Rydberg atoms",
            "authors": "Olivier Simard, Anna Dawid, Joseph Tindall, Michel Ferrero, Anirvan M. Sengupta, Antoine Georges",
            "summary": "Quantum simulators have the potential to solve quantum many-body problems\nthat are beyond the reach of classical computers, especially when they feature\nlong-range entanglement. To fulfill their prospects, quantum simulators must be\nfully controllable, allowing for precise tuning of the microscopic physical\nparameters that define their implementation. We consider Rydberg-atom arrays, a\npromising platform for quantum simulations. Experimental control of such arrays\nis limited by the imprecision on the optical tweezers positions when assembling\nthe array, hence introducing uncertainties in the simulated Hamiltonian. In\nthis work, we introduce a scalable approach to Hamiltonian learning using graph\nneural networks (GNNs). We employ the Density Matrix Renormalization Group\n(DMRG) to generate ground-state snapshots of the transverse field Ising model\nrealized by the array, for many realizations of the Hamiltonian parameters.\nCorrelation functions reconstructed from these snapshots serve as input data to\ncarry out the training. We demonstrate that our GNN model has a remarkable\ncapacity to extrapolate beyond its training domain, both regarding the size and\nthe shape of the system, yielding an accurate determination of the Hamiltonian\nparameters with a minimal set of measurements. We prove a theorem establishing\na bijective correspondence between the correlation functions and the\ninteraction parameters in the Hamiltonian, which provides a theoretical\nfoundation to our learning algorithm. Our work could open the road to feedback\ncontrol of the positions of the optical tweezers, hence providing a decisive\nimprovement of analog quantum simulators.",
            "pdf_url": "http://arxiv.org/pdf/2412.12019v2",
            "published": "2024-12-16 17:45:30+00:00",
            "updated": "2025-08-08 17:02:32+00:00"
        },
        {
            "title": "Nonreciprocal and Geometric Frustration in Dissipative Quantum Spins",
            "authors": "Guitao Lyu, Myung-Joong Hwang",
            "summary": "Nonreciprocal interactions often create conflicting dynamical objectives that\ncannot be simultaneously satisfied, leading to nonreciprocal frustration. On\nthe other hand, geometric frustration arises when conflicting static objectives\nin energy minimization cannot be satisfied. In this work, we show that\nnonreciprocal interaction among three collective quantum spins, mediated by a\ndamped cavity, induces not only nonreciprocal frustration, intrinsic to\nnonreciprocity, but also geometric frustration with a remarkable robustness\nagainst disorder. It therefore ensures that the accidental degeneracy for\nsteady states remains intact even when the system is perturbed away from a\nfine-tuned point of enhanced symmetry, in sharp contrast to the equilibrium\ncase. Leveraging this finding, we identify a nonreciprocal phase transition\ndriven by both geometric and nonreciprocal frustration. It gives rise to a\ntime-dependent state, which shows a chiral dynamics along a geometry shaped by\nthe geometric frustration and dynamically restores the broken discrete\nsymmetries. Moreover, it constitutes a time-crystalline order, with multiple\nharmonics set by an emergent time scale that exhibits critical slowing down.\nOur predictions have important physical implications for a three-component\nspinor BEC-cavity system, which manifest as a geometric frustration in the\nstructural phase transition and chiral dynamics of the frustrated\nself-organized BECs. We demonstrate the feasibility of experimental observation\ndespite the presence of disorder in the spin-cavity coupling strengths.",
            "pdf_url": "http://arxiv.org/pdf/2508.06444v1",
            "published": "2025-08-08 16:37:12+00:00",
            "updated": "2025-08-08 16:37:12+00:00"
        },
        {
            "title": "Perturbative unitarity bounds from momentum-space entanglement",
            "authors": "Carlos Duaso Pueyo, Harry Goodhew, Ciaran McCulloch, Enrico Pajer",
            "summary": "Physical theories have a limited regime of validity and hence must be\naccompanied by a breakdown diagnostic to establish when they cease to be valid\nas parameters are varied. For perturbative theories, estimates of the first\nneglected order offer valuable guidance, but one is often interested in sharp\nbounds beyond which perturbation theory necessarily fails. In particle physics,\nit is common to employ the bounds on partial waves imposed by unitarity as such\na diagnostic. Unfortunately, these bounds don't extend to curved spacetime,\nwhere scattering experiments are challenging to define. Here, we propose to use\nthe growth of entanglement in momentum space as a breakdown diagnostic for\nperturbation theory in general field theories. This diagnostic can be readily\nused in cosmological spacetimes and does not require any flat spacetime limit.\nMore in detail, we consider the so-called purity of the reduced density\noperator constructed by tracing out all but one of the Fourier modes in an\neffective theory and we present a diagrammatic technique to compute it\nperturbatively. Constraints on the regime of validity of perturbation theory\nare then derived when the perturbative purity violates its unitarity bounds.\n  In flat spacetime, we compare these purity bounds to those from partial\nwaves. We find general qualitative agreement but with remarkable differences:\npurity bounds can be sometimes weaker, but other times they exist when no\npartial wave bounds exist. We then derive purity bounds for scalar field\ntheories in de Sitter spacetime for a variety of interactions that appear in\ninflationary models. Importantly, our bounds make no reference to time\nevolution and in de Sitter they depend exclusively on scale-invariant ratios of\nthe physical kinematics.",
            "pdf_url": "http://arxiv.org/pdf/2410.23709v2",
            "published": "2024-10-31 07:52:33+00:00",
            "updated": "2025-08-08 16:35:46+00:00"
        },
        {
            "title": "Optoelectronic Physical Unclonable Functions and Reservoir-Inspired Computation with Low Symmetry Integrated Photonics",
            "authors": "Farhan Bin Tarik, Yingjie Lao, Mustafa Hammood, Jonathan Barnes, Madeline Mahanloo, Lukas Chrostowski, Taufiquar Khan, Judson D. Ryckman",
            "summary": "Structural symmetry in photonics has long been exploited to engineer devices\nwith predictable, analytically describable behaviors. Yet this predictability\noften limits their expressivity, constraining complex interactions essential\nfor advanced functionalities in computing, sensing, and security. Here we\ndemonstrate how low symmetry integrated photonic circuits can unlock enhanced\nmode diversity and rich spectral complexity, enabling highly non-linear\ntransformations of input signals into outputs. Our devices, physically\nunclonable moir\\'e quasicrystal interferometers integrated on a silicon\nphotonics platform, exhibit aperiodic and reconfigurable spectral responses and\nare characterized by analyticity breaking and erasable mutual information.\nUsing dynamic thermo-optic control to drive their complex spectral dynamics, we\ndemonstrate that these devices function as reconfigurable physical unclonable\nfunctions (rPUFs). We also highlight their ability to perform high-dimensional\ninput--output transformations, emulating reservoir-inspired information\nprocessing in a compact photonic platform. This work bridges the gap between\nengineered and natural complexity in photonic systems, revealing new\nopportunities for scalable, energy-efficient, and information-dense\nopto-electronics with applications in secure communications, hardware security,\nadvanced sensing, and optical information processing. Our results establish\nlow-symmetry integrated photonics as a powerful resource for complex signal\nmanipulation in photonic systems.",
            "pdf_url": "http://arxiv.org/pdf/2507.06473v2",
            "published": "2025-07-09 01:22:40+00:00",
            "updated": "2025-08-08 16:34:02+00:00"
        },
        {
            "title": "Single photon emission from lithographically-positioned engineered nanodiamonds for cryogenic applications",
            "authors": "Vivekanand Tiwari, Zhaojin Liu, Hao-Cheng Weng, Krishna C Balram, John G Rarity, Soumen Mandal, Oliver A Williams, Gavin W Morley, Joe A Smith",
            "summary": "Nitrogen-vacancy centres in nanodiamonds (NDs) provide a promising resource\nfor quantum photonic systems. However, developing a technology beyond\nproof-of-principle physics requires optimally engineering its component parts.\nIn this work, we present a hybrid materials platform by photolithographically\npositioning ball-milled isotopically-enriched NDs on broadband metal\nreflectors. The structure enhances the photonic collection efficiency, enabling\ncryogenic characterisation despite the limited numerical aperture imposed by\nour cryostat. Our device, with SiO$_2$ above a silver reflector, allows us to\nperform spectroscopic characterisation at 16 K and measure autocorrelation\nfunctions confirming single-photon emission (g$^2$(0)<0.5). Through comparative\nstudies of similar hybrid device configurations, we can move towards optimally\nengineered techniques for building and analysing quantum emitters in\nwafer-scale photonic environments.",
            "pdf_url": "http://arxiv.org/pdf/2508.06424v1",
            "published": "2025-08-08 16:11:41+00:00",
            "updated": "2025-08-08 16:11:41+00:00"
        },
        {
            "title": "Quantum Annealing for the Set Splitting Problem",
            "authors": "Sean Borneman",
            "summary": "I present a novel use of quantum annealing to solve the Set Splitting Problem\nusing (QUBO) problem formulation. The contribution of the work is in\nformulating penalty functions that ensure the ground state of the QUBO\nHamiltonian corresponds to valid solutions that split the input subsets. This\napproach scales linearly in terms of the number of logical qubits relative to\nproblem size. Empirical tests of the proposed solution show convergence to\nglobally optimal solutions, with high accuracy rates over repeated trials.\nHardware limitations of current quantum annealers lead to an exponential rise\nin required physical qubits, versus the theoretical linear increase, although\nthis can improve with future developments. Further work is needed to enhance\nformulation robustness, reduce qubit requirements for embedded problems, and to\nconduct more extensive bench-marking. Quantum solutions to the Set-Splitting\nproblem lead to reduced time complexity versus classical solutions, and may\naccelerate research in biology, cybersecurity, and other domains.",
            "pdf_url": "http://arxiv.org/pdf/2508.06410v1",
            "published": "2025-08-08 15:55:30+00:00",
            "updated": "2025-08-08 15:55:30+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "LaDi-WM: A Latent Diffusion-based World Model for Predictive Manipulation",
            "authors": "Yuhang Huang, JIazhao Zhang, Shilong Zou, XInwang Liu, Ruizhen Hu, Kai Xu",
            "summary": "Predictive manipulation has recently gained considerable attention in the\nEmbodied AI community due to its potential to improve robot policy performance\nby leveraging predicted states. However, generating accurate future visual\nstates of robot-object interactions from world models remains a well-known\nchallenge, particularly in achieving high-quality pixel-level representations.\nTo this end, we propose LaDi-WM, a world model that predicts the latent space\nof future states using diffusion modeling. Specifically, LaDi-WM leverages the\nwell-established latent space aligned with pre-trained Visual Foundation Models\n(VFMs), which comprises both geometric features (DINO-based) and semantic\nfeatures (CLIP-based). We find that predicting the evolution of the latent\nspace is easier to learn and more generalizable than directly predicting\npixel-level images. Building on LaDi-WM, we design a diffusion policy that\niteratively refines output actions by incorporating forecasted states, thereby\ngenerating more consistent and accurate results. Extensive experiments on both\nsynthetic and real-world benchmarks demonstrate that LaDi-WM significantly\nenhances policy performance by 27.9\\% on the LIBERO-LONG benchmark and 20\\% on\nthe real-world scenario. Furthermore, our world model and policies achieve\nimpressive generalizability in real-world experiments.",
            "pdf_url": "http://arxiv.org/pdf/2505.11528v2",
            "published": "2025-05-13 04:42:14+00:00",
            "updated": "2025-08-08 17:58:06+00:00"
        },
        {
            "title": "Conditional Diffusion Models are Medical Image Classifiers that Provide Explainability and Uncertainty for Free",
            "authors": "Gian Mario Favero, Parham Saremi, Emily Kaczmarek, Brennan Nichyporuk, Tal Arbel",
            "summary": "Discriminative classifiers have become a foundational tool in deep learning\nfor medical imaging, excelling at learning separable features of complex data\ndistributions. However, these models often need careful design, augmentation,\nand training techniques to ensure safe and reliable deployment. Recently,\ndiffusion models have become synonymous with generative modeling in 2D. These\nmodels showcase robustness across a range of tasks including natural image\nclassification, where classification is performed by comparing reconstruction\nerrors across images generated for each possible conditioning input. This work\npresents the first exploration of the potential of class conditional diffusion\nmodels for 2D medical image classification. First, we develop a novel majority\nvoting scheme shown to improve the performance of medical diffusion\nclassifiers. Next, extensive experiments on the CheXpert and ISIC Melanoma skin\ncancer datasets demonstrate that foundation and trained-from-scratch diffusion\nmodels achieve competitive performance against SOTA discriminative classifiers\nwithout the need for explicit supervision. In addition, we show that diffusion\nclassifiers are intrinsically explainable, and can be used to quantify the\nuncertainty of their predictions, increasing their trustworthiness and\nreliability in safety-critical, clinical contexts. Further information is\navailable on our project page:\nhttps://faverogian.github.io/med-diffusion-classifier.github.io/.",
            "pdf_url": "http://arxiv.org/pdf/2502.03687v2",
            "published": "2025-02-06 00:37:21+00:00",
            "updated": "2025-08-08 16:49:48+00:00"
        },
        {
            "title": "ActivityDiff: A diffusion model with Positive and Negative Activity Guidance for De Novo Drug Design",
            "authors": "Renyi Zhou, Huimin Zhu, Jing Tang, Min Li",
            "summary": "Achieving precise control over a molecule's biological activity-encompassing\ntargeted activation/inhibition, cooperative multi-target modulation, and\noff-target toxicity mitigation-remains a critical challenge in de novo drug\ndesign. However, existing generative methods primarily focus on producing\nmolecules with a single desired activity, lacking integrated mechanisms for the\nsimultaneous management of multiple intended and unintended molecular\ninteractions. Here, we propose ActivityDiff, a generative approach based on the\nclassifier-guidance technique of diffusion models. It leverages separately\ntrained drug-target classifiers for both positive and negative guidance,\nenabling the model to enhance desired activities while minimizing harmful\noff-target effects. Experimental results show that ActivityDiff effectively\nhandles essential drug design tasks, including single-/dual-target generation,\nfragment-constrained dual-target design, selective generation to enhance target\nspecificity, and reduction of off-target effects. These results demonstrate the\neffectiveness of classifier-guided diffusion in balancing efficacy and safety\nin molecular design. Overall, our work introduces a novel paradigm for\nachieving integrated control over molecular activity, and provides ActivityDiff\nas a versatile and extensible framework.",
            "pdf_url": "http://arxiv.org/pdf/2508.06364v1",
            "published": "2025-08-08 14:48:47+00:00",
            "updated": "2025-08-08 14:48:47+00:00"
        },
        {
            "title": "OM2P: Offline Multi-Agent Mean-Flow Policy",
            "authors": "Zhuoran Li, Xun Wang, Hai Zhong, Longbo Huang",
            "summary": "Generative models, especially diffusion and flow-based models, have been\npromising in offline multi-agent reinforcement learning. However, integrating\npowerful generative models into this framework poses unique challenges. In\nparticular, diffusion and flow-based policies suffer from low sampling\nefficiency due to their iterative generation processes, making them impractical\nin time-sensitive or resource-constrained settings. To tackle these\ndifficulties, we propose OM2P (Offline Multi-Agent Mean-Flow Policy), a novel\noffline MARL algorithm to achieve efficient one-step action sampling. To\naddress the misalignment between generative objectives and reward maximization,\nwe introduce a reward-aware optimization scheme that integrates a\ncarefully-designed mean-flow matching loss with Q-function supervision.\nAdditionally, we design a generalized timestep distribution and a\nderivative-free estimation strategy to reduce memory overhead and improve\ntraining stability. Empirical evaluations on Multi-Agent Particle and MuJoCo\nbenchmarks demonstrate that OM2P achieves superior performance, with up to a\n3.8x reduction in GPU memory usage and up to a 10.8x speed-up in training time.\nOur approach represents the first to successfully integrate mean-flow model\ninto offline MARL, paving the way for practical and scalable generative\npolicies in cooperative multi-agent settings.",
            "pdf_url": "http://arxiv.org/pdf/2508.06269v1",
            "published": "2025-08-08 12:38:56+00:00",
            "updated": "2025-08-08 12:38:56+00:00"
        },
        {
            "title": "Synthetic Data-Driven Multi-Architecture Framework for Automated Polyp Segmentation Through Integrated Detection and Mask Generation",
            "authors": "Ojonugwa Oluwafemi Ejiga Peter, Akingbola Oluwapemiisin, Amalahu Chetachi, Adeniran Opeyemi, Fahmi Khalifa, Md Mahmudur Rahman",
            "summary": "Colonoscopy is a vital tool for the early diagnosis of colorectal cancer,\nwhich is one of the main causes of cancer-related mortality globally; hence, it\nis deemed an essential technique for the prevention and early detection of\ncolorectal cancer. The research introduces a unique multidirectional\narchitectural framework to automate polyp detection within colonoscopy images\nwhile helping resolve limited healthcare dataset sizes and annotation\ncomplexities. The research implements a comprehensive system that delivers\nsynthetic data generation through Stable Diffusion enhancements together with\ndetection and segmentation algorithms. This detection approach combines Faster\nR-CNN for initial object localization while the Segment Anything Model (SAM)\nrefines the segmentation masks. The faster R-CNN detection algorithm achieved a\nrecall of 93.08% combined with a precision of 88.97% and an F1 score of\n90.98%.SAM is then used to generate the image mask. The research evaluated five\nstate-of-the-art segmentation models that included U-Net, PSPNet, FPN, LinkNet,\nand MANet using ResNet34 as a base model. The results demonstrate the superior\nperformance of FPN with the highest scores of PSNR (7.205893) and SSIM\n(0.492381), while UNet excels in recall (84.85%) and LinkNet shows balanced\nperformance in IoU (64.20%) and Dice score (77.53%).",
            "pdf_url": "http://arxiv.org/pdf/2508.06170v1",
            "published": "2025-08-08 09:37:03+00:00",
            "updated": "2025-08-08 09:37:03+00:00"
        }
    ]
}