{
    "Physics": [
        {
            "title": "Imagine, Verify, Execute: Memory-Guided Agentic Exploration with Vision-Language Models",
            "authors": "Seungjae Lee, Daniel Ekpo, Haowen Liu, Furong Huang, Abhinav Shrivastava, Jia-Bin Huang",
            "summary": "Exploration is essential for general-purpose robotic learning, especially in\nopen-ended environments where dense rewards, explicit goals, or task-specific\nsupervision are scarce. Vision-language models (VLMs), with their semantic\nreasoning over objects, spatial relations, and potential outcomes, present a\ncompelling foundation for generating high-level exploratory behaviors. However,\ntheir outputs are often ungrounded, making it difficult to determine whether\nimagined transitions are physically feasible or informative. To bridge the gap\nbetween imagination and execution, we present IVE (Imagine, Verify, Execute),\nan agentic exploration framework inspired by human curiosity. Human exploration\nis often driven by the desire to discover novel scene configurations and to\ndeepen understanding of the environment. Similarly, IVE leverages VLMs to\nabstract RGB-D observations into semantic scene graphs, imagine novel scenes,\npredict their physical plausibility, and generate executable skill sequences\nthrough action tools. We evaluate IVE in both simulated and real-world tabletop\nenvironments. The results show that IVE enables more diverse and meaningful\nexploration than RL baselines, as evidenced by a 4.1 to 7.8x increase in the\nentropy of visited states. Moreover, the collected experience supports\ndownstream learning, producing policies that closely match or exceed the\nperformance of those trained on human-collected demonstrations.",
            "pdf_url": "http://arxiv.org/pdf/2505.07815v1",
            "published": "2025-05-12 17:59:11+00:00",
            "updated": "2025-05-12 17:59:11+00:00"
        },
        {
            "title": "Exploring Potential Higgs Resonances at 650 GeV and 95 GeV in the 2HDM Type III",
            "authors": "Rachid Benbrik, Mohammed Boukidi, Khouloud Kahime, Stefano Moretti, Larbi Rahili, Bassim Taki",
            "summary": "Recent searches by the CMS collaboration at the Large Hadron Collider (LHC)\nin the `diphoton plus $b\\bar{b}$ final state' have revealed an excess near 650\nGeV, which might indicate the presence of a (broad) heavy resonance decaying\ninto a Standard Model (SM) Higgs boson and an additional particle. At the same\ntime, both ATLAS and CMS as well as all experiments at the Large\nElectron-Position (LEP) collider have reported excesses consistent with a light\nHiggs boson channel around 95 GeV, suggesting a potential connection between\nthese two signals. In this study, we investigate these anomalies within the\ncontext of the CP-conserving 2-Higgs-Doublet Model (2HDM) Type~III. In our\nproposed scenario, a heavy CP-odd Higgs boson $A$ with a mass near 650 GeV\ndecays into a SM-like Higgs boson $H$ and a $Z$ boson, with the $H$ boson\nsubsequently decaying into diphotons and the $Z$ boson decaying into $b\\bar{b}$\npairs. To explain the excess around 95 GeV, we independently select the mass of\nthe light CP-even Higgs boson of the model $h$ to be around this value. This\nconfiguration allows for a consistent explanation of both the high- and\nlow-mass excesses observed in the experiments. Through a detailed analysis, we\ndemonstrate that these two signals can be fitted simultaneously at the\n2.5$\\sigma$ significance level, offering a promising solution to the observed\nanomalies and potentially hinting at new physics Beyond the Standard Model\n(BSM).",
            "pdf_url": "http://arxiv.org/pdf/2505.07811v1",
            "published": "2025-05-12 17:57:45+00:00",
            "updated": "2025-05-12 17:57:45+00:00"
        },
        {
            "title": "Automatically Differentiable Model Updating (ADiMU): conventional, hybrid, and neural network material model discovery including history-dependency",
            "authors": "Bernardo P. Ferreira, Miguel A. Bessa",
            "summary": "We introduce the first Automatically Differentiable Model Updating (ADiMU)\nframework that finds any history-dependent material model from full-field\ndisplacement and global force data (global, indirect discovery) or from\nstrain-stress data (local, direct discovery). We show that ADiMU can update\nconventional (physics-based), neural network (data-driven), and hybrid material\nmodels. Moreover, this framework requires no fine-tuning of hyperparameters or\nadditional quantities beyond those inherent to the user-selected material model\narchitecture and optimizer. The robustness and versatility of ADiMU is\nextensively exemplified by updating different models spanning tens to millions\nof parameters, in both local and global discovery settings. Relying on fully\ndifferentiable code, the algorithmic implementation leverages vectorizing maps\nthat enable history-dependent automatic differentiation via efficient batched\nexecution of shared computation graphs. This contribution also aims to\nfacilitate the integration, evaluation and application of future material model\narchitectures by openly supporting the research community. Therefore, ADiMU is\nreleased as an open-source computational tool, integrated into a carefully\ndesigned and documented software named HookeAI.",
            "pdf_url": "http://arxiv.org/pdf/2505.07801v1",
            "published": "2025-05-12 17:49:54+00:00",
            "updated": "2025-05-12 17:49:54+00:00"
        },
        {
            "title": "Mixed state deep thermalization",
            "authors": "Xie-Hang Yu, Wen Wei Ho, Pavel Kos",
            "summary": "We introduce the notion of the mixed state projected ensemble (MSPE), a\ncollection of mixed states describing a local region of a quantum many-body\nsystem, conditioned upon measurements of the complementary region which are\nincomplete. This constitutes a generalization of the pure state projected\nensemble in which measurements are assumed ideal and complete, and which has\nbeen shown to tend towards limiting pure state distributions depending only on\nsymmetries of the system, thus representing a new kind of universality in\nquantum equilibration dubbed deep thermalization. We study the MSPE generated\nby solvable (1+1)d dual-unitary quantum circuit evolution, and identify the\nlimiting mixed state distributions which emerge at late times depending on the\nsize of the incomplete measurement, which we assume to be lossy, finding that\nthey correspond to certain random density matrix ensembles known in the\nliterature. We also derive the rate of the emergence of such universality.\nFurthermore, we investigate the quantum information properties of the states\ncomposing the ensemble, specifically their capacity to teleport quantum\ninformation between the ends of the system. The teleportation fidelity is upper\nbounded by the quantum conditional entropy, which we find exhibits a sharp\ntransition from zero to maximal when the number of measurements lost matches of\nthat the number of degrees of freedom to be teleported. Our results initiate\nthe first investigation of deep thermalization for mixed state ensembles, which\nare relevant for present-day quantum simulation experiments wherein\nmeasurements are typically not perfect, and also amount to a physical and\nnatural way of sampling from hitherto abstract random density matrix ensembles.",
            "pdf_url": "http://arxiv.org/pdf/2505.07795v1",
            "published": "2025-05-12 17:45:24+00:00",
            "updated": "2025-05-12 17:45:24+00:00"
        },
        {
            "title": "Unconventional Fractional Phases in Multi-Band Vortexable Systems",
            "authors": "Siddhartha Sarkar, Xiaohan Wan, Ang-Kun Wu, Shi-Zeng Lin, Kai Sun",
            "summary": "In this Letter, we study topological flat bands with distinct features that\ndeviate from conventional Landau level behavior. We show that even in the ideal\nquantum geometry limit, moire flat band systems can exhibit physical phenomena\nfundamentally different from Landau levels without lattices. In particular, we\nfind new fractional quantum Hall states emerging from multi-band vortexable\nsystems, where multiple exactly flat bands appear at the Fermi energy. While\nthe set of bands as a whole exhibits ideal quantum geometry, individual bands\nseparately lose vortexability, and thus making them very different from a stack\nof Landau levels. At certain filling fractions, we find fractional states whose\nHall conductivity deviates from the filling factor. Through careful numerical\nand analytical studies, we rule out all known mechanisms--such as fractional\nquantum Hall crystals or separate filling of trivial and topological bands--as\npossible explanations. Leveraging the exact solvability of vortexable systems,\nwe use analytic Bloch wavefunctions to uncover the origin of these new\nfractional states, which arises from the commensurability between the moire\nunit cell and the magnetic unit cell of an emergent effective magnetic field.",
            "pdf_url": "http://arxiv.org/pdf/2505.07790v1",
            "published": "2025-05-12 17:43:25+00:00",
            "updated": "2025-05-12 17:43:25+00:00"
        },
        {
            "title": "Quantum thermodynamics and semi-definite optimization",
            "authors": "Nana Liu, Michele Minervini, Dhrumil Patel, Mark M. Wilde",
            "summary": "In quantum thermodynamics, a system is described by a Hamiltonian and a list\nof non-commuting charges representing conserved quantities like particle number\nor electric charge, and an important goal is to determine the system's minimum\nenergy in the presence of these conserved charges. In optimization theory, a\nsemi-definite program (SDP) involves a linear objective function optimized over\nthe cone of positive semi-definite operators intersected with an affine space.\nThese problems arise from differing motivations in the physics and optimization\ncommunities and are phrased using very different terminology, yet they are\nessentially identical mathematically. By adopting Jaynes' mindset motivated by\nquantum thermodynamics, we observe that minimizing free energy in the\naforementioned thermodynamics problem, instead of energy, leads to an elegant\nsolution in terms of a dual chemical potential maximization problem that is\nconcave in the chemical potential parameters. As such, one can employ standard\n(stochastic) gradient ascent methods to find the optimal values of these\nparameters, and these methods are guaranteed to converge quickly. At low\ntemperature, the minimum free energy provides an excellent approximation for\nthe minimum energy. We then show how this Jaynes-inspired gradient-ascent\napproach can be used in both first- and second-order classical and hybrid\nquantum-classical algorithms for minimizing energy, and equivalently, how it\ncan be used for solving SDPs, with guarantees on the runtimes of the\nalgorithms. The approach discussed here is well grounded in quantum\nthermodynamics and, as such, provides physical motivation underpinning why\nalgorithms published fifty years after Jaynes' seminal work, including the\nmatrix multiplicative weights update method, the matrix exponentiated gradient\nupdate method, and their quantum algorithmic generalizations, perform well at\nsolving SDPs.",
            "pdf_url": "http://arxiv.org/pdf/2505.04514v2",
            "published": "2025-05-07 15:40:15+00:00",
            "updated": "2025-05-12 17:33:50+00:00"
        },
        {
            "title": "Solving Nonlinear PDEs with Sparse Radial Basis Function Networks",
            "authors": "Zihan Shao, Konstantin Pieper, Xiaochuan Tian",
            "summary": "We propose a novel framework for solving nonlinear PDEs using sparse radial\nbasis function (RBF) networks. Sparsity-promoting regularization is employed to\nprevent over-parameterization and reduce redundant features. This work is\nmotivated by longstanding challenges in traditional RBF collocation methods,\nalong with the limitations of physics-informed neural networks (PINNs) and\nGaussian process (GP) approaches, aiming to blend their respective strengths in\na unified framework. The theoretical foundation of our approach lies in the\nfunction space of Reproducing Kernel Banach Spaces (RKBS) induced by\none-hidden-layer neural networks of possibly infinite width. We prove a\nrepresenter theorem showing that the solution to the sparse optimization\nproblem in the RKBS admits a finite solution and establishes error bounds that\noffer a foundation for generalizing classical numerical analysis. The\nalgorithmic framework is based on a three-phase algorithm to maintain\ncomputational efficiency through adaptive feature selection, second-order\noptimization, and pruning of inactive neurons. Numerical experiments\ndemonstrate the effectiveness of our method and highlight cases where it offers\nnotable advantages over GP approaches. This work opens new directions for\nadaptive PDE solvers grounded in rigorous analysis with efficient,\nlearning-inspired implementation.",
            "pdf_url": "http://arxiv.org/pdf/2505.07765v1",
            "published": "2025-05-12 17:12:53+00:00",
            "updated": "2025-05-12 17:12:53+00:00"
        },
        {
            "title": "Attosecond physics hidden in Cherenkov radiation",
            "authors": "D. Karlovets, A. Chaikovskaia, D. Grosman, D. Kargina, A. Shchepkin, G. Sizykh",
            "summary": "Cherenkov radiation of charged particles moving with superluminal velocities\nin transparent media is a well-studied phenomenon with a plethora of\napplications. Its microscopic origins can be traced to the polarization of\natomic shells, characterized by time scales in the subfemtosecond range -\ndynamics that eludes conventional macroscopic treatment. Here we present a\ntheoretical framework for probing the intrinsic dynamics of Cherenkov\nradiation, unveiling quantum features absent in classical realm and even in a\nfully quantum theory in momentum space. These features include a finite\nformation length and spreading time of the photon, the latter becoming negative\nnearby the Cherenkov angle, a finite flash duration tied to the size of the\nelectron packet, along with a shift in the photon arrival time that can be\neither positive or negative and necessitates going beyond the far-field\napproximation. The calculated time scales lie in the attosecond range for the\nrelevant parameters, thus linking this macroscopic phenomenon back to its\natomic origins. Finally, we propose that by measuring the duration of the\nCherenkov flash one can in principle retrieve the length of the emitting\npacket, deepening our understanding of quantum coherence effects in photon\nemission.",
            "pdf_url": "http://arxiv.org/pdf/2411.00212v3",
            "published": "2024-10-31 21:16:18+00:00",
            "updated": "2025-05-12 16:38:51+00:00"
        },
        {
            "title": "Effective Field Theory Description of Hawking Radiation",
            "authors": "David A. Lowe, Larus Thorlacius",
            "summary": "A study is made of Hawking radiation from four-dimensional black holes using\neffective field theory methods. The trace anomaly for the stress tensor in a\ngeneral curved spacetime background is reproduced using Riegert's action. The\nsemiclassical stress tensor is evaluated in a Schwarzschild background taking a\ntime-independent limit for the quantum state. Imposing physical boundary\nconditions on an initial Cauchy surface leads to a unique state, analogous to\nthe Unruh state with a vanishing ingoing flux and a finite outgoing flux. In\nparticular, there is no sign of quantum hair arising from this nonlocal\neffective action.",
            "pdf_url": "http://arxiv.org/pdf/2505.07722v1",
            "published": "2025-05-12 16:29:16+00:00",
            "updated": "2025-05-12 16:29:16+00:00"
        },
        {
            "title": "Electron Wave-Spin Qubit",
            "authors": "Ju Gao, Fang Shen",
            "summary": "This work proposes a wave-entity perspective of the electron spin qubit,\ntreating the electron as a continuous physical wave rather than a point-like\nparticle. In this theoretical framework, each spin qubit corresponds to a\ndistinct current density configuration, offering a resolution to the paradox of\na particle appearing to spin both up and down simultaneously. We further\npredict the existence of a persistent, azimuthally asymmetric magnetic field\nassociated with the wave-spin qubit, an effect not anticipated by the\nconventional particle-spin model. Notably, the qubit's relative phase governs\nthe orientation of both the current and the magnetic field, suggesting a\nmechanism for direct, local interactions between qubits. This phase-dependent\ncoupling could form the basis for inherently parallel quantum computing\narchitectures, in contrast to the sequential operations of gate-based logic.\nWhile this framework is grounded in theoretical analysis, it yields testable\npredictions -- particularly regarding the magnetic field structure -- that\ninvite experimental verification. By treating the electron wave as the\nfundamental physical entity, rather than a probabilistic abstraction, we\nexplore a quantum model that is deterministic, local, causal, and fully\nconsistent with special relativity.",
            "pdf_url": "http://arxiv.org/pdf/2504.18824v3",
            "published": "2025-04-26 07:13:56+00:00",
            "updated": "2025-05-12 16:27:47+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "H$^{\\mathbf{3}}$DP: Triply-Hierarchical Diffusion Policy for Visuomotor Learning",
            "authors": "Yiyang Lu, Yufeng Tian, Zhecheng Yuan, Xianbang Wang, Pu Hua, Zhengrong Xue, Huazhe Xu",
            "summary": "Visuomotor policy learning has witnessed substantial progress in robotic\nmanipulation, with recent approaches predominantly relying on generative models\nto model the action distribution. However, these methods often overlook the\ncritical coupling between visual perception and action prediction. In this\nwork, we introduce $\\textbf{Triply-Hierarchical Diffusion\nPolicy}~(\\textbf{H$^{\\mathbf{3}}$DP})$, a novel visuomotor learning framework\nthat explicitly incorporates hierarchical structures to strengthen the\nintegration between visual features and action generation. H$^{3}$DP contains\n$\\mathbf{3}$ levels of hierarchy: (1) depth-aware input layering that organizes\nRGB-D observations based on depth information; (2) multi-scale visual\nrepresentations that encode semantic features at varying levels of granularity;\nand (3) a hierarchically conditioned diffusion process that aligns the\ngeneration of coarse-to-fine actions with corresponding visual features.\nExtensive experiments demonstrate that H$^{3}$DP yields a $\\mathbf{+27.5\\%}$\naverage relative improvement over baselines across $\\mathbf{44}$ simulation\ntasks and achieves superior performance in $\\mathbf{4}$ challenging bimanual\nreal-world manipulation tasks. Project Page: https://lyy-iiis.github.io/h3dp/.",
            "pdf_url": "http://arxiv.org/pdf/2505.07819v1",
            "published": "2025-05-12 17:59:43+00:00",
            "updated": "2025-05-12 17:59:43+00:00"
        },
        {
            "title": "Prompt to Polyp: Medical Text-Conditioned Image Synthesis with Diffusion Models",
            "authors": "Mikhail Chaichuk, Sushant Gautam, Steven Hicks, Elena Tutubalina",
            "summary": "The generation of realistic medical images from text descriptions has\nsignificant potential to address data scarcity challenges in healthcare AI\nwhile preserving patient privacy. This paper presents a comprehensive study of\ntext-to-image synthesis in the medical domain, comparing two distinct\napproaches: (1) fine-tuning large pre-trained latent diffusion models and (2)\ntraining small, domain-specific models. We introduce a novel model named MSDM,\nan optimized architecture based on Stable Diffusion that integrates a clinical\ntext encoder, variational autoencoder, and cross-attention mechanisms to better\nalign medical text prompts with generated images. Our study compares two\napproaches: fine-tuning large pre-trained models (FLUX, Kandinsky) versus\ntraining compact domain-specific models (MSDM). Evaluation across colonoscopy\n(MedVQA-GI) and radiology (ROCOv2) datasets reveals that while large models\nachieve higher fidelity, our optimized MSDM delivers comparable quality with\nlower computational costs. Quantitative metrics and qualitative evaluations by\nmedical experts reveal strengths and limitations of each approach.",
            "pdf_url": "http://arxiv.org/pdf/2505.05573v2",
            "published": "2025-05-08 18:07:16+00:00",
            "updated": "2025-05-12 17:59:28+00:00"
        },
        {
            "title": "BNEM: A Boltzmann Sampler Based on Bootstrapped Noised Energy Matching",
            "authors": "RuiKang OuYang, Bo Qiang, José Miguel Hernández-Lobato",
            "summary": "Developing an efficient sampler capable of generating independent and\nidentically distributed (IID) samples from a Boltzmann distribution is a\ncrucial challenge in scientific research, e.g. molecular dynamics. In this\nwork, we intend to learn neural samplers given energy functions instead of data\nsampled from the Boltzmann distribution. By learning the energies of the noised\ndata, we propose a diffusion-based sampler, Noised Energy Matching, which\ntheoretically has lower variance and more complexity compared to related works.\nFurthermore, a novel bootstrapping technique is applied to NEM to balance\nbetween bias and variance. We evaluate NEM and BNEM on a 2-dimensional 40\nGaussian Mixture Model (GMM) and a 4-particle double-well potential (DW-4). The\nexperimental results demonstrate that BNEM can achieve state-of-the-art\nperformance while being more robust.",
            "pdf_url": "http://arxiv.org/pdf/2409.09787v4",
            "published": "2024-09-15 16:41:30+00:00",
            "updated": "2025-05-12 16:54:02+00:00"
        },
        {
            "title": "Diffused Responsibility: Analyzing the Energy Consumption of Generative Text-to-Audio Diffusion Models",
            "authors": "Riccardo Passoni, Francesca Ronchini, Luca Comanducci, Romain Serizel, Fabio Antonacci",
            "summary": "Text-to-audio models have recently emerged as a powerful technology for\ngenerating sound from textual descriptions. However, their high computational\ndemands raise concerns about energy consumption and environmental impact. In\nthis paper, we conduct an analysis of the energy usage of 7 state-of-the-art\ntext-to-audio diffusion-based generative models, evaluating to what extent\nvariations in generation parameters affect energy consumption at inference\ntime. We also aim to identify an optimal balance between audio quality and\nenergy consumption by considering Pareto-optimal solutions across all selected\nmodels. Our findings provide insights into the trade-offs between performance\nand environmental impact, contributing to the development of more efficient\ngenerative audio models.",
            "pdf_url": "http://arxiv.org/pdf/2505.07615v1",
            "published": "2025-05-12 14:36:47+00:00",
            "updated": "2025-05-12 14:36:47+00:00"
        },
        {
            "title": "Noise Optimized Conditional Diffusion for Domain Adaptation",
            "authors": "Lingkun Luo, Shiqiang Hu, Liming Chen",
            "summary": "Pseudo-labeling is a cornerstone of Unsupervised Domain Adaptation (UDA), yet\nthe scarcity of High-Confidence Pseudo-Labeled Target Domain Samples\n(\\textbf{hcpl-tds}) often leads to inaccurate cross-domain statistical\nalignment, causing DA failures. To address this challenge, we propose\n\\textbf{N}oise \\textbf{O}ptimized \\textbf{C}onditional \\textbf{D}iffusion for\n\\textbf{D}omain \\textbf{A}daptation (\\textbf{NOCDDA}), which seamlessly\nintegrates the generative capabilities of conditional diffusion models with the\ndecision-making requirements of DA to achieve task-coupled optimization for\nefficient adaptation. For robust cross-domain consistency, we modify the DA\nclassifier to align with the conditional diffusion classifier within a unified\noptimization framework, enabling forward training on noise-varying cross-domain\nsamples. Furthermore, we argue that the conventional \\( \\mathcal{N}(\\mathbf{0},\n\\mathbf{I}) \\) initialization in diffusion models often generates\nclass-confused hcpl-tds, compromising discriminative DA. To resolve this, we\nintroduce a class-aware noise optimization strategy that refines sampling\nregions for reverse class-specific hcpl-tds generation, effectively enhancing\ncross-domain alignment. Extensive experiments across 5 benchmark datasets and\n29 DA tasks demonstrate significant performance gains of \\textbf{NOCDDA} over\n31 state-of-the-art methods, validating its robustness and effectiveness.",
            "pdf_url": "http://arxiv.org/pdf/2505.07548v1",
            "published": "2025-05-12 13:28:31+00:00",
            "updated": "2025-05-12 13:28:31+00:00"
        }
    ]
}