{
    "Physics": [
        {
            "title": "Electronic structure and optical signatures of highly-doped graphene",
            "authors": "Saúl Antonio Herrera-González, Guillermo Parra-Martínez, Francisco Guinea, Jose Angel Silva-Guillén, Pierre A. Pantaleón, Gerardo G. Naumis",
            "summary": "Heavily doping graphene by intercalation can raise its Fermi level near an\nextended van Hove singularity, potentially inducing correlated electronic\nphases. Intercalation also modifies the band structure: dopants may hybridize\nwith carbon orbitals and order into $\\sqrt{3}\\times\\sqrt{3}$ or $2\\times2$\nsuperstructures, introducing periodic potentials that fold the graphene $\\pi$\nbands. Angle-resolved photoemission spectroscopy further shows a pronounced\nflattening of the conduction band near the M points, producing higher-order van\nHove singularities. These effects depend strongly on the dopant species and\nsubstrate, with implications for both many-body physics and transport. We\nconstruct effective tight-binding models that incorporate dopant ordering,\ncarbon-dopant hybridization, and $\\pi$-band renormalization. Model parameters\nare obtained from density functional theory and reproduce dispersions observed\nin photoemission experiments. Using these models, we compute the optical\nconductivity and identify characteristic signatures associated with dopant\nordering and hybridization. Our results provide a framework to interpret\nexperimental spectra and to probe the superlattice symmetry of highly doped\nmonolayer graphene.",
            "pdf_url": "http://arxiv.org/pdf/2509.18098v1",
            "published": "2025-09-22 17:59:56+00:00",
            "updated": "2025-09-22 17:59:56+00:00"
        },
        {
            "title": "Pseudogap in a Fermi-Hubbard quantum simulator",
            "authors": "Lev Haldar Kendrick, Anant Kale, Youqi Gang, Alexander Dennisovich Deters, Martin Lebrat, Aaron W. Young, Markus Greiner",
            "summary": "Understanding doped Mott insulators is a fundamental goal in condensed matter\nphysics, with relevance to cuprate superconductors and other quantum materials.\nThe doped Hubbard model minimally describes such systems, and has explicated\nsome of their complex behavior. However, many open questions remain concerning\nthe anomalous metallic states which emerge at low temperatures and intermediate\ndoping and which, in cuprates, give rise to high-temperature superconductivity\nupon cooling. Here we observe a crossover between a normal metal and a\npseudogapped metal in the Hubbard model by performing thermodynamic and\nspectroscopic measurements in a cold atom quantum simulator, leveraging a\nrecent several-fold reduction in experimentally achievable temperatures.\nMeasurements of the compressibility show a maximum versus doping that develops\nupon cooling, signaling an inflection point in the equation of state. We track\nthis maximum versus interaction strength, revealing a line of thermodynamic\nanomalies in the phase diagram that separates an underdoped from an overdoped\nmetal at large interactions. Lattice modulation spectroscopy shows a loss of\nspectral weight at low energies in the underdoped regime which is non-uniform\nin the Brillouin zone, indicating the formation of a pseudogap. We use this\nsignal to establish a pseudogap phase diagram as a function of interactions and\ndoping. Our results experimentally demonstrate the existence of a pseudogapped\nmetal in the Hubbard model, partially characterize the pseudogap regime, and\nsuggest a link between the pseudogap and charge order which can be probed in\nfuture work. Furthermore, this work demonstrates the utility of quantum\nsimulation in addressing frontier problems in correlated electron physics.",
            "pdf_url": "http://arxiv.org/pdf/2509.18075v1",
            "published": "2025-09-22 17:55:08+00:00",
            "updated": "2025-09-22 17:55:08+00:00"
        },
        {
            "title": "Neuromorphic Intelligence",
            "authors": "Marcel van Gerven",
            "summary": "Neuromorphic computing seeks to replicate the remarkable efficiency,\nflexibility, and adaptability of the human brain in artificial systems. Unlike\nconventional digital approaches, which suffer from the Von Neumann bottleneck\nand depend on massive computational and energy resources, neuromorphic systems\nexploit brain-inspired principles of computation to achieve orders of magnitude\ngreater energy efficiency. By drawing on insights from a wide range of\ndisciplines, including artificial intelligence, physics, chemistry, biology,\nneuroscience, cognitive science and materials science, neuromorphic computing\npromises to deliver intelligent systems that are sustainable, transparent, and\nwidely accessible. A central challenge, however, is to identify a unifying\ntheoretical framework capable of bridging these diverse disciplines. We argue\nthat dynamical systems theory provides such a foundation. Rooted in\ndifferential calculus, it offers a principled language for modeling inference,\nlearning, and control in both natural and artificial substrates. Within this\nframework, noise can be harnessed as a resource for learning, while\ndifferential genetic programming enables the discovery of dynamical systems\nthat implement adaptive behaviors. Embracing this perspective paves the way\ntoward emergent neuromorphic intelligence, where intelligent behavior arises\nfrom the dynamics of physical substrates, advancing both the science and\nsustainability of AI.",
            "pdf_url": "http://arxiv.org/pdf/2509.11940v2",
            "published": "2025-09-15 13:59:42+00:00",
            "updated": "2025-09-22 17:48:58+00:00"
        },
        {
            "title": "Exploring molecular supersolidity via exact and mean-field theories: single microwave shielding",
            "authors": "Tiziano Arnone Cardinale, Thomas Bland, Stephanie M. Reimann",
            "summary": "Ultracold polar molecules with microwave shielding provide a powerful\nplatform for exploring quantum many-body physics with strong, anisotropic\ninteractions. We develop an extended Gross-Pitaevskii framework for bosonic\nmolecules under single microwave shielding, incorporating effective\ninteractions and quantum fluctuations, and benchmark it against exact Quantum\nMonte Carlo simulations. In the regime of positive scattering lengths, our\napproach captures superfluid, supersolid, and droplet phases with excellent\naccuracy. We show that elliptic microwave polarization induces\ndirection-dependent superfluidity - absent in cylindrically symmetric systems -\nenabling tunable anisotropy and potential applications in directional quantum\nsensing. A quasi-1D theory reveals that roton softening and instabilities can\nbe controlled via ellipticity, consistent with recent experiments. Furthermore,\nwe find that the nature of the superfluid-to-supersolid transition is strongly\ninfluenced by the ellipticity: the transition is sharp at low ellipticity and\ncontinuous at higher values. This tunability offers a potential route for low\nentropy preparation of molecular supersolids via adiabatic ramps. While double\nshielding is often used experimentally, our results demonstrate that\nsingle-shielded molecules already offer rich, controllable behavior, laying the\ngroundwork for future studies with more complex shielding schemes.",
            "pdf_url": "http://arxiv.org/pdf/2509.18051v1",
            "published": "2025-09-22 17:25:39+00:00",
            "updated": "2025-09-22 17:25:39+00:00"
        },
        {
            "title": "Global stability of ghostly field theories: Classical scattering in $(N+1)$ dimensions",
            "authors": "Aaron Held",
            "summary": "We review results on small-data global stability and highlight their\napplicability to classical interacting scalar fields with opposite-sign kinetic\nterms (ghosts). Further, we present a one-parameter family of numerical\nscattering solutions under the simplifying assumption of spherical symmetry. We\nthereby identify classical ghostly field theories with polynomial interaction\npotentials for which small-data global stability apparently extends to\nlarge-data global stability, i.e., global stability for all compactly supported\ninitial data. These global stability results support an underlying physical\nmechanism by which the ghost instability can be quenched due to dominant\nself-interactions, at least in classical physics.",
            "pdf_url": "http://arxiv.org/pdf/2509.18049v1",
            "published": "2025-09-22 17:23:47+00:00",
            "updated": "2025-09-22 17:23:47+00:00"
        },
        {
            "title": "Analysis of polymerized superconducting circuits",
            "authors": "Sean Crowe, Stefan Evans, Alexei Smolyaninov",
            "summary": "We apply polymer quantization, a quantization technique sometimes used in\nhigh energy physics, to several superconducting circuits including: transmons,\ntransmission line resonators, and LC circuits. In the case of transmon qubits\nand transmission line resonators, experimental predictions are very close to\nwhat is found with canonical quantization, though in this approach constant\ncharge offsets can be interpreted as quantization ambiguities. In the case of\nLC circuits, polymer quantization predicts nonlinearities which are not present\nin the canonical approach. Based on this analysis we design and analyze a qubit\nwhich uses a meander inductor instead of a Josephson junction. Implications for\nqubit performance and fabrication are discussed. Given a choice for an\neffective phase operator, relevant parameters such as anharmonicity, frequency,\nand dispersive shifts are calculated for this meander inductor based qubit.",
            "pdf_url": "http://arxiv.org/pdf/2509.18016v1",
            "published": "2025-09-22 16:56:00+00:00",
            "updated": "2025-09-22 16:56:00+00:00"
        },
        {
            "title": "Building Transparency in Deep Learning-Powered Network Traffic Classification: A Traffic-Explainer Framework",
            "authors": "Riya Ponraj, Ram Durairajan, Yu Wang",
            "summary": "Recent advancements in deep learning have significantly enhanced the\nperformance and efficiency of traffic classification in networking systems.\nHowever, the lack of transparency in their predictions and decision-making has\nmade network operators reluctant to deploy DL-based solutions in production\nnetworks. To tackle this challenge, we propose Traffic-Explainer, a\nmodel-agnostic and input-perturbation-based traffic explanation framework. By\nmaximizing the mutual information between predictions on original traffic\nsequences and their masked counterparts, Traffic-Explainer automatically\nuncovers the most influential features driving model predictions. Extensive\nexperiments demonstrate that Traffic-Explainer improves upon existing\nexplanation methods by approximately 42%. Practically, we further apply\nTraffic-Explainer to identify influential features and demonstrate its enhanced\ntransparency across three critical tasks: application classification, traffic\nlocalization, and network cartography. For the first two tasks,\nTraffic-Explainer identifies the most decisive bytes that drive predicted\ntraffic applications and locations, uncovering potential vulnerabilities and\nprivacy concerns. In network cartography, Traffic-Explainer identifies\nsubmarine cables that drive the mapping of traceroute to physical path,\nenabling a traceroute-informed risk analysis.",
            "pdf_url": "http://arxiv.org/pdf/2509.18007v1",
            "published": "2025-09-22 16:46:12+00:00",
            "updated": "2025-09-22 16:46:12+00:00"
        },
        {
            "title": "Gravity from thermodynamics in vacuum: Lorentz invariance and the role of Bel-Robinson tensor",
            "authors": "Ana Alonso-Serrano, Marek Liška",
            "summary": "Thermodynamics of local causal horizons have been shown to encode the\ninformation necessary to derive the equations governing the gravitational\ndynamics. We have previously shown that, in the presence of matter, this\nderivation further implies quantum phenomenological corrections to\ngravitational dynamics. Herein, we study whether similar corrections also occur\nin vacuum. We show that, under the assumptions of locality and local Lorentz\ninvariance of physics, the vacuum dynamics is prescribed by the Einstein\nequations. We also discuss an alternative paradigm which assumes the existence\nof a preferred direction of time (much like in Einstein-aether or\nHo\\v{r}ava-Lifshitz gravity). Then, we find an modified gravitational dynamics\nin which Ricci curvature is sourced by Bel-Robinson super-energy.",
            "pdf_url": "http://arxiv.org/pdf/2411.07856v2",
            "published": "2024-11-12 15:12:59+00:00",
            "updated": "2025-09-22 16:46:07+00:00"
        },
        {
            "title": "Hybrid Electromagnetic Calorimeter Module: Enhanced Performance through Integration of Silicon Pixel Layer into Scintillator Design",
            "authors": "Jia-Le Fei, Ao Yuan, Chang-Heng Huang, Liu-Pan An, Ji-Ke Wang",
            "summary": "This study constructs a hybrid module with a multi-material collaborative\ndetection architecture by integrating silicon pixel layers into the\nlongitudinally segmented scintillating fiber sampling calorimeter module and\noptimizes the placement of the silicon layers. The module utilizes the\npre-shower characteristics of the front-end scintillator units to ensure\nsufficient energy deposition in the silicon pixel layers, thereby maintaining\nits high-precision detection capability. A dedicated simulation framework\ncombining Geant4 modeling for the scintillator section and a parameterized\napproach for the silicon pixel layer is employed for module verification and\nperformance study. The hybrid module demonstrates overall performance\nenhancement. The maximum achievable improvements are 56\\% for position\nresolution and 26\\% for time resolution, respectively. These advancements also\nlead to significant increase of physics sensitivity, especially for physics\nchannels with low-energy photons, for instance, a 16\\% boost in signal\nsignificance for $D^{*0}$ from the $B^-\\rightarrow D^{*0}(\\rightarrow D^0\n\\gamma)\\pi^-$ decay",
            "pdf_url": "http://arxiv.org/pdf/2509.17997v1",
            "published": "2025-09-22 16:37:54+00:00",
            "updated": "2025-09-22 16:37:54+00:00"
        },
        {
            "title": "Gravity from equilibrium thermodynamics of stretched light cones",
            "authors": "Ana Alonso-Serrano, Luis J. Garay, Marek Liška, Celia López Pineros",
            "summary": "This work digs into the connection between gravity and thermodynamics of\nstretched light cones (SLC). They are associated with uniformly accelerating\nobservers, who endow the SLC with a physical notion of temperature via the\nUnruh effect. We compute the expansion, shear, and vorticity of the SLC to\nfully study its dynamics and account for the possibility of previously\npredicted non-equilibrium entropy production. For consistency, we prove the\nequivalence of the two different geometrical methods available for studying the\nSLCs' properties. Then, we apply the energy balance and use Clausius' relation\nto relate the geometrical properties of the SLC with energy fluxes crossing its\nsurface, showing that it encodes the equations governing the gravitational\ndynamics. We show here how this analysis can be fully carried in terms of\nequilibrium thermodynamics due to the vanishing of shear, and how one can\nidentify a work term related to the acceleration of the observer.",
            "pdf_url": "http://arxiv.org/pdf/2509.08566v2",
            "published": "2025-09-10 13:08:53+00:00",
            "updated": "2025-09-22 16:34:35+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Spiffy: Multiplying Diffusion LLM Acceleration via Lossless Speculative Decoding",
            "authors": "Sudhanshu Agrawal, Risheek Garrepalli, Raghavv Goel, Mingu Lee, Christopher Lott, Fatih Porikli",
            "summary": "Diffusion LLMs (dLLMs) have recently emerged as a powerful alternative to\nautoregressive LLMs (AR-LLMs) with the potential to operate at significantly\nhigher token generation rates. However, currently available open-source dLLMs\noften generate at much lower rates, typically decoding only a single token at\nevery denoising timestep in order to maximize output quality. We present\nSpiffy, a speculative decoding algorithm that accelerates dLLM inference by\n$\\mathbf{2.8{-}3.1\\times}$ while provably preserving the model's output\ndistribution. This work addresses the unique challenges involved in applying\nideas from speculative decoding of AR-LLMs to the dLLM setting. Spiffy proposes\ndraft states by leveraging the dLLM's distribution itself in an\nauto-speculative manner. This approach is efficient and effective, and\neliminates the overheads of training and running an independent draft model. To\nstructure the candidate draft states, we propose a novel directed draft graph\nwhich is uniquely designed to take advantage of the bidirectional, block-wise\nnature of dLLM generation and can be verified in parallel by the dLLM. To\nfurther optimize the structure of these draft graphs, we introduce an\nefficient, offline calibration algorithm that procedurally determines\nhigh-quality graph configurations. These optimized draft graphs, enabling\nincreased acceptance rates, lead to a significant boost in the overall speedup\nachieved by the system. Crucially, Spiffy is also complementary to other recent\ninnovations in improving dLLM generation speeds such as KV-caching and\nmulti-token unmasking. We demonstrate that when combined with such parallel\ndecoding algorithms, Spiffy is able to effectively multiply the benefits of\nthese methods leading to total speedups of up to $\\mathbf{7.9\\times}$.",
            "pdf_url": "http://arxiv.org/pdf/2509.18085v1",
            "published": "2025-09-22 17:58:21+00:00",
            "updated": "2025-09-22 17:58:21+00:00"
        },
        {
            "title": "Efficient Neural SDE Training using Wiener-Space Cubature",
            "authors": "Luke Snow, Vikram Krishnamurthy",
            "summary": "A neural stochastic differential equation (SDE) is an SDE with drift and\ndiffusion terms parametrized by neural networks. The training procedure for\nneural SDEs consists of optimizing the SDE vector field (neural network)\nparameters to minimize the expected value of an objective functional on\ninfinite-dimensional path-space. Existing training techniques focus on methods\nto efficiently compute path-wise gradients of the objective functional with\nrespect to these parameters, then pair this with Monte-Carlo simulation to\nestimate the gradient expectation. In this work we introduce a novel training\ntechnique which bypasses and improves upon this Monte-Carlo simulation; we\nextend results in the theory of Wiener space cubature to approximate the\nexpected objective functional value by a weighted sum of functional evaluations\nof deterministic ODE solutions. Our main mathematical contribution enabling\nthis approximation is an extension of cubature bounds to the setting of\nLipschitz-nonlinear functionals acting on path-space. Our resulting\nconstructive algorithm allows for more computationally efficient training along\nseveral lines. First, it circumvents Brownian motion simulation and enables the\nuse of efficient parallel ODE solvers, thus decreasing the complexity of\npath-functional evaluation. Furthermore, and more surprisingly, we show that\nthe number of paths required to achieve a given (expected loss functional\noracle value) approximation can be reduced in this deterministic cubature\nregime. Specifically, we show that under reasonable regularity assumptions we\ncan observe a O(1/n) convergence rate, where n is the number of path\nevaluations; in contrast with the standard O(1/sqrt(n)) rate of naive\nMonte-Carlo or the O(log(n)^d /n) rate of quasi-Monte-Carlo.",
            "pdf_url": "http://arxiv.org/pdf/2502.12395v3",
            "published": "2025-02-18 00:06:40+00:00",
            "updated": "2025-09-22 17:36:28+00:00"
        },
        {
            "title": "Prepare Before You Act: Learning From Humans to Rearrange Initial States",
            "authors": "Yinlong Dai, Andre Keyser, Dylan P. Losey",
            "summary": "Imitation learning (IL) has proven effective across a wide range of\nmanipulation tasks. However, IL policies often struggle when faced with\nout-of-distribution observations; for instance, when the target object is in a\npreviously unseen position or occluded by other objects. In these cases,\nextensive demonstrations are needed for current IL methods to reach robust and\ngeneralizable behaviors. But when humans are faced with these sorts of atypical\ninitial states, we often rearrange the environment for more favorable task\nexecution. For example, a person might rotate a coffee cup so that it is easier\nto grasp the handle, or push a box out of the way so they can directly grasp\ntheir target object. In this work we seek to equip robot learners with the same\ncapability: enabling robots to prepare the environment before executing their\ngiven policy. We propose ReSET, an algorithm that takes initial states -- which\nare outside the policy's distribution -- and autonomously modifies object poses\nso that the restructured scene is similar to training data. Theoretically, we\nshow that this two step process (rearranging the environment before rolling out\nthe given policy) reduces the generalization gap. Practically, our ReSET\nalgorithm combines action-agnostic human videos with task-agnostic\nteleoperation data to i) decide when to modify the scene, ii) predict what\nsimplifying actions a human would take, and iii) map those predictions into\nrobot action primitives. Comparisons with diffusion policies, VLAs, and other\nbaselines show that using ReSET to prepare the environment enables more robust\ntask execution with equal amounts of total training data. See videos at our\nproject website: https://reset2025paper.github.io/",
            "pdf_url": "http://arxiv.org/pdf/2509.18043v1",
            "published": "2025-09-22 17:18:52+00:00",
            "updated": "2025-09-22 17:18:52+00:00"
        },
        {
            "title": "ComposableNav: Instruction-Following Navigation in Dynamic Environments via Composable Diffusion",
            "authors": "Zichao Hu, Chen Tang, Michael J. Munje, Yifeng Zhu, Alex Liu, Shuijing Liu, Garrett Warnell, Peter Stone, Joydeep Biswas",
            "summary": "This paper considers the problem of enabling robots to navigate dynamic\nenvironments while following instructions. The challenge lies in the\ncombinatorial nature of instruction specifications: each instruction can\ninclude multiple specifications, and the number of possible specification\ncombinations grows exponentially as the robot's skill set expands. For example,\n\"overtake the pedestrian while staying on the right side of the road\" consists\nof two specifications: \"overtake the pedestrian\" and \"walk on the right side of\nthe road.\" To tackle this challenge, we propose ComposableNav, based on the\nintuition that following an instruction involves independently satisfying its\nconstituent specifications, each corresponding to a distinct motion primitive.\nUsing diffusion models, ComposableNav learns each primitive separately, then\ncomposes them in parallel at deployment time to satisfy novel combinations of\nspecifications unseen in training. Additionally, to avoid the onerous need for\ndemonstrations of individual motion primitives, we propose a two-stage training\nprocedure: (1) supervised pre-training to learn a base diffusion model for\ndynamic navigation, and (2) reinforcement learning fine-tuning that molds the\nbase model into different motion primitives. Through simulation and real-world\nexperiments, we show that ComposableNav enables robots to follow instructions\nby generating trajectories that satisfy diverse and unseen combinations of\nspecifications, significantly outperforming both non-compositional VLM-based\npolicies and costmap composing baselines. Videos and additional materials can\nbe found on the project page: https://amrl.cs.utexas.edu/ComposableNav/",
            "pdf_url": "http://arxiv.org/pdf/2509.17941v1",
            "published": "2025-09-22 16:04:50+00:00",
            "updated": "2025-09-22 16:04:50+00:00"
        },
        {
            "title": "Optimizing Inference in Transformer-Based Models: A Multi-Method Benchmark",
            "authors": "Siu Hang Ho, Prasad Ganesan, Nguyen Duong, Daniel Schlabig",
            "summary": "Efficient inference is a critical challenge in deep generative modeling,\nparticularly as diffusion models grow in capacity and complexity. While\nincreased complexity often improves accuracy, it raises compute costs, latency,\nand memory requirements. This work investigates techniques such as pruning,\nquantization, knowledge distillation, and simplified attention to reduce\ncomputational overhead without impacting performance. The study also explores\nthe Mixture of Experts (MoE) approach to further enhance efficiency. These\nexperiments provide insights into optimizing inference for the state-of-the-art\nFast Diffusion Transformer (fast-DiT) model.",
            "pdf_url": "http://arxiv.org/pdf/2509.17894v1",
            "published": "2025-09-22 15:25:28+00:00",
            "updated": "2025-09-22 15:25:28+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Enhanced fill probability estimates in institutional algorithmic bond trading using statistical learning algorithms with quantum computers",
            "authors": "Axel Ciceri, Austin Cottrell, Joshua Freeland, Daniel Fry, Hirotoshi Hirai, Philip Intallura, Hwajung Kang, Chee-Kong Lee, Abhijit Mitra, Kentaro Ohno, Das Pemmaraju, Manuel Proissl, Brian Quanz, Del Rajan, Noriaki Shimada, Kavitha Yograj",
            "summary": "The estimation of fill probabilities for trade orders represents a key\ningredient in the optimization of algorithmic trading strategies. It is bound\nby the complex dynamics of financial markets with inherent uncertainties, and\nthe limitations of models aiming to learn from multivariate financial time\nseries that often exhibit stochastic properties with hidden temporal patterns.\nIn this paper, we focus on algorithmic responses to trade inquiries in the\ncorporate bond market and investigate fill probability estimation errors of\ncommon machine learning models when given real production-scale intraday trade\nevent data, transformed by a quantum algorithm running on IBM Heron processors,\nas well as on noiseless quantum simulators for comparison. We introduce a\nframework to embed these quantum-generated data transforms as a decoupled\noffline component that can be selectively queried by models in low-latency\ninstitutional trade optimization settings. A trade execution backtesting method\nis employed to evaluate the fill prediction performance of these models in\nrelation to their input data. We observe a relative gain of up to ~ 34% in\nout-of-sample test scores for those models with access to quantum\nhardware-transformed data over those using the original trading data or\ntransforms by noiseless quantum simulation. These empirical results suggest\nthat the inherent noise in current quantum hardware contributes to this effect\nand motivates further studies. Our work demonstrates the emerging potential of\nquantum computing as a complementary explorative tool in quantitative finance\nand encourages applied industry research towards practical applications in\ntrading.",
            "pdf_url": "http://arxiv.org/pdf/2509.17715v1",
            "published": "2025-09-22 12:51:31+00:00",
            "updated": "2025-09-22 12:51:31+00:00"
        }
    ]
}