{
    "Physics": [
        {
            "title": "A Multi-Grained Symmetric Differential Equation Model for Learning Protein-Ligand Binding Dynamics",
            "authors": "Shengchao Liu, Weitao Du, Hannan Xu, Yanjing Li, Zhuoxinran Li, Vignesh Bhethanabotla, Divin Yan, Christian Borgs, Anima Anandkumar, Hongyu Guo, Jennifer Chayes",
            "summary": "In drug discovery, molecular dynamics (MD) simulation for protein-ligand\nbinding provides a powerful tool for predicting binding affinities, estimating\ntransport properties, and exploring pocket sites. There has been a long history\nof improving the efficiency of MD simulations through better numerical methods\nand, more recently, by utilizing machine learning (ML) methods. Yet, challenges\nremain, such as accurate modeling of extended-timescale simulations. To address\nthis issue, we propose NeuralMD, the first ML surrogate that can facilitate\nnumerical MD and provide accurate simulations in protein-ligand binding\ndynamics. We propose a principled approach that incorporates a novel\nphysics-informed multi-grained group symmetric framework. Specifically, we\npropose (1) the BindingNet model that satisfies group symmetry using vector\nframes and captures the multi-level protein-ligand interactions, and (2) an\naugmented neural differential equation solver that learns the trajectory under\nNewtonian mechanics. For the experiment, we design ten single-trajectory and\nthree multi-trajectory binding simulation tasks. We demonstrate the efficiency\nand effectiveness of NeuralMD, achieving over 1K$\\times$ speedup compared to\nstandard numerical MD simulations. NeuralMD also outperforms all other ML\napproaches, achieving up to 15$\\times$ reduction in reconstruction error and\n70% increase in validity. Additionally, we qualitatively illustrate that the\noscillations in the predicted trajectories align more closely with ground-truth\ndynamics than those of other machine-learning methods. We believe NeuralMD\npaves the foundation for a new research paradigm in simulating protein-ligand\ndynamics.",
            "pdf_url": "http://arxiv.org/pdf/2401.15122v3",
            "published": "2024-01-26 09:35:17+00:00",
            "updated": "2024-11-26 18:13:02+00:00"
        },
        {
            "title": "Uma proposta para o uso de RPG no Ensino de Física: A Vingança de Newton",
            "authors": "Maria Rita Vasconcelos Brandão Souza, Luís Henrique de Freitas, Glaucia de Souza Silva, Felipe Xavier de Carvalho, Leonardo Antônio M. Souza",
            "summary": "This work explores the use of Role Playing Games (RPG) as an active\nmethodology in teaching Modern Physics, focusing on a game called Newton's\nRevenge. The game was developed with the aim of engaging students in\ncollaborative and investigative learning processes, using gamification elements\nto increase motivation and involvement. Based on the constructivist theories of\nPiaget and Vygotsky, the RPG stimu-\\newline lates cognitive and social\ndevelopment by placing students in the roles of historical science figures.\nThrough contextualized physical challenges, such as understanding the\nPhotoelectric Effect, participants actively construct knowledge. This study\npresents preliminary learning data obtained through pre- and post-tests, as\nwell as evaluates students' perceptions of using educational games in science\neducation. The results indicate that the use of RPG can be an effective tool\nfor teaching Modern Physics, promoting greater engagement and understanding of\nscientific concepts.",
            "pdf_url": "http://arxiv.org/pdf/2411.17642v1",
            "published": "2024-11-26 18:08:02+00:00",
            "updated": "2024-11-26 18:08:02+00:00"
        },
        {
            "title": "Tutorial: Classifying Photonic Topology Using the Spectral Localizer and Numerical $K$-Theory",
            "authors": "Alexander Cerjan, Terry A. Loring",
            "summary": "Recently, the spectral localizer framework has emerged as an efficient\napproach to classifying topology in photonic systems featuring local\nnonlinearities and radiative environments. In nonlinear systems, this framework\nprovides rigorous definitions for concepts like topological solitons and\ntopological dynamics, where a system's occupation induces a local change in its\ntopology due to the nonlinearity. For systems embedded in radiative\nenvironments that do not possess a shared bulk spectral gap, this framework\nenables the identification of local topology and shows that local topological\nprotection is preserved despite the lack of a common gap. However, as the\nspectral localizer framework is rooted in the mathematics of $C^*$-algebras,\nand not vector bundles, understanding and using this framework requires\ndeveloping intuition for a somewhat different set of underlying concepts than\nthose that appear in traditional approaches to classifying material topology.\nIn this tutorial, we introduce the spectral localizer framework from a\nground-up perspective, and provide physically motivated arguments for\nunderstanding its local topological markers and associated local measure of\ntopological protection. In doing so, we provide numerous examples of the\nframework's application to a variety of topological classes, including\ncrystalline and higher-order topology. We then show how Maxwell's equations can\nbe reformulated to be compatible with the spectral localizer framework,\nincluding the possibility of radiative boundary conditions. To aid in this\nintroduction, we also provide a physics-oriented introduction to multi-operator\npseudospectral methods and numerical $K$-theory, two mathematical concepts that\nform the foundation for the spectral localizer framework.",
            "pdf_url": "http://arxiv.org/pdf/2411.03515v2",
            "published": "2024-11-05 21:23:07+00:00",
            "updated": "2024-11-26 17:51:18+00:00"
        },
        {
            "title": "Broadband coherent XUV light from $e^-/e^+$ microbunching in an intense laser pulse",
            "authors": "Michael J. Quin, Antonino Di Piazza, Christoph H. Keitel, Matteo Tamburini",
            "summary": "Attosecond pulses of coherent extreme ultraviolet (XUV) light are\ninstrumental for studying sub-atomic dynamics, and are often produced from a\nfree electron laser (FEL) by electron microbunches in an undulator. An\noptical-FEL (OFEL) utilizes a counter-propagating laser pulse instead of an\nundulator, and has been proposed as a more compact and tunable source than a\nFEL. Yet, an OFEL is difficult to realize because of the high electron density\nrequired and subsequent high emittance. We demonstrate that broadband coherent\nXUV light, which in the temporal domain corresponds to a train of attosecond\npulses with 8-as duration at 92-as intervals, can be generated by microbunching\nof relativistic electrons and positrons in an optical laser pulse. The symmetry\nbetween electrons and positrons in the bunch stabilizes the system and enables\nthe rapid formation of dense microbunches over a ten-micrometer distance\ninstead of the tens of meters typically required in an undulator. The high\nmicrobunch density and the stable spectral phase up to emitted photon energies\nof about 350 eV, allow for the creation of orders of magnitude more compact\nsources of XUV light that could be employed in physics, chemistry, biology, and\nindustry.",
            "pdf_url": "http://arxiv.org/pdf/2411.17631v1",
            "published": "2024-11-26 17:43:51+00:00",
            "updated": "2024-11-26 17:43:51+00:00"
        },
        {
            "title": "Equivariant neural networks for robust $\\textit{CP}$ observables",
            "authors": "Sergio Sánchez Cruz, Marina Kolosova, Clara Ramón Álvarez, Giovanni Petrucciani, Pietro Vischia",
            "summary": "We introduce the usage of equivariant neural networks in the search for\nviolations of the charge-parity ($\\textit{CP}$) symmetry in particle\ninteractions at the CERN Large Hadron Collider. We design neural networks that\ntake as inputs kinematic information of recorded events and that transform\nequivariantly under the a symmetry group related to the $\\textit{CP}$\ntransformation. We show that this algorithm allows to define observables\nreflecting the properties of the $\\textit{CP}$ symmetry, showcasing its\nperformance in several reference processes in top quark and electroweak\nphysics. Imposing equivariance as an inductive bias in the algorithm improves\nthe numerical convergence properties with respect to other methods that do not\nrely on equivariance and allows to construct optimal observables that\nsignificantly improve the state-of-the-art methodology in the searches\nconsidered.",
            "pdf_url": "http://arxiv.org/pdf/2405.13524v2",
            "published": "2024-05-22 10:50:36+00:00",
            "updated": "2024-11-26 17:43:51+00:00"
        },
        {
            "title": "Flame-wall interaction of thermodiffusively unstable hydrogen/air flames -- Part I: Characterization of governing physical phenomena",
            "authors": "Max Schneider, Hendrik Nicolai, Vinzenz Schuh, Matthias Steinhausen, Christian Hasse",
            "summary": "Hydrogen combustion systems operated under fuel-lean conditions offer great\npotential for low emissions. However, these operating conditions are also\nsusceptible to intrinsic thermodiffusive combustion instabilities. Even though\ntechnical combustors are enclosed by walls that significantly influence the\ncombustion process, intrinsic flame instabilities have mostly been investigated\nin canonical freely-propagating flame configurations unconfined by walls. This\nstudy aims to close this gap by investigating the flame-wall interaction of\nthermodiffusive unstable hydrogen/air flame through detailed numerical\nsimulations in a two-dimensional head-on quenching configuration. It presents\nan in-depth qualitative and quantitative analysis of the quenching process,\nrevealing the major impact factors of the instabilities on the quenching\ncharacteristics. The thermodiffusive instabilities result in lower quenching\ndistances and increased wall heat fluxes compared to one-dimensional head-on\nquenching flames under similar operation conditions. The change in quenching\ncharacteristics seems not to be driven by kinematic effects. Instead, the\nincreased wall heat fluxes are caused by the enhanced flame reactivity of the\nunstable flame approaching the wall, which results from mixture variations\nassociated with the instabilities. Overall, the study highlights the importance\nof studying flame-wall interaction in more complex domains than simple\none-dimensional configurations, where such instabilities are inherently\nsuppressed. Further, it emphasizes the need to incorporate local mixture\nvariations induced by intrinsic combustion instabilities in combustion models\nfor flame-wall interactions. In part II of this study, the scope is expanded to\ngas turbine and internal combustion engine relevant conditions through a\nparametric study, varying the equivalence ratio, pressure, and unburnt\ntemperature.",
            "pdf_url": "http://arxiv.org/pdf/2411.17590v1",
            "published": "2024-11-26 16:56:30+00:00",
            "updated": "2024-11-26 16:56:30+00:00"
        },
        {
            "title": "Multi-IMPT: a biologically equivalent approach to proton ARC therapy",
            "authors": "Nimita Shinde, Yanan Zhu, Wei Wang, Wangyao Li, Yuting Lin, Gregory N Gan, Christopher Lominska, Ronny Rotondo, Ronald C Chen, Hao Gao",
            "summary": "Objective: Proton spot-scanning arc therapy (ARC) is an emerging modality\nthat can improve the high-dose conformity to targets compared with standard\nintensity-modulated proton therapy (IMPT). However, the efficient treatment\ndelivery of ARC is challenging due to the required frequent energy changes\nduring the continuous gantry rotation. This work proposes a novel method that\ndelivers a multiple IMPT (multi-IMPT) plan that is equivalent to ARC in terms\nof biologically effective dose (BED).\n  Approach: The proposed multi-IMPT method utilizes a different subset of\nlimited number of beam angles in each fraction for dose delivery. Due to the\ndifferent dose delivered to organs at risk (OAR) in each fraction, we optimize\nbiologically effective dose (BED) for OAR and the physical dose delivered for\ntarget in each fraction. The BED-based multi-IMPT inverse optimization problem\nis solved via the iterative convex relaxation method and the alternating\ndirection method of multipliers. The effectiveness of the proposed multi-IMPT\nmethod is evaluated in terms of dose objectives in comparison with ARC.\n  Main results: Multi-IMPT provided similar plan quality with ARC. For example,\nmulti-IMPT provided better OAR sparing and slightly better target dose coverage\nfor the prostate case; similar dose distribution for the lung case; slightly\nworse dose coverage for the brain case; better dose coverage but slightly\nhigher BED in OAR for the head-and-neck case.\n  Significance: We have proposed a multi-IMPT approach to deliver\nARC-equivalent plan quality.\n  Keywords: biologically effective dose (BED), proton arc therapy",
            "pdf_url": "http://arxiv.org/pdf/2411.17578v1",
            "published": "2024-11-26 16:42:17+00:00",
            "updated": "2024-11-26 16:42:17+00:00"
        },
        {
            "title": "Observation and characterisation of trapped electron modes in Wendelstein 7-X",
            "authors": "A. Krämer-Flecken, J. H. E. Proll, G. Weir, P. Costello, G. Fuchert, J. Geiger, S. Heuraux, A. Knieps, A. Langenberg, S. Vaz Mendes, N. Pablant, E. Pasch, K. Rahbarnia, R. Sabot, L. Salazar, H. M. Smith, H. Thomsen, T. Windisch, H. M. Xiang, the W7-X-team",
            "summary": "In the past, quasi coherent modes were reported for nearly all tokamaks. The\ngeneral definition describes modes as quasi coherent when the magnitude squared\ncoherence is in the range of \\SIrange{0.3}{0.6}{}. Quasi coherent modes are\nobserved in the plasma core as well as in the plasma edge and can have quite\ndifferent physical origins. The one in the core are observed in plasmas with\nlow collisionality, where the electron temperature exceeds the ion temperature\nin the plasma core. This is the case for electron cyclotron heating in general.\nThe origin of these modes are electrons trapped within a magnetic mirror, as\nreported in the past from various fusion devices. The so-called\ntrapped-electron modes (TEMs) belong to drift wave instabilities and can be\ndestabilized by electron-temperature gradients in the plasma core. From the\ndiagnostic point of view, quasi coherent modes appear as fluctuations in\nelectron density and temperature. Therefore, the microwave reflectometer is\nvery well suited to monitor these modes. This paper describes experiments,\nconducted at the Wendelstein 7-X stellarator (W7-X), which aim at detecting\nquasi coherent modes at low wave numbers. A Poloidal Correlation Reflectometer\n(PCR) installed at W7-X, is able to measure low wave numbers ($k_\\perp\\le 3.5$\ncm$^{-1}$). For different magnetic configurations and plasma parameters, broad\nquasi-coherent structures are observed in the coherence spectra. From the\nanalysis of the rotation and the poloidal structure, these quasi coherent (QC)\nmodes show the properties of electron-temperature-gradient driven TEMs. A\nlinear relation between the mode velocity and the rotation frequency is found.\nThe relation is uniform and confirms the nature of QC-mode observation as TEM\nin tokamaks, too.",
            "pdf_url": "http://arxiv.org/pdf/2408.12900v3",
            "published": "2024-08-23 08:06:40+00:00",
            "updated": "2024-11-26 16:25:58+00:00"
        },
        {
            "title": "Variational Quantum Simulation of the Fokker-Planck Equation applied to Quantum Radiation Reaction",
            "authors": "Óscar Amaro, Lucas I. Iñigo Gamiz, Marija Vranic",
            "summary": "Near-future experiments with Petawatt class lasers are expected to produce a\nhigh flux of gamma-ray photons and electron-positron pairs through Strong Field\nQuantum Electrodynamical processes. Simulations of the expected regime of\nlaser-matter interaction are computationally intensive due to the disparity of\nthe spatial and temporal scales and because quantum and classical descriptions\nneed to be accounted for simultaneously (classical for collective effects and\nquantum for nearly-instantaneous events of hard photon emission and pair\ncreation). A typical configuration for experiments is a scattering of an\nelectron and a laser beam which can be mapped to an equivalent problem with\nconstant magnetic field. We study the stochastic cooling of an electron beam in\na strong constant uniform magnetic field, both its particle distribution\nfunctions and their energy momenta. We start by obtaining approximate\nclosed-form analytical solutions to the relevant observables. Then, we apply\nthe quantum-hybrid Variational Quantum Imaginary Time Evolution to the\nFokker-Planck equation describing this process, and compare against theory and\nresults from Particle-In-Cell simulations and classical Partial Differential\nEquation solvers, showing good agreement. This work will be useful as a first\nstep towards quantum simulation of plasma physics scenarios where diffusion\nprocesses are important, in particular in strong electromagnetic fields.",
            "pdf_url": "http://arxiv.org/pdf/2411.17517v1",
            "published": "2024-11-26 15:27:00+00:00",
            "updated": "2024-11-26 15:27:00+00:00"
        },
        {
            "title": "Scalar and tensor meson dominance and gravitational form factors of the pion",
            "authors": "Enrique Ruiz Arriola, Wojciech Broniowski",
            "summary": "We analyze the recent MIT lattice data for the gravitational form factors\n(GFFs) of the pion which extend up to $Q^2= 2~{\\rm GeV}^2$ for\n$m_\\pi=170$~MeV~\\cite{Hackett:2023nkr}. We show that simple monopole fits\ncomply with the old idea of meson dominance. We use Chiral Perturbation theory\n($\\chi$PT) to next-to-leading order (NLO) to transform the MIT data to the\nphysical world with $m_\\pi=140~$MeV and find that the spin-0 GFF is effectively\nsaturated with the $f_0(600)$ and the spin-2 with the $f_2(1270)$, with\nmonopole masses $m_\\sigma= 630(60)$~MeV and $m_{f_2}= 1270(40)$~MeV. We\ndetermine in passing the chiral low energy constants (LECs) from the MIT\nlattice data alone \\[ 10^3 \\cdot L_{11} (m_\\rho^2)=1.06(15) \\, , \\qquad 10^3\n\\cdot L_{12} (m_\\rho^2)= -2.2(1) \\, , \\qquad 10^3 \\cdot L_{13} (m_\\rho^2) =\n-0.7(1.1). \\] which agree in sign and order of magnitude % to be compared with\nthe original estimates by Donoghue and Leutwyler. The corresponding D-term\n(druck) has the value $ D(0) = -0.95(3) $. We also analyze the sum rules based\non perturbative QCD (pQCD) that imply that the corresponding spectral functions\nare not positive definite. We show that these sum rules are strongly violated\nin a variety of $\\pi\\pi-K \\bar K$ coupled channel Omn\\`es-Muskhelishvili\ncalculations. This is not mended by the inclusion of the pQCD tail, suggesting\nthe need for an extra negative spectral strength. Using a simple model\nimplementing all sum rules, we find the expected onset of pQCD at very high\nmomenta.",
            "pdf_url": "http://arxiv.org/pdf/2411.10354v2",
            "published": "2024-11-15 17:02:50+00:00",
            "updated": "2024-11-26 15:24:03+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "StableAnimator: High-Quality Identity-Preserving Human Image Animation",
            "authors": "Shuyuan Tu, Zhen Xing, Xintong Han, Zhi-Qi Cheng, Qi Dai, Chong Luo, Zuxuan Wu",
            "summary": "Current diffusion models for human image animation struggle to ensure\nidentity (ID) consistency. This paper presents StableAnimator, the first\nend-to-end ID-preserving video diffusion framework, which synthesizes\nhigh-quality videos without any post-processing, conditioned on a reference\nimage and a sequence of poses. Building upon a video diffusion model,\nStableAnimator contains carefully designed modules for both training and\ninference striving for identity consistency. In particular, StableAnimator\nbegins by computing image and face embeddings with off-the-shelf extractors,\nrespectively and face embeddings are further refined by interacting with image\nembeddings using a global content-aware Face Encoder. Then, StableAnimator\nintroduces a novel distribution-aware ID Adapter that prevents interference\ncaused by temporal layers while preserving ID via alignment. During inference,\nwe propose a novel Hamilton-Jacobi-Bellman (HJB) equation-based optimization to\nfurther enhance the face quality. We demonstrate that solving the HJB equation\ncan be integrated into the diffusion denoising process, and the resulting\nsolution constrains the denoising path and thus benefits ID preservation.\nExperiments on multiple benchmarks show the effectiveness of StableAnimator\nboth qualitatively and quantitatively.",
            "pdf_url": "http://arxiv.org/pdf/2411.17697v1",
            "published": "2024-11-26 18:59:22+00:00",
            "updated": "2024-11-26 18:59:22+00:00"
        },
        {
            "title": "Mixed-State Quantum Denoising Diffusion Probabilistic Model",
            "authors": "Gino Kwun, Bingzhi Zhang, Quntao Zhuang",
            "summary": "Generative quantum machine learning has gained significant attention for its\nability to produce quantum states with desired distributions. Among various\nquantum generative models, quantum denoising diffusion probabilistic models\n(QuDDPMs) [Phys. Rev. Lett. 132, 100602 (2024)] provide a promising approach\nwith stepwise learning that resolves the training issues. However, the\nrequirement of high-fidelity scrambling unitaries in QuDDPM poses a challenge\nin near-term implementation. We propose the \\textit{mixed-state quantum\ndenoising diffusion probabilistic model} (MSQuDDPM) to eliminate the need for\nscrambling unitaries. Our approach focuses on adapting the quantum noise\nchannels to the model architecture, which integrates depolarizing noise\nchannels in the forward diffusion process and parameterized quantum circuits\nwith projective measurements in the backward denoising steps. We also introduce\nseveral techniques to improve MSQuDDPM, including a cosine-exponent schedule of\nnoise interpolation, the use of single-qubit random ancilla, and\nsuperfidelity-based cost functions to enhance the convergence. We evaluate\nMSQuDDPM on quantum ensemble generation tasks, demonstrating its successful\nperformance.",
            "pdf_url": "http://arxiv.org/pdf/2411.17608v1",
            "published": "2024-11-26 17:20:58+00:00",
            "updated": "2024-11-26 17:20:58+00:00"
        },
        {
            "title": "On Statistical Rates of Conditional Diffusion Transformers: Approximation, Estimation and Minimax Optimality",
            "authors": "Jerry Yao-Chieh Hu, Weimin Wu, Yi-Chen Lee, Yu-Chao Huang, Minshuo Chen, Han Liu",
            "summary": "We investigate the approximation and estimation rates of conditional\ndiffusion transformers (DiTs) with classifier-free guidance. We present a\ncomprehensive analysis for ``in-context'' conditional DiTs under four common\ndata assumptions. We show that both conditional DiTs and their latent variants\nlead to the minimax optimality of unconditional DiTs under identified settings.\nSpecifically, we discretize the input domains into infinitesimal grids and then\nperform a term-by-term Taylor expansion on the conditional diffusion score\nfunction under H\\\"older smooth data assumption. This enables fine-grained use\nof transformers' universal approximation through a more detailed piecewise\nconstant approximation and hence obtains tighter bounds. Additionally, we\nextend our analysis to the latent setting under the linear latent subspace\nassumption. We not only show that latent conditional DiTs achieve lower bounds\nthan conditional DiTs both in approximation and estimation, but also show the\nminimax optimality of latent unconditional DiTs. Our findings establish\nstatistical limits for conditional and unconditional DiTs, and offer practical\nguidance toward developing more efficient and accurate DiT models.",
            "pdf_url": "http://arxiv.org/pdf/2411.17522v1",
            "published": "2024-11-26 15:30:48+00:00",
            "updated": "2024-11-26 15:30:48+00:00"
        },
        {
            "title": "WF-VAE: Enhancing Video VAE by Wavelet-Driven Energy Flow for Latent Video Diffusion Model",
            "authors": "Zongjian Li, Bin Lin, Yang Ye, Liuhan Chen, Xinhua Cheng, Shenghai Yuan, Li Yuan",
            "summary": "Video Variational Autoencoder (VAE) encodes videos into a low-dimensional\nlatent space, becoming a key component of most Latent Video Diffusion Models\n(LVDMs) to reduce model training costs. However, as the resolution and duration\nof generated videos increase, the encoding cost of Video VAEs becomes a\nlimiting bottleneck in training LVDMs. Moreover, the block-wise inference\nmethod adopted by most LVDMs can lead to discontinuities of latent space when\nprocessing long-duration videos. The key to addressing the computational\nbottleneck lies in decomposing videos into distinct components and efficiently\nencoding the critical information. Wavelet transform can decompose videos into\nmultiple frequency-domain components and improve the efficiency significantly,\nwe thus propose Wavelet Flow VAE (WF-VAE), an autoencoder that leverages\nmulti-level wavelet transform to facilitate low-frequency energy flow into\nlatent representation. Furthermore, we introduce a method called Causal Cache,\nwhich maintains the integrity of latent space during block-wise inference.\nCompared to state-of-the-art video VAEs, WF-VAE demonstrates superior\nperformance in both PSNR and LPIPS metrics, achieving 2x higher throughput and\n4x lower memory consumption while maintaining competitive reconstruction\nquality. Our code and models are available at\nhttps://github.com/PKU-YuanGroup/WF-VAE.",
            "pdf_url": "http://arxiv.org/pdf/2411.17459v1",
            "published": "2024-11-26 14:23:53+00:00",
            "updated": "2024-11-26 14:23:53+00:00"
        },
        {
            "title": "Efficient Long Video Tokenization via Coordinate-based Patch Reconstruction",
            "authors": "Huiwon Jang, Sihyun Yu, Jinwoo Shin, Pieter Abbeel, Younggyo Seo",
            "summary": "Efficient tokenization of videos remains a challenge in training vision\nmodels that can process long videos. One promising direction is to develop a\ntokenizer that can encode long video clips, as it would enable the tokenizer to\nleverage the temporal coherence of videos better for tokenization. However,\ntraining existing tokenizers on long videos often incurs a huge training cost\nas they are trained to reconstruct all the frames at once. In this paper, we\nintroduce CoordTok, a video tokenizer that learns a mapping from\ncoordinate-based representations to the corresponding patches of input videos,\ninspired by recent advances in 3D generative models. In particular, CoordTok\nencodes a video into factorized triplane representations and reconstructs\npatches that correspond to randomly sampled $(x,y,t)$ coordinates. This allows\nfor training large tokenizer models directly on long videos without requiring\nexcessive training resources. Our experiments show that CoordTok can\ndrastically reduce the number of tokens for encoding long video clips. For\ninstance, CoordTok can encode a 128-frame video with 128$\\times$128 resolution\ninto 1280 tokens, while baselines need 6144 or 8192 tokens to achieve similar\nreconstruction quality. We further show that this efficient video tokenization\nenables memory-efficient training of a diffusion transformer that can generate\n128 frames at once.",
            "pdf_url": "http://arxiv.org/pdf/2411.14762v2",
            "published": "2024-11-22 06:50:44+00:00",
            "updated": "2024-11-26 14:03:14+00:00"
        }
    ]
}