{
    "Physics": [
        {
            "title": "X-Diffusion: Training Diffusion Policies on Cross-Embodiment Human Demonstrations",
            "authors": "Maximus A. Pace, Prithwish Dan, Chuanruo Ning, Atiksh Bhardwaj, Audrey Du, Edward W. Duan, Wei-Chiu Ma, Kushal Kedia",
            "summary": "Human videos can be recorded quickly and at scale, making them an appealing\nsource of training data for robot learning. However, humans and robots differ\nfundamentally in embodiment, resulting in mismatched action execution. Direct\nkinematic retargeting of human hand motion can therefore produce actions that\nare physically infeasible for robots. Despite these low-level differences,\nhuman demonstrations provide valuable motion cues about how to manipulate and\ninteract with objects. Our key idea is to exploit the forward diffusion\nprocess: as noise is added to actions, low-level execution differences fade\nwhile high-level task guidance is preserved. We present X-Diffusion, a\nprincipled framework for training diffusion policies that maximally leverages\nhuman data without learning dynamically infeasible motions. X-Diffusion first\ntrains a classifier to predict whether a noisy action is executed by a human or\nrobot. Then, a human action is incorporated into policy training only after\nadding sufficient noise such that the classifier cannot discern its embodiment.\nActions consistent with robot execution supervise fine-grained denoising at low\nnoise levels, while mismatched human actions provide only coarse guidance at\nhigher noise levels. Our experiments show that naive co-training under\nexecution mismatches degrades policy performance, while X-Diffusion\nconsistently improves it. Across five manipulation tasks, X-Diffusion achieves\na 16% higher average success rate than the best baseline. The project website\nis available at https://portal-cornell.github.io/X-Diffusion/.",
            "pdf_url": "http://arxiv.org/pdf/2511.04671v1",
            "published": "2025-11-06 18:56:30+00:00",
            "updated": "2025-11-06 18:56:30+00:00"
        },
        {
            "title": "Real-to-Sim Robot Policy Evaluation with Gaussian Splatting Simulation of Soft-Body Interactions",
            "authors": "Kaifeng Zhang, Shuo Sha, Hanxiao Jiang, Matthew Loper, Hyunjong Song, Guangyan Cai, Zhuo Xu, Xiaochen Hu, Changxi Zheng, Yunzhu Li",
            "summary": "Robotic manipulation policies are advancing rapidly, but their direct\nevaluation in the real world remains costly, time-consuming, and difficult to\nreproduce, particularly for tasks involving deformable objects. Simulation\nprovides a scalable and systematic alternative, yet existing simulators often\nfail to capture the coupled visual and physical complexity of soft-body\ninteractions. We present a real-to-sim policy evaluation framework that\nconstructs soft-body digital twins from real-world videos and renders robots,\nobjects, and environments with photorealistic fidelity using 3D Gaussian\nSplatting. We validate our approach on representative deformable manipulation\ntasks, including plush toy packing, rope routing, and T-block pushing,\ndemonstrating that simulated rollouts correlate strongly with real-world\nexecution performance and reveal key behavioral patterns of learned policies.\nOur results suggest that combining physics-informed reconstruction with\nhigh-quality rendering enables reproducible, scalable, and accurate evaluation\nof robotic manipulation policies. Website: https://real2sim-eval.github.io/",
            "pdf_url": "http://arxiv.org/pdf/2511.04665v1",
            "published": "2025-11-06 18:52:08+00:00",
            "updated": "2025-11-06 18:52:08+00:00"
        },
        {
            "title": "Nowcast3D: Reliable precipitation nowcasting via gray-box learning",
            "authors": "Huaguan Chen, Wei Han, Haofei Sun, Ning Lin, Xingtao Song, Yunfan Yang, Jie Tian, Yang Liu, Ji-Rong Wen, Xiaoye Zhang, Xueshun Shen, Hao Sun",
            "summary": "Extreme precipitation nowcasting demands high spatiotemporal fidelity and\nextended lead times, yet existing approaches remain limited. Numerical Weather\nPrediction (NWP) and its deep-learning emulations are too slow and coarse for\nrapidly evolving convection, while extrapolation and purely data-driven models\nsuffer from error accumulation and excessive smoothing. Hybrid 2D radar-based\nmethods discard crucial vertical information, preventing accurate\nreconstruction of height-dependent dynamics. We introduce a gray-box, fully\nthree-dimensional nowcasting framework that directly processes volumetric radar\nreflectivity and couples physically constrained neural operators with\ndatadriven learning. The model learns vertically varying 3D advection fields\nunder a conservative advection operator, parameterizes spatially varying\ndiffusion, and introduces a Brownian-motion--inspired stochastic term to\nrepresent unresolved motions. A residual branch captures small-scale convective\ninitiation and microphysical variability, while a diffusion-based stochastic\nmodule estimates uncertainty. The framework achieves more accurate forecasts up\nto three-hour lead time across precipitation regimes and ranked first in 57\\%\nof cases in a blind evaluation by 160 meteorologists. By restoring full 3D\ndynamics with physical consistency, it offers a scalable and robust pathway for\nskillful and reliable nowcasting of extreme precipitation.",
            "pdf_url": "http://arxiv.org/pdf/2511.04659v1",
            "published": "2025-11-06 18:44:35+00:00",
            "updated": "2025-11-06 18:44:35+00:00"
        },
        {
            "title": "Automated Discovery of Non-local Photonic Gates",
            "authors": "Sören Arlt, Mario Krenn, Xuemei Gu",
            "summary": "Interactions between quantum systems enable quantum gates, the building\nblocks of quantum information processing. In photonics, direct photon-photon\ninteractions are too weak to be practically useful, so effective interactions\nare engineered with linear optics and measurement. A central challenge is to\nrealize such interactions non-locally, i.e., between photons that remain\nspatially separated. We present experimental proposals for several essential\nnon-local multiphoton quantum gates that act on spatially separated photons, in\nboth qubit and high-dimensional qudit systems. All solutions were discovered by\nthe AI-driven discovery system called PyTheus. Rather than using pre-shared\nentanglement or Bell state measurements, our gates use as a resource quantum\nindistinguishability by path identity - a technique that exploits coherent\nsuperpositions of the photon pair origins. While analyzing these solutions, we\nuncovered a new mechanism that mimics much of the properties of quantum\nteleportation, without shared entanglement or Bell state measurements.\nTechnically, our results establish path indistinguishability as a practical\nresource for distributed quantum information processing; conceptually, they\ndemonstrate how automated discovery systems can contribute new ideas and\ntechniques in physics.",
            "pdf_url": "http://arxiv.org/pdf/2511.04648v1",
            "published": "2025-11-06 18:38:30+00:00",
            "updated": "2025-11-06 18:38:30+00:00"
        },
        {
            "title": "The phase-field model of fracture incorporating Mohr-Coulomb, Mogi-Coulomb, and Hoek-Brown strength surfaces",
            "authors": "S Chockalingam, Adrian Buganza Tepole, Aditya Kumar",
            "summary": "Classical phase-field theories of brittle fracture capture\ntoughness-controlled crack propagation but do not account for the material's\nstrength surface, which governs fracture nucleation in the absence of cracks.\nThe phase-field formulation of Kumar et al. (2020) proposed a blueprint for\nincorporating the strength surface while preserving toughness-controlled\npropagation by introducing a nucleation driving force and presented results for\nthe Drucker--Prager surface. Following this blueprint, Chockalingam (2025)\nrecently derived a general driving-force expression that incorporates arbitrary\nstrength surfaces. The present work implements this driving force within a\nfinite-element framework and incorporates representative strength surfaces that\nspan diverse mathematical and physical characteristics -- the Mohr--Coulomb, 3D\nHoek--Brown, and Mogi--Coulomb surfaces. Through simulations of canonical\nfracture problems, the formulation is comprehensively validated across fracture\nregimes, capturing (i) nucleation under uniform stress, (ii) crack growth from\nlarge pre-existing flaws, and (iii) fracture governed jointly by strength and\ntoughness. While the strength surfaces examined here already encompass a broad\nrange of brittle materials, the results demonstrate the generality and\nrobustness of the proposed driving-force construction for materials governed by\narbitrary strength surfaces.",
            "pdf_url": "http://arxiv.org/pdf/2511.04627v1",
            "published": "2025-11-06 18:23:53+00:00",
            "updated": "2025-11-06 18:23:53+00:00"
        },
        {
            "title": "Implications of recent $\\left(g-2\\right)_μ$ measurements for MeV-GeV dark sector searches",
            "authors": "Aleksandr Pustyntsev, Marc Vanderhaeghen",
            "summary": "Recent theoretical and experimental studies of the muon magnetic moment\nindicate the absence of the previously reported discrepancy, providing a vital\nopportunity to constrain potential BSM physics. In this work, we explore the\nMeV-GeV mass range, where existing exclusion limits remain relatively loose. We\nanalyze both scalar and pseudoscalar as well as vector and axial vector\nmediators. We demonstrate that the new bounds are not only comparable to - but\nin several cases, significantly more stringent than - the constraints obtained\nfrom previous collider experiments, even when near-future projections are\nconsidered.",
            "pdf_url": "http://arxiv.org/pdf/2506.17750v2",
            "published": "2025-06-21 16:12:07+00:00",
            "updated": "2025-11-06 18:11:52+00:00"
        },
        {
            "title": "Effective matter sectors from modified entropies",
            "authors": "Ankit Anand, Sahil Devdutt, Kimet Jusufi, Emmanuel N. Saridakis",
            "summary": "We present a general formalism linking modified entropy functions directly to\na modified spacetime metric and, subsequently, to an effective matter sector of\nentropic origin. In particular, within the framework of general relativity,\nstarting from the first law of black-hole thermodynamics we establish an\nexplicit correspondence between the entropy derivative and the metric function,\nwhich naturally leads to an emergent stress-energy tensor representing an\nanisotropic effective fluid. This backreaction effect of horizon entropy may\nresolve possible inconsistencies recently identified in black hole physics with\nmodified entropies. As specific examples, we apply this procedure to a wide\nclass of modified entropies, such as Barrow, Tsallis-Cirto, Renyi, Kaniadakis,\nlogarithmic, power-law, loop-quantum-gravity, and exponential modifications,\nand we derive the associated effective matter sectors, analyzing their physical\nproperties and energy conditions.",
            "pdf_url": "http://arxiv.org/pdf/2511.04613v1",
            "published": "2025-11-06 18:05:18+00:00",
            "updated": "2025-11-06 18:05:18+00:00"
        },
        {
            "title": "Qubit Mapping and Routing tailored to Advanced Quantum ISAs: Not as Costly as You Think",
            "authors": "Zhaohui Yang, Kai Zhang, Xinyang Tian, Xiangyu Ren, Yingjian Liu, Yunfeng Li, Jianxin Chen, Dawei Ding, Yuanx Xie",
            "summary": "Qubit mapping/routing is a critical stage in compilation for both near-term\nand fault-tolerant quantum computers, yet existing scalable methods typically\nimpose several times the routing overhead in terms of circuit depth or\nduration. This inefficiency stems from a fundamental disconnect: compilers rely\non an abstract routing model (e.g., three-$ \\mathrm{CX} $-unrolled SWAP\ninsertion) that completely ignores the idiosyncrasies of native gates supported\nby physical devices.\n  Recent hardware breakthroughs have enabled high-precision implementations of\ndiverse instruction set architectures (ISAs) beyond standard\n$\\mathrm{CX}$-based gates. Advanced ISAs involving gates such as\n$\\mathrm{\\sqrt{iSWAP}}$ and $\\mathrm{ZZ}(\\theta)$ gates offer superior circuit\nsynthesis capabilities and can be realized with higher fidelities. However,\nsystematic compiler optimization strategies tailored to these advanced ISAs are\nlacking.\n  To address this, we propose Canopus, a unified qubit mapping/routing\nframework applicable to diverse quantum ISAs. Built upon the canonical\nrepresentation of two-qubit gates, Canopus centers on qubit routing to perform\ndeep co-optimization in an ISA-aware approach. Canopus leverages the two-qubit\ncanonical representation and the monodromy polytope to model the synthesis cost\nfor more intelligent $ \\mathrm{SWAP} $ insertion during the routing stage. We\nalso formalize the commutation relations between two-qubit gates through the\ncanonical form, providing a generalized approach to commutativity-based\noptimizations. Experiments show that Canopus consistently reduces routing\noverhead by 15\\%-35\\% compared to state-of-the-art methods across different\nISAs and topologies. Our work also presents a coherent method for\nco-exploration of program patterns, quantum ISAs, and hardware topologies.",
            "pdf_url": "http://arxiv.org/pdf/2511.04608v1",
            "published": "2025-11-06 17:58:53+00:00",
            "updated": "2025-11-06 17:58:53+00:00"
        },
        {
            "title": "Controlling Hong-Ou-Mandel antibunching via parity governed spectral shaping of biphoton states",
            "authors": "Mikhail Guselnikov, Alexei D. Kiselev, Andrei Gaidash, George Miroshnichenko, Anton Kozubov",
            "summary": "We investigate into experimentally detectable effects such as the\nHong-Ou-Mandel (HOM) bunching and antibunching. These regimes can be\ncharacterized using the symmetry degree parameter $D_S$ that enters the\ntwo-photon coincidence probability $P_{2c}=(1-D_S)/2$. In the case of HOM\nbunching (antibunching), $D_S$ is positive (negative). Though the symmetry\ndegree can generally be expressed in terms of the difference between the\ncontributions coming from the symmetric and antisymmetric parts of the biphoton\njoint spectral amplitude (JSA), $\\psi(\\omega_1,\\omega_2)$, for a certain\nphysically realizable class of the JSA, where $\\psi(\\omega_1,\\omega_2)$ is\nproportional to the product of amplitudes\n$\\varphi_1(\\omega_1)\\varphi_2(\\omega_2)$ multiplied by a Gaussian shaped\nentangling factor, we find the sign of $D_S$ is primarily governed by the\nparity properties of the spectral function,\n$\\varphi_{12}(\\omega)=\\varphi_1(\\omega)\\varphi_2^*(\\omega)$. It is the even\n(odd) part of $\\varphi_{12}=\\varphi_{12}^{(+)}+\\varphi_{12}^{(-)}$ that meets\nthe parity condition\n$\\varphi_{12}^{(+)}(\\omega-\\Omega)=\\varphi_{12}^{(+)}(\\Omega-\\omega)$\n($\\varphi_{12}^{(-)}(\\omega-\\Omega)=- \\varphi_{12}^{(-)}(\\Omega-\\omega)$) to\nyield the positive (negative) contribution, $D_S^{(+)}$ ($-D_S^{(-)}$), to the\nsymmetry degree parameter: $D_S=D_S^{(+)}-D_S^{(-)}$. We have shown that\nswitching between the bunching and antibunching regimes can be realized using\nthe experimentally accessible family of modulated biphoton states produced\nusing the spectral phase modulation fine-tuned via the sub-nanometer scale\nvariation of the path length. For this class of modulated states, the Schmidt\nnumber has been computed as a function of the modulation parameter. This\ndependence reveals the structure of narrow resonance peaks strongly correlated\nwith the corresponding narrow dips of the symmetry degree where the HOM\nantibunching occurs.",
            "pdf_url": "http://arxiv.org/pdf/2511.04604v1",
            "published": "2025-11-06 17:57:52+00:00",
            "updated": "2025-11-06 17:57:52+00:00"
        },
        {
            "title": "Cosmogenic Neutron Production in Water at SNO+",
            "authors": "SNO+ Collaboration, :, M. Abreu, A. Allega, M. R. Anderson, S. Andringa, S. Arora, D. M. Asner, D. J. Auty, A. Bacon, T. Baltazar, F. Barão, N. Barros, R. Bayes, C. Baylis, E. W. Beier, A. Bialek, S. D. Biller, E. Caden, M. Chen, S. Cheng, B. Cleveland, D. Cookman, J. Corning, S. DeGraw, R. Dehghani, J. Deloye, M. M. Depatie, C. Dima, J. Dittmer, K. H. Dixon, M. S. Esmaeilian, E. Falk, N. Fatemighomi, R. Ford, S. Gadamsetty, A. Gaur, D. Gooding, C. Grant, J. Grove, S. Hall, A. L. Hallin, D. Hallman, M. R. Hebert, W. J. Heintzelman, R. L. Helmer, C. Hewitt, B. Hreljac, P. Huang, R. Hunt-Stokes, A. S. Inácio, C. J. Jillings, S. Kaluzienski, T. Kaptanoglu, J. Kladnik, J. R. Klein, L. L. Kormos, B. Krar, C. Kraus, C. B. Krauss, T. Kroupová, C. Lake, L. Lebanowski, C. Lefebvre, B. Liggins, V. Lozza, M. Luo, S. Maguire, A. Maio, S. Manecki, J. Maneira, R. D. Martin, N. McCauley, A. B. McDonald, G. Milton, D. Morris, M. Mubasher, S. Naugle, L. J. Nolan, H. M. O'Keeffe, G. D. Orebi Gann, S. Ouyang, J. Page, S. Pal, K. Paleshi, W. Parker, L. J. Pickard, R. C. Pitelka, B. Quenallata, P. Ravi, A. Reichold, S. Riccetto, J. Rose, R. Rosero, J. Shen, J. Simms, P. Skensved, M. Smiley, M. I. Stringer, R. Tafirout, B. Tam, J. Tseng, E. Vázquez-Jáuregui, J. G. C. Veinot, C. J. Virtue, F. Wang, M. Ward, J. D. Wilson, J. R. Wilson, A. Wright, S. Yang, Z. Ye, M. Yeh, S. Yu, Y. Zhang, K. Zuber",
            "summary": "Accurate measurement of the cosmogenic muon-induced neutron yield is crucial\nfor constraining a significant background in a wide range of low-energy physics\nsearches. Although previous underground experiments have measured this yield\nacross various cosmogenic muon energies, SNO+ is uniquely positioned due to its\nexposure to one of the highest average cosmogenic muon energies at\n364\\,\\textup{GeV}. Using ultra-pure water, we have determined a neutron yield\nof\nY_{n}=(3.38^{+0.23}_{-0.30})\\times10^{-4}\\,\\textup{cm}^{2}\\textup{g}^{-1}\\mu^{-1}\nat SNO+. Comparison with simulations demonstrates clear agreement with the\n\\textsc{FLUKA} neutron production model, highlighting discrepancies with the\nwidely used \\textsc{GEANT4} model. Furthermore, this measurement reveals a\nlower cosmogenic neutron yield than that observed by the SNO experiment, which\nused heavy water under identical muon flux conditions. This result provides new\nevidence that nuclear structure and target material composition significantly\ninfluence neutron production by cosmogenic muons, offering fresh insight with\nimportant implications for the design and background modelling of future\nunderground experiments.",
            "pdf_url": "http://arxiv.org/pdf/2511.04600v1",
            "published": "2025-11-06 17:51:58+00:00",
            "updated": "2025-11-06 17:51:58+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Optimal Inference Schedules for Masked Diffusion Models",
            "authors": "Sitan Chen, Kevin Cong, Jerry Li",
            "summary": "A major bottleneck of standard auto-regressive large language models is that\ntheir inference process is inherently sequential, resulting in very long and\ncostly inference times. To circumvent this, practitioners proposed a class of\nlanguage models called diffusion language models, of which the masked diffusion\nmodel (MDM) is the most successful. The MDM is able to sample tokens\nout-of-order and, ostensibly, many tokens at once and in parallel. However,\nthere is very limited rigorous understanding of how much parallel sampling\nthese models can perform without noticeable degradation in their sampling\nperformance. Prior work of Li and Cai obtained some preliminary bounds, but\nthese are not tight for many natural classes of distributions. In this work, we\ngive a new, exact characterization of the expected divergence between the true\ndistribution and the sampled distribution, for any distribution and any\nunmasking schedule for the sampler, showing an elegant connection to the theory\nof univariate function approximation.\n  By leveraging this connection, we then attain a number of novel lower and\nupper bounds for this problem. While the connection to function approximation\nin principle gives the optimal unmasking schedule for any distribution, we show\nthat it is in general impossible to compete with it without strong a priori\nknowledge of the distribution, even in seemingly benign settings. However, we\nalso demonstrate new upper bounds and new sampling schedules in terms of\nwell-studied information-theoretic properties of the base distribution, namely,\nits total correlation and dual total correlation, which show that in some\nnatural settings, one can sample in $O(log n)$ steps without any visible loss\nin performance, where $n$ is the total sequence length.",
            "pdf_url": "http://arxiv.org/pdf/2511.04647v1",
            "published": "2025-11-06 18:38:24+00:00",
            "updated": "2025-11-06 18:38:24+00:00"
        },
        {
            "title": "Efficient probabilistic surrogate modeling techniques for partially-observed large-scale dynamical systems",
            "authors": "Hans Harder, Abhijeet Vishwasrao, Luca Guastoni, Ricardo Vinuesa, Sebastian Peitz",
            "summary": "This paper is concerned with probabilistic techniques for forecasting\ndynamical systems described by partial differential equations (such as, for\nexample, the Navier-Stokes equations). In particular, it is investigating and\ncomparing various extensions to the flow matching paradigm that reduce the\nnumber of sampling steps. In this regard, it compares direct distillation,\nprogressive distillation, adversarial diffusion distillation, Wasserstein GANs\nand rectified flows. Moreover, experiments are conducted on a set of\nchallenging systems. In particular, we also address the challenge of directly\npredicting 2D slices of large-scale 3D simulations, paving the way for\nefficient inflow generation for solvers.",
            "pdf_url": "http://arxiv.org/pdf/2511.04641v1",
            "published": "2025-11-06 18:35:01+00:00",
            "updated": "2025-11-06 18:35:01+00:00"
        },
        {
            "title": "Unified Generative Latent Representation for Functional Brain Graphs",
            "authors": "Subati Abulikemu, Tiago Azevedo, Michail Mamalakis, John Suckling",
            "summary": "Functional brain graphs are often characterized with separate graph-theoretic\nor spectral descriptors, overlooking how these properties covary and partially\noverlap across brains and conditions. We anticipate that dense, weighted\nfunctional connectivity graphs occupy a low-dimensional latent geometry along\nwhich both topological and spectral structures display graded variations. Here,\nwe estimated this unified graph representation and enabled generation of dense\nfunctional brain graphs through a graph transformer autoencoder with latent\ndiffusion, with spectral geometry providing an inductive bias to guide\nlearning. This geometry-aware latent representation, although unsupervised,\nmeaningfully separated working-memory states and decoded visual stimuli, with\nperformance further enhanced by incorporating neural dynamics. From the\ndiffusion modeled distribution, we were able to sample biologically plausible\nand structurally grounded synthetic dense graphs.",
            "pdf_url": "http://arxiv.org/pdf/2511.04539v1",
            "published": "2025-11-06 16:52:49+00:00",
            "updated": "2025-11-06 16:52:49+00:00"
        },
        {
            "title": "Diffusion & Adversarial Schrödinger Bridges via Iterative Proportional Markovian Fitting",
            "authors": "Sergei Kholkin, Grigoriy Ksenofontov, David Li, Nikita Kornilov, Nikita Gushchin, Alexandra Suvorikova, Alexey Kroshnin, Evgeny Burnaev, Alexander Korotin",
            "summary": "The Iterative Markovian Fitting (IMF) procedure, which iteratively projects\nonto the space of Markov processes and the reciprocal class, successfully\nsolves the Schr\\\"odinger Bridge (SB) problem. However, an efficient practical\nimplementation requires a heuristic modification -- alternating between fitting\nforward and backward time diffusion at each iteration. This modification is\ncrucial for stabilizing training and achieving reliable results in applications\nsuch as unpaired domain translation. Our work reveals a close connection\nbetween the modified version of IMF and the Iterative Proportional Fitting\n(IPF) procedure -- a foundational method for the SB problem, also known as\nSinkhorn's algorithm. Specifically, we demonstrate that the heuristic\nmodification of the IMF effectively integrates both IMF and IPF procedures. We\nrefer to this combined approach as the Iterative Proportional Markovian Fitting\n(IPMF) procedure. Through theoretical and empirical analysis, we establish the\nconvergence of the IPMF procedure under various settings, contributing to\ndeveloping a unified framework for solving SB problems. Moreover, from a\npractical standpoint, the IPMF procedure enables a flexible trade-off between\nimage similarity and generation quality, offering a new mechanism for tailoring\nmodels to specific tasks.",
            "pdf_url": "http://arxiv.org/pdf/2410.02601v4",
            "published": "2024-10-03 15:43:17+00:00",
            "updated": "2025-11-06 15:32:52+00:00"
        }
    ]
}