{
    "Physics": [
        {
            "title": "Scattering Spectra Models for Physics",
            "authors": "Sihao Cheng, Rudy Morel, Erwan Allys, Brice Ménard, Stéphane Mallat",
            "summary": "Physicists routinely need probabilistic models for a number of tasks such as\nparameter inference or the generation of new realizations of a field.\nEstablishing such models for highly non-Gaussian fields is a challenge,\nespecially when the number of samples is limited. In this paper, we introduce\nscattering spectra models for stationary fields and we show that they provide\naccurate and robust statistical descriptions of a wide range of fields\nencountered in physics. These models are based on covariances of scattering\ncoefficients, i.e. wavelet decomposition of a field coupled with a point-wise\nmodulus. After introducing useful dimension reductions taking advantage of the\nregularity of a field under rotation and scaling, we validate these models on\nvarious multi-scale physical fields and demonstrate that they reproduce\nstandard statistics, including spatial moments up to 4th order. These\nscattering spectra provide us with a low-dimensional structured representation\nthat captures key properties encountered in a wide range of physical fields.\nThese generic models can be used for data exploration, classification,\nparameter inference, symmetry detection, and component separation.",
            "pdf_url": "http://arxiv.org/pdf/2306.17210v2",
            "published": "2023-06-29 18:00:00+00:00",
            "updated": "2024-10-04 17:46:04+00:00"
        },
        {
            "title": "Quasilinear wave equations on asymptotically flat spacetimes with applications to Kerr black holes",
            "authors": "Mihalis Dafermos, Gustav Holzegel, Igor Rodnianski, Martin Taylor",
            "summary": "We prove global existence and decay for small-data solutions to a class of\nquasilinear wave equations on a wide variety of asymptotically flat spacetime\nbackgrounds, allowing in particular for the presence of horizons, ergoregions\nand trapped null geodesics, and including as a special case the Schwarzschild\nand very slowly rotating $\\vert a \\vert \\ll M$ Kerr family of black holes in\ngeneral relativity. There are two distinguishing aspects of our approach. The\nfirst aspect is its dyadically localised nature: The nontrivial part of the\nanalysis is reduced entirely to time-translation invariant $r^p$-weighted\nestimates, in the spirit of [DR09], to be applied on dyadic time-slabs which\nfor large $r$ are outgoing. Global existence and decay then both immediately\nfollow by elementary iteration on consecutive such time-slabs, without further\nglobal bootstrap. The second, and more fundamental, aspect is our direct use of\na \"blackbox\" linear inhomogeneous energy estimate on exactly stationary\nmetrics, together with a novel but elementary physical space top order identity\nthat need not capture the structure of trapping and is robust to perturbation.\nIn the specific example of Kerr black holes, the required linear inhomogeneous\nestimate can then be quoted directly from the literature [DRSR16], while the\nadditional top order physical space identity can be shown easily in many cases\n(we include in the Appendix a proof for the Kerr case $\\vert a \\vert \\ll M$,\nwhich can in fact be understood in this context simply as a perturbation of\nSchwarzschild). In particular, the approach circumvents the need either for\nproducing a purely physical space identity capturing trapping or for a careful\nanalysis of the commutation properties of frequency projections with the wave\noperator of time-dependent metrics.",
            "pdf_url": "http://arxiv.org/pdf/2212.14093v2",
            "published": "2022-12-28 20:43:39+00:00",
            "updated": "2024-10-04 17:45:24+00:00"
        },
        {
            "title": "Quasilinear wave equations on Kerr black holes in the full subextremal range $|a|<M$",
            "authors": "Mihalis Dafermos, Gustav Holzegel, Igor Rodnianski, Martin Taylor",
            "summary": "We prove global existence, boundedness and decay for small data solutions\n$\\psi$ to a general class of quasilinear wave equations on Kerr black hole\nbackgrounds in the full sub-extremal range $|a|<M$. The method extends our\nprevious [DHRT22], which considered such equations on a wide class of\nbackground spacetimes, including Kerr, but restricted in that case to the very\nslowly rotating regime $|a|\\ll M$ (which may be treated simply as a\nperturbation of Schwarzschild $a=0$). To handle the general $|a|<M$ case, our\npresent proof is based on two ingredients: (i) the linear inhomogeneous\nestimates on Kerr backgrounds proven in [DRSR16], further refined however in\norder to gain a derivative in elliptic frequency regimes, and (ii) the\nexistence of appropriate physical space currents satisfying degenerate\ncoercivity properties, but which now must be tailored to a finite number of\nwave packets defined by suitable frequency projection. The above ingredients\ncan be thought of as adaptations of the two basic ingredients of [DHRT22],\nexploiting however the peculiarities of the Kerr geometry. The novel frequency\ndecomposition in (ii), inspired by the boundedness arguments of [DR11, DRSR16],\nis defined using only azimuthal and stationary frequencies, and serves both to\nseparate the superradiant and non-superradiant parts of the solution and to\nlocalise trapping to small regions of spacetime. The strengthened (i), on the\nother hand, allows us to relax the required coercivity properties of our\nwave-packet dependent currents, so as in particular to accept top order errors\nprovided that they are localised to the elliptic frequency regime. These error\nterms are analysed with the help of the full Carter separation.",
            "pdf_url": "http://arxiv.org/pdf/2410.03639v1",
            "published": "2024-10-04 17:44:21+00:00",
            "updated": "2024-10-04 17:44:21+00:00"
        },
        {
            "title": "Physically Agnostic Quasinormal Mode Expansion in Time Dispersive Structures:from Mechanical Vibrations to Nanophotonic Resonances",
            "authors": "André Nicolet, Guillaume Demésy, Frédéric Zolla, Carmen Campos, Jose E. Roman, Christophe Geuzaine",
            "summary": "Resonances, also known as quasi normal modes (QNM) in the non-Hermitian case,\nplay an ubiquitous role in all domains of physics ruled by wave phenomena,\nnotably in continuum mechanics, acoustics, electrodynamics, and quantum theory.\nIn this paper, we present a QNM expansion for dispersive systems, recently\napplied to photonics but based on sixty year old techniques in mechanics. The\nresulting numerical algorithm appears to be physically agnostic, that is\nindependent of the considered physical problem and can therefore be implemented\nas a mere toolbox in a nonlinear eigenvalue computation library.",
            "pdf_url": "http://arxiv.org/pdf/2410.03631v1",
            "published": "2024-10-04 17:38:36+00:00",
            "updated": "2024-10-04 17:38:36+00:00"
        },
        {
            "title": "The fine structure of the peaks of the correlation function in acoustic black holes: a complete analytical model",
            "authors": "Paul R. Anderson, Roberto Balbinot, Richard A. Dudley, Alessandro Fabbri, Amanda Peake, Daniel Peñalver",
            "summary": "The detailed structure of the peaks appearing in the density-density\ncorrelation function for an acoustic black hole formed by a Bose-Einstein\ncondensate is analytically discussed for a particular, but physically\nmeaningful, sound velocity profile that allows the field modes to be exactly\ncomputed.",
            "pdf_url": "http://arxiv.org/pdf/2410.03629v1",
            "published": "2024-10-04 17:34:42+00:00",
            "updated": "2024-10-04 17:34:42+00:00"
        },
        {
            "title": "A concept of a para-hydrogen-based cold neutron source for simultaneous high flux and high brightness",
            "authors": "Alexander Ioffe, Petr Konik, Konstantin Batkov",
            "summary": "A novel cold neutron source (CNS) employing chessboard or staircase\nassemblies of high-aspect ratio rectangular (HARR) para-hydrogen (p-H2)\nmoderators is proposed. It is demonstrated that this design can generate\nneutron beams with higher intensity and brightness, up to 2.5 times more than\nany p-H2 based CNS with an equal cold neutron beam cross-section made of a\nsingle moderator (flat or voluminous). Two limiting factors for this gain are\nidentified: the limited volume of the high-density thermal neutron region\nsurrounding the reactor core or spallation target imposing constraints on the\ntotal length of the moderator assembly and the finite width of moderator walls.\nAdditional factors affecting gain can be revealed by dedicated Monte Carlo\nsimulations of the moderator-reflector assembly, which can only be conducted\nfor a particular neutron source and are beyond the scope of this general study.\nMoreover, the relatively large length of moderator assemblies makes their\napplication for short pulse neutron sources very problematic. Analytic approach\nfor calculating the brightness of p-H2 moderators is introduced. Because\nbrightness gain originates from a near-the-surface effect resulting from the\nprevailing single collision process, HARR CMs offer a significant increase, up\nto a factor of 10, in cold neutron brightness. The obtained results are in\nexcellent agreement with MCNP calculations. The concept of 'low-dimensionality'\n(low-d) in moderators is explored: achieving a substantial increase in\nbrightness necessitates CMs to be low-d both geometrically (HARR) and\nphysically, requiring the moderator's smallest dimension to be smaller than the\nmean free path for thermal neutrons. This explains why additional compression\nof the CM along the longest direction, effectively giving it a tube-like shape,\ndoes not leads to a significant brightness increase comparable to the\nflattening of CM.",
            "pdf_url": "http://arxiv.org/pdf/2311.15389v7",
            "published": "2023-11-26 19:14:59+00:00",
            "updated": "2024-10-04 17:23:50+00:00"
        },
        {
            "title": "LInK: Learning Joint Representations of Design and Performance Spaces through Contrastive Learning for Mechanism Synthesis",
            "authors": "Amin Heyrani Nobari, Akash Srivastava, Dan Gutfreund, Kai Xu, Faez Ahmed",
            "summary": "In this paper, we introduce LInK, a novel framework that integrates\ncontrastive learning of performance and design space with optimization\ntechniques for solving complex inverse problems in engineering design with\ndiscrete and continuous variables. We focus on the path synthesis problem for\nplanar linkage mechanisms. By leveraging a multimodal and\ntransformation-invariant contrastive learning framework, LInK learns a joint\nrepresentation that captures complex physics and design representations of\nmechanisms, enabling rapid retrieval from a vast dataset of over 10 million\nmechanisms. This approach improves precision through the warm start of a\nhierarchical unconstrained nonlinear optimization algorithm, combining the\nrobustness of traditional optimization with the speed and adaptability of\nmodern deep learning methods. Our results on an existing benchmark demonstrate\nthat LInK outperforms existing methods with 28 times less error compared to a\nstate of the art approach while taking 20 times less time on an existing\nbenchmark. Moreover, we introduce a significantly more challenging benchmark,\nnamed LINK ABC, which involves synthesizing linkages that trace the\ntrajectories of English capital alphabets, an inverse design benchmark task\nthat existing methods struggle with due to large nonlinearities and tiny\nfeasible space. Our results demonstrate that LInK not only advances the field\nof mechanism design but also broadens the applicability of contrastive learning\nand optimization to other areas of engineering. The code and data are publicly\navailable at https://github.com/ahnobari/LInK.",
            "pdf_url": "http://arxiv.org/pdf/2405.20592v2",
            "published": "2024-05-31 03:04:57+00:00",
            "updated": "2024-10-04 17:13:43+00:00"
        },
        {
            "title": "Language Model Empowered Spatio-Temporal Forecasting via Physics-Aware Reprogramming",
            "authors": "Hao Wang, Jindong Han, Wei Fan, Hao Liu",
            "summary": "Spatio-temporal forecasting is pivotal in numerous real-world applications,\nincluding transportation planning, energy management, and climate monitoring.\nIn this work, we aim to harness the reasoning and generalization abilities of\nPre-trained Language Models (PLMs) for more effective spatio-temporal\nforecasting, particularly in data-scarce scenarios. However, recent studies\nuncover that PLMs, which are primarily trained on textual data, often falter\nwhen tasked with modeling the intricate correlations in numerical time series,\nthereby limiting their effectiveness in comprehending spatio-temporal data. To\nbridge the gap, we propose RePST, a physics-aware PLM reprogramming framework\ntailored for spatio-temporal forecasting. Specifically, we first propose a\nphysics-aware decomposer that adaptively disentangles spatially correlated time\nseries into interpretable sub-components, which facilitates PLM to understand\nsophisticated spatio-temporal dynamics via a divide-and-conquer strategy.\nMoreover, we propose a selective discrete reprogramming scheme, which\nintroduces an expanded spatio-temporal vocabulary space to project\nspatio-temporal series into discrete representations. This scheme minimizes the\ninformation loss during reprogramming and enriches the representations derived\nby PLMs. Extensive experiments on real-world datasets show that the proposed\nRePST outperforms twelve state-of-the-art baseline methods, particularly in\ndata-scarce scenarios, highlighting the effectiveness and superior\ngeneralization capabilities of PLMs for spatio-temporal forecasting.",
            "pdf_url": "http://arxiv.org/pdf/2408.14505v2",
            "published": "2024-08-24 07:59:36+00:00",
            "updated": "2024-10-04 17:08:17+00:00"
        },
        {
            "title": "BRST Covariant Phase Space and Holographic Ward Identities",
            "authors": "Laurent Baulieu, Tom Wetzstein",
            "summary": "This paper develops an enlarged BRST framework to treat the large gauge\ntransformations of a given quantum field theory. It determines the associated\ninfinitely many Noether charges stemming from a gauge fixed and BRST invariant\nLagrangian, a result that cannot be obtained from Noether's second theorem. The\ngeometrical significance of this result is highlighted by the construction of a\ntrigraded BRST covariant phase space, allowing a BRST invariant gauge fixing\nprocedure. This provides an appropriate framework for determining the conserved\nBRST Noether current of the global BRST symmetry and the associated global\nNoether charges. The latter are found to be equivalent with the usual classical\ncorner charges of large gauge transformations. It allows one to prove the gauge\nindependence of their physical effects at the perturbative quantum level. In\nparticular, the underlying BRST fundamental canonical relation provides the\nsame graded symplectic brackets as in the classical covariant phase space. A\nunified Lagrangian Ward identity for small and large gauge transformations is\nbuilt. It consistently decouples into a bulk part for small gauge\ntransformations, which is the standard BRST--BV quantum master equation, and a\nboundary part for large gauge transformations. The boundary part provides a\nperturbation theory origin for the invariance of the Hamiltonian physical\n$\\mathcal{S}$-matrix under asymptotic symmetries. Holographic anomalies for the\nboundary Ward identity are studied and found to be solutions of a codimension\none Wess--Zumino consistency condition. Such solutions are studied in the\ncontext of extended BMS symmetry. Their existence clarifies the status of the\n$1$-loop correction to the subleading soft graviton theorem.",
            "pdf_url": "http://arxiv.org/pdf/2405.18898v3",
            "published": "2024-05-29 09:00:32+00:00",
            "updated": "2024-10-04 16:37:07+00:00"
        },
        {
            "title": "HyResPINNs: Adaptive Hybrid Residual Networks for Learning Optimal Combinations of Neural and RBF Components for Physics-Informed Modeling",
            "authors": "Madison Cooley, Robert M. Kirby, Shandian Zhe, Varun Shankar",
            "summary": "Physics-informed neural networks (PINNs) are an increasingly popular class of\ntechniques for the numerical solution of partial differential equations (PDEs),\nwhere neural networks are trained using loss functions regularized by relevant\nPDE terms to enforce physical constraints. We present a new class of PINNs\ncalled HyResPINNs, which augment traditional PINNs with adaptive hybrid\nresidual blocks that combine the outputs of a standard neural network and a\nradial basis function (RBF) network. A key feature of our method is the\ninclusion of adaptive combination parameters within each residual block, which\ndynamically learn to weigh the contributions of the neural network and RBF\nnetwork outputs. Additionally, adaptive connections between residual blocks\nallow for flexible information flow throughout the network. We show that\nHyResPINNs are more robust to training point locations and neural network\narchitectures than traditional PINNs. Moreover, HyResPINNs offer orders of\nmagnitude greater accuracy than competing methods on certain problems, with\nonly modest increases in training costs. We demonstrate the strengths of our\napproach on challenging PDEs, including the Allen-Cahn equation and the\nDarcy-Flow equation. Our results suggest that HyResPINNs effectively bridge the\ngap between traditional numerical methods and modern machine learning-based\nsolvers.",
            "pdf_url": "http://arxiv.org/pdf/2410.03573v1",
            "published": "2024-10-04 16:21:14+00:00",
            "updated": "2024-10-04 16:21:14+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Estimating Body and Hand Motion in an Ego-sensed World",
            "authors": "Brent Yi, Vickie Ye, Maya Zheng, Lea Müller, Georgios Pavlakos, Yi Ma, Jitendra Malik, Angjoo Kanazawa",
            "summary": "We present EgoAllo, a system for human motion estimation from a head-mounted\ndevice. Using only egocentric SLAM poses and images, EgoAllo guides sampling\nfrom a conditional diffusion model to estimate 3D body pose, height, and hand\nparameters that capture the wearer's actions in the allocentric coordinate\nframe of the scene. To achieve this, our key insight is in representation: we\npropose spatial and temporal invariance criteria for improving model\nperformance, from which we derive a head motion conditioning parameterization\nthat improves estimation by up to 18%. We also show how the bodies estimated by\nour system can improve the hands: the resulting kinematic and temporal\nconstraints result in over 40% lower hand estimation errors compared to noisy\nmonocular estimates. Project page: https://egoallo.github.io/",
            "pdf_url": "http://arxiv.org/pdf/2410.03665v1",
            "published": "2024-10-04 17:59:57+00:00",
            "updated": "2024-10-04 17:59:57+00:00"
        },
        {
            "title": "Geometric Representation Condition Improves Equivariant Molecule Generation",
            "authors": "Zian Li, Cai Zhou, Xiyuan Wang, Xingang Peng, Muhan Zhang",
            "summary": "Recent advancements in molecular generative models have demonstrated\nsubstantial potential in accelerating scientific discovery, particularly in\ndrug design. However, these models often face challenges in generating\nhigh-quality molecules, especially in conditional scenarios where specific\nmolecular properties must be satisfied. In this work, we introduce GeoRCG, a\ngeneral framework to enhance the performance of molecular generative models by\nintegrating geometric representation conditions. We decompose the molecule\ngeneration process into two stages: first, generating an informative geometric\nrepresentation; second, generating a molecule conditioned on the\nrepresentation. Compared to directly generating a molecule, the relatively\neasy-to-generate representation in the first-stage guides the second-stage\ngeneration to reach a high-quality molecule in a more goal-oriented and much\nfaster way. Leveraging EDM as the base generator, we observe significant\nquality improvements in unconditional molecule generation on the widely-used\nQM9 and GEOM-DRUG datasets. More notably, in the challenging conditional\nmolecular generation task, our framework achieves an average 31\\% performance\nimprovement over state-of-the-art approaches, highlighting the superiority of\nconditioning on semantically rich geometric representations over conditioning\non individual property values as in previous approaches. Furthermore, we show\nthat, with such representation guidance, the number of diffusion steps can be\nreduced to as small as 100 while maintaining superior generation quality than\nthat achieved with 1,000 steps, thereby significantly accelerating the\ngeneration process.",
            "pdf_url": "http://arxiv.org/pdf/2410.03655v1",
            "published": "2024-10-04 17:57:35+00:00",
            "updated": "2024-10-04 17:57:35+00:00"
        },
        {
            "title": "Real-World Benchmarks Make Membership Inference Attacks Fail on Diffusion Models",
            "authors": "Chumeng Liang, Jiaxuan You",
            "summary": "Membership inference attacks (MIAs) on diffusion models have emerged as\npotential evidence of unauthorized data usage in training pre-trained diffusion\nmodels. These attacks aim to detect the presence of specific images in training\ndatasets of diffusion models. Our study delves into the evaluation of\nstate-of-the-art MIAs on diffusion models and reveals critical flaws and overly\noptimistic performance estimates in existing MIA evaluation. We introduce\nCopyMark, a more realistic MIA benchmark that distinguishes itself through the\nsupport for pre-trained diffusion models, unbiased datasets, and fair\nevaluation pipelines. Through extensive experiments, we demonstrate that the\neffectiveness of current MIA methods significantly degrades under these more\npractical conditions. Based on our results, we alert that MIA, in its current\nstate, is not a reliable approach for identifying unauthorized data usage in\npre-trained diffusion models. To the best of our knowledge, we are the first to\ndiscover the performance overestimation of MIAs on diffusion models and present\na unified benchmark for more realistic evaluation. Our code is available on\nGitHub: \\url{https://github.com/caradryanl/CopyMark}.",
            "pdf_url": "http://arxiv.org/pdf/2410.03640v1",
            "published": "2024-10-04 17:46:06+00:00",
            "updated": "2024-10-04 17:46:06+00:00"
        },
        {
            "title": "AID: Attention Interpolation of Text-to-Image Diffusion",
            "authors": "Qiyuan He, Jinghao Wang, Ziwei Liu, Angela Yao",
            "summary": "Conditional diffusion models can create unseen images in various settings,\naiding image interpolation. Interpolation in latent spaces is well-studied, but\ninterpolation with specific conditions like text or poses is less understood.\nSimple approaches, such as linear interpolation in the space of conditions,\noften result in images that lack consistency, smoothness, and fidelity. To that\nend, we introduce a novel training-free technique named Attention Interpolation\nvia Diffusion (AID). Our key contributions include 1) proposing an inner/outer\ninterpolated attention layer; 2) fusing the interpolated attention with\nself-attention to boost fidelity; and 3) applying beta distribution to\nselection to increase smoothness. We also present a variant, Prompt-guided\nAttention Interpolation via Diffusion (PAID), that considers interpolation as a\ncondition-dependent generative process. This method enables the creation of new\nimages with greater consistency, smoothness, and efficiency, and offers control\nover the exact path of interpolation. Our approach demonstrates effectiveness\nfor conceptual and spatial interpolation. Code and demo are available at\nhttps://github.com/QY-H00/attention-interpolation-diffusion.",
            "pdf_url": "http://arxiv.org/pdf/2403.17924v3",
            "published": "2024-03-26 17:57:05+00:00",
            "updated": "2024-10-04 17:09:40+00:00"
        },
        {
            "title": "How Discrete and Continuous Diffusion Meet: Comprehensive Analysis of Discrete Diffusion Models via a Stochastic Integral Framework",
            "authors": "Yinuo Ren, Haoxuan Chen, Grant M. Rotskoff, Lexing Ying",
            "summary": "Discrete diffusion models have gained increasing attention for their ability\nto model complex distributions with tractable sampling and inference. However,\nthe error analysis for discrete diffusion models remains less well-understood.\nIn this work, we propose a comprehensive framework for the error analysis of\ndiscrete diffusion models based on L\\'evy-type stochastic integrals. By\ngeneralizing the Poisson random measure to that with a time-independent and\nstate-dependent intensity, we rigorously establish a stochastic integral\nformulation of discrete diffusion models and provide the corresponding change\nof measure theorems that are intriguingly analogous to It\\^o integrals and\nGirsanov's theorem for their continuous counterparts. Our framework unifies and\nstrengthens the current theoretical results on discrete diffusion models and\nobtains the first error bound for the $\\tau$-leaping scheme in KL divergence.\nWith error sources clearly identified, our analysis gives new insight into the\nmathematical properties of discrete diffusion models and offers guidance for\nthe design of efficient and accurate algorithms for real-world discrete\ndiffusion model applications.",
            "pdf_url": "http://arxiv.org/pdf/2410.03601v1",
            "published": "2024-10-04 16:59:29+00:00",
            "updated": "2024-10-04 16:59:29+00:00"
        }
    ]
}