{
    "Physics": [
        {
            "title": "Inferring Dynamic Physical Properties from Video Foundation Models",
            "authors": "Guanqi Zhan, Xianzheng Ma, Weidi Xie, Andrew Zisserman",
            "summary": "We study the task of predicting dynamic physical properties from videos. More\nspecifically, we consider physical properties that require temporal information\nto be inferred: elasticity of a bouncing object, viscosity of a flowing liquid,\nand dynamic friction of an object sliding on a surface. To this end, we make\nthe following contributions: (i) We collect a new video dataset for each\nphysical property, consisting of synthetic training and testing splits, as well\nas a real split for real world evaluation. (ii) We explore three ways to infer\nthe physical property from videos: (a) an oracle method where we supply the\nvisual cues that intrinsically reflect the property using classical computer\nvision techniques; (b) a simple read out mechanism using a visual prompt and\ntrainable prompt vector for cross-attention on pre-trained video generative and\nself-supervised models; and (c) prompt strategies for Multi-modal Large\nLanguage Models (MLLMs). (iii) We show that video foundation models trained in\na generative or self-supervised manner achieve a similar performance, though\nbehind that of the oracle, and MLLMs are currently inferior to the other\nmodels, though their performance can be improved through suitable prompting.",
            "pdf_url": "http://arxiv.org/pdf/2510.02311v1",
            "published": "2025-10-02 17:59:50+00:00",
            "updated": "2025-10-02 17:59:50+00:00"
        },
        {
            "title": "Astrophysical Consequences of an Electroweak $\\etaw$ Pseudo-Scalar",
            "authors": "Hooman Davoudiasl",
            "summary": "Recently, it has been suggested that the spectrum of physical states in the\nStandard Model may include an ultralight pseudo-scalar, denoted by $\\eta_w$, in\nanalogy with the $\\eta'$ state arising from the strong interactions. We find\nthat typical expectations for the properties of $\\eta_w$ get challenged by\nastrophysical constraints on the couplings of ultralight bosons. Our strongest\nlimit sets a lower bound of O(1000 TeV) on the decay constant of the\nhypothesized pseudo-scalar. We also briefly discuss whether $\\eta_w$ could be a\ndark matter candidate, or the origin of dark energy, but conclude that those\nidentifications appear unlikely. Given the important implications of a\npotentially overlooked $\\eta_w$ state for a more complete understanding of the\nelectroweak interactions and a fundamental description of Nature, further\ntheoretical and phenomenological investigations of this possibility and its\nassociated physics are warranted.",
            "pdf_url": "http://arxiv.org/pdf/2510.02310v1",
            "published": "2025-10-02 17:59:47+00:00",
            "updated": "2025-10-02 17:59:47+00:00"
        },
        {
            "title": "Learning to Generate Object Interactions with Physics-Guided Video Diffusion",
            "authors": "David Romero, Ariana Bermudez, Hao Li, Fabio Pizzati, Ivan Laptev",
            "summary": "Recent models for video generation have achieved remarkable progress and are\nnow deployed in film, social media production, and advertising. Beyond their\ncreative potential, such models also hold promise as world simulators for\nrobotics and embodied decision making. Despite strong advances, however,\ncurrent approaches still struggle to generate physically plausible object\ninteractions and lack physics-grounded control mechanisms. To address this\nlimitation, we introduce KineMask, an approach for physics-guided video\ngeneration that enables realistic rigid body control, interactions, and\neffects. Given a single image and a specified object velocity, our method\ngenerates videos with inferred motions and future object interactions. We\npropose a two-stage training strategy that gradually removes future motion\nsupervision via object masks. Using this strategy we train video diffusion\nmodels (VDMs) on synthetic scenes of simple interactions and demonstrate\nsignificant improvements of object interactions in real scenes. Furthermore,\nKineMask integrates low-level motion control with high-level textual\nconditioning via predictive scene descriptions, leading to effective support\nfor synthesis of complex dynamical phenomena. Extensive experiments show that\nKineMask achieves strong improvements over recent models of comparable size.\nAblation studies further highlight the complementary roles of low- and\nhigh-level conditioning in VDMs. Our code, model, and data will be made\npublicly available.",
            "pdf_url": "http://arxiv.org/pdf/2510.02284v1",
            "published": "2025-10-02 17:56:46+00:00",
            "updated": "2025-10-02 17:56:46+00:00"
        },
        {
            "title": "Transformers Discover Molecular Structure Without Graph Priors",
            "authors": "Tobias Kreiman, Yutong Bai, Fadi Atieh, Elizabeth Weaver, Eric Qu, Aditi S. Krishnapriyan",
            "summary": "Graph Neural Networks (GNNs) are the dominant architecture for molecular\nmachine learning, particularly for molecular property prediction and machine\nlearning interatomic potentials (MLIPs). GNNs perform message passing on\npredefined graphs often induced by a fixed radius cutoff or k-nearest neighbor\nscheme. While this design aligns with the locality present in many molecular\ntasks, a hard-coded graph can limit expressivity due to the fixed receptive\nfield and slows down inference with sparse graph operations. In this work, we\ninvestigate whether pure, unmodified Transformers trained directly on Cartesian\ncoordinates$\\unicode{x2013}$without predefined graphs or physical\npriors$\\unicode{x2013}$can approximate molecular energies and forces. As a\nstarting point for our analysis, we demonstrate how to train a Transformer to\ncompetitive energy and force mean absolute errors under a matched training\ncompute budget, relative to a state-of-the-art equivariant GNN on the OMol25\ndataset. We discover that the Transformer learns physically consistent\npatterns$\\unicode{x2013}$such as attention weights that decay inversely with\ninteratomic distance$\\unicode{x2013}$and flexibly adapts them across different\nmolecular environments due to the absence of hard-coded biases. The use of a\nstandard Transformer also unlocks predictable improvements with respect to\nscaling training resources, consistent with empirical scaling laws observed in\nother domains. Our results demonstrate that many favorable properties of GNNs\ncan emerge adaptively in Transformers, challenging the necessity of hard-coded\ngraph inductive biases and pointing toward standardized, scalable architectures\nfor molecular modeling.",
            "pdf_url": "http://arxiv.org/pdf/2510.02259v1",
            "published": "2025-10-02 17:42:10+00:00",
            "updated": "2025-10-02 17:42:10+00:00"
        },
        {
            "title": "The (PXP)$^2$ model: long-range quantum scars in optical cavities",
            "authors": "Hossein Hosseinabadi, Riccardo J. Valencia-Tortora, Aleksandr N. Mikheev, Darrick E. Chang, Johannes Zeiher, Roderich Moessner, Jamir Marino",
            "summary": "Rydberg-cavity systems are emerging as promising platforms for quantum\nsimulation and quantum information processing. These hybrid architectures\ncombine two complementary interaction mechanisms: cavity photons mediate\ncollective long-range couplings, while Rydberg excitations generate strong\nshort-range interactions. Together, they offer a setting for engineering\nmany-body phases characterized by a hierarchy of interactions across widely\ndifferent length scales. In this work, we introduce a minimal and scalable\nmodel for such systems. Focusing on the strong Rydberg blockade regime, we\nrestrict the Hilbert space to the subspace enforced by the blockade, yielding a\nkinetically constrained long-range model in one spatial dimension. This\napproach both captures the physics of Rydberg-cavity experiments in the regime\nof strong Rydberg interactions and provides a conceptually transparent\nframework for studying the interplay of long-range and short-range\ninteractions. At equilibrium, in addition to paramagnetic and N\\'eel-ordered\nphases, the system supports a blockaded ferromagnetic/superradiant phase,\ndistinct from the conventional superradiant phase. Out of equilibrium, we\nidentify long-range quantum many-body scars, which are atypical nonthermal\neigenstates that evade the eigenstate thermalization hypothesis, and giving\nrise to slow entanglement growth. In contrast to the linear-in-time\nentanglement growth characteristic of short-range scarred models, these\nlong-range scars exhibit logarithmic entanglement dynamics. Our results\nestablish a minimal yet versatile framework for Rydberg-cavity systems, and\nprovide a stepping stone for future theoretical and experimental studies of\nthis frontier platform in quantum many-body physics.",
            "pdf_url": "http://arxiv.org/pdf/2510.02246v1",
            "published": "2025-10-02 17:33:41+00:00",
            "updated": "2025-10-02 17:33:41+00:00"
        },
        {
            "title": "PUL-Inter-slice Defender: An Anomaly Detection Solution for Distributed Slice Mobility Attacks",
            "authors": "Ricardo Misael Ayala Molina, Hyame Assem Alameddine, Makan Pourzandi, Chadi Assi",
            "summary": "Network Slices (NSs) are virtual networks operating over a shared physical\ninfrastructure, each designed to meet specific application requirements while\nmaintaining consistent Quality of Service (QoS). In Fifth Generation (5G)\nnetworks, User Equipment (UE) can connect to and seamlessly switch between\nmultiple NSs to access diverse services. However, this flexibility, known as\nInter-Slice Switching (ISS), introduces a potential vulnerability that can be\nexploited to launch Distributed Slice Mobility (DSM) attacks, a form of\nDistributed Denial of Service (DDoS) attack. To secure 5G networks and their\nNSs against DSM attacks, we present in this work, PUL-Inter-Slice Defender; an\nanomaly detection solution that leverages Positive Unlabeled Learning (PUL) and\nincorporates a combination of Long Short-Term Memory Autoencoders and K-Means\nclustering. PUL-Inter-Slice Defender leverages the Third Generation Partnership\nProject (3GPP) key performance indicators and performance measurement counters\nas features for its machine learning models to detect DSM attack variants while\nmaintaining robustness in the presence of contaminated training data. When\nevaluated on data collected from our 5G testbed based on the open-source\nfree5GC and UERANSIM, a UE/ Radio Access Network (RAN) simulator;\nPUL-Inter-Slice Defender achieved F1-scores exceeding 98.50% on training\ndatasets with 10% to 40% attack contamination, consistently outperforming its\ncounterpart Inter-Slice Defender and other PUL based solutions combining\nOne-Class Support Vector Machine (OCSVM) with Random Forest and XGBoost.",
            "pdf_url": "http://arxiv.org/pdf/2510.02236v1",
            "published": "2025-10-02 17:24:17+00:00",
            "updated": "2025-10-02 17:24:17+00:00"
        },
        {
            "title": "Constraints on New Physics from decays of polarized $Λ_b^0$ baryons at the FCC-ee",
            "authors": "Anja Beck, Mero Elmarassy, Asher Sabbagh, Michal Kreps, Eluned Smith",
            "summary": "The $Z^0$ bosons produced in electron-positron collisions at the potential\nFuture Circular Collider (FCC-ee) provide unique opportunities for flavour\nphysics. The non-zero polarization of \\Lb baryons produced in $Z^0$ decays\nenables access to a much larger set of observables than at the LHC, where the\n\\Lb baryons are produced unpolarized. This paper presents a toy angular\nanalysis of $\\Lambda_b^0\\to \\Lambda(\\to p\\pi^-)\\mu^+\\mu^-$ decays using\nsimulation samples of collisions at the FCC-ee reconstructed using the IDEA\ndetector concept and assuming a dataset of $6\\times 10^{12}$ $Z^0$ bosons.\nWhile the statistical sensitivity achieved for individual angular observables\nis not expected to significantly exceed that from the LHCb Upgrade II\nexperiment, the addition of the polarized observables leads to a significant\nimprovement of the knowledge on the Wilson coefficients $C_9$ and $C_{10}$.",
            "pdf_url": "http://arxiv.org/pdf/2510.02225v1",
            "published": "2025-10-02 17:10:07+00:00",
            "updated": "2025-10-02 17:10:07+00:00"
        },
        {
            "title": "Multimessenger consistency relations bridging gravitational wave and large scale structure observations",
            "authors": "Antonio Enea Romano",
            "summary": "We show that for Horndeski theories it is possible to derive mathematically\ncompact consistency relations (CR) between physically observable quantities,\nvalid for different classes of theories defined by the behavior of the brading\nfunction $\\alpha_B$, independent of all other property functions. The CRs\nestablish a parametrization independent direct relation between the effective\ngravitational constant, the slip parameter, the gravitational and\nelectromagnetic waves (EMW) luminosity distances, the speed of gravitational\nwaves (GW) and the sound speed. The no-brading CR is also satisfied by general\nrelativity (GR), and allows to estimate the gravitational coupling from GWs\nobservations, independently from large scale structure (LSS) observations. A\ngeneral, less mathematically compact, consistency condition is also derived,\nvalid for any form of the function $\\alpha_B$ and the other property functions.\nWe apply the CRs to map the large scale structure observational constraints on\nthe effective gravitational constant and the slip parameter to GW-EMW distance\nratio constraints, showing that LSS and GWs give independent constraints\nconsistent with no-brading. Beside allowing to perform parametrization and\nmodel independent tests of the consistency between different constraints on\nmodified gravity, the CRs allow to probe the value of the effective\ngravitational constant with multimessenger observations, independently from LSS\nobservations.",
            "pdf_url": "http://arxiv.org/pdf/2504.04574v4",
            "published": "2025-04-06 18:23:43+00:00",
            "updated": "2025-10-02 17:07:49+00:00"
        },
        {
            "title": "Phonon Spin Selective One-Way Axial Phonon Transport in Chiral Nanohelix",
            "authors": "Jia Li, Yu-Tao Tan, Yizhou Liu, Jie Ren",
            "summary": "Selectively exciting and manipulating phonons at nanoscale becomes more and\nmore important but still remains challenging in modern nano-energy control and\ninformation sensing. Here, we show that the phonon spin angular momentum\nprovides an extra degree of freedom to achieve versatile manipulation of axial\nphonons in nanomaterials via coupling to spinful multi-physical fields, such as\ncircularly polarized infrared absorption. In particular, we demonstrate the\nnanoscale one-way axial phonon excitation and routing in chiral nanomaterials,\nby converting the photon spin in circularly polarized optical fields into the\ncollective interference phonon spin. As exemplified in the smallest chiral\ncarbon nanotube, we show that the rectification rate can reach nearly 100\\%,\nachieving an ideal one-way phonon router, which is verified by molecular\ndynamics simulations. Our results shed new light on the flexible phonon\nmanipulation via phonon spin degree of freedom, paving the way for future spin\nphononics.",
            "pdf_url": "http://arxiv.org/pdf/2510.02221v1",
            "published": "2025-10-02 17:04:18+00:00",
            "updated": "2025-10-02 17:04:18+00:00"
        },
        {
            "title": "Quantum Fisher information matrices from Rényi relative entropies",
            "authors": "Mark M. Wilde",
            "summary": "Quantum generalizations of the Fisher information are important in quantum\ninformation science, with applications in high energy and condensed matter\nphysics and in quantum estimation theory, machine learning, and optimization.\nOne can derive a quantum generalization of the Fisher information matrix in a\nnatural way as the Hessian matrix arising in a Taylor expansion of a smooth\ndivergence. Such an approach is appealing for quantum information theorists,\ngiven the ubiquity of divergences in quantum information theory. In contrast to\nthe classical case, there is not a unique quantum generalization of the Fisher\ninformation matrix, similar to how there is not a unique quantum generalization\nof the relative entropy or the R\\'enyi relative entropy. In this paper, I\nderive information matrices arising from the log-Euclidean, $\\alpha$-$z$, and\ngeometric R\\'enyi relative entropies, with the main technical tool for doing so\nbeing the method of divided differences for calculating matrix derivatives.\nInterestingly, for all non-negative values of the R\\'enyi parameter $\\alpha$,\nthe log-Euclidean R\\'enyi relative entropy leads to the Kubo-Mori information\nmatrix, and the geometric R\\'enyi relative entropy leads to the\nright-logarithmic derivative Fisher information matrix. Thus, the resulting\ninformation matrices obey the data-processing inequality for all non-negative\nvalues of the R\\'enyi parameter $\\alpha$ even though the original quantities do\nnot. Additionally, I derive and establish basic properties of $\\alpha$-$z$\ninformation matrices resulting from the $\\alpha$-$z$ R\\'enyi relative\nentropies. For parameterized thermal states, I establish formulas for their\n$\\alpha$-$z$ information matrices and hybrid quantum-classical algorithms for\nestimating them, with applications in quantum Boltzmann machine learning.",
            "pdf_url": "http://arxiv.org/pdf/2510.02218v1",
            "published": "2025-10-02 17:02:48+00:00",
            "updated": "2025-10-02 17:02:48+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "NoiseShift: Resolution-Aware Noise Recalibration for Better Low-Resolution Image Generation",
            "authors": "Ruozhen He, Moayed Haji-Ali, Ziyan Yang, Vicente Ordonez",
            "summary": "Text-to-image diffusion models trained on a fixed set of resolutions often\nfail to generalize, even when asked to generate images at lower resolutions\nthan those seen during training. High-resolution text-to-image generators are\ncurrently unable to easily offer an out-of-the-box budget-efficient alternative\nto their users who might not need high-resolution images. We identify a key\ntechnical insight in diffusion models that when addressed can help tackle this\nlimitation: Noise schedulers have unequal perceptual effects across\nresolutions. The same level of noise removes disproportionately more signal\nfrom lower-resolution images than from high-resolution images, leading to a\ntrain-test mismatch. We propose NoiseShift, a training-free method that\nrecalibrates the noise level of the denoiser conditioned on resolution size.\nNoiseShift requires no changes to model architecture or sampling schedule and\nis compatible with existing models. When applied to Stable Diffusion 3, Stable\nDiffusion 3.5, and Flux-Dev, quality at low resolutions is significantly\nimproved. On LAION-COCO, NoiseShift improves SD3.5 by 15.89%, SD3 by 8.56%, and\nFlux-Dev by 2.44% in FID on average. On CelebA, NoiseShift improves SD3.5 by\n10.36%, SD3 by 5.19%, and Flux-Dev by 3.02% in FID on average. These results\ndemonstrate the effectiveness of NoiseShift in mitigating resolution-dependent\nartifacts and enhancing the quality of low-resolution image generation.",
            "pdf_url": "http://arxiv.org/pdf/2510.02307v1",
            "published": "2025-10-02 17:59:43+00:00",
            "updated": "2025-10-02 17:59:43+00:00"
        },
        {
            "title": "Diffusion Models and the Manifold Hypothesis: Log-Domain Smoothing is Geometry Adaptive",
            "authors": "Tyler Farghly, Peter Potaptchik, Samuel Howard, George Deligiannidis, Jakiw Pidstrigach",
            "summary": "Diffusion models have achieved state-of-the-art performance, demonstrating\nremarkable generalisation capabilities across diverse domains. However, the\nmechanisms underpinning these strong capabilities remain only partially\nunderstood. A leading conjecture, based on the manifold hypothesis, attributes\nthis success to their ability to adapt to low-dimensional geometric structure\nwithin the data. This work provides evidence for this conjecture, focusing on\nhow such phenomena could result from the formulation of the learning problem\nthrough score matching. We inspect the role of implicit regularisation by\ninvestigating the effect of smoothing minimisers of the empirical score\nmatching objective. Our theoretical and empirical results confirm that\nsmoothing the score function -- or equivalently, smoothing in the log-density\ndomain -- produces smoothing tangential to the data manifold. In addition, we\nshow that the manifold along which the diffusion model generalises can be\ncontrolled by choosing an appropriate smoothing.",
            "pdf_url": "http://arxiv.org/pdf/2510.02305v1",
            "published": "2025-10-02 17:59:39+00:00",
            "updated": "2025-10-02 17:59:39+00:00"
        },
        {
            "title": "Equilibrium Matching: Generative Modeling with Implicit Energy-Based Models",
            "authors": "Runqian Wang, Yilun Du",
            "summary": "We introduce Equilibrium Matching (EqM), a generative modeling framework\nbuilt from an equilibrium dynamics perspective. EqM discards the\nnon-equilibrium, time-conditional dynamics in traditional diffusion and\nflow-based generative models and instead learns the equilibrium gradient of an\nimplicit energy landscape. Through this approach, we can adopt an\noptimization-based sampling process at inference time, where samples are\nobtained by gradient descent on the learned landscape with adjustable step\nsizes, adaptive optimizers, and adaptive compute. EqM surpasses the generation\nperformance of diffusion/flow models empirically, achieving an FID of 1.90 on\nImageNet 256$\\times$256. EqM is also theoretically justified to learn and\nsample from the data manifold. Beyond generation, EqM is a flexible framework\nthat naturally handles tasks including partially noised image denoising, OOD\ndetection, and image composition. By replacing time-conditional velocities with\na unified equilibrium landscape, EqM offers a tighter bridge between flow and\nenergy-based models and a simple route to optimization-driven inference.",
            "pdf_url": "http://arxiv.org/pdf/2510.02300v1",
            "published": "2025-10-02 17:59:06+00:00",
            "updated": "2025-10-02 17:59:06+00:00"
        },
        {
            "title": "Continual Personalization for Diffusion Models",
            "authors": "Yu-Chien Liao, Jr-Jen Chen, Chi-Pin Huang, Ci-Siang Lin, Meng-Lin Wu, Yu-Chiang Frank Wang",
            "summary": "Updating diffusion models in an incremental setting would be practical in\nreal-world applications yet computationally challenging. We present a novel\nlearning strategy of Concept Neuron Selection (CNS), a simple yet effective\napproach to perform personalization in a continual learning scheme. CNS\nuniquely identifies neurons in diffusion models that are closely related to the\ntarget concepts. In order to mitigate catastrophic forgetting problems while\npreserving zero-shot text-to-image generation ability, CNS finetunes concept\nneurons in an incremental manner and jointly preserves knowledge learned of\nprevious concepts. Evaluation of real-world datasets demonstrates that CNS\nachieves state-of-the-art performance with minimal parameter adjustments,\noutperforming previous methods in both single and multi-concept personalization\nworks. CNS also achieves fusion-free operation, reducing memory storage and\nprocessing time for continual personalization.",
            "pdf_url": "http://arxiv.org/pdf/2510.02296v1",
            "published": "2025-10-02 17:58:56+00:00",
            "updated": "2025-10-02 17:58:56+00:00"
        },
        {
            "title": "Test-Time Anchoring for Discrete Diffusion Posterior Sampling",
            "authors": "Litu Rout, Andreas Lugmayr, Yasamin Jafarian, Srivatsan Varadharajan, Constantine Caramanis, Sanjay Shakkottai, Ira Kemelmacher-Shlizerman",
            "summary": "We study the problem of posterior sampling using pretrained discrete\ndiffusion foundation models, aiming to recover images from noisy measurements\nwithout retraining task-specific models. While diffusion models have achieved\nremarkable success in generative modeling, most advances rely on continuous\nGaussian diffusion. In contrast, discrete diffusion offers a unified framework\nfor jointly modeling categorical data such as text and images. Beyond\nunification, discrete diffusion provides faster inference, finer control, and\nprincipled training-free Bayesian inference, making it particularly well-suited\nfor posterior sampling. However, existing approaches to discrete diffusion\nposterior sampling face severe challenges: derivative-free guidance yields\nsparse signals, continuous relaxations limit applicability, and split Gibbs\nsamplers suffer from the curse of dimensionality. To overcome these\nlimitations, we introduce Anchored Posterior Sampling (APS) for masked\ndiffusion foundation models, built on two key innovations -- quantized\nexpectation for gradient-like guidance in discrete embedding space, and\nanchored remasking for adaptive decoding. Our approach achieves\nstate-of-the-art performance among discrete diffusion samplers across linear\nand nonlinear inverse problems on the standard benchmarks. We further\ndemonstrate the benefits of our approach in training-free stylization and\ntext-guided editing.",
            "pdf_url": "http://arxiv.org/pdf/2510.02291v1",
            "published": "2025-10-02 17:58:37+00:00",
            "updated": "2025-10-02 17:58:37+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Mean-field theory of the Santa Fe model revisited: a systematic derivation from an exact BBGKY hierarchy for the zero-intelligence limit-order book model",
            "authors": "Taiki Wakatsuki, Kiyoshi Kanazawa",
            "summary": "The Santa Fe model is an established econophysics model for describing\nstochastic dynamics of the limit order book from the viewpoint of the\nzero-intelligence approach. While its foundation was studied by combining a\ndimensional analysis and a mean-field theory by E. Smith et al. in Quantitative\nFinance 2003, their arguments are rather heuristic and lack solid mathematical\nfoundation; indeed, their mean-field equations were derived with heuristic\narguments and their solutions were not explicitly obtained. In this work, we\nrevisit the mean-field theory of the Santa Fe model from the viewpoint of\nkinetic theory -- a traditional mathematical program in statistical physics. We\nstudy the exact master equation for the Santa Fe model and systematically\nderive the Bogoliubov-Born-Green-Kirkwood-Yvon (BBGKY) hierarchical equation.\nBy applying the mean-field approximation, we derive the mean-field equation for\nthe order-book density profile, parallel to the Boltzmann equation in\nconventional statistical physics. Furthermore, we obtain explicit and closed\nexpression of the mean-field solutions. Our solutions have several\nimplications: (1)Our scaling formulas are available for both $\\mu\\to 0$ and\n$\\mu\\to \\infty$ asymptotics, where $\\mu$ is the market-order submission\nintensity. Particularly, the mean-field theory works very well for small $\\mu$,\nwhile its validity is partially limited for large $\\mu$. (2)The ``method of\nimage'' solution, heuristically derived by Bouchaud-M\\'ezard-Potters in\nQuantitative Finance 2002, is obtained for large $\\mu$, serving as a\nmathematical foundation for their heuristic arguments. (3)Finally, we point out\nan error in E. Smith et al. 2003 in the scaling law for the diffusion constant\ndue to a misspecification in their dimensional analysis.",
            "pdf_url": "http://arxiv.org/pdf/2510.01814v1",
            "published": "2025-10-02 09:00:43+00:00",
            "updated": "2025-10-02 09:00:43+00:00"
        }
    ]
}