{
    "Physics": [
        {
            "title": "Quantum hall transformer in a quantum point contact over the full range of transmission",
            "authors": "Stuart Yi-Thomas, Jay D. Sau",
            "summary": "A recent experiment [Cohen et al., Science 382, 542 (2023)] observed a robustly quantized $e^2/2h$ conductance in a quantum point contact between fractional quantum Hall edges (a quantum Hall transformer), which then vanishes at low temperature. While this behavior can be described by a boundary sine gordon (BSG) model derived from electron tunneling, the microscopic motivation for such strong tunneling is unclear. We use an alternative model based on sliding charge density waves and a density inhomogeneity to clarify the BSG description and calculate the conductance over the full range of transmission. Using a perturbative method and a matrix product state calculation, we draw a quantitative connection between the BSG model and the physical quantum Hall system.",
            "pdf_url": "https://arxiv.org/pdf/2406.17778v2",
            "published": "2024-06-25 17:59:57+00:00",
            "updated": "2026-01-22 18:59:58+00:00"
        },
        {
            "title": "Gauge Theory and Skein Modules",
            "authors": "Du Pei",
            "summary": "We study skein modules of 3-manifolds by embedding them into the Hilbert spaces of 4d ${\\cal N}=4$ super-Yang-Mills theories. When the 3-manifold has reduced holonomy, we present an algorithm to determine the dimension and the list of generators of the skein module with a general gauge group. The analysis uses a deformation preserving ${\\cal N}=1$ supersymmetry to express the dimension as a sum over nilpotent orbits. We find that the dimensions often differ between Langlands-dual pairs beyond the A-series, for which we provide a physical explanation involving chiral symmetry breaking and 't Hooft operators. We also relate our results to the structure of $\\mathbb{C}^*$-fixed loci in the moduli space of Higgs bundles. This approach helps to clarify the relation between the gauge-theoretic framework of Kapustin and Witten with other versions of the geometric Langlands program, explains why the dimensions of skein modules do not exhibit a TQFT-like behavior, and provides a physical interpretation of the skein-valued curve counting of Ekholm and Shende.",
            "pdf_url": "https://arxiv.org/pdf/2601.16213v1",
            "published": "2026-01-22 18:59:51+00:00",
            "updated": "2026-01-22 18:59:51+00:00"
        },
        {
            "title": "LLM-in-Sandbox Elicits General Agentic Intelligence",
            "authors": "Daixuan Cheng, Shaohan Huang, Yuxian Gu, Huatong Song, Guoxin Chen, Li Dong, Wayne Xin Zhao, Ji-Rong Wen, Furu Wei",
            "summary": "We introduce LLM-in-Sandbox, enabling LLMs to explore within a code sandbox (i.e., a virtual computer), to elicit general intelligence in non-code domains. We first demonstrate that strong LLMs, without additional training, exhibit generalization capabilities to leverage the code sandbox for non-code tasks. For example, LLMs spontaneously access external resources to acquire new knowledge, leverage the file system to handle long contexts, and execute scripts to satisfy formatting requirements. We further show that these agentic capabilities can be enhanced through LLM-in-Sandbox Reinforcement Learning (LLM-in-Sandbox-RL), which uses only non-agentic data to train models for sandbox exploration. Experiments demonstrate that LLM-in-Sandbox, in both training-free and post-trained settings, achieves robust generalization spanning mathematics, physics, chemistry, biomedicine, long-context understanding, and instruction following. Finally, we analyze LLM-in-Sandbox's efficiency from computational and system perspectives, and open-source it as a Python package to facilitate real-world deployment.",
            "pdf_url": "https://arxiv.org/pdf/2601.16206v1",
            "published": "2026-01-22 18:57:09+00:00",
            "updated": "2026-01-22 18:57:09+00:00"
        },
        {
            "title": "Universal non-Gaussian order parameter statistics in 2D superfluids",
            "authors": "Abel Beregi, En Chang, Erik Rydow, Christopher J. Foot, Shinichi Sunami",
            "summary": "Fluctuations are an intrinsic feature of many-body systems, and their full statistical distributions reveal a wealth of information about the underlying physics. Of particular interest are non-Gaussian, extreme-value statistics that arise when nontrivial correlations and criticality dominate over the central limit theorem. Strikingly, in two-dimensional (2D) quantum fluids, such effects have been predicted to manifest in the order parameter distribution in the Berezinskii-Kosterlitz-Thouless (BKT) superfluid phase, which approaches a universal extreme-value form in the low-temperature limit. Here, we measure the order parameter statistics of 2D Bose gases across the BKT critical point using matter-wave interferometry. This allows us to confirm the predicted convergence of the observed statistics to a universal Gumbel distribution at low temperatures, to the 0.1% level of the probability density. Furthermore, the intrinsic precision of the atom interferometer allows the robust extraction of higher-moment observables such as skewness and kurtosis; in particular, we report direct measurements of the Binder cumulant which allows us to precisely identify the onset of the phase transition. Extending this approach to the investigation of non-equilibrium systems, we probe vortex unbinding dynamics following a quench across the BKT critical point and identify parameter-independent scaling behaviour of higher moments.",
            "pdf_url": "https://arxiv.org/pdf/2601.16204v1",
            "published": "2026-01-22 18:55:58+00:00",
            "updated": "2026-01-22 18:55:58+00:00"
        },
        {
            "title": "Pushing the limits of unconstrained machine-learned interatomic potentials",
            "authors": "Filippo Bigi, Paolo Pegolo, Arslan Mazitov, Michele Ceriotti",
            "summary": "Machine-learned interatomic potentials (MLIPs) are increasingly used to replace computationally demanding electronic-structure calculations to model matter at the atomic scale. The most commonly used model architectures are constrained to fulfill a number of physical laws exactly, from geometric symmetries to energy conservation. Evidence is mounting that relaxing some of these constraints can be beneficial to the efficiency and (somewhat surprisingly) accuracy of MLIPs, even though care should be taken to avoid qualitative failures associated with the breaking of physical symmetries. Given the recent trend of \\emph{scaling up} models to larger numbers of parameters and training samples, a very important question is how unconstrained MLIPs behave in this limit. Here we investigate this issue, showing that -- when trained on large datasets -- unconstrained models can be superior in accuracy and speed when compared to physically constrained models. We assess these models both in terms of benchmark accuracy and in terms of usability in practical scenarios, focusing on static simulation workflows such as geometry optimization and lattice dynamics. We conclude that accurate unconstrained models can be applied with confidence, especially since simple inference-time modifications can be used to recover observables that are consistent with the relevant physical symmetries.",
            "pdf_url": "https://arxiv.org/pdf/2601.16195v1",
            "published": "2026-01-22 18:46:58+00:00",
            "updated": "2026-01-22 18:46:58+00:00"
        },
        {
            "title": "Robust Bell Nonlocality from Gottesman-Kitaev-Preskill States",
            "authors": "Xiaotian Yang, Santiago Zamora, Rafael Chaves, Ulrik L. Andersen, Jonatan Bohr Brask, A. de Oliveira Junior",
            "summary": "Bell tests based on homodyne detection are strongly constrained in continuous-variable systems. Can Gottesman-Kitaev-Preskill (GKP) encoding turn homodyne detection into a practical tool for revealing Bell nonlocality? We consider a physically motivated model in which each party performs homodyne detection and digitizes the continuous outcome via a fixed periodic binning, corresponding to logical Pauli measurements. Within this framework, we derive a bipartite no-go: CHSH cannot be violated for Bell-pair states. Moving beyond two parties, we show that finitely squeezed GKP-encoded GHZ and W states nevertheless exhibit strong multipartite nonlocality, violating multipartite Bell inequalities with homodyne-only readout. We quantify the required squeezing thresholds and robustness to loss, providing a route toward homodyne-based Bell tests in continuous-variable systems.",
            "pdf_url": "https://arxiv.org/pdf/2601.16189v1",
            "published": "2026-01-22 18:41:13+00:00",
            "updated": "2026-01-22 18:41:13+00:00"
        },
        {
            "title": "String Breaking and Glueball Dynamics in $2+1$D Quantum Link Electrodynamics",
            "authors": "Jiahao Cao, Rohan Joshi, Yizhuo Tian, N. S. Srivatsa, Jad C. Halimeh",
            "summary": "At the heart of quark confinement and hadronization, the physics of flux strings has recently become a focal point in the field of quantum simulation of high-energy physics (HEP). Despite considerable progress, a detailed understanding of the behavior of flux strings in quantum simulation-relevant lattice formulations of gauge theories has remained limited to the lowest truncations of the gauge field, which are severely limited in their ability to draw conclusions about the quantum field theory limit. Here, we employ tensor network simulations to investigate the behavior of flux strings in a quantum link formulation of $2+1$D quantum electrodynamics (QED) with a spin-$1$ representation of the gauge field. We first map out the ground-state phase diagram of this model in the presence of two spatially separated static charges, revealing distinct microscopic processes responsible for string breaking, including a two-stage breaking mechanism not possible in the spin-$\\frac{1}{2}$ formulation. Starting in different initial product state string configurations, we then explore far-from-equilibrium quench dynamics across various parameter regimes, demonstrating genuine $2+1$D real-time string breaking and glueball-like bound state formation, with the latter not possible in the spin-$\\frac{1}{2}$ formulation. In and out of equilibrium, we consider different values and placements of the static charges. Finally, we provide efficient qudit circuits for a quantum simulation experiment in which our results can be observed in state-of-the-art ion-trap setups. Our findings lay the groundwork for quantum simulations of flux strings towards the quantum field theory limit.",
            "pdf_url": "https://arxiv.org/pdf/2601.16166v1",
            "published": "2026-01-22 18:11:29+00:00",
            "updated": "2026-01-22 18:11:29+00:00"
        },
        {
            "title": "Cosmos Policy: Fine-Tuning Video Models for Visuomotor Control and Planning",
            "authors": "Moo Jin Kim, Yihuai Gao, Tsung-Yi Lin, Yen-Chen Lin, Yunhao Ge, Grace Lam, Percy Liang, Shuran Song, Ming-Yu Liu, Chelsea Finn, Jinwei Gu",
            "summary": "Recent video generation models demonstrate remarkable ability to capture complex physical interactions and scene evolution over time. To leverage their spatiotemporal priors, robotics works have adapted video models for policy learning but introduce complexity by requiring multiple stages of post-training and new architectural components for action generation. In this work, we introduce Cosmos Policy, a simple approach for adapting a large pretrained video model (Cosmos-Predict2) into an effective robot policy through a single stage of post-training on the robot demonstration data collected on the target platform, with no architectural modifications. Cosmos Policy learns to directly generate robot actions encoded as latent frames within the video model's latent diffusion process, harnessing the model's pretrained priors and core learning algorithm to capture complex action distributions. Additionally, Cosmos Policy generates future state images and values (expected cumulative rewards), which are similarly encoded as latent frames, enabling test-time planning of action trajectories with higher likelihood of success. In our evaluations, Cosmos Policy achieves state-of-the-art performance on the LIBERO and RoboCasa simulation benchmarks (98.5% and 67.1% average success rates, respectively) and the highest average score in challenging real-world bimanual manipulation tasks, outperforming strong diffusion policies trained from scratch, video model-based policies, and state-of-the-art vision-language-action models fine-tuned on the same robot demonstrations. Furthermore, given policy rollout data, Cosmos Policy can learn from experience to refine its world model and value function and leverage model-based planning to achieve even higher success rates in challenging tasks. We release code, models, and training data at https://research.nvidia.com/labs/dir/cosmos-policy/",
            "pdf_url": "https://arxiv.org/pdf/2601.16163v1",
            "published": "2026-01-22 18:09:30+00:00",
            "updated": "2026-01-22 18:09:30+00:00"
        },
        {
            "title": "On the structural properties of Lie algebras via associated labeled directed graphs",
            "authors": "Tim Heib, David Edward Bruschi",
            "summary": "We present a method for associating labeled directed graphs to finite-dimensional Lie algebras, thereby enabling rapid identification of key structural algebraic features. To formalize this approach, we introduce the concept of graph-admissible Lie algebras and analyze properties of valid graphs given the antisymmetry property of the Lie bracket as well as the Jacobi identity. Based on these foundations, we develop graph-theoretic criteria for solvability, nilpotency, presence of ideals, simplicity, semisimplicity, and reductiveness of an algebra. Practical algorithms are provided for constructing such graphs and those associated with the lower central series and derived series via an iterative pruning procedure. This visual framework allows for an intuitive understanding of Lie algebraic structures that goes beyond purely visual advantages, since it enables a simpler and swifter grasping of the algebras of interest beyond computational-heavy approaches. Examples, which include the Schrödinger and Lorentz algebra, illustrate the applicability of these tools to physically relevant cases. We further explore applications in physics, where the method facilitates computation of similtude relations essential for determining quantum mechanical time evolution via the Lie algebraic factorization method. Extensions to graded Lie algebras and related conjectures are discussed. Our approach bridges algebraic and combinatorial perspectives, offering both theoretical insights and computational tools into this area of mathematical physics.",
            "pdf_url": "https://arxiv.org/pdf/2601.16161v1",
            "published": "2026-01-22 18:09:16+00:00",
            "updated": "2026-01-22 18:09:16+00:00"
        },
        {
            "title": "Mode interactions in scalar field cosmology",
            "authors": "Spiros Cotsakis, Ignatios Antoniadis",
            "summary": "We study the dynamics of spatially homogeneous Friedmann--Robertson--Walker universes filled with a massive scalar field in a neighbourhood of the massless transition $s=1$. At this point the Einstein--scalar system exhibits a codimension--two Hopf--steady--state organising centre whose versal unfolding describes all small deformations of the quadratic model. After reduction to the centre manifold, the dynamics is governed by two slow geometric modes $(r,z)$: the Hopf amplitude $r$, measuring the kinetic departure from de Sitter, and the slowly drifting Hubble mode $z$. We show that the standard slow--roll parameters follow directly from these unfolding variables, $ε\\sim\\tfrac32 r^{2}$ and $η\\sim z$, so that the spectral tilt, tensor--to--scalar ratio, and scalar amplitude arise as universal functions of $(r,z)$, independently of the choice of potential. The two unfolding parameters $(μ_{1},μ_{2})$ classify all perturbations of the quadratic model and can be interpreted physically as controlling the tilt and curvature deformations of generic polynomial inflationary potentials. Thus the near scale--invariance of primordial perturbations emerges as a structural property of the unfolding of the organising centre, providing a potential--independent mechanism for an early phase of accelerated expansion. We discuss the implications of this geometric framework for the interpretation and classification of inflationary models.",
            "pdf_url": "https://arxiv.org/pdf/2512.04607v2",
            "published": "2025-12-04 09:29:42+00:00",
            "updated": "2026-01-22 17:56:01+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Pay (Cross) Attention to the Melody: Curriculum Masking for Single-Encoder Melodic Harmonization",
            "authors": "Maximos Kaliakatsos-Papakostas, Dimos Makris, Konstantinos Soiledis, Konstantinos-Theodoros Tsamis, Vassilis Katsouros, Emilios Cambouropoulos",
            "summary": "Melodic harmonization, the task of generating harmonic accompaniments for a given melody, remains a central challenge in computational music generation. Recent single encoder transformer approaches have framed harmonization as a masked sequence modeling problem, but existing training curricula inspired by discrete diffusion often result in weak (cross) attention between melody and harmony. This leads to limited exploitation of melodic cues, particularly in out-of-domain contexts. In this work, we introduce a training curriculum, FF (full-to-full), which keeps all harmony tokens masked for several training steps before progressively unmasking entire sequences during training to strengthen melody-harmony interactions. We systematically evaluate this approach against prior curricula across multiple experimental axes, including temporal quantization (quarter vs. sixteenth note), bar-level vs. time-signature conditioning, melody representation (full range vs. pitch class), and inference-time unmasking strategies. Models are trained on the HookTheory dataset and evaluated both in-domain and on a curated collection of jazz standards, using a comprehensive set of metrics that assess chord progression structure, harmony-melody alignment, and rhythmic coherence. Results demonstrate that the proposed FF curriculum consistently outperforms baselines in nearly all metrics, with particularly strong gains in out-of-domain evaluations where harmonic adaptability to novel melodic queues is crucial. We further find that quarter-note quantization, intertwining of bar tokens, and pitch-class melody representations are advantageous in the FF setting. Our findings highlight the importance of training curricula in enabling effective melody conditioning and suggest that full-to-full unmasking offers a robust strategy for single encoder harmonization.",
            "pdf_url": "https://arxiv.org/pdf/2601.16150v1",
            "published": "2026-01-22 17:46:31+00:00",
            "updated": "2026-01-22 17:46:31+00:00"
        },
        {
            "title": "Learning to Watermark in the Latent Space of Generative Models",
            "authors": "Sylvestre-Alvise Rebuffi, Tuan Tran, Valeriu Lacatusu, Pierre Fernandez, Tomáš Souček, Nikola Jovanović, Tom Sander, Hady Elsahar, Alexandre Mourachko",
            "summary": "Existing approaches for watermarking AI-generated images often rely on post-hoc methods applied in pixel space, introducing computational overhead and potential visual artifacts. In this work, we explore latent space watermarking and introduce DistSeal, a unified approach for latent watermarking that works across both diffusion and autoregressive models. Our approach works by training post-hoc watermarking models in the latent space of generative models. We demonstrate that these latent watermarkers can be effectively distilled either into the generative model itself or into the latent decoder, enabling in-model watermarking. The resulting latent watermarks achieve competitive robustness while offering similar imperceptibility and up to 20x speedup compared to pixel-space baselines. Our experiments further reveal that distilling latent watermarkers outperforms distilling pixel-space ones, providing a solution that is both more efficient and more robust.",
            "pdf_url": "https://arxiv.org/pdf/2601.16140v1",
            "published": "2026-01-22 17:34:30+00:00",
            "updated": "2026-01-22 17:34:30+00:00"
        },
        {
            "title": "GenPO: Generative Diffusion Models Meet On-Policy Reinforcement Learning",
            "authors": "Shutong Ding, Ke Hu, Shan Zhong, Haoyang Luo, Weinan Zhang, Jingya Wang, Jun Wang, Ye Shi",
            "summary": "Recent advances in reinforcement learning (RL) have demonstrated the powerful exploration capabilities and multimodality of generative diffusion-based policies. While substantial progress has been made in offline RL and off-policy RL settings, integrating diffusion policies into on-policy frameworks like PPO remains underexplored. This gap is particularly significant given the widespread use of large-scale parallel GPU-accelerated simulators, such as IsaacLab, which are optimized for on-policy RL algorithms and enable rapid training of complex robotic tasks. A key challenge lies in computing state-action log-likelihoods under diffusion policies, which is straightforward for Gaussian policies but intractable for flow-based models due to irreversible forward-reverse processes and discretization errors (e.g., Euler-Maruyama approximations). To bridge this gap, we propose GenPO, a generative policy optimization framework that leverages exact diffusion inversion to construct invertible action mappings. GenPO introduces a novel doubled dummy action mechanism that enables invertibility via alternating updates, resolving log-likelihood computation barriers. Furthermore, we also use the action log-likelihood for unbiased entropy and KL divergence estimation, enabling KL-adaptive learning rates and entropy regularization in on-policy updates. Extensive experiments on eight IsaacLab benchmarks, including legged locomotion (Ant, Humanoid, Anymal-D, Unitree H1, Go2), dexterous manipulation (Shadow Hand), aerial control (Quadcopter), and robotic arm tasks (Franka), demonstrate GenPO's superiority over existing RL baselines. Notably, GenPO is the first method to successfully integrate diffusion policies into on-policy RL, unlocking their potential for large-scale parallelized training and real-world robotic deployment.",
            "pdf_url": "https://arxiv.org/pdf/2505.18763v4",
            "published": "2025-05-24 15:57:07+00:00",
            "updated": "2026-01-22 17:10:05+00:00"
        },
        {
            "title": "Likelihood Matching for Diffusion Models",
            "authors": "Lei Qian, Wu Su, Yanqi Huang, Song Xi Chen",
            "summary": "We propose a Likelihood Matching approach for training diffusion models by first establishing an equivalence between the likelihood of the target data distribution and a likelihood along the sample path of the reverse diffusion. To efficiently compute the reverse sample likelihood, a quasi-likelihood is considered to approximate each reverse transition density by a Gaussian distribution with matched conditional mean and covariance, respectively. The score and Hessian functions for the diffusion generation are estimated by maximizing the quasi-likelihood, ensuring a consistent matching of both the first two transitional moments between every two time points. A stochastic sampler is introduced to facilitate computation that leverages both the estimated score and Hessian information. We establish consistency of the quasi-maximum likelihood estimation, and provide non-asymptotic convergence guarantees for the proposed sampler, quantifying the rates of the approximation errors due to the score and Hessian estimation, dimensionality, and the number of diffusion steps. Empirical and simulation evaluations demonstrate the effectiveness of the proposed Likelihood Matching and validate the theoretical results.",
            "pdf_url": "https://arxiv.org/pdf/2508.03636v2",
            "published": "2025-08-05 16:51:29+00:00",
            "updated": "2026-01-22 16:44:18+00:00"
        },
        {
            "title": "PF-D2M: A Pose-free Diffusion Model for Universal Dance-to-Music Generation",
            "authors": "Jaekwon Im, Natalia Polouliakh, Taketo Akama",
            "summary": "Dance-to-music generation aims to generate music that is aligned with dance movements. Existing approaches typically rely on body motion features extracted from a single human dancer and limited dance-to-music datasets, which restrict their performance and applicability to real-world scenarios involving multiple dancers and non-human dancers. In this paper, we propose PF-D2M, a universal diffusion-based dance-to-music generation model that incorporates visual features extracted from dance videos. PF-D2M is trained with a progressive training strategy that effectively addresses data scarcity and generalization challenges. Both objective and subjective evaluations show that PF-D2M achieves state-of-the-art performance in dance-music alignment and music quality.",
            "pdf_url": "https://arxiv.org/pdf/2601.15872v1",
            "published": "2026-01-22 11:21:54+00:00",
            "updated": "2026-01-22 11:21:54+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "MiRAGE: A Multiagent Framework for Generating Multimodal Multihop Question-Answer Dataset for RAG Evaluation",
            "authors": "Chandan Kumar Sahu, Premith Kumar Chilukuri, Matthew Hetrich",
            "summary": "The rapid evolution of Retrieval-Augmented Generation (RAG) toward multimodal, high-stakes enterprise applications has outpaced the development of domain specific evaluation benchmarks. Existing datasets often rely on general-domain corpora or purely textual retrieval, failing to capture the complexity of specialized technical documents where information is inextricably multimodal and reasoning requires synthesizing disjoint evidence. We address this gap by introducing MiRAGE, a Multiagent framework for RAG systems Evaluation, that leverages a collaborative swarm of specialized agents to generate verified, domain-specific, multimodal, and multi-hop Question-Answer datasets. MiRAGE orchestrates a swarm of specialized agents: a recursive context optimization loop to aggregate scattered evidence, an adversarial verifier agent to guarantee factual grounding, and an agent to recognize the expert persona and the relevant domain to mimic expert cognitive workflows. Extensive empirical evaluation across four distinct domains (regulations, finance, quantitative biology, and journalism) demonstrates that MiRAGE generates datasets with significantly higher reasoning complexity (>2.3 average hops) and factual faithfulness. Our ablation studies point that MiRAGE can be powered by LLMs if textual descriptions of the images are available. Visual grounding still remains a frontier. By automating the creation of gold standard evaluation datasets that reflect the latent thematic structure of proprietary corpora, MiRAGE provides the necessary infrastructure to rigorously benchmark the next generation information retrieval systems.",
            "pdf_url": "https://arxiv.org/pdf/2601.15487v1",
            "published": "2026-01-21 21:39:09+00:00",
            "updated": "2026-01-21 21:39:09+00:00"
        }
    ]
}