{
    "Physics": [
        {
            "title": "Quantum simulation of bubble nucleation across a quantum phase transition",
            "authors": "De Luo, Federica Maria Surace, Arinjoy De, Alessio Lerose, Elizabeth R. Bennewitz, Brayden Ware, Alexander Schuckert, Zohreh Davoudi, Alexey V. Gorshkov, Or Katz, Christopher Monroe",
            "summary": "The liquid-vapor transition is a classic example of a discontinuous\n(first-order) phase transition. Such transitions underlie many phenomena in\ncosmology, nuclear and particle physics, and condensed-matter physics. They\ngive rise to long-lived metastable states, whose decay can be driven by either\nthermal or quantum fluctuations. Yet, direct experimental observations of how\nthese states collapse into a stable phase remain elusive in the quantum regime.\nHere, we use a trapped-ion quantum simulator to observe the real-time dynamics\nof ``bubble nucleation'' induced by quantum fluctuations. Bubbles are localized\ndomains of the stable phase which spontaneously form, or nucleate, and expand\nas the system is driven across a discontinuous quantum phase transition.\nImplementing a mixed-field Ising spin model with tunable and time-dependent\ninteractions, we track the microscopic evolution of the metastable state as the\nHamiltonian parameters are varied in time with various speeds, bringing the\nsystem out of equilibrium. Site-resolved measurements reveal the emergence and\nevolution of finite-size quantum bubbles, providing direct insight into the\nmechanism by which the metastable phase decays. We also identify nonequilibrium\nscaling behavior near the transition, consistent with a generalized\nKibble-Zurek mechanism. Our results demonstrate the power of quantum simulators\nto probe out-of-equilibrium many-body physics, including quantum bubble\nnucleation, a key feature of discontinuous quantum phase transitions, with\napplication to studies of matter formation in the early universe.",
            "pdf_url": "http://arxiv.org/pdf/2505.09607v1",
            "published": "2025-05-14 17:57:25+00:00",
            "updated": "2025-05-14 17:57:25+00:00"
        },
        {
            "title": "Comparative Analysis of GFN Methods in Geometry Optimization of Small Organic Semiconductor Molecules: A DFT Benchmarking Study",
            "authors": "Steve Cabrel Teguia Kouam, Jean-Pierre Tchapet Njafa, Raoult Dabou Teukam, Patrick Mvoto Kongo, Jean-Pierre Nguenang, Serge Guy Nana Engo",
            "summary": "This study benchmarks the geometric, frequency, non-covalent (GFN)\nsemi-empirical methods, GFN1-xTB, GFN2-xTB, GFN0-xTB, and GFN-FF, against\ndensity functional theory (DFT) for the geometry optimization of small organic\nsemiconductor molecules. Two datasets are evaluated: a QM9-derived subset of\nsmall organic molecules and the Harvard Clean Energy Project (CEP) database of\nextended $\\pi$-systems relevant to organic photovoltaics. Structural agreement\nis quantified using heavy-atom RMSD, equilibrium rotational constants, bond\nlengths, angles, and HOMO-LUMO energy gaps. Computational efficiency is\nassessed via CPU time and scaling behavior. GFN1-xTB and GFN2-xTB demonstrate\nthe highest structural fidelity, while GFN-FF offers an optimal balance between\naccuracy and speed, particularly for larger systems. The results indicate that\nGFN-based methods are suitable for high-throughput molecular screening of small\norganic semiconductors, the choice of the method depending on the accuracy-cost\ntrade-offs. The findings support the deployment of GFN approaches in\ncomputational pipelines for the discovery of organic electronics and materials,\nproviding information on their strengths and limitations relative to\nestablished DFT methods.",
            "pdf_url": "http://arxiv.org/pdf/2505.09606v1",
            "published": "2025-05-14 17:57:21+00:00",
            "updated": "2025-05-14 17:57:21+00:00"
        },
        {
            "title": "Exponential improvement in quantum simulations of bosons",
            "authors": "Masanori Hanada, Shunji Matsuura, Emanuele Mendicelli, Enrico Rinaldi",
            "summary": "Hamiltonian quantum simulation of bosons on digital quantum computers\nrequires truncating the Hilbert space to finite dimensions. The method of\ntruncation and the choice of basis states can significantly impact the\ncomplexity of the quantum circuit required to simulate the system. For example,\na truncation in the Fock basis where each boson is encoded with a register of\n$Q$ qubits, can result in an exponentially large number of Pauli strings\nrequired to decompose the truncated Hamiltonian. This, in turn, can lead to an\nexponential increase in $Q$ in the complexity of the quantum circuit. For\nlattice quantum field theories such as Yang-Mills theory and QCD, several\nHamiltonian formulations and corresponding truncations have been put forward in\nrecent years. There is no exponential increase in $Q$ when resorting to the\norbifold lattice Hamiltonian, while we do not know how to remove the\nexponential complexity in $Q$ in the commonly used Kogut-Susskind Hamiltonian.\nSpecifically, when using the orbifold lattice Hamiltonian, the continuum limit,\nor, in other words, the removal of the ultraviolet energy cutoff, is obtained\nwith circuits whose resources scale like $Q$, while they scale like\n$\\mathcal{O}(\\exp(Q))$ for the Kogut-Susskind Hamiltonian: this can be seen as\nan exponential speed up in approaching the physical continuum limit for the\norbifold lattice Hamiltonian formulation. We show that the universal framework,\nadvocated by three of the authors (M.~H., S.~M., and E.~R.) and collaborators\nprovides a natural avenue to solve the exponential scaling of circuit\ncomplexity with $Q$, and it is the reason why using the orbifold lattice\nHamiltonian is advantageous. We also point out that Hamiltonian formulations\nbased on a gauge-invariant Hilbert space require an exponential increase in the\nresource requirement with respect to using an extended Hilbert space.",
            "pdf_url": "http://arxiv.org/pdf/2505.02553v2",
            "published": "2025-05-05 10:48:52+00:00",
            "updated": "2025-05-14 16:49:42+00:00"
        },
        {
            "title": "High-Performance Computational Magnetohydrodynamics with Python",
            "authors": "Chris Bard, John Dorelli",
            "summary": "We present the AGATE simulation code, a Python-based framework developed\nprimarily for solving the magnetohydrodynamics (MHD) equations while\nmaintaining adaptability to other equation sets. The code employs a modular,\nobject-oriented architecture that separates interface specifications from\nnumerical implementations, allowing users to customize numerical methods and\nphysics models. Built on a Godunov-type finite-volume scheme, AGATE currently\nsupports the ideal, Hall, and Chew-Goldberger-Low (CGL) MHD equations, with\nmultiple acceleration options ranging from Numpy to GPU-enabled computation via\nNVIDIA CUDA. Performance testing demonstrates that our GPU implementations\nachieve 40-60x speedups over CPU versions. Comprehensive validation through\nestablished benchmarks confirms accurate reproduction of both linear and\nnonlinear phenomena across different MHD regimes. This combination of\nmodularity, performance, and extensibility makes AGATE suitable for multiple\napplications: from rapid prototyping to production simulations, and from\nnumerical algorithm development to physics education.",
            "pdf_url": "http://arxiv.org/pdf/2503.20899v2",
            "published": "2025-03-26 18:16:17+00:00",
            "updated": "2025-05-14 16:46:32+00:00"
        },
        {
            "title": "Experimental demonstration of an analogy between optical non-coherence and irreversibility of heat transport",
            "authors": "Aleksandr Meilakhs, Claudio Pastorino, Miguel Larotonda",
            "summary": "We probe experimentally a connection between coherence in the context of\noptical physics and the irreversibility present in heat transfer through an\ninterface separating two media. The robustness of the experiment on the one\nhand, and the theoretical description taken from the statistical-mechanics\ntreatment of the heat transfer problem, on the other hand, allows for the study\nof the arrow of time's problem within the clean and precise framework of\nexperimental optical physics. The central aspect of the experiment is a light\nbeam incident and split at an interface to produce a second common interaction\npoint again at the interface. The experiment was carried out with two light\nsources that only differ in their coherence length. In the case of the highly\ncoherent light source, we were able to combine the previously split parts of\nthe light back into a single beam. This is indicative of the reversibility of\nthe process of coherent light transmission through the interface. The light\nsource with low coherence length, on the contrary, does not allow for such a\nrecombination, thus producing an irreversible process. We explain how the\nlatter case is analogous to the process of interfacial heat transport, thus\nestablishing an important connection between optical non-coherence and\nirreversibility of transport phenomena. Our finding paves the way for the study\nof fundamental processes in heat transfer and the surge of irreversibility in\nthe realm of optical physics.",
            "pdf_url": "http://arxiv.org/pdf/2505.09522v1",
            "published": "2025-05-14 16:18:55+00:00",
            "updated": "2025-05-14 16:18:55+00:00"
        },
        {
            "title": "The impact of the TMD shape function on matching the transverse momentum spectrum in $J/ψ$ production at the EIC",
            "authors": "Luca Maxia, Daniël Boer, Jelle Bor",
            "summary": "The impact of the inclusion of TMD shape functions on the transverse momentum\nspectrum in $J/\\psi$ production at the EIC is investigated by considering the\nmatching of the TMD factorization description at low transverse momentum with\nthe collinear factorization description at high transverse momentum by means of\nthe inverse-error weighting method. Despite large uncertainties from scale\nvariations and the $J/\\psi$ long-distance matrix elements, predictions for the\ndifferential cross section and its $\\cos(2\\phi_\\psi)$ modulation are obtained.\nWe find that physical constraints are satisfied in case a process-dependent\nterm is included for color octet production, but not in all cases when it is\nexcluded. These numerical results support the analytic calculations in\n\\cite{Boer:2023zit}. Future experimental data can thus test the validity of TMD\nfactorization in $J/\\psi$ production and explore the presence of nontrivial\nprocess-dependent effects in the soft-gluon resummation. This will be crucial\nin the extraction of gluon unpolarized and linearly polarized TMD distributions\nof the proton. In addition, we suggest how the sign of the latter can be\ndetermined by investigating the presence of a node in the $\\cos(2\\phi_\\psi)$\nmodulation as a function of transverse momentum.",
            "pdf_url": "http://arxiv.org/pdf/2504.19617v2",
            "published": "2025-04-28 09:26:21+00:00",
            "updated": "2025-05-14 16:14:43+00:00"
        },
        {
            "title": "Platforms for the realization and characterization of Tomonaga-Luttinger liquids",
            "authors": "Isabelle Bouchoule, Roberta Citro, Tim Duty, Thierry Giamarchi, Randall G. Hulet, Martin Klanjsek, Edmond Orignac, Bent Weber",
            "summary": "The concept of a Tomonaga-Luttinger liquid (TLL) has been established as a\nfundamental theory for the understanding of one-dimensional quantum systems.\nOriginally formulated as a replacement for Landau's Fermi-liquid theory, which\naccurately predicts the behaviour of most 3D metals but fails dramatically in\n1D, the TLL description applies to a even broader class of 1D systems,including\nbosons and anyons. After a certain number of theoretical breakthroughs, its\ndescriptive power has now been confirmed experimentally in different\nexperimental platforms. They extend from organic conductors, carbon nanotubes,\nquantum wires, topological edge states of quantum spin Hall insulators to cold\natoms, Josephson junctions, Bose liquids confined within 1D nanocapillaries and\nspin chains. In the ground state of such systems, quantum fluctuations become\ncorrelated on all length scales, but, counter-intuitively, no long-range order\nexists. In this respect, this review will illustrate the validity of conformal\nfield theory for describing real-world systems, establishing the boundaries for\nits application and, on the other side will discuss the spectacular\ndemonstration of how the quantum-critical TLL state governs the properties of\nmany-body systems in one dimension.",
            "pdf_url": "http://arxiv.org/pdf/2501.12097v2",
            "published": "2025-01-21 12:41:16+00:00",
            "updated": "2025-05-14 16:07:53+00:00"
        },
        {
            "title": "Physical Representations of Corner Symmetries",
            "authors": "Ludovic Varrin",
            "summary": "We give the full representation theory of the gravitational extended corner\nsymmetry group in two-dimensions. This includes projective representations,\nwhich correspond to representations of the quantum corner symmetry group. We\nfind that they are described by one-dimensional conformal fields with an\nadditional index in the Fock space of the harmonic oscillator. We begin with a\nreview of Mackey's theory of induced representations and then proceed to its\napplication to the corner symmetries. The field representations, induced from\nthe irreducible representations of the special linear group are worked out\nfirst. The little group method is then applied to the extended corner symmetry\ngroup to obtain the irreducible unitary representations. Finally, we focus on\nprojective representations and their application to the description of local\nsubsystems.",
            "pdf_url": "http://arxiv.org/pdf/2409.10624v3",
            "published": "2024-09-16 18:00:39+00:00",
            "updated": "2025-05-14 15:57:06+00:00"
        },
        {
            "title": "Equivalence Theorems and Double-Copy Structure in Scattering Amplitudes of Massive Kaluza-Klein States with Matter Interactions",
            "authors": "Kezhu Guo, Yanfeng Hang",
            "summary": "We investigate the scattering amplitudes of massive Kaluza-Klein (KK) states\nin compactified five-dimensional warped gauge and gravity theories. Focusing on\ntree-level $2\\to2$ processes, we analyze the leading-order amplitudes involving\nbulk KK matter fields and KK gauge/gravitational Goldstone bosons. By imposing\nthe gauge theory equivalence theorem (GAET) and the gravitational equivalence\ntheorem (GRET) within warped KK theories, we systematically reconstruct the\nleading-order amplitudes for physical KK gauge bosons and gravitons, thereby\ncircumventing the intricate energy cancellations inherent in physical\namplitudes. Within this framework, the correspondence between GAET and GRET\narises as a direct manifestation of the leading-order double-copy relation in\nthe high-energy expansion. This connection provides a foundation for extending\nthe BCJ double-copy construction to four-point amplitudes involving bulk KK\nmatter fields, and further generalizes to arbitrary $N$-point cases, enabling a\nsystematic derivation of the corresponding gravitational amplitudes with\nconsistent incorporation of KK matter fields at leading order.",
            "pdf_url": "http://arxiv.org/pdf/2504.05199v2",
            "published": "2025-04-07 15:50:19+00:00",
            "updated": "2025-05-14 15:35:20+00:00"
        },
        {
            "title": "Surface excitation of Rydberg dressed quantum droplet of Bose-Einstein Condensates",
            "authors": "Avra Banerjee, Dwipesh Majumder",
            "summary": "We have considered a quantum droplet of two components of Bose-Einstein\ncondensate (BEC) inside the electron of a Rydberg atom to study the surface\nmode of collective excitation using the Bogoliubov theory of excitation. We\nhave calculated the surface excitation spectrum for various Rydberg\nelectron-atom interaction strengths. From the energy spectrum, we calculated\nthe surface tension of the droplet as a function of Rydberg electron-atom\ninteraction strength. Our study shows that the electron-atom interaction\nenhances the surface energy; hence, the droplet will be more stable inside the\nelectron of a Rydberg atom.",
            "pdf_url": "http://arxiv.org/pdf/2505.09474v1",
            "published": "2025-05-14 15:25:02+00:00",
            "updated": "2025-05-14 15:25:02+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "BLIP3-o: A Family of Fully Open Unified Multimodal Models-Architecture, Training and Dataset",
            "authors": "Jiuhai Chen, Zhiyang Xu, Xichen Pan, Yushi Hu, Can Qin, Tom Goldstein, Lifu Huang, Tianyi Zhou, Saining Xie, Silvio Savarese, Le Xue, Caiming Xiong, Ran Xu",
            "summary": "Unifying image understanding and generation has gained growing attention in\nrecent research on multimodal models. Although design choices for image\nunderstanding have been extensively studied, the optimal model architecture and\ntraining recipe for a unified framework with image generation remain\nunderexplored. Motivated by the strong potential of autoregressive and\ndiffusion models for high-quality generation and scalability, we conduct a\ncomprehensive study of their use in unified multimodal settings, with emphasis\non image representations, modeling objectives, and training strategies.\nGrounded in these investigations, we introduce a novel approach that employs a\ndiffusion transformer to generate semantically rich CLIP image features, in\ncontrast to conventional VAE-based representations. This design yields both\nhigher training efficiency and improved generative quality. Furthermore, we\ndemonstrate that a sequential pretraining strategy for unified models-first\ntraining on image understanding and subsequently on image generation-offers\npractical advantages by preserving image understanding capability while\ndeveloping strong image generation ability. Finally, we carefully curate a\nhigh-quality instruction-tuning dataset BLIP3o-60k for image generation by\nprompting GPT-4o with a diverse set of captions covering various scenes,\nobjects, human gestures, and more. Building on our innovative model design,\ntraining recipe, and datasets, we develop BLIP3-o, a suite of state-of-the-art\nunified multimodal models. BLIP3-o achieves superior performance across most of\nthe popular benchmarks spanning both image understanding and generation tasks.\nTo facilitate future research, we fully open-source our models, including code,\nmodel weights, training scripts, and pretraining and instruction tuning\ndatasets.",
            "pdf_url": "http://arxiv.org/pdf/2505.09568v1",
            "published": "2025-05-14 17:11:07+00:00",
            "updated": "2025-05-14 17:11:07+00:00"
        },
        {
            "title": "Learning Long-Context Diffusion Policies via Past-Token Prediction",
            "authors": "Marcel Torne, Andy Tang, Yuejiang Liu, Chelsea Finn",
            "summary": "Reasoning over long sequences of observations and actions is essential for\nmany robotic tasks. Yet, learning effective long-context policies from\ndemonstrations remains challenging. As context length increases, training\nbecomes increasingly expensive due to rising memory demands, and policy\nperformance often degrades as a result of spurious correlations. Recent methods\ntypically sidestep these issues by truncating context length, discarding\nhistorical information that may be critical for subsequent decisions. In this\npaper, we propose an alternative approach that explicitly regularizes the\nretention of past information. We first revisit the copycat problem in\nimitation learning and identify an opposite challenge in recent diffusion\npolicies: rather than over-relying on prior actions, they often fail to capture\nessential dependencies between past and future actions. To address this, we\nintroduce Past-Token Prediction (PTP), an auxiliary task in which the policy\nlearns to predict past action tokens alongside future ones. This regularization\nsignificantly improves temporal modeling in the policy head, with minimal\nreliance on visual representations. Building on this observation, we further\nintroduce a multistage training strategy: pre-train the visual encoder with\nshort contexts, and fine-tune the policy head using cached long-context\nembeddings. This strategy preserves the benefits of PTP while greatly reducing\nmemory and computational overhead. Finally, we extend PTP into a\nself-verification mechanism at test time, enabling the policy to score and\nselect candidates consistent with past actions during inference. Experiments\nacross four real-world and six simulated tasks demonstrate that our proposed\nmethod improves the performance of long-context diffusion policies by 3x and\naccelerates policy training by more than 10x.",
            "pdf_url": "http://arxiv.org/pdf/2505.09561v1",
            "published": "2025-05-14 17:00:47+00:00",
            "updated": "2025-05-14 17:00:47+00:00"
        },
        {
            "title": "Detecting Multimedia Generated by Large AI Models: A Survey",
            "authors": "Li Lin, Neeraj Gupta, Yue Zhang, Hainan Ren, Chun-Hao Liu, Feng Ding, Xin Wang, Xin Li, Luisa Verdoliva, Shu Hu",
            "summary": "The rapid advancement of Large AI Models (LAIMs), particularly diffusion\nmodels and large language models, has marked a new era where AI-generated\nmultimedia is increasingly integrated into various aspects of daily life.\nAlthough beneficial in numerous fields, this content presents significant\nrisks, including potential misuse, societal disruptions, and ethical concerns.\nConsequently, detecting multimedia generated by LAIMs has become crucial, with\na marked rise in related research. Despite this, there remains a notable gap in\nsystematic surveys that focus specifically on detecting LAIM-generated\nmultimedia. Addressing this, we provide the first survey to comprehensively\ncover existing research on detecting multimedia (such as text, images, videos,\naudio, and multimodal content) created by LAIMs. Specifically, we introduce a\nnovel taxonomy for detection methods, categorized by media modality, and\naligned with two perspectives: pure detection (aiming to enhance detection\nperformance) and beyond detection (adding attributes like generalizability,\nrobustness, and interpretability to detectors). Additionally, we have presented\na brief overview of generation mechanisms, public datasets, online detection\ntools, and evaluation metrics to provide a valuable resource for researchers\nand practitioners in this field. Most importantly, we offer a focused analysis\nfrom a social media perspective to highlight their broader societal impact.\nFurthermore, we identify current challenges in detection and propose directions\nfor future research that address unexplored, ongoing, and emerging issues in\ndetecting multimedia generated by LAIMs. Our aim for this survey is to fill an\nacademic gap and contribute to global AI security efforts, helping to ensure\nthe integrity of information in the digital realm. The project link is\nhttps://github.com/Purdue-M2/Detect-LAIM-generated-Multimedia-Survey.",
            "pdf_url": "http://arxiv.org/pdf/2402.00045v5",
            "published": "2024-01-22 15:08:19+00:00",
            "updated": "2025-05-14 16:37:28+00:00"
        },
        {
            "title": "Fragment-Masked Diffusion for Molecular Optimization",
            "authors": "Kun Li, Xiantao Cai, Jia Wu, Shirui Pan, Huiting Xu, Bo Du, Wenbin Hu",
            "summary": "Molecular optimization is a crucial aspect of drug discovery, aimed at\nrefining molecular structures to enhance drug efficacy and minimize side\neffects, ultimately accelerating the overall drug development process. Many\nmolecular optimization methods have been proposed, significantly advancing drug\ndiscovery. These methods primarily on understanding the specific drug target\nstructures or their hypothesized roles in combating diseases. However,\nchallenges such as a limited number of available targets and a difficulty\ncapturing clear structures hinder innovative drug development. In contrast,\nphenotypic drug discovery (PDD) does not depend on clear target structures and\ncan identify hits with novel and unbiased polypharmacology signatures. As a\nresult, PDD-based molecular optimization can reduce potential safety risks\nwhile optimizing phenotypic activity, thereby increasing the likelihood of\nclinical success. Therefore, we propose a fragment-masked molecular\noptimization method based on PDD (FMOP). FMOP employs a regression-free\ndiffusion model to conditionally optimize the molecular masked regions,\neffectively generating new molecules with similar scaffolds. On the large-scale\ndrug response dataset GDSCv2, we optimize the potential molecules across all\n985 cell lines. The overall experiments demonstrate that the in-silico\noptimization success rate reaches 95.4\\%, with an average efficacy increase of\n7.5\\%. Additionally, we conduct extensive ablation and visualization\nexperiments, confirming that FMOP is an effective and robust molecular\noptimization method. The code is available at:\nhttps://anonymous.4open.science/r/FMOP-98C2.",
            "pdf_url": "http://arxiv.org/pdf/2408.09106v3",
            "published": "2024-08-17 06:00:58+00:00",
            "updated": "2025-05-14 16:26:53+00:00"
        },
        {
            "title": "Train a Multi-Task Diffusion Policy on RLBench-18 in One Day with One GPU",
            "authors": "Yutong Hu, Pinhao Song, Kehan Wen, Renaud Detry",
            "summary": "We present a method for training multi-task vision-language robotic diffusion\npolicies that reduces training time and memory usage by an order of magnitude.\nThis improvement arises from a previously underexplored distinction between\naction diffusion and the image diffusion techniques that inspired it: image\ngeneration targets are high-dimensional, while robot actions lie in a much\nlower-dimensional space. Meanwhile, the vision-language conditions for action\ngeneration remain high-dimensional. Our approach, Mini-Diffuser, exploits this\nasymmetry by introducing Level-2 minibatching, which pairs multiple noised\naction samples with each vision-language condition, instead of the conventional\none-to-one sampling strategy. To support this batching scheme, we introduce\narchitectural adaptations to the diffusion transformer that prevent information\nleakage across samples while maintaining full conditioning access. In RLBench\nsimulations, Mini-Diffuser achieves 95\\% of the performance of state-of-the-art\nmulti-task diffusion policies, while using only 5\\% of the training time and\n7\\% of the memory. Real-world experiments further validate that Mini-Diffuser\npreserves the key strengths of diffusion-based policies, including the ability\nto model multimodal action distributions and produce behavior conditioned on\ndiverse perceptual inputs. Code available at\ngithub.com/utomm/mini-diffuse-actor.",
            "pdf_url": "http://arxiv.org/pdf/2505.09430v1",
            "published": "2025-05-14 14:34:40+00:00",
            "updated": "2025-05-14 14:34:40+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Fast Learning in Quantitative Finance with Extreme Learning Machine",
            "authors": "Liexin Cheng, Xue Cheng, Shuaiqiang Liu",
            "summary": "This paper demonstrates that a broad class of problems in quantitative\nfinance, including those previously addressed using deep neural networks, can\nbe efficiently solved using single-layer neural networks without iterative\ngradient-based training, namely extreme learning machine (ELM). ELM utilizes a\nsingle-layer network with randomly initialized hidden nodes and analytically\ncomputed output weights obtained via convex optimization, enabling rapid\ntraining and inference. Both supervised and unsupervised learning tasks are\nexplored.\n  In supervised learning, ELM is employed to learn parametric option pricing\nfunctions, predict intraday stock returns, and complete implied volatility\nsurfaces. Compared with deep neural networks, Gaussian process regression, and\nlogistic regression, ELM achieves higher computational speed, comparable\naccuracy, and superior generalization.\n  In unsupervised learning, ELM numerically solves Black-Scholes-type PDEs, and\noutperforms Physics-Informed Neural Networks in training speed without losing\nprecision. The approximation and generalization abilities of ELM are briefly\ndiscussed.\n  The findings establish ELM as a practical and efficient tool for various\ntasks in quantitative finance.",
            "pdf_url": "http://arxiv.org/pdf/2505.09551v1",
            "published": "2025-05-14 16:49:47+00:00",
            "updated": "2025-05-14 16:49:47+00:00"
        }
    ]
}