{
    "Physics": [
        {
            "title": "Denoising Hamiltonian Network for Physical Reasoning",
            "authors": "Congyue Deng, Brandon Y. Feng, Cecilia Garraffo, Alan Garbarz, Robin Walters, William T. Freeman, Leonidas Guibas, Kaiming He",
            "summary": "Machine learning frameworks for physical problems must capture and enforce\nphysical constraints that preserve the structure of dynamical systems. Many\nexisting approaches achieve this by integrating physical operators into neural\nnetworks. While these methods offer theoretical guarantees, they face two key\nlimitations: (i) they primarily model local relations between adjacent time\nsteps, overlooking longer-range or higher-level physical interactions, and (ii)\nthey focus on forward simulation while neglecting broader physical reasoning\ntasks. We propose the Denoising Hamiltonian Network (DHN), a novel framework\nthat generalizes Hamiltonian mechanics operators into more flexible neural\noperators. DHN captures non-local temporal relationships and mitigates\nnumerical integration errors through a denoising mechanism. DHN also supports\nmulti-system modeling with a global conditioning mechanism. We demonstrate its\neffectiveness and flexibility across three diverse physical reasoning tasks\nwith distinct inputs and outputs.",
            "pdf_url": "http://arxiv.org/pdf/2503.07596v1",
            "published": "2025-03-10 17:57:01+00:00",
            "updated": "2025-03-10 17:57:01+00:00"
        },
        {
            "title": "Flavor Patterns of Fundamental Particles from Quantum Entanglement?",
            "authors": "Jesse Thaler, Sokratis Trifinopoulos",
            "summary": "The Cabibbo-Kobayashi-Maskawa (CKM) matrix, which controls flavor mixing\nbetween the three generations of quark fermions, is a key input to the Standard\nModel of particle physics. In this paper, we identify a surprising connection\nbetween quantum entanglement and the degree of quark mixing. Focusing on a\nspecific limit of $2 \\to 2$ quark scattering mediated by electroweak bosons, we\nfind that the quantum entanglement generated by scattering is minimized when\nthe CKM matrix is almost (but not exactly) diagonal, in qualitative agreement\nwith observation. With the discovery of neutrino masses and mixings, additional\nangles are needed to parametrize the Pontecorvo-Maki-Nakagawa-Sakata (PMNS)\nmatrix in the lepton sector. Applying the same logic, we find that quantum\nentanglement is minimized when the PMNS matrix features two large angles and a\nsmaller one, again in qualitative agreement with observation, plus a hint for\nsuppressed CP violation. We speculate on the (unlikely but tantalizing)\npossibility that minimization of quantum entanglement might be a fundamental\nprinciple that determines particle physics input parameters.",
            "pdf_url": "http://arxiv.org/pdf/2410.23343v2",
            "published": "2024-10-30 18:00:01+00:00",
            "updated": "2025-03-10 17:44:26+00:00"
        },
        {
            "title": "Feshbach Resonances in Exciton-Charge-Carrier Scattering in Semiconductor Bilayers",
            "authors": "Marcel Wagner, Rafał Ołdziejewski, Félix Rose, Verena Köder, Clemens Kuhlenkamp, Ataç İmamoğlu, Richard Schmidt",
            "summary": "Feshbach resonances play a vital role in the success of cold atoms\ninvestigating strongly-correlated physics. The recent observation of their\nsolid-state analog in the scattering of holes and intralayer excitons in\ntransition metal dichalcogenides [Schwartz et al., Science 374, 336 (2021)]\nholds compelling promise for bringing fully controllable interactions to the\nfield of semiconductors. Here, we demonstrate how tunneling-induced layer\nhybridization can lead to the emergence of two distinct classes of Feshbach\nresonances in atomically thin semiconductors. Based on microscopic scattering\ntheory we show that these two types of Feshbach resonances allow to tune\ninteractions between electrons and both short-lived intralayer, as well as\nlong-lived interlayer excitons. We predict the exciton-electron scattering\nphase shift from first principles and show that the exciton-electron coupling\nis fully tunable from strong to vanishing interactions. The tunability of\ninteractions opens the avenue to explore Bose-Fermi mixtures in solid-state\nsystems in regimes that were previously only accessible in cold atom\nexperiments.",
            "pdf_url": "http://arxiv.org/pdf/2310.08729v2",
            "published": "2023-10-12 21:33:11+00:00",
            "updated": "2025-03-10 17:43:50+00:00"
        },
        {
            "title": "Genuine Continuous Quantumness",
            "authors": "Vojtěch Kala, Jiří Fadrný, Michal Neset, Jan Bílek, Petr Marek, Miroslav Ježek",
            "summary": "Randomness is a key feature of quantum physics. Heisenberg's uncertainty\nprinciple reveals existence of an intrinsic noise, usually explored through\nGaussian squeezed states. Due to their insufficiency for quantum advantage, the\nfocus is currently shifting towards genuinely quantum non-Gaussian states.\nHowever, while the genuine quantum behavior comes naturally to discrete\nvariable systems, its preparation and verification is difficult in the\ncontinuous ones. Simultaneously, a unifying theoretical framework based on the\ncontinuous nature is missing. Here, we introduce nonlinear squeezing as a\ngeneral framework to describe and verify genuine quantumness in noise of\ncontinuous quantum states. Using this approach, we certify the non-Gaussianity\nof experimentally prepared multi-photon-added coherent states of light for the\nfirst time. Chiefly, we demonstrated the nonlinear squeezing corresponding to\nthird- and fifth-order quantum nonlinearities, going significantly beyond the\ncurrent state-of-the-art in quantum technology. This framework advances quantum\nscience and supports the development of quantum technologies by uncovering\nintricate quantum properties in cutting-edge experiments.",
            "pdf_url": "http://arxiv.org/pdf/2503.07574v1",
            "published": "2025-03-10 17:41:35+00:00",
            "updated": "2025-03-10 17:41:35+00:00"
        },
        {
            "title": "Probing quantum properties of black holes with a Floquet-driven optical lattice simulator",
            "authors": "Asmae Benhemou, Georgia Nixon, Aydin Deger, Ulrich Schneider, Jiannis K. Pachos",
            "summary": "In the curved spacetime of a black hole, quantum physics gives rise to\ndistinctive effects such as Hawking radiation and maximally fast scrambling.\nHere, we present a scheme for an analogue quantum simulation of (1 + 1) and (2\n+ 1)-dimensional black holes using ultracold atoms in a locally Floquet-driven\noptical lattice. We show how the effective dynamics of the driven system can\ngenerate position-dependent tunnelling amplitudes that encode the curved\ngeometry of the black hole. Moreover, we provide a simple and robust scheme to\ndetermine the Hawking temperature of a (1+1)D simulated black hole based solely\non on-site atom population measurements. Combined with the highly tunable\nonsite atom-atom interactions typical for cold atoms, our simulator provides a\npowerful and feasible platform to probe the scrambling of quantum information\nin black holes. We illustrate the ergodicity of our (2+1)D black-hole simulator\nby showing numerically that its level statistics in the hard-core limit\napproaches the ergodic regime faster than a globally homogeneous Hamiltonian.",
            "pdf_url": "http://arxiv.org/pdf/2312.14058v3",
            "published": "2023-12-21 17:36:28+00:00",
            "updated": "2025-03-10 17:39:16+00:00"
        },
        {
            "title": "Dynamics of disordered quantum systems with two- and three-dimensional tensor networks",
            "authors": "Joseph Tindall, Antonio Mello, Matt Fishman, Miles Stoudenmire, Dries Sels",
            "summary": "Quantum spin glasses form a good testbed for studying the performance of\nvarious quantum annealing and optimization algorithms. In this work we show how\ntwo- and three-dimensional tensor networks can accurately and efficiently\nsimulate the quantum annealing dynamics of Ising spin glasses on a range of\nlattices. Such dynamics were recently simulated using D-Wave's Advantage$2$\nsystem [arXiv:2403.00910] and, following extensive comparison to existing\nnumerical methods, claimed to be beyond the reach of classical computation.\nHere we show that by evolving lattice-specific tensor networks with simple\nbelief propagation to keep up with the entanglement generated during the time\nevolution and then extracting expectation values with more sophisticated\nvariants of belief propagation, state-of-the-art accuracies can be reached with\nmodest computational resources. The scalability of our simulations allows us to\nverify the universal physics present in the system and extract a value for the\nassociated Kibble-Zurek exponent which agrees with recent values obtained in\nliterature. Our results demonstrate that tensor networks are a viable approach\nfor simulating large scale quantum dynamics in two and three dimensions on\nclassical computers, and algorithmic advancements are expected to expand their\napplicability going forward.",
            "pdf_url": "http://arxiv.org/pdf/2503.05693v2",
            "published": "2025-03-07 18:58:03+00:00",
            "updated": "2025-03-10 17:29:40+00:00"
        },
        {
            "title": "Incentive-Compatible Recovery from Manipulated Signals, with Applications to Decentralized Physical Infrastructure",
            "authors": "Jason Milionis, Jens Ernstberger, Joseph Bonneau, Scott Duke Kominers, Tim Roughgarden",
            "summary": "We introduce the first formal model capturing the elicitation of unverifiable\ninformation from a party (the \"source\") with implicit signals derived by other\nplayers (the \"observers\"). Our model is motivated in part by applications in\ndecentralized physical infrastructure networks (a.k.a. \"DePIN\"), an emerging\napplication domain in which physical services (e.g., sensor information,\nbandwidth, or energy) are provided at least in part by untrusted and\nself-interested parties. A key challenge in these signal network applications\nis verifying the level of service that was actually provided by network\nparticipants.\n  We first establish a condition called source identifiability, which we show\nis necessary for the existence of a mechanism for which truthful signal\nreporting is a strict equilibrium. For a converse, we build on techniques from\npeer prediction to show that in every signal network that satisfies the source\nidentifiability condition, there is in fact a strictly truthful mechanism,\nwhere truthful signal reporting gives strictly higher total expected payoff\nthan any less informative equilibrium. We furthermore show that this truthful\nequilibrium is in fact the unique equilibrium of the mechanism if there is\npositive probability that any one observer is unconditionally honest (e.g., if\nan observer were run by the network owner). Also, by extending our condition to\ncoalitions, we show that there are generally no collusion-resistant mechanisms\nin the settings that we consider.\n  We apply our framework and results to two DePIN applications: proving\nlocation, and proving bandwidth. In the location-proving setting observers\nlearn (potentially enlarged) Euclidean distances to the source. Here, our\ncondition has an appealing geometric interpretation, implying that the source's\nlocation can be truthfully elicited if and only if it is guaranteed to lie\ninside the convex hull of the observers.",
            "pdf_url": "http://arxiv.org/pdf/2503.07558v1",
            "published": "2025-03-10 17:28:45+00:00",
            "updated": "2025-03-10 17:28:45+00:00"
        },
        {
            "title": "New Physics at Tera-$Z$: Precision Renormalised",
            "authors": "Lukas Allwicher, Matthew McCullough, Sophie Renner",
            "summary": "We study the power of a Tera-$Z$ run at FCC-ee for indirectly detecting or\nconstraining heavy new physics. Our main finding is that nearly every new\nparticle which matches at tree level to dimension-six operators of the Standard\nModel Effective Field Theory (SMEFT) affects electroweak precision observables\n(EWPOs) at either tree level or via one loop renormalisation group (RG)\nrunning. This is true almost regardless of the structure of couplings to the\nStandard Model; just a handful of exceptions are identified which can produce\nzeroes in the EWPO RG equations. Under simple flavour assumptions, we perform\nfits of each state to projected FCC-ee $Z$ pole measurements, showing that all\nscenarios can be tested at the TeV scale or better, with many projected\nexclusions reaching tens of TeV. Tera-$Z$ is argued to provide an almost\ninescapable probe of heavy new physics.",
            "pdf_url": "http://arxiv.org/pdf/2408.03992v2",
            "published": "2024-08-07 18:00:01+00:00",
            "updated": "2025-03-10 17:24:15+00:00"
        },
        {
            "title": "Probing the Quantum Nature of Gravity through Classical Diffusion",
            "authors": "Oliviero Angeli, Sandro Donadi, Giovanni Di Bartolomeo, José Luis Gaona-Reyes, Andrea Vinante, Angelo Bassi",
            "summary": "The question of whether gravity is fundamentally quantum remains one of the\nmost profound open problems in modern physics. A recently explored approach\nconsists in testing gravity's ability to entangle quantum systems, which\nrequires preparing and controlling large-mass quantum states-a formidable\nexperimental challenge. We propose an alternative strategy that circumvents the\nneed for quantum state engineering. We show that if gravity is classical in the\nsense of being a local operation and classical communication (LOCC) channel, it\nmust necessarily introduce diffusion in the motion of quantum systems. We\nderive the master equation governing this diffusive dynamics and establish a\nlower bound on the noise that any classical gravitational interaction must\ninduce. Next, we outline an experimental protocol based on a high-precision\ntorsion pendulum at millikelvin temperatures, showing that the predicted\ndiffusion, if present, is in principle detectable with near-term technology.\nOur approach offers a novel route to testing the classical vs quantum nature of\ngravity without requiring macroscopic quantum superpositions or high control of\nthe quantum state of the system, significantly reducing the experimental\ncomplexity.",
            "pdf_url": "http://arxiv.org/pdf/2501.13030v2",
            "published": "2025-01-22 17:22:49+00:00",
            "updated": "2025-03-10 17:18:40+00:00"
        },
        {
            "title": "Collimated $ γ$-flash emission along the target surface irradiated by a laser at non-grazing incidence",
            "authors": "M. Matys, P. Hadjisolomou, R. Shaisultanov, P. Valenta, M. Lamač, T. M. Jeong, J. P. Thistlewood, C. P. Ridgers, A. S. Pirozhkov, S. V. Bulanov",
            "summary": "The interaction of a high-power laser with a solid target provides ways to\nproduce beams of $\\gamma$-photons. For normal incidence of the laser on the\ntarget the beams usually appear in a form of two lobes, which are symmetric\nwith respect to the laser propagation axis. In this work we demonstrate via\nthree-dimensional particle-in-cell simulations a regime where for oblique\nincidence the emission of a collimated $\\gamma$-photon beam is in the direction\nparallel to the target surface. The process is ascribed to the interference\npattern in the electromagnetic field formed by the incident and reflected laser\npulse. The electromagnetic field accelerates electrons to the GeV energy level,\nwhile temporarily directing their momentum along the target surface.\nConsequently, they emit a collimated $\\gamma$-photon beam in the same\ndirection. The dependencies of $\\gamma$-photon emission on the incident angle,\nlaser pulse polarization, power and duration and target thickness and preplasma\nare also addressed in the paper. The beam directionality is important for\ndesigning future experiments. In addition, this setup causes the generation of\nhigh-order harmonics propagating along the target surface.",
            "pdf_url": "http://arxiv.org/pdf/2410.12780v2",
            "published": "2024-10-16 17:53:51+00:00",
            "updated": "2025-03-10 17:10:33+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Balanced Image Stylization with Style Matching Score",
            "authors": "Yuxin Jiang, Liming Jiang, Shuai Yang, Jia-Wei Liu, Ivor Tsang, Mike Zheng Shou",
            "summary": "We present Style Matching Score (SMS), a novel optimization method for image\nstylization with diffusion models. Balancing effective style transfer with\ncontent preservation is a long-standing challenge. Unlike existing efforts, our\nmethod reframes image stylization as a style distribution matching problem. The\ntarget style distribution is estimated from off-the-shelf style-dependent LoRAs\nvia carefully designed score functions. To preserve content information\nadaptively, we propose Progressive Spectrum Regularization, which operates in\nthe frequency domain to guide stylization progressively from low-frequency\nlayouts to high-frequency details. In addition, we devise a Semantic-Aware\nGradient Refinement technique that leverages relevance maps derived from\ndiffusion semantic priors to selectively stylize semantically important\nregions. The proposed optimization formulation extends stylization from pixel\nspace to parameter space, readily applicable to lightweight feedforward\ngenerators for efficient one-step stylization. SMS effectively balances style\nalignment and content preservation, outperforming state-of-the-art approaches,\nverified by extensive experiments.",
            "pdf_url": "http://arxiv.org/pdf/2503.07601v1",
            "published": "2025-03-10 17:58:02+00:00",
            "updated": "2025-03-10 17:58:02+00:00"
        },
        {
            "title": "Denoising Score Distillation: From Noisy Diffusion Pretraining to One-Step High-Quality Generation",
            "authors": "Tianyu Chen, Yasi Zhang, Zhendong Wang, Ying Nian Wu, Oscar Leong, Mingyuan Zhou",
            "summary": "Diffusion models have achieved remarkable success in generating\nhigh-resolution, realistic images across diverse natural distributions.\nHowever, their performance heavily relies on high-quality training data, making\nit challenging to learn meaningful distributions from corrupted samples. This\nlimitation restricts their applicability in scientific domains where clean data\nis scarce or costly to obtain. In this work, we introduce denoising score\ndistillation (DSD), a surprisingly effective and novel approach for training\nhigh-quality generative models from low-quality data. DSD first pretrains a\ndiffusion model exclusively on noisy, corrupted samples and then distills it\ninto a one-step generator capable of producing refined, clean outputs. While\nscore distillation is traditionally viewed as a method to accelerate diffusion\nmodels, we show that it can also significantly enhance sample quality,\nparticularly when starting from a degraded teacher model. Across varying noise\nlevels and datasets, DSD consistently improves generative performancewe\nsummarize our empirical evidence in Fig. 1. Furthermore, we provide theoretical\ninsights showing that, in a linear model setting, DSD identifies the eigenspace\nof the clean data distributions covariance matrix, implicitly regularizing the\ngenerator. This perspective reframes score distillation as not only a tool for\nefficiency but also a mechanism for improving generative models, particularly\nin low-quality data settings.",
            "pdf_url": "http://arxiv.org/pdf/2503.07578v1",
            "published": "2025-03-10 17:44:46+00:00",
            "updated": "2025-03-10 17:44:46+00:00"
        },
        {
            "title": "Inductive Moment Matching",
            "authors": "Linqi Zhou, Stefano Ermon, Jiaming Song",
            "summary": "Diffusion models and Flow Matching generate high-quality samples but are slow\nat inference, and distilling them into few-step models often leads to\ninstability and extensive tuning. To resolve these trade-offs, we propose\nInductive Moment Matching (IMM), a new class of generative models for one- or\nfew-step sampling with a single-stage training procedure. Unlike distillation,\nIMM does not require pre-training initialization and optimization of two\nnetworks; and unlike Consistency Models, IMM guarantees distribution-level\nconvergence and remains stable under various hyperparameters and standard model\narchitectures. IMM surpasses diffusion models on ImageNet-256x256 with 1.99 FID\nusing only 8 inference steps and achieves state-of-the-art 2-step FID of 1.98\non CIFAR-10 for a model trained from scratch.",
            "pdf_url": "http://arxiv.org/pdf/2503.07565v1",
            "published": "2025-03-10 17:37:39+00:00",
            "updated": "2025-03-10 17:37:39+00:00"
        },
        {
            "title": "PointVLA: Injecting the 3D World into Vision-Language-Action Models",
            "authors": "Chengmeng Li, Junjie Wen, Yan Peng, Yaxin Peng, Feifei Feng, Yichen Zhu",
            "summary": "Vision-Language-Action (VLA) models excel at robotic tasks by leveraging\nlarge-scale 2D vision-language pretraining, but their reliance on RGB images\nlimits spatial reasoning critical for real-world interaction. Retraining these\nmodels with 3D data is computationally prohibitive, while discarding existing\n2D datasets wastes valuable resources. To bridge this gap, we propose PointVLA,\na framework that enhances pre-trained VLAs with point cloud inputs without\nrequiring retraining. Our method freezes the vanilla action expert and injects\n3D features via a lightweight modular block. To identify the most effective way\nof integrating point cloud representations, we conduct a skip-block analysis to\npinpoint less useful blocks in the vanilla action expert, ensuring that 3D\nfeatures are injected only into these blocks--minimizing disruption to\npre-trained representations.\n  Extensive experiments demonstrate that PointVLA outperforms state-of-the-art\n2D imitation learning methods, such as OpenVLA, Diffusion Policy and DexVLA,\nacross both simulated and real-world robotic tasks. Specifically, we highlight\nseveral key advantages of PointVLA enabled by point cloud integration: (1)\nFew-shot multi-tasking, where PointVLA successfully performs four different\ntasks using only 20 demonstrations each; (2) Real-vs-photo discrimination,\nwhere PointVLA distinguishes real objects from their images, leveraging 3D\nworld knowledge to improve safety and reliability; (3) Height adaptability,\nUnlike conventional 2D imitation learning methods, PointVLA enables robots to\nadapt to objects at varying table height that unseen in train data.\nFurthermore, PointVLA achieves strong performance in long-horizon tasks, such\nas picking and packing objects from a moving conveyor belt, showcasing its\nability to generalize across complex, dynamic environments.",
            "pdf_url": "http://arxiv.org/pdf/2503.07511v1",
            "published": "2025-03-10 16:32:41+00:00",
            "updated": "2025-03-10 16:32:41+00:00"
        },
        {
            "title": "SoundCTM: Unifying Score-based and Consistency Models for Full-band Text-to-Sound Generation",
            "authors": "Koichi Saito, Dongjun Kim, Takashi Shibuya, Chieh-Hsin Lai, Zhi Zhong, Yuhta Takida, Yuki Mitsufuji",
            "summary": "Sound content creation, essential for multimedia works such as video games\nand films, often involves extensive trial-and-error, enabling creators to\nsemantically reflect their artistic ideas and inspirations, which evolve\nthroughout the creation process, into the sound. Recent high-quality\ndiffusion-based Text-to-Sound (T2S) generative models provide valuable tools\nfor creators. However, these models often suffer from slow inference speeds,\nimposing an undesirable burden that hinders the trial-and-error process. While\nexisting T2S distillation models address this limitation through 1-step\ngeneration, the sample quality of $1$-step generation remains insufficient for\nproduction use. Additionally, while multi-step sampling in those distillation\nmodels improves sample quality itself, the semantic content changes due to\ntheir lack of deterministic sampling capabilities. To address these issues, we\nintroduce Sound Consistency Trajectory Models (SoundCTM), which allow flexible\ntransitions between high-quality $1$-step sound generation and superior sound\nquality through multi-step deterministic sampling. This allows creators to\nefficiently conduct trial-and-error with 1-step generation to semantically\nalign samples with their intention, and subsequently refine sample quality with\npreserving semantic content through deterministic multi-step sampling. To\ndevelop SoundCTM, we reframe the CTM training framework, originally proposed in\ncomputer vision, and introduce a novel feature distance using the teacher\nnetwork for a distillation loss. For production-level generation, we scale up\nour model to 1B trainable parameters, making SoundCTM-DiT-1B the first\nlarge-scale distillation model in the sound community to achieve both promising\nhigh-quality 1-step and multi-step full-band (44.1kHz) generation.",
            "pdf_url": "http://arxiv.org/pdf/2405.18503v3",
            "published": "2024-05-28 18:14:52+00:00",
            "updated": "2025-03-10 15:51:47+00:00"
        }
    ],
    "Quantitative Finance": [
        {
            "title": "Decoding the Black Box: Integrating Moral Imagination with Technical AI Governance",
            "authors": "Krti Tallam",
            "summary": "This paper examines the intricate interplay among AI safety, security, and\ngovernance by integrating technical systems engineering with principles of\nmoral imagination and ethical philosophy. Drawing on foundational insights from\nWeapons of Math Destruction and Thinking in Systems alongside contemporary\ndebates in AI ethics, we develop a comprehensive multi-dimensional framework\ndesigned to regulate AI technologies deployed in high-stakes domains such as\ndefense, finance, healthcare, and education. Our approach combines rigorous\ntechnical analysis, quantitative risk assessment, and normative evaluation to\nexpose systemic vulnerabilities inherent in opaque, black-box models. Detailed\ncase studies, including analyses of Microsoft Tay (2016) and the UK A-Level\nGrading Algorithm (2020), demonstrate how security lapses, bias amplification,\nand lack of accountability can precipitate cascading failures that undermine\npublic trust. We conclude by outlining targeted strategies for enhancing AI\nresilience through adaptive regulatory mechanisms, robust security protocols,\nand interdisciplinary oversight, thereby advancing the state of the art in\nethical and technical AI governance.",
            "pdf_url": "http://arxiv.org/pdf/2503.06411v1",
            "published": "2025-03-09 03:11:32+00:00",
            "updated": "2025-03-09 03:11:32+00:00"
        }
    ]
}