{
    "Physics": [
        {
            "title": "Robust Hilbert space fragmentation in group-valued loop models",
            "authors": "Alexey Khudorozhkov, Charles Stahl, Oliver Hart, Rahul Nandkishore",
            "summary": "We introduce a large class of models exhibiting robust ergodicity breaking in\nquantum dynamics. Our work is inspired by recent discussions of \"topologically\nrobust Hilbert space fragmentation,\" but massively generalizes in two\ndirections: firstly from states describable as \"loop-soups\" to a broader class\nof states reminiscent of string-nets and sponges, and secondly from models\nrestricted to square or cubic lattices, to models defined on arbitrary lattices\n(and even arbitrary graphs without translation invariance). Our constructions\nleverage a recently proposed group-theory framework [PRX 14, 021034 (2024)],\nand identify a host of new phenomena arising from the interplay of \"group-model\ndynamics\" and lattice structure. We make crisp connections to gauge theories,\nand our construction generalizes Kitaev's quantum double to infinite groups.",
            "pdf_url": "http://arxiv.org/pdf/2406.19386v1",
            "published": "2024-06-27 17:58:23+00:00",
            "updated": "2024-06-27 17:58:23+00:00"
        },
        {
            "title": "Spontaneous symmetry breaking in open quantum systems: strong, weak, and strong-to-weak",
            "authors": "Ding Gu, Zijian Wang, Zhong Wang",
            "summary": "Depending on the coupling to the environment, symmetries of open quantum\nsystems manifest in two distinct forms, the strong and the weak. We study the\nspontaneous symmetry breaking among phases with different symmetries. Concrete\nLiouvillian models with strong and weak symmetry are constructed, and different\nscenarios of symmetry-breaking transitions are investigated from complementary\napproaches. It is demonstrated that strong symmetry always spontaneously breaks\ninto the corresponding weak symmetry. For strong $U(1)$ symmetry, we show that\nstrong-to-weak symmetry breaking leads to gapless Goldstone modes dictating\ndiffusion of the symmetry charge in translational invariant systems. We\nconjecture that this relation among strong-to-weak symmetry breaking, gapless\nmodes, and symmetry-charge diffusion is general for continuous symmetries. It\ncan be interpreted as an \"enhanced Lieb-Schultz-Mattis (LSM) theorem\" for open\nquantum systems, according to which the gapless spectrum does not require\nnon-integer filling. We also investigate the scenario where the strong symmetry\nbreaks completely. In the symmetry-broken phase, we identify an effective\nKeldysh action with two Goldstone modes, describing fluctuations of the order\nparameter and diffusive hydrodynamics of the symmetry charge, respectively. For\na particular model studied here, we uncover a transition from a symmetric phase\nwith a \"Bose surface\" to a symmetry-broken phase with long-range order induced\nby tuning the filling. It is also shown that the long-range order of $U(1)$\nsymmetry breaking is possible in spatial dimension $d\\geq 3$, in both weak and\nstrong symmetry cases. Our work outline the typical scenarios of spontaneous\nsymmetry breaking in open quantum systems, and highlights their physical\nconsequences.",
            "pdf_url": "http://arxiv.org/pdf/2406.19381v1",
            "published": "2024-06-27 17:55:36+00:00",
            "updated": "2024-06-27 17:55:36+00:00"
        },
        {
            "title": "Inflation, the Hubble Tension and Early Dark Energy: an alternative overview",
            "authors": "William Giarè",
            "summary": "I review and discuss the possible implications for inflation resulting from\nconsidering new physics in light of the Hubble tension. My study is motivated\nby a simple argument that the constraints on inflationary parameters, most\ntypically the spectral index $n_s$, depend to some extent on the cosmological\nframework. To avoid broadening the uncertainties resulting from marginalizing\nover additional parameters (typical in many alternative models), I first adopt\nthe same alternative viewpoint of previous studies and analyze what happens if\na physical theory can fix extra parameters to non-standard values. Focusing on\nthe dark energy equation of state $w$ and the effective number of relativistic\nspecies $N_{\\rm{eff}}$, I confirm that physical theories able to fix $w \\approx\n-1.2$ or $N_{\\rm{eff}} \\approx 3.9$ produce values of $H_0$ from CMB and BAO in\nline with the local distance ladder estimate. While in the former case I do not\nfind any relevant implications for inflation, in the latter scenarios, I\nobserve a shift towards $n_s \\approx 1$. From a model-selection perspective,\nboth cases are strongly disfavored compared to $\\Lambda$CDM. However, models\nwith $N_{\\rm{eff}} \\approx 3.3 - 3.4$ could bring the $H_0$ tension down to\n$\\sim 3\\sigma$ while being moderately disfavored. Yet, this is enough to change\nthe constraints on inflation so that the most accredited models (e.g.,\nStarobinsky inflation) would no longer be favored by data. I then focus on\nEarly Dark Energy (EDE), arguing that an EDE fraction $f_{\\rm{EDE}}\\sim 0.04 -\n0.06$ (only able to mildly reduce the $H_0$-tension down to $\\sim 3\\sigma$)\ncould already require a similar change in perspective on inflation. In fact,\nperforming a full joint analysis of EDE and Starobinsky inflation, I find that\nthe two models can hardly coexist for $f_{\\rm{EDE}}\\gtrsim 0.06$.",
            "pdf_url": "http://arxiv.org/pdf/2404.12779v2",
            "published": "2024-04-19 10:36:37+00:00",
            "updated": "2024-06-27 17:34:47+00:00"
        },
        {
            "title": "Physics-Guided Neural Networks for Intraventricular Vector Flow Mapping",
            "authors": "Hang Jung Ling, Salomé Bru, Julia Puig, Florian Vixège, Simon Mendez, Franck Nicoud, Pierre-Yves Courand, Olivier Bernard, Damien Garcia",
            "summary": "Intraventricular vector flow mapping (iVFM) seeks to enhance and quantify\ncolor Doppler in cardiac imaging. In this study, we propose novel alternatives\nto the traditional iVFM optimization scheme by utilizing physics-informed\nneural networks (PINNs) and a physics-guided nnU-Net-based supervised approach.\nWhen evaluated on simulated color Doppler images derived from a\npatient-specific computational fluid dynamics model and in vivo Doppler\nacquisitions, both approaches demonstrate comparable reconstruction performance\nto the original iVFM algorithm. The efficiency of PINNs is boosted through\ndual-stage optimization and pre-optimized weights. On the other hand, the\nnnU-Net method excels in generalizability and real-time capabilities. Notably,\nnnU-Net shows superior robustness on sparse and truncated Doppler data while\nmaintaining independence from explicit boundary conditions. Overall, our\nresults highlight the effectiveness of these methods in reconstructing\nintraventricular vector blood flow. The study also suggests potential\napplications of PINNs in ultrafast color Doppler imaging and the incorporation\nof fluid dynamics equations to derive biomarkers for cardiovascular diseases\nbased on blood flow.",
            "pdf_url": "http://arxiv.org/pdf/2403.13040v2",
            "published": "2024-03-19 17:35:17+00:00",
            "updated": "2024-06-27 17:27:13+00:00"
        },
        {
            "title": "Accelerating Multiphase Flow Simulations with Denoising Diffusion Model Driven Initializations",
            "authors": "Jaehong Chung, Agnese Marcato, Eric J. Guiltinan, Tapan Mukerji, Hari Viswanathan, Yen Ting Lin, Javier E. Santos",
            "summary": "This study introduces a hybrid fluid simulation approach that integrates\ngenerative diffusion models with physics-based simulations, aiming at reducing\nthe computational costs of flow simulations while still honoring all the\nphysical properties of interest. These simulations enhance our understanding of\napplications such as assessing hydrogen and CO$_2$ storage efficiency in\nunderground reservoirs. Nevertheless, they are computationally expensive and\nthe presence of nonunique solutions can require multiple simulations within a\nsingle geometry. To overcome the computational cost hurdle, we propose a hybrid\nmethod that couples generative diffusion models and physics-based modeling. We\nintroduce a system to condition the diffusion model with a geometry of\ninterest, allowing to produce variable fluid saturations in the same geometry.\nWhile training the model, we simultaneously generate initial conditions and\nperform physics-based simulations using these conditions. This integrated\napproach enables us to receive real-time feedback on a single compute node\nequipped with both CPUs and GPUs. By efficiently managing these processes\nwithin one compute node, we can continuously evaluate performance and stop\ntraining when the desired criteria are met. To test our model, we generate\nrealizations in a real Berea sandstone fracture which shows that our technique\nis up to 4.4 times faster than commonly used flow simulation initializations.",
            "pdf_url": "http://arxiv.org/pdf/2406.19333v1",
            "published": "2024-06-27 17:05:40+00:00",
            "updated": "2024-06-27 17:05:40+00:00"
        },
        {
            "title": "Error-corrected Hadamard gate simulated at the circuit level",
            "authors": "György P. Gehér, Campbell McLauchlan, Earl T. Campbell, Alexandra E. Moylett, Ophelia Crawford",
            "summary": "We simulate the logical Hadamard gate in the surface code under a\ncircuit-level noise model, compiling it to a physical circuit on square-grid\nconnectivity hardware. Our paper is the first to do this for a logical unitary\ngate on a quantum error-correction code. We consider two proposals, both via\npatch-deformation: one that applies a transversal Hadamard gate (i.e. a domain\nwall through time) to interchange the logical $X$ and $Z$ strings, and another\nthat applies a domain wall through space to achieve this interchange. We\nexplain in detail why they perform the logical Hadamard gate by tracking how\nthe stabilisers and the logical operators are transformed in each quantum\nerror-correction round. We optimise the physical circuits and evaluate their\nlogical failure probabilities, which we find to be comparable to those of a\nquantum memory experiment for the same number of quantum error-correction\nrounds. We present syndrome-extraction circuits that maintain the same\neffective distance under circuit-level noise as under phenomenological noise.\nWe also explain how a $SWAP$-quantum error-correction round (required to return\nthe patch to its initial position) can be compiled to only four two-qubit gate\nlayers. This can be applied to more general scenarios and, as a byproduct,\nexplains from first principles how the \"stepping\" circuits of the recent Google\npaper [McEwen, Bacon, and Gidney, Quantum 7, 1172 (2023)] can be constructed.",
            "pdf_url": "http://arxiv.org/pdf/2312.11605v2",
            "published": "2023-12-18 19:00:00+00:00",
            "updated": "2024-06-27 16:57:14+00:00"
        },
        {
            "title": "Nonuniqueness in Defining the Polarization: Nonlocal Surface Charges and the Electrostatic, Energetic, and Transport Perspectives",
            "authors": "Shoham Sen, Yang Wang, Timothy Breitzman, Kaushik Dayal",
            "summary": "Ionic crystals play a central role in functional applications. Mesoscale\ndescriptions of these crystals are based on the continuum polarization density\nfield to represent the effective physics of charge distribution at the scale of\nthe atomic lattice. However, a long-standing difficulty is that the classical\nelectrostatic definition of the macroscopic polarization -- as the dipole or\nfirst moment of the charge density in a unit cell -- is not unique. This\nunphysical non-uniqueness has been shown to arise from starting directly with\nan infinite system rather than starting with a finite body and taking\nappropriate limits. This limit process shows that the electrostatic description\nrequires not only the bulk polarization density, but also the surface charge\ndensity, as the effective macroscopic descriptors; that is, a nonlocal\neffective description. Other approaches to resolve this difficulty include\nrelating the change in polarization to the transport of charge; or, to define\nthe polarization as the energy-conjugate to the electric field.\n  This work examines the relation between the classical electrostatic\ndefinition of polarization, and the transport and energy-conjugate definitions\nof polarization. We show the following: (1) The transport of charge does not\ncorrespond to the change in polarization in general; instead, one requires\nadditional simplifying assumptions on the electrostatic definition of\npolarization for these approaches to give rise to the same macroscopic electric\nfields. Thus, the electrostatic definition encompasses the transport definition\nas a special case. (2) The energy-conjugate definition has both bulk and\nsurface contributions; while traditional approaches neglect the surface\ncontribution, we find that accounting for the nonlocal surface contributions is\nessential to obtain the correct macroscopic electric fields.",
            "pdf_url": "http://arxiv.org/pdf/2406.19322v1",
            "published": "2024-06-27 16:54:14+00:00",
            "updated": "2024-06-27 16:54:14+00:00"
        },
        {
            "title": "Probing self-interacting ultra-high-energy neutrinos with cosmic 21-cm signal",
            "authors": "Mansi Dhuria, Bishnu Gupta Teli",
            "summary": "In this study, we investigate the constraints on secret self-interactions of\nneutrinos by examining the impact of radiative scattering of ultra-high-energy\n(UHE) neutrinos. These neutrinos are produced from the decay of superheavy dark\nmatter and interact with the cosmic neutrino background (C$\\nu$B). We explore\nhow these interactions influence the 21-cm hydrogen signal during the cosmic\ndark ages and cosmic dawn, periods relatively free from astrophysical\nuncertainties, providing a clearer signal for studying non-standard neutrino\ninteractions. By analyzing the global brightness temperature measurements, we\nconstrain the scattering cross-section of UHE self-interacting neutrinos,\ndetermining the coupling constant $g$ to be within $\\sim 10^{-4}$ to $\\sim\n10^{-3}$ for neutrino energies in the PeV to EeV range. Interestingly, these\nconstraints are more competitive than those from existing astrophysical and\ncollider experiments. As future 21-cm experiments focus on measuring brightness\ntemperature across a wide range of redshifts from the cosmic dark ages to\nreionization, using the epoch of 21-cm to probe neutrino properties could\nprovide crucial insights into dark matter and neutrino physics.",
            "pdf_url": "http://arxiv.org/pdf/2406.19279v1",
            "published": "2024-06-27 15:49:37+00:00",
            "updated": "2024-06-27 15:49:37+00:00"
        },
        {
            "title": "Fractal Subsystem Symmetries, Anomalies, Boundaries, and Effective Field Theory",
            "authors": "Heitor Casasola, Guilherme Delfino, Yizhi You, Paula F. Bienzobaz, Pedro R. S. Gomes",
            "summary": "This work reports an extensive study of three-dimensional topological ordered\nphases that, in one of the directions behave like usual topological order\nconcerning mobility of excitations, but in the perpendicular plane manifest\ntype-II fracton physics dictated by a fractal subsystem symmetry. We obtain an\nexpression for the ground state degeneracy, which depends intricately on the\nsizes of the plane, signaling a strong manifestation of ultraviolet/infrared\n(UV/IR) mixing. The ground state degeneracy can be interpreted in terms of\nspontaneous/explicit breaking of fractal subsystem symmetries. We also study\nthe boundary physics, which in turn is useful to understand the connection with\ncertain two-dimensional phases. Finally, we derive a low-energy but not\nlong-distance effective field theory, by Higgsing a fractal $U(1)$ symmetry and\ntaking the deep IR limit. This description embodies in a natural way several\naspects of the phases, such as the content of generalized global symmetries,\nthe role of fractal symmetries on the mobility of excitations, the anomalies,\nand the boundary physics.",
            "pdf_url": "http://arxiv.org/pdf/2406.19275v1",
            "published": "2024-06-27 15:43:14+00:00",
            "updated": "2024-06-27 15:43:14+00:00"
        },
        {
            "title": "Asymptotic stability of the equilibrium for the free boundary problem of a compressible atmospheric primitive model with physical vacuum",
            "authors": "Xin Liu, Edriss S. Titi, Zhouping Xin",
            "summary": "This paper concerns the large time asymptotic behavior of solutions to the\nfree boundary problem of the compressible primitive equations in atmospheric\ndynamics with physical vacuum. Up to second order of the perturbations of an\nequilibrium, we have introduced a model of the compressible primitive equations\nwith a specific viscosity and shown that the physical vacuum free boundary\nproblem for this model system has a global-in-time solution converging to an\nequilibrium exponentially, provided that the initial data is a small\nperturbation of the equilibrium. More precisely, we introduce a new coordinate\nsystem by choosing the enthalpy (the square of sound speed) as the vertical\ncoordinate, and thanks to the hydrostatic balance, the degenerate density at\nthe free boundary admits a representation with separation of variables in the\nnew coordinates. Such a property allows us to establish horizontal derivative\nestimates without involving the singular vertical derivative of the density\nprofile, which plays a key role in our analysis.",
            "pdf_url": "http://arxiv.org/pdf/2406.19259v1",
            "published": "2024-06-27 15:30:30+00:00",
            "updated": "2024-06-27 15:30:30+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Subtractive Training for Music Stem Insertion using Latent Diffusion Models",
            "authors": "Ivan Villa-Renteria, Mason L. Wang, Zachary Shah, Zhe Li, Soohyun Kim, Neelesh Ramachandran, Mert Pilanci",
            "summary": "We present Subtractive Training, a simple and novel method for synthesizing\nindividual musical instrument stems given other instruments as context. This\nmethod pairs a dataset of complete music mixes with 1) a variant of the dataset\nlacking a specific stem, and 2) LLM-generated instructions describing how the\nmissing stem should be reintroduced. We then fine-tune a pretrained\ntext-to-audio diffusion model to generate the missing instrument stem, guided\nby both the existing stems and the text instruction. Our results demonstrate\nSubtractive Training's efficacy in creating authentic drum stems that\nseamlessly blend with the existing tracks. We also show that we can use the\ntext instruction to control the generation of the inserted stem in terms of\nrhythm, dynamics, and genre, allowing us to modify the style of a single\ninstrument in a full song while keeping the remaining instruments the same.\nLastly, we extend this technique to MIDI formats, successfully generating\ncompatible bass, drum, and guitar parts for incomplete arrangements.",
            "pdf_url": "http://arxiv.org/pdf/2406.19328v1",
            "published": "2024-06-27 16:59:14+00:00",
            "updated": "2024-06-27 16:59:14+00:00"
        },
        {
            "title": "$μ$GUIDE: a framework for quantitative imaging via generalized uncertainty-driven inference using deep learning",
            "authors": "Maëliss Jallais, Marco Palombo",
            "summary": "This work proposes $\\mu$GUIDE: a general Bayesian framework to estimate\nposterior distributions of tissue microstructure parameters from any given\nbiophysical model or MRI signal representation, with exemplar demonstration in\ndiffusion-weighted MRI. Harnessing a new deep learning architecture for\nautomatic signal feature selection combined with simulation-based inference and\nefficient sampling of the posterior distributions, $\\mu$GUIDE bypasses the high\ncomputational and time cost of conventional Bayesian approaches and does not\nrely on acquisition constraints to define model-specific summary statistics.\nThe obtained posterior distributions allow to highlight degeneracies present in\nthe model definition and quantify the uncertainty and ambiguity of the\nestimated parameters.",
            "pdf_url": "http://arxiv.org/pdf/2312.17293v3",
            "published": "2023-12-28 13:59:43+00:00",
            "updated": "2024-06-27 16:38:18+00:00"
        },
        {
            "title": "Compositional Image Decomposition with Diffusion Models",
            "authors": "Jocelin Su, Nan Liu, Yanbo Wang, Joshua B. Tenenbaum, Yilun Du",
            "summary": "Given an image of a natural scene, we are able to quickly decompose it into a\nset of components such as objects, lighting, shadows, and foreground. We can\nthen envision a scene where we combine certain components with those from other\nimages, for instance a set of objects from our bedroom and animals from a zoo\nunder the lighting conditions of a forest, even if we have never encountered\nsuch a scene before. In this paper, we present a method to decompose an image\ninto such compositional components. Our approach, Decomp Diffusion, is an\nunsupervised method which, when given a single image, infers a set of different\ncomponents in the image, each represented by a diffusion model. We demonstrate\nhow components can capture different factors of the scene, ranging from global\nscene descriptors like shadows or facial expression to local scene descriptors\nlike constituent objects. We further illustrate how inferred factors can be\nflexibly composed, even with factors inferred from other models, to generate a\nvariety of scenes sharply different than those seen in training time. Website\nand code at https://energy-based-model.github.io/decomp-diffusion.",
            "pdf_url": "http://arxiv.org/pdf/2406.19298v1",
            "published": "2024-06-27 16:13:34+00:00",
            "updated": "2024-06-27 16:13:34+00:00"
        },
        {
            "title": "DEX-TTS: Diffusion-based EXpressive Text-to-Speech with Style Modeling on Time Variability",
            "authors": "Hyun Joon Park, Jin Sob Kim, Wooseok Shin, Sung Won Han",
            "summary": "Expressive Text-to-Speech (TTS) using reference speech has been studied\nextensively to synthesize natural speech, but there are limitations to\nobtaining well-represented styles and improving model generalization ability.\nIn this study, we present Diffusion-based EXpressive TTS (DEX-TTS), an acoustic\nmodel designed for reference-based speech synthesis with enhanced style\nrepresentations. Based on a general diffusion TTS framework, DEX-TTS includes\nencoders and adapters to handle styles extracted from reference speech. Key\ninnovations contain the differentiation of styles into time-invariant and\ntime-variant categories for effective style extraction, as well as the design\nof encoders and adapters with high generalization ability. In addition, we\nintroduce overlapping patchify and convolution-frequency patch embedding\nstrategies to improve DiT-based diffusion networks for TTS. DEX-TTS yields\noutstanding performance in terms of objective and subjective evaluation in\nEnglish multi-speaker and emotional multi-speaker datasets, without relying on\npre-training strategies. Lastly, the comparison results for the general TTS on\na single-speaker dataset verify the effectiveness of our enhanced diffusion\nbackbone. Demos are available here.",
            "pdf_url": "http://arxiv.org/pdf/2406.19135v1",
            "published": "2024-06-27 12:39:55+00:00",
            "updated": "2024-06-27 12:39:55+00:00"
        }
    ]
}