{
    "Physics": [
        {
            "title": "A New $\\sim 5σ$ Tension at Characteristic Redshift from DESI DR1 and DES-SN5YR observations",
            "authors": "Purba Mukherjee, Anjan A Sen",
            "summary": "We perform a model-independent reconstruction of the angular diameter\ndistance ($D_{A}$) using the Multi-Task Gaussian Process (MTGP) framework with\nDESI-DR1 BAO and DES-SN5YR datasets. We calibrate the comoving sound horizon at\nthe baryon drag epoch $r_d$ to the Planck best-fit value, ensuring consistency\nwith early-universe physics. With the reconstructed $D_A$ at two key redshifts,\n$z\\sim 1.63$ (where $D_{A}^{\\prime} =0$) and at $z\\sim 0.512$ (where\n$D_{A}^{\\prime} = D_{A}$), we derive the expansion rate of the Universe $H(z)$\nat these redshifts. Our findings reveal that at $z\\sim 1.63$, the $H(z)$ is\nfully consistent with the Planck-2018 $\\Lambda$CDM prediction, confirming no\nnew physics at that redshift. However, at $z \\sim 0.512$, the derived $H(z)$\nshows a more than $5\\sigma$ discrepancy with the Planck-2018 $\\Lambda$CDM\nprediction, suggesting a possible breakdown of the $\\Lambda$CDM model as\nconstrained by Planck-2018 at this lower redshift. This emerging $\\sim 5\\sigma$\ntension at $z\\sim 0.512$, distinct from the existing ``Hubble Tension'', may\nsignal the first strong evidence for new physics at low redshifts.",
            "pdf_url": "http://arxiv.org/pdf/2503.02880v1",
            "published": "2025-03-04 18:58:15+00:00",
            "updated": "2025-03-04 18:58:15+00:00"
        },
        {
            "title": "Conservative Dynamics of Relativistic Binaries Beyond Einstein Gravity",
            "authors": "Jordan Wilson-Gerow",
            "summary": "We study the conservative dynamics of spinless compact objects in a general\neffective theory of gravity which includes a metric and an arbitrary number of\nscalar fields, through $\\mathcal{O}(G^{3})$. Departures from Einstein gravity,\nwhich preserve general coordinate and local Lorentz invariance, are\ncharacterized by higher-derivative terms in a Lagrangian whose coupling\nconstants scale as powers of a ``new-physics'' length scale, $\\ell$. For a\npurely metric theory we compute the contributions from the the leading and\nsubleading higher-curvature curvature corrections. In four dimensions these are\ncubic and quartic curvature terms, i.e. orders $\\ell^4$ and $\\ell^6$. We also\nstudy a general multi-scalar-tensor theory of gravity to order $\\ell^{4}$,\nwhich includes both Einstein-dilaton-Gauss-Bonnet (EdGB) and dynamical\nChern-Simons (dCS) higher-order couplings. Specifically, we compute the radial\naction in a post-Minkowskian approximation for scattering orbits, to two-loop\norder. The result encodes the fully relativistic dynamics of the compact\nobjects, and serves as a generating function for gauge-invariant orbital\nobservables for both bound and unbound binary systems. Where overlapping\npost-Newtonian results are available, we've verified agreement.",
            "pdf_url": "http://arxiv.org/pdf/2503.02867v1",
            "published": "2025-03-04 18:46:50+00:00",
            "updated": "2025-03-04 18:46:50+00:00"
        },
        {
            "title": "PileUp Mitigation at the HL-LHC Using Attention for Event-Wide Context",
            "authors": "Luke Vaughan, Mohammed Rakib, Shivang Patel, Flera Rizatdinova, Alexander Khanov, Arunkumar Bagavathi",
            "summary": "The Large Hadron Collider, LHC, collides bunches of protons resulting in\nmultiple interactions that occur practically simultaneously. This creates a\npileup effect that distorts physics measurements due to the products of pileup\ncollisions. In order to improve the discovery potential of the LHC, it is\nnecessary to mitigate the effect of pileup interactions on the processes of\ninterest. In this paper, we suggest a novel AI-based method, PUMiNet, to tackle\nthe problem of pileup at the current LHC and future High Luminosity LHC\nconditions. PUMiNet is an attention-based algorithm that mitigates pileup\neffects using a regression task on jets in the context of an entire event. At\n$\\left\\langle \\mu \\right\\rangle=200$, PUMiNet is able to predict the hard\nscatter energy and mass fractions of jets with $R^2=0.912$ and $R^2=0.720$,\nrespectively. These predictions enable the reconstruction of the Higgs boson\nmass in the HL-LHC environment.",
            "pdf_url": "http://arxiv.org/pdf/2503.02860v1",
            "published": "2025-03-04 18:38:21+00:00",
            "updated": "2025-03-04 18:38:21+00:00"
        },
        {
            "title": "$2+1$ dimensional Floquet systems and lattice fermions: Exact bulk spectral equivalence",
            "authors": "Thomas Iadecola, Srimoyee Sen, Lars Sivertsen",
            "summary": "A connection has recently been proposed between periodically driven systems\nknown as Floquet insulators in continuous time and static fermion theories in\ndiscrete time. This connection has been established in a $(1+1)$-dimensional\nfree theory, where an explicit mapping between the spectra of a Floquet\ninsulator and a discrete-time Dirac fermion theory has been formulated. Here we\ninvestigate the potential of static discrete-time theories to capture Floquet\nphysics in higher dimensions, where so-called anomalous Floquet topological\ninsulators can emerge that feature chiral edge states despite having bulk bands\nwith zero Chern number. Starting from a particular model of an anomalous\nFloquet system, we provide an example of a static discrete-time theory whose\nbulk spectrum is an exact analytic match for the Floquet spectrum. The spectra\nwith open boundary conditions in a particular strip geometry also match up to\nfinite-size corrections. However, the models differ in several important\nrespects. The discrete-time theory is spatially anisotropic, so that the\nspectra do not agree for all lattice terminations, e.g. other strip geometries\nor on half spaces. This difference can be attributed to the fact that the\nstatic discrete-time model is quasi-one-dimensional in nature and therefore has\na different bulk-boundary correspondence than the Floquet model.",
            "pdf_url": "http://arxiv.org/pdf/2410.18226v2",
            "published": "2024-10-23 19:09:01+00:00",
            "updated": "2025-03-04 18:11:01+00:00"
        },
        {
            "title": "Precision phenomenology of the PDF-BSM interplay",
            "authors": "Manuel Morales Alvarado",
            "summary": "The Standard Model (SM) is one of the most successful theories ever\nconceived, representing a triumph of human intellect and collaboration. The SM\nprovides a very good description of visible matter, with the proton being a\ncentral part of this understanding. The structure of the proton can be\nparametrised in terms of parton distribution functions (PDFs), essential inputs\nfor theoretical predictions at the Large Hadron Collider (LHC) which cannot be\ncomputed from first principles and must be obtained from fits to experimental\ndata.\n  Despite the remarkable success of the SM, many fundamental questions remain\nunanswered, motivating the search for physics beyond the Standard Model (BSM).\nThese searches often rely on precise comparisons between theoretical\npredictions and experimental measurements. However, a significant challenge\narises because PDFs are typically determined under SM assumptions. This\napproach can introduce potential biases and inconsistencies in BSM searches.\nAdditionally, signals of BSM physics may be absorbed by the PDFs during the\nfitting procedure, further complicating the interpretation of the results.\n  This PhD thesis explores the interplay between PDFs and BSM physics. We\nintroduce the open-source release of SIMUnet, a deep learning framework\ndesigned to perform simultaneous fits of PDFs and BSM parameters, as well as to\nassess the potential absorption of BSM signals by the PDFs. We study the\nPDF-BSM interplay in the top sector and in a global dataset, and assess the\nabsorption of BSM physics in widely used models. Additionally, we explore how\nBSM effects can alter the evolution of PDFs, and demonstrate the potential of\ninterpretable machine learning techniques in symbolic regression for collider\nphysics in general.",
            "pdf_url": "http://arxiv.org/pdf/2503.02827v1",
            "published": "2025-03-04 17:50:30+00:00",
            "updated": "2025-03-04 17:50:30+00:00"
        },
        {
            "title": "Meson dynamics from locally exciting a particle-conserving $Z_2$ lattice gauge theory",
            "authors": "Vaibhav Sharma, Kaden R. A. Hazzard",
            "summary": "Quantum simulation of lattice gauge theories is an important avenue to gain\ninsights into both particle physics phenomena and constrained quantum many-body\ndynamics. There is a growing interest in probing analogs of high energy\ncollision phenomena in lattice gauge theories that can be implemented on\ncurrent quantum simulators. Motivated by this, we characterize the confined\nmesons that originate from a local high energy excitation in a\nparticle-conserving 1D $Z_2$ lattice gauge theory. We focus on a simple,\nexperimentally accessible setting that does not require preparation of\ncolliding wavepackets and isolates the effects of gauge field confinement\nstrength and initial state energy on the nature of propagating excitations. We\nfind that the dynamics is characterized by the propagation of a superposition\nof differently sized mesons. The linear confinement leads to meson size\noscillations in time. The average meson size and oscillation frequency are\ncontrolled by the strength of the gauge field confinement. At a constant\nconfinement field, the average meson length is controlled by the initial\nexcitation's energy. Higher energies produce longer mesons and their effective\nmass depends strongly on their size: longer mesons propagate more slowly out of\nthe central excitation. Mesons of different sizes get spatially filtered with\ntime due to different speeds. We show that this phenomenology is a consequence\nof linear confinement and remains valid in both the strong and weak confinement\nlimit. We present simple explanations of these phenomena supported by exact\nnumerics.",
            "pdf_url": "http://arxiv.org/pdf/2503.02791v1",
            "published": "2025-03-04 17:09:44+00:00",
            "updated": "2025-03-04 17:09:44+00:00"
        },
        {
            "title": "Universal analytical modeling of coated plasmonic particles",
            "authors": "Nikolai G. Khlebtsov, Sergey V. Zarkov",
            "summary": "From a structural point of view, plasmonic nanoparticles are always at least\ntwo-layer structures with a dielectric layer of stabilizing, targeting,\nfluorescent, Raman, or other functional molecules, often embedded in a matrix\nsuch as porous silica. To optimize the optical properties of such\nbioconjugates, one needs efficient analytical models based on simple physical\nideas and with reasonable accuracy comparable to rigorous numerical methods\nrequiring significant computer resources. Here, we present such type models\nbased on a combination of the modal expansion method (MEM) and the dipole\nequivalence method (DEM). The MEM+DEM approach makes it possible to use the MEM\nparameters of the original metal particles and does not require additional\nnumerical calculations to build models for bilayered or multilayered\nconjugates. Our analytical solutions depend on the particle shape, the shell\nthickness, and the shell refractive index, regardless of the particle size and\nthe metal's nature. To illustrate the universality of our method, we calculate\nextinction and scattering spectra of gold and silver nanorods, nanodiscs,\ntriangle nanoprisms, bicones, and bipyramids with a dielectric coating\nthickness from 0 to 30 nm. For the main plasmonic peaks, we found excellent\nagreement between our analytical method and numerical simulations performed\nwith COMSOL. Due to the simplicity and reasonable accuracy of the MEM+DEM\nanalytical models, they can help apply machine learning to predict various\nplasmonic responses such as light absorption, scattering, SERS, and\nmetal-enhanced fluorescence.",
            "pdf_url": "http://arxiv.org/pdf/2503.02775v1",
            "published": "2025-03-04 16:45:28+00:00",
            "updated": "2025-03-04 16:45:28+00:00"
        },
        {
            "title": "Radiation-magnetohydrodynamics with MPI-AMRVAC using flux-limited diffusion",
            "authors": "Nishant Narechania, Rony Keppens, Asif ud-Doula, Nicolas Moens, Jon Sundqvist",
            "summary": "Context. Radiation plays a significant role in solar and astrophysical\nenvironments as it may constitute a sizeable fraction of the energy density,\nmomentum flux, and the total pressure. Modelling the dynamic interaction\nbetween radiation and magnetized plasmas in such environments is an intricate\nand computationally costly task. Aims. The goal of this work is to demonstrate\nthe capabilities of the open-source parallel, block-adaptive computational\nframework MPI-AMRVAC, in solving equations of radiation-magnetohydrodynamics\n(RMHD), and to present benchmark test cases relevant for radiation-dominated\nmagnetized plasmas. Methods. The existing magnetohydrodynamics (MHD) and\nflux-limited diffusion (FLD) radiative-hydrodynamics physics modules are\ncombined to solve the equations of radiation-magnetohydrodynamics (RMHD) on\nblock-adaptive finite volume Cartesian meshes in any dimensionality. Results.\nWe introduce and validate several benchmark test cases such as steady radiative\nMHD shocks, radiation-damped linear MHD waves, radiation-modified Riemann\nproblems and a multi-dimensional radiative magnetoconvection case. We recall\nthe basic governing Rankine-Hugoniot relations for shocks and the dispersion\nrelation for linear MHD waves in the presence of optically thick radiation\nfields where the diffusion limit is reached. The RMHD system allows for 8\nlinear wave types, where the classical 7-wave MHD picture (entropy and three\nwave pairs for slow, Alfven and fast) is augmented with a radiative diffusion\nmode. Conclusions. The MPI-AMRVAC code now has the capability to perform\nmultidimensional RMHD simulations with mesh adaptation making it well-suited\nfor larger scientific applications to study magnetized matter-radiation\ninteractions in solar and stellar interiors and atmospheres.",
            "pdf_url": "http://arxiv.org/pdf/2503.02764v1",
            "published": "2025-03-04 16:24:38+00:00",
            "updated": "2025-03-04 16:24:38+00:00"
        },
        {
            "title": "Improving Oil Slick Trajectory Simulations with Bayesian Optimization",
            "authors": "Gabriele Accarino, Marco M. De Carlo, Igor Atake, Donatello Elia, Anusha L. Dissanayake, Antonio Augusto Sepp Neves, Juan Peña Ibañez, Italo Epicoco, Paola Nassisi, Sandro Fiore, Giovanni Coppini",
            "summary": "Accurate simulations of oil spill trajectories are essential for supporting\npractitioners' response and mitigating environmental and socioeconomic impacts.\nNumerical models, such as MEDSLIK-II, simulate advection, dispersion, and\ntransformation processes of oil particles. However, simulations heavily rely on\naccurate parameter tuning, still based on expert knowledge and manual\ncalibration. To overcome these limitations, we integrate the MEDSLIK-II\nnumerical oil spill model with a Bayesian optimization framework to iteratively\nestimate the best physical parameter configuration that yields simulation\ncloser to satellite observations of the slick. We focus on key parameters, such\nas horizontal diffusivity and drift factor, maximizing the Fraction Skill Score\n(FSS) as a measure of spatio-temporal overlap between simulated and observed\noil distributions. We validate the framework for the Baniyas oil incident that\noccurred in Syria between August 23 and September 4, 2021, which released over\n12,000 $m^3$ of oil. We show that, on average, the proposed approach\nsystematically improves the FSS from 5.82% to 11.07% compared to control\nsimulations initialized with default parameters. The optimization results in\nconsistent improvement across multiple time steps, particularly during periods\nof increased drift variability, demonstrating the robustness of our method in\ndynamic environmental conditions.",
            "pdf_url": "http://arxiv.org/pdf/2503.02749v1",
            "published": "2025-03-04 16:14:16+00:00",
            "updated": "2025-03-04 16:14:16+00:00"
        },
        {
            "title": "Influence of the chiral magnetic effect on particle-pair elliptic anisotropy",
            "authors": "Han-Sheng Li, Yicheng Feng, Fuqiang Wang",
            "summary": "Chiral Magnetic Effect (CME) is a phenomenon in which electric charge is\nseparated by a strong magnetic field from local domains of chirality imbalance\nin quantum chromodynamics. The CME-sensitive, azimuthal correlator difference\n$\\Delta\\gamma$ between opposite-sign (OS) and same-sign (SS) charged hadron\npairs is contaminated by a major physics background proportional to the\nparticle elliptic anisotropy ($v_2$). The CME signal, on the other hand,\ncontributes to the difference in the pair elliptic anisotropies between OS and\nSS pairs ($\\Delta v_{2,\\rm pair}$). We investigate $\\Delta v_{2,\\rm pair}$ and\nfound its sensitivity to CME to be similar to that of the $\\Delta\\gamma$\nobservable.",
            "pdf_url": "http://arxiv.org/pdf/2404.05032v2",
            "published": "2024-04-07 17:57:52+00:00",
            "updated": "2025-03-04 16:09:13+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Reactive Diffusion Policy: Slow-Fast Visual-Tactile Policy Learning for Contact-Rich Manipulation",
            "authors": "Han Xue, Jieji Ren, Wendi Chen, Gu Zhang, Yuan Fang, Guoying Gu, Huazhe Xu, Cewu Lu",
            "summary": "Humans can accomplish complex contact-rich tasks using vision and touch, with\nhighly reactive capabilities such as quick adjustments to environmental changes\nand adaptive control of contact forces; however, this remains challenging for\nrobots. Existing visual imitation learning (IL) approaches rely on action\nchunking to model complex behaviors, which lacks the ability to respond\ninstantly to real-time tactile feedback during the chunk execution.\nFurthermore, most teleoperation systems struggle to provide fine-grained\ntactile / force feedback, which limits the range of tasks that can be\nperformed. To address these challenges, we introduce TactAR, a low-cost\nteleoperation system that provides real-time tactile feedback through Augmented\nReality (AR), along with Reactive Diffusion Policy (RDP), a novel slow-fast\nvisual-tactile imitation learning algorithm for learning contact-rich\nmanipulation skills. RDP employs a two-level hierarchy: (1) a slow latent\ndiffusion policy for predicting high-level action chunks in latent space at low\nfrequency, (2) a fast asymmetric tokenizer for closed-loop tactile feedback\ncontrol at high frequency. This design enables both complex trajectory modeling\nand quick reactive behavior within a unified framework. Through extensive\nevaluation across three challenging contact-rich tasks, RDP significantly\nimproves performance compared to state-of-the-art visual IL baselines through\nrapid response to tactile / force feedback. Furthermore, experiments show that\nRDP is applicable across different tactile / force sensors. Code and videos are\navailable on https://reactive-diffusion-policy.github.io/.",
            "pdf_url": "http://arxiv.org/pdf/2503.02881v1",
            "published": "2025-03-04 18:58:21+00:00",
            "updated": "2025-03-04 18:58:21+00:00"
        },
        {
            "title": "Decentralized Adversarial Training over Graphs",
            "authors": "Ying Cao, Elsa Rizk, Stefan Vlaski, Ali H. Sayed",
            "summary": "The vulnerability of machine learning models to adversarial attacks has been\nattracting considerable attention in recent years. Most existing studies focus\non the behavior of stand-alone single-agent learners. In comparison, this work\nstudies adversarial training over graphs, where individual agents are subjected\nto perturbations of varied strength levels across space. It is expected that\ninteractions by linked agents, and the heterogeneity of the attack models that\nare possible over the graph, can help enhance robustness in view of the\ncoordination power of the group. Using a min-max formulation of distributed\nlearning, we develop a decentralized adversarial training framework for\nmulti-agent systems. Specifically, we devise two decentralized adversarial\ntraining algorithms by relying on two popular decentralized learning\nstrategies--diffusion and consensus. We analyze the convergence properties of\nthe proposed framework for strongly-convex, convex, and non-convex\nenvironments, and illustrate the enhanced robustness to adversarial attacks.",
            "pdf_url": "http://arxiv.org/pdf/2303.13326v2",
            "published": "2023-03-23 15:05:16+00:00",
            "updated": "2025-03-04 17:56:58+00:00"
        },
        {
            "title": "Feynman-Kac Correctors in Diffusion: Annealing, Guidance, and Product of Experts",
            "authors": "Marta Skreta, Tara Akhound-Sadegh, Viktor Ohanesian, Roberto Bondesan, Alán Aspuru-Guzik, Arnaud Doucet, Rob Brekelmans, Alexander Tong, Kirill Neklyudov",
            "summary": "While score-based generative models are the model of choice across diverse\ndomains, there are limited tools available for controlling inference-time\nbehavior in a principled manner, e.g. for composing multiple pretrained models.\nExisting classifier-free guidance methods use a simple heuristic to mix\nconditional and unconditional scores to approximately sample from conditional\ndistributions. However, such methods do not approximate the intermediate\ndistributions, necessitating additional 'corrector' steps. In this work, we\nprovide an efficient and principled method for sampling from a sequence of\nannealed, geometric-averaged, or product distributions derived from pretrained\nscore-based models. We derive a weighted simulation scheme which we call\nFeynman-Kac Correctors (FKCs) based on the celebrated Feynman-Kac formula by\ncarefully accounting for terms in the appropriate partial differential\nequations (PDEs). To simulate these PDEs, we propose Sequential Monte Carlo\n(SMC) resampling algorithms that leverage inference-time scaling to improve\nsampling quality. We empirically demonstrate the utility of our methods by\nproposing amortized sampling via inference-time temperature annealing,\nimproving multi-objective molecule generation using pretrained models, and\nimproving classifier-free guidance for text-to-image generation. Our code is\navailable at https://github.com/martaskrt/fkc-diffusion.",
            "pdf_url": "http://arxiv.org/pdf/2503.02819v1",
            "published": "2025-03-04 17:46:51+00:00",
            "updated": "2025-03-04 17:46:51+00:00"
        },
        {
            "title": "EC-DIT: Scaling Diffusion Transformers with Adaptive Expert-Choice Routing",
            "authors": "Haotian Sun, Tao Lei, Bowen Zhang, Yanghao Li, Haoshuo Huang, Ruoming Pang, Bo Dai, Nan Du",
            "summary": "Diffusion transformers have been widely adopted for text-to-image synthesis.\nWhile scaling these models up to billions of parameters shows promise, the\neffectiveness of scaling beyond current sizes remains underexplored and\nchallenging. By explicitly exploiting the computational heterogeneity of image\ngenerations, we develop a new family of Mixture-of-Experts (MoE) models\n(EC-DIT) for diffusion transformers with expert-choice routing. EC-DIT learns\nto adaptively optimize the compute allocated to understand the input texts and\ngenerate the respective image patches, enabling heterogeneous computation\naligned with varying text-image complexities. This heterogeneity provides an\nefficient way of scaling EC-DIT up to 97 billion parameters and achieving\nsignificant improvements in training convergence, text-to-image alignment, and\noverall generation quality over dense models and conventional MoE models.\nThrough extensive ablations, we show that EC-DIT demonstrates superior\nscalability and adaptive compute allocation by recognizing varying textual\nimportance through end-to-end training. Notably, in text-to-image alignment\nevaluation, our largest models achieve a state-of-the-art GenEval score of\n71.68% and still maintain competitive inference speed with intuitive\ninterpretability.",
            "pdf_url": "http://arxiv.org/pdf/2410.02098v5",
            "published": "2024-10-02 23:39:10+00:00",
            "updated": "2025-03-04 17:23:51+00:00"
        },
        {
            "title": "Spike-and-Slab Posterior Sampling in High Dimensions",
            "authors": "Syamantak Kumar, Purnamrita Sarkar, Kevin Tian, Yusong Zhu",
            "summary": "Posterior sampling with the spike-and-slab prior [MB88], a popular multimodal\ndistribution used to model uncertainty in variable selection, is considered the\ntheoretical gold standard method for Bayesian sparse linear regression [CPS09,\nRoc18]. However, designing provable algorithms for performing this sampling\ntask is notoriously challenging. Existing posterior samplers for Bayesian\nsparse variable selection tasks either require strong assumptions about the\nsignal-to-noise ratio (SNR) [YWJ16], only work when the measurement count grows\nat least linearly in the dimension [MW24], or rely on heuristic approximations\nto the posterior. We give the first provable algorithms for spike-and-slab\nposterior sampling that apply for any SNR, and use a measurement count\nsublinear in the problem dimension. Concretely, assume we are given a\nmeasurement matrix $\\mathbf{X} \\in \\mathbb{R}^{n\\times d}$ and noisy\nobservations $\\mathbf{y} = \\mathbf{X}\\mathbf{\\theta}^\\star + \\mathbf{\\xi}$ of a\nsignal $\\mathbf{\\theta}^\\star$ drawn from a spike-and-slab prior $\\pi$ with a\nGaussian diffuse density and expected sparsity k, where $\\mathbf{\\xi} \\sim\n\\mathcal{N}(\\mathbb{0}_n, \\sigma^2\\mathbf{I}_n)$. We give a polynomial-time\nhigh-accuracy sampler for the posterior $\\pi(\\cdot \\mid \\mathbf{X},\n\\mathbf{y})$, for any SNR $\\sigma^{-1}$ > 0, as long as $n \\geq k^3 \\cdot\n\\text{polylog}(d)$ and $X$ is drawn from a matrix ensemble satisfying the\nrestricted isometry property. We further give a sampler that runs in\nnear-linear time $\\approx nd$ in the same setting, as long as $n \\geq k^5 \\cdot\n\\text{polylog}(d)$. To demonstrate the flexibility of our framework, we extend\nour result to spike-and-slab posterior sampling with Laplace diffuse densities,\nachieving similar guarantees when $\\sigma = O(\\frac{1}{k})$ is bounded.",
            "pdf_url": "http://arxiv.org/pdf/2503.02798v1",
            "published": "2025-03-04 17:16:07+00:00",
            "updated": "2025-03-04 17:16:07+00:00"
        }
    ]
}