{
    "Physics": [
        {
            "title": "SimProcess: High Fidelity Simulation of Noisy ICS Physical Processes",
            "authors": "Denis Donadel, Gabriele Crestanello, Giulio Morandini, Daniele Antonioli, Mauro Conti, Massimo Merro",
            "summary": "Industrial Control Systems (ICS) manage critical infrastructures like power\ngrids and water treatment plants. Cyberattacks on ICSs can disrupt operations,\ncausing severe economic, environmental, and safety issues. For example,\nundetected pollution in a water plant can put the lives of thousands at stake.\nICS researchers have increasingly turned to honeypots -- decoy systems designed\nto attract attackers, study their behaviors, and eventually improve defensive\nmechanisms. However, existing ICS honeypots struggle to replicate the ICS\nphysical process, making them susceptible to detection. Accurately simulating\nthe noise in ICS physical processes is challenging because different factors\nproduce it, including sensor imperfections and external interferences.\n  In this paper, we propose SimProcess, a novel framework to rank the fidelity\nof ICS simulations by evaluating how closely they resemble real-world and noisy\nphysical processes. It measures the simulation distance from a target system by\nestimating the noise distribution with machine learning models like Random\nForest. Unlike existing solutions that require detailed mathematical models or\nare limited to simple systems, SimProcess operates with only a timeseries of\nmeasurements from the real system, making it applicable to a broader range of\ncomplex dynamic systems. We demonstrate the framework's effectiveness through a\ncase study using real-world power grid data from the EPIC testbed. We compare\nthe performance of various simulation methods, including static and generative\nnoise techniques. Our model correctly classifies real samples with a recall of\nup to 1.0. It also identifies Gaussian and Gaussian Mixture as the best\ndistribution to simulate our power systems, together with a generative solution\nprovided by an autoencoder, thereby helping developers to improve honeypot\nfidelity. Additionally, we make our code publicly available.",
            "pdf_url": "http://arxiv.org/pdf/2505.22638v1",
            "published": "2025-05-28 17:54:23+00:00",
            "updated": "2025-05-28 17:54:23+00:00"
        },
        {
            "title": "The Sky as a Killing Horizon",
            "authors": "Níckolas de Aguiar Alves, Andre G. S. Landulfo",
            "summary": "Symmetries are ubiquitous in modern physics. They not only allow for a more\nsimplified description of physical systems but also, from a more fundamental\nperspective, can be seen as determining a theory itself. In the present paper,\nwe propose a new definition of asymptotic symmetries that unifies and\ngeneralizes the usual notions of symmetry considered in asymptotically flat\nspacetimes and expanding universes with cosmological horizons. This is done by\nconsidering BMS-like symmetries for \"asymptotic (conformal) Killing horizons\",\nor A(C)KHs, here defined as null hypersurfaces that are tangent to a vector\nfield satisfying the (conformal) Killing equation in a limiting sense. The\nconstruction is theory-agnostic and extremely general, for it makes no use of\nthe Einstein equations and can be applied to a wide range of scenarios with\ndifferent dimensions or hypersurface cross sections. While we reproduce the\nresults by Dappiaggi, Moretti, and Pinamonti in the case of asymptotic Killing\nhorizons, the conformal generalization does not yield only the BMS group, but a\nlarger group. The enlargement is due to the presence of \"superdilations\". We\nspeculate on many implications and possible continuations of this work,\nincluding the exploration of gravitational memory effects beyond general\nrelativity, understanding antipodal matching conditions at spatial infinity in\nterms of bifurcate horizons, and the absence of superrotations in de Sitter\nspacetime and Killing horizons.",
            "pdf_url": "http://arxiv.org/pdf/2504.12514v2",
            "published": "2025-04-16 22:23:05+00:00",
            "updated": "2025-05-28 17:36:48+00:00"
        },
        {
            "title": "An effective model for describing coherent population trapping resonances, which correctly takes into account the off-resonant frequency components in periodically modulated laser field",
            "authors": "V. I. Yudin, M. Yu. Basalaev, A. V. Taichenachev, O. N. Prudnikov",
            "summary": "We have developed an effective mathematical model to calculate the coherent\npopulation trapping (CPT) resonance in periodically modulated light, when the\nmodulation frequency $f$ varies near the fractional part of hyperfine splitting\nin the ground state $\\Delta_{\\rm hfs}/N$ (where $N=1,2,...$). In such\npolychromatic field, only two frequency components that are most resonant with\natomic optical transitions are taken into account accurately, while all other\noff-resonant components are taken into account using the second-order\nperturbation theory in the field. Within the presented concept, equation for\natomic density matrix is obtained, in which the contribution of all\noff-resonant components is reduced to the appearance of two new operators\n(non-diagonal, in general case): the shift operator and relaxation operators.\nIn the case of three-level $\\Lambda$-system, the adequacy of presented\neffective model was verified by numerical calculations of various dependencies,\nin which we did not find visual differences from the exact calculations. In\naddition to a significant mathematical simplification, our model provides a\nclear physical picture of various features of CPT spectroscopy in a\nperiodically modulated laser field, including effects that have not been\ndiscussed in the scientific literature before. In particular, we show that the\nwidespread viewpoint that the CPT resonance shift is determined by usual ac\nStark shifts of the lower levels is, in general, fundamentally incorrect, since\nthe contribution to the light shift due to beats at the frequency $\\Delta_{\\rm\nhfs}$ between different off-resonant frequency components can be comparable (or\neven dominate) with the standard ac Stark shift. Therefore, even if we have\ndetailed information on the modulated field spectrum (e.g. using a spectrum\nanalyzer), this is, in general, absolutely insufficient to determine the light\nshift of CPT resonance.",
            "pdf_url": "http://arxiv.org/pdf/2505.01924v2",
            "published": "2025-05-03 21:13:14+00:00",
            "updated": "2025-05-28 17:29:14+00:00"
        },
        {
            "title": "Arnold Diffusion in the Full Three-Body Problem",
            "authors": "Maciej J. Capinski, Marian Gidea",
            "summary": "The full three-body problem, on the motion of three celestial bodies under\ntheir mutual gravitational attraction, is one of the oldest unsolved problems\nin classical mechanics. The main difficulty comes from the presence of unstable\nand chaotic motions, which make long-term prediction impossible. In this paper,\nwe show that the full three-body problem exhibits a strong form of instability\nknown as Arnold diffusion. We consider the planar full three-body problem,\nformulated as a perturbation of both the Kepler problem and the planar circular\nrestricted three-body problem. We show that the system exhibits Arnold\ndiffusion, in the sense that there is a transfer of energy -- of an amount\nindependent of the perturbation parameter -- between the Kepler problem and the\nrestricted three-body problem. Our argument is based on the topological method\nof correctly aligned windows, which is implemented into a computer assisted\nproof. We demonstrate that the approach can be applied to physically relevant\nmasses of the bodies, choosing a Neptune-Triton-asteroid system as an example.\nIn this case, we obtain explicit estimates for the range of the perturbation\nparameter and for the diffusion time.",
            "pdf_url": "http://arxiv.org/pdf/2504.09273v3",
            "published": "2025-04-12 16:35:19+00:00",
            "updated": "2025-05-28 17:22:59+00:00"
        },
        {
            "title": "On the performance of machine-learning assisted Monte Carlo in sampling from simple statistical physics models",
            "authors": "Luca Maria Del Bono, Federico Ricci-Tersenghi, Francesco Zamponi",
            "summary": "Recent years have seen a rise in the application of machine learning\ntechniques to aid the simulation of hard-to-sample systems that cannot be\nstudied using traditional methods. Despite the introduction of many different\narchitectures and procedures, a wide theoretical understanding is still\nlacking, with the risk of suboptimal implementations. As a first step to\naddress this gap, we provide here a complete analytic study of the widely-used\nSequential Tempering procedure applied to a shallow MADE architecture for the\nCurie-Weiss model. The contribution of this work is twofold: firstly, we give a\ndescription of the optimal weights and of the training under Gradient Descent\noptimization. Secondly, we compare what happens in Sequential Tempering with\nand without the addition of local Metropolis Monte Carlo steps. We are thus\nable to give theoretical predictions on the best procedure to apply in this\ncase. This work establishes a clear theoretical basis for the integration of\nmachine learning techniques into Monte Carlo sampling and optimization.",
            "pdf_url": "http://arxiv.org/pdf/2505.22598v1",
            "published": "2025-05-28 17:13:11+00:00",
            "updated": "2025-05-28 17:13:11+00:00"
        },
        {
            "title": "Universal Visuo-Tactile Video Understanding for Embodied Interaction",
            "authors": "Yifan Xie, Mingyang Li, Shoujie Li, Xingting Li, Guangyu Chen, Fei Ma, Fei Richard Yu, Wenbo Ding",
            "summary": "Tactile perception is essential for embodied agents to understand physical\nattributes of objects that cannot be determined through visual inspection\nalone. While existing approaches have made progress in visual and language\nmodalities for physical understanding, they fail to effectively incorporate\ntactile information that provides crucial haptic feedback for real-world\ninteraction. In this paper, we present VTV-LLM, the first multi-modal large\nlanguage model for universal Visuo-Tactile Video (VTV) understanding that\nbridges the gap between tactile perception and natural language. To address the\nchallenges of cross-sensor and cross-modal integration, we contribute VTV150K,\na comprehensive dataset comprising 150,000 video frames from 100 diverse\nobjects captured across three different tactile sensors (GelSight Mini, DIGIT,\nand Tac3D), annotated with four fundamental tactile attributes (hardness,\nprotrusion, elasticity, and friction). We develop a novel three-stage training\nparadigm that includes VTV enhancement for robust visuo-tactile representation,\nVTV-text alignment for cross-modal correspondence, and text prompt finetuning\nfor natural language generation. Our framework enables sophisticated tactile\nreasoning capabilities including feature assessment, comparative analysis,\nscenario-based decision making and so on. Experimental evaluations demonstrate\nthat VTV-LLM achieves superior performance in tactile video understanding\ntasks, establishing a foundation for more intuitive human-machine interaction\nin tactile domains.",
            "pdf_url": "http://arxiv.org/pdf/2505.22566v1",
            "published": "2025-05-28 16:43:01+00:00",
            "updated": "2025-05-28 16:43:01+00:00"
        },
        {
            "title": "Geometric Hyena Networks for Large-scale Equivariant Learning",
            "authors": "Artem Moskalev, Mangal Prakash, Junjie Xu, Tianyu Cui, Rui Liao, Tommaso Mansi",
            "summary": "Processing global geometric context while preserving equivariance is crucial\nwhen modeling biological, chemical, and physical systems. Yet, this is\nchallenging due to the computational demands of equivariance and global context\nat scale. Standard methods such as equivariant self-attention suffer from\nquadratic complexity, while local methods such as distance-based message\npassing sacrifice global information. Inspired by the recent success of\nstate-space and long-convolutional models, we introduce Geometric Hyena, the\nfirst equivariant long-convolutional model for geometric systems. Geometric\nHyena captures global geometric context at sub-quadratic complexity while\nmaintaining equivariance to rotations and translations. Evaluated on all-atom\nproperty prediction of large RNA molecules and full protein molecular dynamics,\nGeometric Hyena outperforms existing equivariant models while requiring\nsignificantly less memory and compute that equivariant self-attention. Notably,\nour model processes the geometric context of 30k tokens 20x faster than the\nequivariant transformer and allows 72x longer context within the same budget.",
            "pdf_url": "http://arxiv.org/pdf/2505.22560v1",
            "published": "2025-05-28 16:38:35+00:00",
            "updated": "2025-05-28 16:38:35+00:00"
        },
        {
            "title": "RiverMamba: A State Space Model for Global River Discharge and Flood Forecasting",
            "authors": "Mohamad Hakam Shams Eddin, Yikui Zahng, Stefan Kollet, Juergen Gall",
            "summary": "Recent deep learning approaches for river discharge forecasting have improved\nthe accuracy and efficiency in flood forecasting, enabling more reliable early\nwarning systems for risk management. Nevertheless, existing deep learning\napproaches in hydrology remain largely confined to local-scale applications and\ndo not leverage the inherent spatial connections of bodies of water. Thus,\nthere is a strong need for new deep learning methodologies that are capable of\nmodeling spatio-temporal relations to improve river discharge and flood\nforecasting for scientific and operational applications. To address this, we\npresent RiverMamba, a novel deep learning model that is pretrained with\nlong-term reanalysis data and that can forecast global river discharge and\nfloods on a $0.05^\\circ$ grid up to 7 days lead time, which is of high\nrelevance in early warning. To achieve this, RiverMamba leverages efficient\nMamba blocks that enable the model to capture global-scale channel network\nrouting and enhance its forecast capability for longer lead times. The forecast\nblocks integrate ECMWF HRES meteorological forecasts, while accounting for\ntheir inaccuracies through spatio-temporal modeling. Our analysis demonstrates\nthat RiverMamba delivers reliable predictions of river discharge, including\nextreme floods across return periods and lead times, surpassing both\noperational AI- and physics-based models.",
            "pdf_url": "http://arxiv.org/pdf/2505.22535v1",
            "published": "2025-05-28 16:21:58+00:00",
            "updated": "2025-05-28 16:21:58+00:00"
        },
        {
            "title": "Unveiling the jet angular broadening with photon-tagged jets in high-energy nuclear collisions",
            "authors": "Sa Wang, Yao Li, Jin-Wen Kang, Ben-Wei Zhang",
            "summary": "The medium modification of jet substructure in hot and dense nuclear matter\nhas garnered significant interest from the heavy-ion physics community in\nrecent years. Measurements of inclusive jets show an angular narrowing in\nnucleus-nucleus collisions, while recent CMS results for photon-tagged jets\n($\\gamma$+jets) suggest evidence of broadening. In this study, we conduct a\ntheoretical analysis of the angular structure of inclusive jets and\n$\\gamma$+jets using a transport approach that accounts for jet energy loss and\nthe medium response in the quark-gluon plasma. We examine the girth\nmodification of $\\gamma$+jets in $0-30\\%$ PbPb collisions at $\\sqrt{s_{NN}} =\n5.02$ TeV, achieving satisfactory agreement with recent CMS measurements. We\nexplore the relationship between selection bias and jet kinematics by varying\nthe threshold for $x_{j\\gamma} = p_T^{\\rm jet}/p_T^{\\gamma}$. Notably, we\nquantitatively demonstrate that $\\gamma$+jets significantly reduce selection\nbias and can effectively select jets that have been sufficiently quenched in\nPbPb collisions, which is crucial for capture the jet angular broadening.\nAdditionally, we estimate the contributions of medium-induced gluon radiation\nand the medium response to the broadening of the jet angular substructure.\nLastly, we analyze the modification patterns of jet $R_g$ and $\\Delta R_{\\rm\naxis}$ in PbPb collisions, which indicate slight broadening for $\\gamma$+jets\nand noticeable narrowing for inclusive jets compared to pp collisions.",
            "pdf_url": "http://arxiv.org/pdf/2408.10924v2",
            "published": "2024-08-20 15:05:49+00:00",
            "updated": "2025-05-28 15:58:04+00:00"
        },
        {
            "title": "Geometric GNNs for Charged Particle Tracking at GlueX",
            "authors": "Ahmed Hossam Mohammed, Kishansingh Rajput, Simon Taylor, Denis Furletov, Sergey Furletov, Malachi Schram",
            "summary": "Nuclear physics experiments are aimed at uncovering the fundamental building\nblocks of matter. The experiments involve high-energy collisions that produce\ncomplex events with many particle trajectories. Tracking charged particles\nresulting from collisions in the presence of a strong magnetic field is\ncritical to enable the reconstruction of particle trajectories and precise\ndetermination of interactions. It is traditionally achieved through\ncombinatorial approaches that scale worse than linearly as the number of hits\ngrows. Since particle hit data naturally form a 3-dimensional point cloud and\ncan be structured as graphs, Graph Neural Networks (GNNs) emerge as an\nintuitive and effective choice for this task. In this study, we evaluate the\nGNN model for track finding on the data from the GlueX experiment at Jefferson\nLab. We use simulation data to train the model and test on both simulation and\nreal GlueX measurements. We demonstrate that GNN-based track finding\noutperforms the currently used traditional method at GlueX in terms of\nsegment-based efficiency at a fixed purity while providing faster inferences.\nWe show that the GNN model can achieve significant speedup by processing\nmultiple events in batches, which exploits the parallel computation capability\nof Graphical Processing Units (GPUs). Finally, we compare the GNN\nimplementation on GPU and FPGA and describe the trade-off.",
            "pdf_url": "http://arxiv.org/pdf/2505.22504v1",
            "published": "2025-05-28 15:52:22+00:00",
            "updated": "2025-05-28 15:52:22+00:00"
        }
    ],
    "Diffusion": [
        {
            "title": "Principled Out-of-Distribution Generalization via Simplicity",
            "authors": "Jiawei Ge, Amanda Wang, Shange Tang, Chi Jin",
            "summary": "Modern foundation models exhibit remarkable out-of-distribution (OOD)\ngeneralization, solving tasks far beyond the support of their training data.\nHowever, the theoretical principles underpinning this phenomenon remain\nelusive. This paper investigates this problem by examining the compositional\ngeneralization abilities of diffusion models in image generation. Our analysis\nreveals that while neural network architectures are expressive enough to\nrepresent a wide range of models -- including many with undesirable behavior on\nOOD inputs -- the true, generalizable model that aligns with human expectations\ntypically corresponds to the simplest among those consistent with the training\ndata.\n  Motivated by this observation, we develop a theoretical framework for OOD\ngeneralization via simplicity, quantified using a predefined simplicity metric.\nWe analyze two key regimes: (1) the constant-gap setting, where the true model\nis strictly simpler than all spurious alternatives by a fixed gap, and (2) the\nvanishing-gap setting, where the fixed gap is replaced by a smoothness\ncondition ensuring that models close in simplicity to the true model yield\nsimilar predictions. For both regimes, we study the regularized maximum\nlikelihood estimator and establish the first sharp sample complexity guarantees\nfor learning the true, generalizable, simple model.",
            "pdf_url": "http://arxiv.org/pdf/2505.22622v1",
            "published": "2025-05-28 17:44:10+00:00",
            "updated": "2025-05-28 17:44:10+00:00"
        },
        {
            "title": "Test-Time Alignment of Discrete Diffusion Models with Sequential Monte Carlo",
            "authors": "Chinmay Pani, Zijing Ou, Yingzhen Li",
            "summary": "Discrete diffusion models have become highly effective across various\ndomains. However, real-world applications often require the generative process\nto adhere to certain constraints but without task-specific fine-tuning. To this\nend, we propose a training-free method based on Sequential Monte Carlo (SMC) to\nsample from the reward-aligned target distribution at the test time. Our\napproach leverages twisted SMC with an approximate locally optimal proposal,\nobtained via a first-order Taylor expansion of the reward function. To address\nthe challenge of ill-defined gradients in discrete spaces, we incorporate a\nGumbel-Softmax relaxation, enabling efficient gradient-based approximation\nwithin the discrete generative framework. Empirical results on both synthetic\ndatasets and image modelling validate the effectiveness of our approach.",
            "pdf_url": "http://arxiv.org/pdf/2505.22524v1",
            "published": "2025-05-28 16:12:03+00:00",
            "updated": "2025-05-28 16:12:03+00:00"
        },
        {
            "title": "Outsourced diffusion sampling: Efficient posterior inference in latent spaces of generative models",
            "authors": "Siddarth Venkatraman, Mohsin Hasan, Minsu Kim, Luca Scimeca, Marcin Sendera, Yoshua Bengio, Glen Berseth, Nikolay Malkin",
            "summary": "Any well-behaved generative model over a variable $\\mathbf{x}$ can be\nexpressed as a deterministic transformation of an exogenous ('outsourced')\nGaussian noise variable $\\mathbf{z}$: $\\mathbf{x}=f_\\theta(\\mathbf{z})$. In\nsuch a model (\\eg, a VAE, GAN, or continuous-time flow-based model), sampling\nof the target variable $\\mathbf{x} \\sim p_\\theta(\\mathbf{x})$ is\nstraightforward, but sampling from a posterior distribution of the form\n$p(\\mathbf{x}\\mid\\mathbf{y}) \\propto\np_\\theta(\\mathbf{x})r(\\mathbf{x},\\mathbf{y})$, where $r$ is a constraint\nfunction depending on an auxiliary variable $\\mathbf{y}$, is generally\nintractable. We propose to amortize the cost of sampling from such posterior\ndistributions with diffusion models that sample a distribution in the noise\nspace ($\\mathbf{z}$). These diffusion samplers are trained by reinforcement\nlearning algorithms to enforce that the transformed samples\n$f_\\theta(\\mathbf{z})$ are distributed according to the posterior in the data\nspace ($\\mathbf{x}$). For many models and constraints, the posterior in noise\nspace is smoother than in data space, making it more suitable for amortized\ninference. Our method enables conditional sampling under unconditional GAN,\n(H)VAE, and flow-based priors, comparing favorably with other inference\nmethods. We demonstrate the proposed outsourced diffusion sampling in several\nexperiments with large pretrained prior models: conditional image generation,\nreinforcement learning with human feedback, and protein structure generation.",
            "pdf_url": "http://arxiv.org/pdf/2502.06999v2",
            "published": "2025-02-10 19:49:54+00:00",
            "updated": "2025-05-28 14:58:36+00:00"
        },
        {
            "title": "Inference-Time Scaling for Flow Models via Stochastic Generation and Rollover Budget Forcing",
            "authors": "Jaihoon Kim, Taehoon Yoon, Jisung Hwang, Minhyuk Sung",
            "summary": "We propose an inference-time scaling approach for pretrained flow models.\nRecently, inference-time scaling has gained significant attention in LLMs and\ndiffusion models, improving sample quality or better aligning outputs with user\npreferences by leveraging additional computation. For diffusion models,\nparticle sampling has allowed more efficient scaling due to the stochasticity\nat intermediate denoising steps. On the contrary, while flow models have gained\npopularity as an alternative to diffusion models--offering faster generation\nand high-quality outputs in state-of-the-art image and video generative\nmodels--efficient inference-time scaling methods used for diffusion models\ncannot be directly applied due to their deterministic generative process. To\nenable efficient inference-time scaling for flow models, we propose three key\nideas: 1) SDE-based generation, enabling particle sampling in flow models, 2)\nInterpolant conversion, broadening the search space and enhancing sample\ndiversity, and 3) Rollover Budget Forcing (RBF), an adaptive allocation of\ncomputational resources across timesteps to maximize budget utilization. Our\nexperiments show that SDE-based generation, particularly variance-preserving\n(VP) interpolant-based generation, improves the performance of particle\nsampling methods for inference-time scaling in flow models. Additionally, we\ndemonstrate that RBF with VP-SDE achieves the best performance, outperforming\nall previous inference-time scaling approaches.",
            "pdf_url": "http://arxiv.org/pdf/2503.19385v4",
            "published": "2025-03-25 06:30:45+00:00",
            "updated": "2025-05-28 14:20:39+00:00"
        }
    ]
}